{"status": "OK", "bill": {"bill_id": 1065974, "change_hash": "cad47da5cecf1facc9521f28e46d3758", "session_id": 1519, "session": {"session_id": 1519, "state_id": 46, "year_start": 2018, "year_end": 2018, "prefile": 0, "sine_die": 1, "prior": 1, "special": 0, "session_tag": "Regular Session", "session_title": "2018 Regular Session", "session_name": "2018 Regular Session"}, "url": "https://legiscan.com/VA/bill/SB910/2018", "state_link": "https://lis.virginia.gov/cgi-bin/legp604.exe?181+sum+SB910", "completed": 0, "status": 1, "status_date": "2018-01-19", "progress": [{"date": "2018-01-19", "event": 1}, {"date": "2018-01-19", "event": 9}], "state": "VA", "state_id": 46, "bill_number": "SB910", "bill_type": "B", "bill_type_id": "1", "body": "S", "body_id": 8, "current_body": "S", "current_body_id": 8, "title": "Abortion; a pregnant person has a fundamental right to obtain.", "description": "Right to abortion; provision of abortion. Provides that Right to abortion; provision of abortion. Provides that a pregnant person has a fundamental right to obtain a lawful abortion and that no statute or regulation shall be construed to prohibit the performance of an abortion prior to viability or if necessary to protect the life or health of the pregnant person. The bill also provides that any statute that places a burden on a pregnant person's access to abortion without conferring any legitimate health benefit is unenforceable. The bill expands who can perform first trimester abortions to include, in addition to physicians, physician's assistants and midwives licensed by the Board of Medicine, nurse practitioners or certified nurse midwives jointly licensed by the Board of Medicine and the Board of Nursing, and persons acting pursuant to orders and under the appropriate supervision of a physician. The bill also expands who can perform second trimester abortions to include persons acting pursuant to orders and under the appropriate supervision of a physician. The bill eliminates the requirement that second trimester abortions be performed in a licensed hospital. The bill eliminates the requirement that two other physicians certify that a third trimester abortion is necessary to prevent the pregnant person's death or impairment of her mental or physical health as well as the need to find that the pregnant person's health would be substantially and irremediably impaired. The bill permits a third trimester abortion if the pregnancy is not viable. The bill eliminates all the procedures and processes, including the performance of an ultrasound, required to effect a pregnant person's informed written consent to the performance of an abortion; however, the bill does not change the requirement that a pregnant person's informed written consent first be obtained. The bill removes language classifying facilities that perform five or more first trimester abortions per month as hospitals for the purpose of complying with regulations establishing minimum standards for hospitals. The bill also removes the prohibition on the sale of health insurance policies that provide coverage for abortions through an exchange established or operating in the Commonwealth pursuant to the federal Patient Protection and Affordable Care Act. The bill eliminates the crime, punishable as a Class 4 felony, of administering a drug or other thing to a pregnant person or using other means with the intent to destroy such person's unborn child or to produce an abortion", "pending_committee_id": 0, "committee": [], "referrals": [{"date": "2018-01-19", "committee_id": 163, "chamber": "S", "chamber_id": 8, "name": "Education and Health"}], "history": [{"date": "2018-01-19", "action": "Presented and ordered printed 18104620D", "chamber": "S", "chamber_id": 8, "importance": 0}, {"date": "2018-01-19", "action": "Referred to Committee on Education and Health", "chamber": "S", "chamber_id": 8, "importance": 1}, {"date": "2018-01-25", "action": "Passed by indefinitely in Education and Health (8-Y 7-N)", "chamber": "S", "chamber_id": 8, "importance": 0}], "sponsors": [{"people_id": 718, "person_hash": "wpb2qlsc", "party_id": "1", "state_id": 46, "party": "D", "role_id": 2, "role": "Sen", "name": "Jennifer McClellan", "first_name": "Jennifer", "middle_name": "L.", "last_name": "McClellan", "suffix": "", "nickname": "", "district": "SD-009", "ftm_eid": 5703418, "votesmart_id": 58655, "opensecrets_id": "", "knowwho_pid": 241253, "ballotpedia": "Jenn_McClellan", "sponsor_type_id": 1, "sponsor_order": 1, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}], "sasts": [], "subjects": [], "texts": [{"doc_id": 1694327, "date": "2018-01-19", "type": "Introduced", "type_id": 1, "mime": "text/html", "mime_id": 1, "url": "https://legiscan.com/VA/text/SB910/id/1694327", "state_link": "https://lis.virginia.gov/cgi-bin/legp604.exe?181+ful+SB910+hil", "text_size": 60518, "text_hash": "ebfe4ee3ea846ef0179ee4bf0b262fa8"}], "votes": [{"roll_call_id": 688777, "date": "2018-01-25", "desc": "Senate: Passed by indefinitely in Education and Health (8-Y 7-N)", "yea": 8, "nay": 7, "nv": 0, "absent": 0, "total": 15, "passed": 1, "chamber": "S", "chamber_id": 8, "url": "https://legiscan.com/VA/rollcall/SB910/id/688777", "state_link": "https://lis.virginia.gov/cgi-bin/legp604.exe?181+vot+S04V0062+SB0910"}], "amendments": [], "supplements": [], "calendar": [{"type_id": 1, "type": "Hearing", "date": "2018-01-25", "time": "08:00", "location": "Pocahontas Bldg.", "description": "Senate Committee on Education and Health Hearing"}]}}