{"status": "OK", "bill": {"bill_id": 1123122, "change_hash": "a3f3fa481739f97f081250572ba22fac", "session_id": 1435, "session": {"session_id": 1435, "state_id": 52, "year_start": 2017, "year_end": 2018, "prefile": 0, "sine_die": 1, "prior": 1, "special": 0, "session_tag": "Regular Session", "session_title": "2017-2018 Regular Session", "session_name": "115th Congress"}, "url": "https://legiscan.com/US/bill/SB3108/2017", "state_link": "https://www.congress.gov/bill/115th-congress/senate-bill/3108/all-info", "completed": 0, "status": 1, "status_date": "2018-06-21", "progress": [{"date": "2018-06-21", "event": 1}], "state": "US", "state_id": 52, "bill_number": "SB3108", "bill_type": "B", "bill_type_id": "1", "body": "S", "body_id": 115, "current_body": "S", "current_body_id": 115, "title": "Department of State, Foreign Operations, and Related Programs Appropriations Act, 2019", "description": "Department of State, Foreign Operations, and Related Programs Appropriations Act, 2019 Provides FY2019 appropriations for the Department of State, foreign operations, and related programs. Provides appropriations to the State Department for: Administration of Foreign Affairs, International Organizations, and International Commissions. Provides appropriations for Related Agencies and Related Programs, including: the Broadcasting Board of Governors, the Asia Foundation, the U.S. Institute of Peace, the Center for Middle Eastern-Western Dialogue Trust Fund, the Eisenhower Exchange Fellowship Program, the Israeli Arab Scholarship Program, the East-West Center, and the National Endowment for Democracy. Provides appropriations for Other Commissions, including: the Commission for the Preservation of America's Heritage Abroad, the U.S. Commission on International Religious Freedom, the Commission on Security and Cooperation in Europe, the Congressional-Executive Commission on the People's Republic of China, and the U.S.-China Economic and Security Review Commission. Provides appropriations for the U.S. Agency for International Development (USAID). Provides appropriations for Bilateral Economic Assistance to: the President; the State Department; Independent Agencies, including the Peace Corps, the Millennium Challenge Corporation, the Inter-American Foundation, and the U.S. African Development Foundation; and the Department of the Treasury. Provides appropriations to the State Department and the President for International Security Assistance. Provides appropriations to the President and International Financial Institutions for Multilateral Assistance. Provides appropriations for Export and Investment Assistance to: the Export-Import Bank of the United States, the Overseas Private Investment Corporation, and the U.S. Trade and Development Agency. Provides appropriations to specified accounts for Overseas Contingency Operations/ Global War on Terrorism. Sets forth requirements and restrictions for using funds provided by this and other appropriations Acts.", "pending_committee_id": 0, "committee": [], "referrals": [], "history": [{"date": "2018-06-21", "action": "Committee on Appropriations. Original measure reported to Senate by Senator Graham. With written report No. 115-282.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2018-06-21", "action": "Placed on Senate Legislative Calendar under General Orders. Calendar No. 480.", "chamber": "S", "chamber_id": 115, "importance": 0}], "sponsors": [{"people_id": 9488, "person_hash": "vxlaliuo", "party_id": "2", "state_id": 52, "party": "R", "role_id": 2, "role": "Sen", "name": "Lindsey Graham", "first_name": "Lindsey", "middle_name": "", "last_name": "Graham", "suffix": "", "nickname": "", "district": "SD-SC", "ftm_eid": 8463292, "votesmart_id": 21992, "opensecrets_id": "N00009975", "knowwho_pid": 159057, "ballotpedia": "Lindsey_Graham", "sponsor_type_id": 1, "sponsor_order": 1, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}], "sasts": [{"type_id": 8, "type": "Related", "sast_bill_number": "HB6385", "sast_bill_id": 1124371}], "subjects": [{"subject_id": 13422, "subject_name": "International affairs"}], "texts": [{"doc_id": 1810884, "date": "2018-06-22", "type": "Introduced", "type_id": 1, "mime": "application/pdf", "mime_id": 2, "url": "https://legiscan.com/US/text/SB3108/id/1810884", "state_link": "https://www.congress.gov/115/bills/s3108/BILLS-115s3108pcs.pdf", "text_size": 613609, "text_hash": "e47ea6e2a280ffa7a91d2086c1b82a32"}], "votes": [], "amendments": [], "supplements": [], "calendar": []}}