{"status": "OK", "bill": {"bill_id": 1124635, "change_hash": "37994dbb256edef920b2fbb8857d945f", "session_id": 1435, "session": {"session_id": 1435, "state_id": 52, "year_start": 2017, "year_end": 2018, "prefile": 0, "sine_die": 1, "prior": 1, "special": 0, "session_tag": "Regular Session", "session_title": "2017-2018 Regular Session", "session_name": "115th Congress"}, "url": "https://legiscan.com/US/bill/HB6470/2017", "state_link": "https://www.congress.gov/bill/115th-congress/house-bill/6470/all-info", "completed": 0, "status": 1, "status_date": "2018-07-23", "progress": [{"date": "2018-07-23", "event": 1}], "state": "US", "state_id": 52, "bill_number": "HB6470", "bill_type": "B", "bill_type_id": "1", "body": "H", "body_id": 114, "current_body": "H", "current_body_id": 114, "title": "Departments of Labor, Health and Human Services, and Education, and Related Agencies Appropriations Act, 2019", "description": "Departments of Labor, Health and Human Services, and Education, and Related Agencies Appropriations Act, 2019 Provides FY2019 appropriations to the Departments of Labor, Health and Human Services, and Education; and related agencies. Department of Labor Appropriations Act, 2019 Provides appropriations to the Department of Labor for: the Employment and Training Administration, the Employee Benefits Security Administration, the Pension Benefit Guaranty Corporation, the Wage and Hour Division, the Office of Labor-Management Standards, the Office of Federal Contract Compliance Programs, the Office of Workers' Compensation Programs, the Occupational Safety and Health Administration, the Mine Safety and Health Administration, the Bureau of Labor Statistics, the Office of Disability Employment Policy, and Departmental Management. Department of Health and Human Services Appropriations Act, 2019 Provides appropriations to the Department of Health and Human Services for: the Health Resources and Services Administration, the Centers for Disease Control and Prevention, the National Institutes of Health, the Substance Abuse and Mental Health Services Administration, the Agency for Healthcare Research and Quality, the Centers for Medicare and Medicaid Services, the Administration for Children and Families, the Administration for Community Living, and the Office of the Secretary. Department of Education Appropriations Act, 2019 Provides appropriations to the Department of Education for: Education for the Disadvantaged; Impact Aid; School Improvement Programs; Indian Education; Innovation and Improvement; Safe Schools and Citizenship Education; English Language Acquisition; Special Education; Rehabilitation Services; Special Institutions for Persons with Disabilities; Career, Technical, and Adult Education; Student Financial Assistance; Student Aid Administration; Higher Education; Howard University; the College Housing and Academic Facilities Loan Program; the Historically Black College and University Capital Financing Program Account; the Institute of Education Sciences; and Departmental Management. Provides appropriations to Related Agencies, including: the Committee for Purchase From People Who Are Blind or Severely Disabled, the Corporation for National and Community Service, the Corporation for Public Broadcasting, the Federal Mediation and Conciliation Service, the Federal Mine Safety and Health Review Commission, the Institute of Museum and Library Services, the Medicaid and CHIP Payment and Access Commission, the Medicare Payment Advisory Commission, the National Council on Disability, the National Labor Relations Board, the National Mediation Board, the Occupational Safety and Health Review Commission, the Railroad Retirement Board, and the Social Security Administration. Sets forth requirements and restrictions for using funds provided by this and other appropriations Acts. Conscience Protection Act of 2018Amends the Public Health Service Act to codify the prohibition against the federal government and state and local governments that receive federal financial assistance for health-related activities penalizing or discriminating against a health care provider based on the provider's refusal to be involved in, or provide coverage for, abortion.", "pending_committee_id": 0, "committee": [], "referrals": [], "history": [{"date": "2018-07-23", "action": "The House Committee on Appropriations reported an original measure, H. Rept. 115-862, by Mr. Cole.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2018-07-23", "action": "Placed on the Union Calendar, Calendar No. 667.", "chamber": "H", "chamber_id": 114, "importance": 0}], "sponsors": [{"people_id": 9213, "person_hash": "86i58pyg", "party_id": "2", "state_id": 52, "party": "R", "role_id": 1, "role": "Rep", "name": "Tom Cole", "first_name": "Tom", "middle_name": "", "last_name": "Cole", "suffix": "", "nickname": "", "district": "HD-OK-4", "ftm_eid": 14964187, "votesmart_id": 46034, "opensecrets_id": "N00025726", "knowwho_pid": 211693, "ballotpedia": "Tom_Cole_(Oklahoma)", "sponsor_type_id": 1, "sponsor_order": 1, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}], "sasts": [{"type_id": 8, "type": "Related", "sast_bill_number": "SB3158", "sast_bill_id": 1123846}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB644", "sast_bill_id": 931442}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB2976", "sast_bill_id": 1020535}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB6173", "sast_bill_id": 1123118}, {"type_id": 8, "type": "Related", "sast_bill_number": "SB301", "sast_bill_id": 945981}, {"type_id": 8, "type": "Related", "sast_bill_number": "SB3207", "sast_bill_id": 1124281}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB6157", "sast_bill_id": 1123005}, {"type_id": 2, "type": "Similar To", "sast_bill_number": "HR1077", "sast_bill_id": 1127104}], "subjects": [{"subject_id": 13124, "subject_name": "Economics and public finance"}], "texts": [{"doc_id": 1814431, "date": "2018-07-24", "type": "Introduced", "type_id": 1, "mime": "application/pdf", "mime_id": 2, "url": "https://legiscan.com/US/text/HB6470/id/1814431", "state_link": "https://www.congress.gov/115/bills/hr6470/BILLS-115hr6470rh.pdf", "text_size": 541972, "text_hash": "42c7ee16bc52cb1091ff1793cb99c9d1"}], "votes": [], "amendments": [], "supplements": [], "calendar": []}}