{"status": "OK", "bill": {"bill_id": 22976, "change_hash": "cb516dadc7b3954f70f77d6139731a46", "session_id": 16, "session": {"session_id": 16, "state_id": 46, "year_start": 2008, "year_end": 2008, "prefile": 0, "sine_die": 1, "prior": 1, "special": 0, "session_tag": "Regular Session", "session_title": "2008 Regular Session", "session_name": "2008 Regular Session"}, "url": "https://legiscan.com/VA/bill/HB670/2008", "state_link": "https://lis.virginia.gov/cgi-bin/legp604.exe?081+sum+HB670", "completed": 0, "status": 1, "status_date": "2008-01-08", "progress": [{"date": "2008-01-08", "event": 1}, {"date": "2008-01-08", "event": 9}], "state": "VA", "state_id": 46, "bill_number": "HB670", "bill_type": "B", "bill_type_id": "1", "body": "H", "body_id": 7, "current_body": "", "current_body_id": 0, "title": "Abortion; regulation of provider businesses.", "description": "Regulation of abortion provider businesses; penalties. Provides that an abortion provider business shall be permitted to operate only in any location at which applicable zoning and land use regulations permit the operation of a hospital; however, the operation of an abortion provider business is prohibited if the location is within 1,500 feet of a church, synagogue, regular place of religious worship, public or private elementary or secondary school, licensed day-care center, public park, residential district, or child or family entertainment business.  If an abortion provider business is operating on July 1, 2008, in violation of these location restrictions, it is a nonconforming use, which may continue for a maximum of two years, after which time the continued operation of the nonconforming business shall be unlawful. The measure makes it a Class 1 misdemeanor to own, operate, or manage an abortion provider business in violation of these location restrictions, unless its operation is permitted as a nonconforming use.  It is also a Class 1 misdemeanor to operate an abortion provider business if an owner, operator, manager, or employee (i) has been convicted of a criminal activity or is awaiting trial on pending charges of a felony or misdemeanor, (ii) has had a previous license under any health care statute or regulation or abortion provider business statute from any state or locality denied, suspended, or revoked, (iii) has any unsatisfied judgments for indebtedness or damages incurred as a result of the provision of health care or the conduct of an abortion provider business, (iv) has falsely answered a question or request for information on any health care or business licensing form, (v) is under the age of 18 years, (vi) has had a health care license or certification revoked or suspended by any licensing or regulatory authority within the preceding 10 years, (vii) uses an alias or any name other than his legal name by which to identify himself to persons using the services of the abortion provider business, (viii) has operated or performed services in an abortion provider business while intoxicated by the use of alcoholic beverages or controlled substances, (ix) refused to allow prompt inspection of the business by state or local government inspectors, (x) had patient contact when not licensed by the appropriate health care agency for that level of patient contact, (xi) permitted any person to have patient contact who is not licensed by the appropriate health care agency for that level of patient contact, (xii) permitted the possession, use, or sale of controlled substances on the premises other than as prescribed by a physician, (xiii) permitted the sale, use, or consumption of alcoholic beverages on the premises, (xiv) permitted the illegal dissemination of prescription drugs on the premises, (xv) permitted the performance of abortions on a minor without the parents’ or court’s permission, or (xvi) permitted the performance of abortions with the assistance of any person who is not licensed by the appropriate health care agency for that level of patient contact.  The measure further makes it a Class 1 misdemeanor (a) to own, operate, or manage an abortion provider business at a premises that has not been approved by its jurisdiction’s health department, fire department, and the building department as being in compliance with all applicable local, state, and federal laws, regulations, and statutes governing outpatient surgical facilities, (b) to allow a person under age 18 to enter or be on the premises of an open abortion provider business without the permission of the minor’s parents or the approval of a court, (c) for the operator of an abortion provider business to fail to ensure that an attendant is stationed at each public entrance to the abortion provider business at all times during such abortion provider business’s regular business hours, and (d) for an attendant to fail to prevent any person under the age of 18 years from entering the abortion provider business without the permission of the minor’s parents or approval of a court.  Courts are authorized to enjoin violations. Persons injured by violations may recover treble damages, including consequential damages, emotional damages, and loss of consortium, and litigation expenses.", "pending_committee_id": 0, "committee": [], "referrals": [], "history": [{"date": "2008-01-08", "action": "House: Prefiled and ordered printed; offered 01/09/08 080018616", "chamber": "", "chamber_id": 0, "importance": 0}, {"date": "2008-01-08", "action": "House: Referred to Committee for Courts of Justice", "chamber": "", "chamber_id": 0, "importance": 1}, {"date": "2008-02-12", "action": "House: Left in Courts of Justice", "chamber": "", "chamber_id": 0, "importance": 0}], "sponsors": [{"people_id": 714, "person_hash": "oyfmo6kf", "party_id": "2", "state_id": 46, "party": "R", "role_id": 1, "role": "Rep", "name": "Robert Marshall", "first_name": "Robert", "middle_name": "G.", "last_name": "Marshall", "suffix": "", "nickname": "Bob", "district": "HD-013", "ftm_eid": 6418461, "votesmart_id": 5162, "opensecrets_id": "", "knowwho_pid": 199435, "ballotpedia": "Bob_Marshall_(Virginia)", "sponsor_type_id": 0, "sponsor_order": 0, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}], "sasts": [], "subjects": [{"subject_id": 231, "subject_name": "Health"}, {"subject_id": 292, "subject_name": "Trade and Commerce"}], "texts": [], "votes": [], "amendments": [], "supplements": [], "calendar": []}}