{"status": "OK", "bill": {"bill_id": 759882, "change_hash": "881e8dff314e60df0629f916a94ce4f0", "session_id": 1156, "session": {"session_id": 1156, "state_id": 52, "year_start": 2015, "year_end": 2016, "prefile": 0, "sine_die": 1, "prior": 1, "special": 0, "session_tag": "Regular Session", "session_title": "2015-2016 Regular Session", "session_name": "114th Congress"}, "url": "https://legiscan.com/US/bill/SB764/2015", "state_link": "https://www.congress.gov/bill/114th-congress/senate-bill/764/all-info", "completed": 1, "status": 4, "status_date": "2016-07-29", "progress": [{"date": "2015-03-17", "event": 1}, {"date": "2015-03-17", "event": 9}, {"date": "2015-03-25", "event": 10}, {"date": "2015-07-29", "event": 2}, {"date": "2015-07-29", "event": 9}, {"date": "2015-08-31", "event": 9}, {"date": "2016-07-19", "event": 3}, {"date": "2016-07-29", "event": 8}, {"date": "2016-07-29", "event": 4}], "state": "US", "state_id": 52, "bill_number": "SB764", "bill_type": "B", "bill_type_id": "1", "body": "S", "body_id": 115, "current_body": "H", "current_body_id": 114, "title": "Defund Planned Parenthood Act of 2015", "description": "Defund Planned Parenthood Act of 2015 This bill amends the Agricultural Marketing Act of 1946 to establish a national mandatory bioengineered food disclosure standard. (Bioengineered food is commonly referred to as a genetically modified organism or GMO food.) (Sec. 1) Bioengineered food is food that that has been genetically modified in a way that could not be obtained through conventional breeding or found in nature. The standard applies to any claim in a disclosure a food bears indicating that the food is bioengineered and to any food subject to the labeling requirements under the Federal Food, Drug, and Cosmetic Act (FFDCA). It applies to foods subject to labeling requirements under the Federal Meat Inspection Act, the Poultry Products Inspection Act, or the Egg Products Inspection Act if: (1) the most predominant ingredient would independently be subject to the FFDCA labeling requirements; or (2) the most predominant ingredient is broth, stock, water, or a similar solution and the second-most predominant ingredient would independently be subject to the FFDCA labeling requirements. Within two years of enactment of this bill, USDA must establish: (1) a national mandatory bioengineered food disclosure standard for any bioengineered food and any food that may be bioengineered, and (2) requirements and procedures to carry out the standard. Regulations prescribing the labeling of bioengineered food must: prohibit a food derived from an animal from being considered bioengineered solely because the animal consumed feed produced from, containing, or consisting of a bioengineered substance; determine the amounts of a bioengineered substance that may be present for a food to be bioengineered; establish a process for requesting and granting a USDA determination regarding other factors and conditions under which a food is considered bioengineered; require the form of disclosure to be a text, symbol, or electronic or digital link (excluding Internet website Uniform Resource Locators not embedded in the link) with the disclosure option to be selected by the food manufacturer; and provide alternative reasonable disclosure options for food contained in small or very small packages. For small food manufacturers, the regulations must provide: (1) an implementation date that is no earlier than one year after the implementation date of the regulations; and (2) additional on-package disclosure options to be selected by the manufacturer that consist of: a telephone number with language indicating that it provides access to additional information, and an Internet website maintained by the manufacturer. The regulations must exclude: (1) food served in a restaurant or similar retail food establishment, and (2) very small food manufacturers. A bioengineered food that has successfully completed the pre-market federal regulatory review process shall not be treated as safer than, or not as safe as, a non-bioengineered counterpart solely because the food is bioengineered or produced or developed with bioengineering. USDA must: (1) conduct a study to identify potential technological challenges that may impact whether consumers would have access to the bioengineering disclosure through electronic or digital disclosure methods, and (2) provide additional disclosure options if it determines that consumers will not have sufficient access to disclosures through electronic or digital methods. USDA must ensure that specified on-package language accompanies electronic or digital link disclosures and telephone number disclosures. USDA must also ensure that an electronic or digital link disclosure: provides access to the disclosure located in a consistent and conspicuous manner on the first product information page that appears, excluding marketing and promotional information; may not collect, analyze, or sell personally identifiable information about consumers or their devices unless the information is necessary to carry out the bill and is deleted immediately after it is used; includes a telephone number that provides access to the disclosure; and is of sufficient size to be easily and effectively scanned or read by a digital device. The bill prohibits states or political subdivisions of states from establishing or continuing requirements for labeling or disclosure of bioengineered or genetically engineered food that are not identical to the mandatory disclosure standard established by this bill. This bill prohibits a person from knowingly failing to make a disclosure required by the standard. Each person subject to the mandatory disclosure requirement must maintain records necessary to establish compliance and provide the records to USDA upon request. USDA may conduct examinations and audits related to compliance, subject to requirements for notice, a public hearing, and the publication of the results. USDA may not recall any food on the basis of whether the food includes the disclosure. A food may not include claims related to the absence of bioengineering solely based on whether or not a disclosure is required by the standard. A certification under the national organic program is sufficient to make a claim regarding the absence of bioengineering in a food.", "pending_committee_id": 0, "committee": [], "referrals": [{"date": "2015-03-17", "committee_id": 2323, "chamber": "S", "chamber_id": 115, "name": "Commerce, Science, And Transportation"}, {"date": "2015-07-29", "committee_id": 2310, "chamber": "H", "chamber_id": 114, "name": "Natural Resources"}, {"date": "2015-08-31", "committee_id": 3361, "chamber": "H", "chamber_id": 114, "name": "Subcommittee on Water, Power and Oceans"}], "history": [{"date": "2015-03-17", "action": "Read twice and referred to the Committee on Commerce, Science, and Transportation.", "chamber": "S", "chamber_id": 115, "importance": 1}, {"date": "2015-03-25", "action": "Committee on Commerce, Science, and Transportation. Ordered to be reported with an amendment in the nature of a substitute favorably.", "chamber": "S", "chamber_id": 115, "importance": 1}, {"date": "2015-07-23", "action": "Committee on Commerce, Science, and Transportation. Reported by Senator Thune with an amendment in the nature of a substitute. With written report No. 114-90.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2015-07-23", "action": "Placed on Senate Legislative Calendar under General Orders. Calendar No. 161.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2015-07-28", "action": "Passed Senate with an amendment by Unanimous Consent. (consideration: CR S6085-6086; text as passed Senate: CR S6085-6086)", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2015-07-29", "action": "Received in the House.", "chamber": "H", "chamber_id": 114, "importance": 1}, {"date": "2015-07-29", "action": "Message on Senate action sent to the House.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2015-07-29", "action": "Referred to the House Committee on Natural Resources.", "chamber": "H", "chamber_id": 114, "importance": 1}, {"date": "2015-08-31", "action": "Referred to the Subcommittee on Water, Power and Oceans.", "chamber": "H", "chamber_id": 114, "importance": 1}, {"date": "2015-09-18", "action": "Passed House with amendment pursuant to H. Res. 421.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2015-09-21", "action": "Message on House action received in Senate and at desk: House amendment to Senate bill.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-03-14", "action": "Measure laid before Senate by unanimous consent. (consideration: CR S1458)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-03-14", "action": "Motion by Senator McConnell to concur in the House amendment to S. 764 with an amendment SA 3450 made in Senate. (consideration: CR S1458; text: CR S1458)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-03-14", "action": "S.Amdt.3450 Amendment SA 3450 proposed by Senator McConnell for Senator Roberts. (consideration: CR S1458)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-03-14", "action": "Cloture motion on the motion to concur in the House amendment to S. 764 with an amendment SA 3450 presented in Senate. (consideration: CR S1458; text: CR S1458)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-03-14", "action": "Motion by Senator McConnell to refer to Senate Committee on Commerce, Science, and Transportation the House message to accompany S. 764 made in Senate. (consideration: CR S1458; text: CR S1458)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-03-15", "action": "Considered by Senate (Message from the House considered). (consideration: CR S1482-1494, S1496-1501)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-03-15", "action": "S.Amdt.3450 Considered by Senate. (consideration: CR S1482)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-03-16", "action": "Considered by Senate (Message from the House considered). (consideration: CR S1516-1538)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-03-16", "action": "S.Amdt.3450 Considered by Senate. (consideration: CR S1516, S1524)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-03-16", "action": "Cloture on the motion to concur in the House amendment to S. 764 with an amendment SA 3450 not invoked in Senate by Yea-Nay Vote. 48 - 49. Record Vote Number: 37. (consideration: CR S1516, S1524)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-03-16", "action": "Motion by Senator McConnell to reconsider the vote by which cloture was not invoked on the motion to concur in the House amendment to S. 764 with an amendment SA 3450 entered in Senate. (consideration: CR S1516, S1524)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-06-29", "action": "Motion to lay before the Senate a Message from the House to accompany S. 764 agreed to by Yea-Nay Vote. 68 - 29. Record Vote Number: 117. (consideration: CR S4703)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-06-29", "action": "Considered by Senate (Message from the House considered). (consideration: CR S4703-4705)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-06-29", "action": "S.Amdt.3450 Considered by Senate. (consideration: CR S4704)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-06-29", "action": "Motion by Senator McConnell to refer to Senate Committee on Commerce, Science, and Transportation the House message to accompany S. 764 withdrawn in Senate. (consideration: CR S4704)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-06-29", "action": "Motion by Senator McConnell to concur in the House amendment to S. 764 with an amendment SA 3450 withdrawn in Senate. (consideration: CR S4704)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-06-29", "action": "S.Amdt.3450 SA 3450 fell when the motion to concur in the House amendment to S.764 with an amendment SA 3450 withdrawn. (consideration: CR S4704)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-06-29", "action": "Motion by Senator McConnell to reconsider the vote by which cloture was not invoked on the motion to concur in the House amendment to S. 764 with an amendment SA 3450 rendered moot in Senate. (consideration: CR S4704)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-06-29", "action": "Motion by Senator McConnell to concur in the House amendment to S. 764 with an amendment SA 4935 made in Senate. (consideration: CR S4704)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-06-29", "action": "S.Amdt.4935 Amendment SA 4935 proposed by Senator McConnell for Senator Roberts. (consideration: CR S4704)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-06-29", "action": "Cloture motion on the motion to concur in the House amendment to S. 764 with an amendment SA 4935 presented in Senate. (consideration: CR S4704-4705; text: CR S4704-4705)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-06-29", "action": "S.Amdt.4936 Amendment SA 4936 proposed by Senator McConnell to Amendment SA 4935. (consideration: CR S4705; text: CR S4705)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-06-29", "action": "Motion by Senator McConnell to refer to Senate Committee on Agriculture, Nutrition, and Forestry the House message to accompany S. 764 with instructions to report back forthwith with amendment SA 4937 made in Senate. (consideration: CR S4705; text: CR S4705)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-06-29", "action": "S.Amdt.4937 Amendment SA 4937 proposed by Senator McConnell. (consideration: CR S4705)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-06-29", "action": "S.Amdt.4938 Amendment SA 4938 proposed by Senator McConnell to Amendment SA 4937 (the instructions of the motion to refer). (consideration: CR S4705; text: CR S4705)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-06-29", "action": "S.Amdt.4939 Amendment SA 4939 proposed by Senator McConnell to Amendment SA 4938. (consideration: CR S4705; text: CR S4705)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-07-06", "action": "Cloture on the motion to concur in the House amendment to S. 764 with an amendment SA 4935 invoked in Senate by Yea-Nay Vote. 65 - 32. Record Vote Number: 121. (consideration: CR S4800-4814; text: CR S4800)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-07-06", "action": "Considered by Senate (Message from the House considered). (consideration: CR S4800)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-07-06", "action": "S.Amdt.4937 Considered by Senate.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-07-06", "action": "S.Amdt.4939 Considered by Senate.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-07-06", "action": "S.Amdt.4938 Considered by Senate.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-07-06", "action": "Motion by Senator McConnell to refer to Senate Committee on Agriculture, Nutrition, and Forestry the House message to accompany S. 764 with instructions to report back forthwith with amendment SA 4937 fell when cloture invoked on the motion to concur in the House amendment to S. 764 with an amendment SA 4935 in Senate. (consideration: CR S4800)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-07-06", "action": "S.Amdt.4937 SA 4937 (the instructions of the motion to refer) fell when cloture invoked on the motion to concur in the House amendment to S. 764 with an amendment SA 4935. (consideration: CR S4800)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-07-06", "action": "S.Amdt.4938 SA 4938 fell when SA 4937 fell. (consideration: CR S4800)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-07-06", "action": "S.Amdt.4939 SA 4939 fell when SA 4938 fell. (consideration: CR S4800)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-07-06", "action": "S.Amdt.4935 Considered by Senate. (consideration: CR S4800)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-07-06", "action": "S.Amdt.4936 Considered by Senate. (consideration: CR S4800)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-07-07", "action": "Considered by Senate (Message from the House considered). (consideration: CR S4841-4910)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-07-07", "action": "S.Amdt.4936 Considered by Senate. (consideration: CR S4841, S4909-4910, S4910)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-07-07", "action": "S.Amdt.4935 Considered by Senate. (consideration: CR S4841, S4910)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-07-07", "action": "S.Amdt.4936 Motion to table amendment SA 4936 rejected in Senate by Yea-Nay Vote. 31 - 62. Record Vote Number: 122.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-07-07", "action": "S.Amdt.4936 Amendment SA 4936 not agreed to in Senate by Voice Vote.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-07-07", "action": "Senate concurred in the House amendment to S. 764 with an amendment (SA 4935) by Yea-Nay Vote. 63 - 30. Record Vote Number: 123. (consideration: CR S4910)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-07-07", "action": "S.Amdt.4935 Amendment SA 4935 agreed to in Senate by Yea-Nay Vote. 63 - 30. Record Vote Number: 123.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-07-08", "action": "Message on Senate action sent to the House.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-07-12", "action": "Rules Committee Resolution H. Res. 822 Reported to House. Previous question shall be considered as ordered without intervening motions except motion to recommit with or without instructions. Provides for consideration of the Senate amendment to the House amendment to S. 764. The resolution makes in order a motion that the House agree to the Senate amendment to the House amendment to S. 764.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-07-14", "action": "ORDER OF PROCEDURE - Mr. Conaway asked unanimous consent that the question on adoption of the motion to concur in the Senate amendment to the House amendment to S. 764 be subject to postponement as though under clause 8 of rule 20. Agreed to without objection. (consideration: CR H4932-4939, H4964-4965)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-07-14", "action": "Pursuant to the provisions of H. Hes. 822, Mr. Conaway moved that the House concur in the Senate amendment to the House amendment. (consideration: CR H4933; text: CR H4933)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-07-14", "action": "DEBATE - The House proceeded with 1 hour of debate on the motion to concur in the Senate amendment to the House amendment to S. 764.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-07-14", "action": "The previous question was ordered pursuant to the rule. (consideration: CR H4939)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-07-14", "action": "POSTPONED PROCEEDINGS - At the conclusion of debate on the motion to concur in the Senate amendment to the House amendment to S. 764, the Chair put the question on passage of the bill and by voice vote announced that the ayes had prevailed. Mr. Welch demanded the yeas and nays, and the Chair postponed further proceedings on the motion pursuant to a previous order until later in the legislative day.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-07-14", "action": "On motion that the House agree to the Senate amendment to the House amendment Agreed to by the Yeas and Nays: 306 - 117 (Roll no. 466). (text: CR H4932-4933)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-07-14", "action": "Motion to reconsider laid on the table Agreed to without objection.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-07-19", "action": "Presented to President.", "chamber": "H", "chamber_id": 114, "importance": 1}, {"date": "2016-07-29", "action": "Signed by President.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-07-29", "action": "Became Public Law No: 114-216. (TXT | PDF)", "chamber": "H", "chamber_id": 114, "importance": 1}], "sponsors": [{"people_id": 9493, "person_hash": "cabmgf99", "party_id": "2", "state_id": 52, "party": "R", "role_id": 2, "role": "Sen", "name": "Roger Wicker", "first_name": "Roger", "middle_name": "F.", "last_name": "Wicker", "suffix": "", "nickname": "", "district": "SD-MS", "ftm_eid": 17659028, "votesmart_id": 21926, "opensecrets_id": "N00003280", "knowwho_pid": 158928, "ballotpedia": "Roger_Wicker", "sponsor_type_id": 1, "sponsor_order": 1, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 16523, "person_hash": "urkh79kr", "party_id": "2", "state_id": 52, "party": "R", "role_id": 2, "role": "Sen", "name": "Dan Sullivan", "first_name": "Dan", "middle_name": "", "last_name": "Sullivan", "suffix": "", "nickname": "", "district": "SD-AK", "ftm_eid": 39833727, "votesmart_id": 114964, "opensecrets_id": "N00035774", "knowwho_pid": 328336, "ballotpedia": "Daniel_S._Sullivan", "sponsor_type_id": 2, "sponsor_order": 2, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}], "sasts": [{"type_id": 1, "type": "Same As", "sast_bill_number": "HB1900", "sast_bill_id": 773340}, {"type_id": 8, "type": "Related", "sast_bill_number": "HR421", "sast_bill_id": 790879}, {"type_id": 1, "type": "Same As", "sast_bill_number": "HB3134", "sast_bill_id": 787817}, {"type_id": 8, "type": "Related", "sast_bill_number": "HCR79", "sast_bill_id": 791850}, {"type_id": 8, "type": "Related", "sast_bill_number": "SB1836", "sast_bill_id": 787975}, {"type_id": 8, "type": "Related", "sast_bill_number": "SB2328", "sast_bill_id": 798247}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB4394", "sast_bill_id": 827528}], "subjects": [{"subject_id": 13127, "subject_name": "Advisory bodies"}, {"subject_id": 13130, "subject_name": "Agricultural research"}, {"subject_id": 13784, "subject_name": "Aquaculture"}, {"subject_id": 13331, "subject_name": "Aquatic ecology"}, {"subject_id": 13677, "subject_name": "Congressional committees"}, {"subject_id": 13585, "subject_name": "Congressional officers and employees"}, {"subject_id": 13146, "subject_name": "Congressional oversight"}, {"subject_id": 13152, "subject_name": "Department of Commerce"}, {"subject_id": 13171, "subject_name": "Education programs funding"}, {"subject_id": 13184, "subject_name": "Executive agency funding and structure"}, {"subject_id": 13521, "subject_name": "Food supply, safety, and labeling"}, {"subject_id": 13198, "subject_name": "Government employee pay, benefits, personnel management"}, {"subject_id": 13352, "subject_name": "Great Lakes"}, {"subject_id": 13215, "subject_name": "Higher education"}, {"subject_id": 13335, "subject_name": "Marine and coastal resources, fisheries"}, {"subject_id": 13360, "subject_name": "Marine and inland water transportation"}, {"subject_id": 13267, "subject_name": "Research administration and funding"}, {"subject_id": 13878, "subject_name": "Seafood"}, {"subject_id": 13280, "subject_name": "Social work, volunteer service, charitable organizations"}, {"subject_id": 13286, "subject_name": "Student aid and college costs"}, {"subject_id": 13347, "subject_name": "Abortion"}, {"subject_id": 13622, "subject_name": "Family planning and birth control"}, {"subject_id": 13209, "subject_name": "Health facilities and institutions"}, {"subject_id": 13212, "subject_name": "Health programs administration and funding"}, {"subject_id": 13349, "subject_name": "Sex and reproductive health"}, {"subject_id": 13302, "subject_name": "Women's health"}, {"subject_id": 13655, "subject_name": "Science and engineering education"}, {"subject_id": 13395, "subject_name": "Public lands and natural resources"}, {"subject_id": 13126, "subject_name": "Administrative law and regulatory procedures"}, {"subject_id": 13401, "subject_name": "Agricultural practices and innovations"}, {"subject_id": 13413, "subject_name": "Business records"}, {"subject_id": 13147, "subject_name": "Consumer affairs"}, {"subject_id": 13151, "subject_name": "Department of Agriculture"}, {"subject_id": 13185, "subject_name": "Federal preemption"}, {"subject_id": 13511, "subject_name": "Food industry and services"}, {"subject_id": 13506, "subject_name": "Genetics"}, {"subject_id": 22688, "subject_name": "Government studies and investigations"}, {"subject_id": 13276, "subject_name": "Small business"}, {"subject_id": 13285, "subject_name": "State and local government operations"}, {"subject_id": 13597, "subject_name": "Agriculture and food"}], "texts": [{"doc_id": 1180121, "date": "2015-03-23", "type": "Introduced", "type_id": 1, "mime": "application/pdf", "mime_id": 2, "url": "https://legiscan.com/US/text/SB764/id/1180121", "state_link": "https://www.congress.gov/114/bills/s764/BILLS-114s764is.pdf", "text_size": 261779, "text_hash": "0d3890dded4cf790076a14a3dd8aa5fe"}, {"doc_id": 1256687, "date": "2015-07-24", "type": "Introduced", "type_id": 1, "mime": "application/pdf", "mime_id": 2, "url": "https://legiscan.com/US/text/SB764/id/1256687", "state_link": "https://www.congress.gov/114/bills/s764/BILLS-114s764rs.pdf", "text_size": 304744, "text_hash": "4bb943fa4b6013968e89d23179d5890d"}, {"doc_id": 1256959, "date": "2015-07-29", "type": "Engrossed", "type_id": 4, "mime": "application/pdf", "mime_id": 2, "url": "https://legiscan.com/US/text/SB764/id/1256959", "state_link": "https://www.congress.gov/114/bills/s764/BILLS-114s764es.pdf", "text_size": 213065, "text_hash": "a4d47ccb145c0a925b3250c9da1ec974"}, {"doc_id": 1262765, "date": "2015-09-18", "type": "Amended", "type_id": 3, "mime": "application/pdf", "mime_id": 2, "url": "https://legiscan.com/US/text/SB764/id/1262765", "state_link": "https://www.congress.gov/114/bills/s764/BILLS-114s764eah.pdf", "text_size": 122243, "text_hash": "cd2f4e32259f619053806a5fef2ec0f5"}, {"doc_id": 1422721, "date": "2016-07-08", "type": "Amended", "type_id": 3, "mime": "application/pdf", "mime_id": 2, "url": "https://legiscan.com/US/text/SB764/id/1422721", "state_link": "https://www.congress.gov/114/bills/s764/BILLS-114s764eas.pdf", "text_size": 144321, "text_hash": "14f30310064c1ceb297827dff41ae15f"}, {"doc_id": 1423261, "date": "2016-07-14", "type": "Enrolled", "type_id": 5, "mime": "application/pdf", "mime_id": 2, "url": "https://legiscan.com/US/text/SB764/id/1423261", "state_link": "https://www.congress.gov/114/bills/s764/BILLS-114s764enr.pdf", "text_size": 207721, "text_hash": "5c7ae9d0329a1e4f2697a8366807f461"}], "votes": [{"roll_call_id": 520767, "date": "2016-03-16", "desc": "On the Cloture Motion S. 764", "yea": 48, "nay": 49, "nv": 3, "absent": 0, "total": 100, "passed": 0, "chamber": "S", "chamber_id": 115, "url": "https://legiscan.com/US/rollcall/SB764/id/520767", "state_link": "https://www.senate.gov/legislative/LIS/roll_call_votes/vote1142/vote_114_2_00037.xml"}, {"roll_call_id": 556527, "date": "2016-03-16", "desc": "On the Motion (Motion to Lay Before the Senate a Message From the House to Accompany S. 764)", "yea": 68, "nay": 29, "nv": 3, "absent": 0, "total": 100, "passed": 1, "chamber": "S", "chamber_id": 115, "url": "https://legiscan.com/US/rollcall/SB764/id/556527", "state_link": "https://www.senate.gov/legislative/LIS/roll_call_votes/vote1142/vote_114_2_00117.xml"}, {"roll_call_id": 557264, "date": "0000-00-00", "desc": "On Agreeing to the Resolution", "yea": 246, "nay": 179, "nv": 9, "absent": 0, "total": 434, "passed": 1, "chamber": "H", "chamber_id": 114, "url": "https://legiscan.com/US/rollcall/SB764/id/557264", "state_link": "https://clerk.house.gov/Votes/2015503"}, {"roll_call_id": 557358, "date": "0000-00-00", "desc": "On the Cloture Motion S. 764", "yea": 65, "nay": 32, "nv": 3, "absent": 0, "total": 100, "passed": 1, "chamber": "S", "chamber_id": 115, "url": "https://legiscan.com/US/rollcall/SB764/id/557358", "state_link": "https://www.senate.gov/legislative/LIS/roll_call_votes/vote1142/vote_114_2_00121.xml"}, {"roll_call_id": 557404, "date": "0000-00-00", "desc": "On the Motion (Motion to Concur in the House Amendment to S. 764 with Further Amendment (Amdt. No. 4935))", "yea": 63, "nay": 30, "nv": 7, "absent": 0, "total": 100, "passed": 1, "chamber": "S", "chamber_id": 115, "url": "https://legiscan.com/US/rollcall/SB764/id/557404", "state_link": "https://www.senate.gov/legislative/LIS/roll_call_votes/vote1142/vote_114_2_00123.xml"}, {"roll_call_id": 557405, "date": "0000-00-00", "desc": "On the Motion (Motion to Concur in the House Amendment to S. 764 with Further Amendment (Amdt. No. 4935))", "yea": 63, "nay": 30, "nv": 7, "absent": 0, "total": 100, "passed": 1, "chamber": "S", "chamber_id": 115, "url": "https://legiscan.com/US/rollcall/SB764/id/557405", "state_link": "https://www.senate.gov/legislative/LIS/roll_call_votes/vote1142/vote_114_2_00123.xml"}, {"roll_call_id": 557406, "date": "0000-00-00", "desc": "On the Motion (Motion to Concur in the House Amendment to S. 764 with Further Amendment (Amdt. No. 4935))", "yea": 63, "nay": 30, "nv": 7, "absent": 0, "total": 100, "passed": 1, "chamber": "S", "chamber_id": 115, "url": "https://legiscan.com/US/rollcall/SB764/id/557406", "state_link": "https://www.senate.gov/legislative/LIS/roll_call_votes/vote1142/vote_114_2_00123.xml"}, {"roll_call_id": 557407, "date": "0000-00-00", "desc": "On the Motion to Table S.Amdt. 4936 to S.Amdt. 4935 to S. 764 (Defund Planned Parenthood Act of 2015)", "yea": 31, "nay": 62, "nv": 7, "absent": 0, "total": 100, "passed": 0, "chamber": "S", "chamber_id": 115, "url": "https://legiscan.com/US/rollcall/SB764/id/557407", "state_link": "https://www.senate.gov/legislative/LIS/roll_call_votes/vote1142/vote_114_2_00122.xml"}, {"roll_call_id": 558276, "date": "0000-00-00", "desc": "On Motion to Concur in the Senate Amendment to the House Amendment", "yea": 306, "nay": 117, "nv": 10, "absent": 0, "total": 433, "passed": 1, "chamber": "H", "chamber_id": 114, "url": "https://legiscan.com/US/rollcall/SB764/id/558276", "state_link": "https://clerk.house.gov/Votes/2016466"}, {"roll_call_id": 558277, "date": "0000-00-00", "desc": "On Motion to Concur in the Senate Amendment to the House Amendment", "yea": 306, "nay": 117, "nv": 10, "absent": 0, "total": 433, "passed": 1, "chamber": "H", "chamber_id": 114, "url": "https://legiscan.com/US/rollcall/SB764/id/558277", "state_link": "https://clerk.house.gov/Votes/2016466"}], "amendments": [], "supplements": [], "calendar": []}}