{"votes": {"No": [["John  A.  Kissel", "7116", "Republican", "CT", "7"], ["Kevin  D.  Witkos", "30602", "Republican", "CT", "8"], ["Joe  Markley", "126703", "Republican", "CT", "16"], ["Andrew  M.  Maynard", "30242", "Democratic", "CT", "18"], ["Catherine  Ann 'Cathy'  Osten", "126682", "Democratic", "CT", "19"], ["Clark  J.  Chapin", "53567", "Republican", "CT", "30"], ["Jason  C.  Welch", "30363", "Republican", "CT", "31"], ["Robert  J. 'Rob'  Kane", "103902", "Republican", "CT", "32"], ["Art  Linares", "141264", "Republican", "CT", "33"], ["Anthony 'Tony'  Guglielmo", "7113", "Republican", "CT", "35"]], "Yes": [["John  W.  Fonfara", "7180", "Democratic", "CT", "1"], ["Eric  D.  Coleman", "7102", "Democratic", "CT", "2"], ["Gary  Daniel  LeBeau", "13100", "Democratic", "CT", "3"], ["Stephen 'Steve'  Cassano", "126719", "Democratic", "CT", "4"], ["Beth  Bye", "68397", "Democratic", "CT", "5"], ["Theresa  Bielinski 'Terry'  Gerratana", "7190", "Democratic", "CT", "6"], ["Paul  R.  Doyle", "7264", "Democratic", "CT", "9"], ["Toni  N.  Harp", "7114", "Democratic", "CT", "10"], ["Martin  M.  Looney", "7117", "Democratic", "CT", "11"], ["Edward 'Ed'  Meyer", "30286", "Democratic", "CT", "12"], ["Danté  Bartolomeo", "112346", "Democratic", "CT", "13"], ["Gayle  Slossberg", "30463", "Democratic", "CT", "14"], ["Joan  V.  Hartley", "7199", "Democratic", "CT", "15"], ["Joseph  J. 'Joe'  Crisco\n                  Jr.", "7104", "Democratic", "CT", "17"], ["Andrea  L.  Stillman", "7276", "Democratic", "CT", "20"], ["Kevin  C.  Kelly", "126697", "Republican", "CT", "21"], ["Anthony  J.  Musto", "30593", "Democratic", "CT", "22"], ["Andres  Ayala\n                  Jr.", "65682", "Democratic", "CT", "23"], ["Michael  A.  McLachlan", "107286", "Republican", "CT", "24"], ["Bob  Duff", "30430", "Democratic", "CT", "25"], ["Antonietta 'Toni'  Boucher", "17217", "Republican", "CT", "26"], ["Carlo  Leone", "30262", "Democratic", "CT", "27"], ["John  P.  McKinney", "17194", "Republican", "CT", "28"], ["Donald  E.  Williams\n                  Jr.", "7132", "Democratic", "CT", "29"], ["Leonard  A. 'Len'  Fasano", "30404", "Republican", "CT", "34"], ["L.  Scott  Frantz", "107349", "Republican", "CT", "36"]], "Did Not Vote": [], "NA": []}, "synopsis": "Vote to pass a bill that establishes secure ammunition and firearms enforcement.", "link": "https://justfacts.votesmart.org/bill/16463/43455/establishes-secure-ammunition-and-firearms-enforcement", "name": "SB 1160 - Establishes Secure Ammunition and Firearms Enforcement - Connecticut Key Vote", "pg": "Highlights: Prohibits the sale, delivery or transfer of a “long gun” to individuals that include, but are not limited to the following: (Secs. 1 & 2) An individual less than 18 years of age; An individual that has failed to complete a course in the safety and use of firearms; An individual who has been convicted of a felony or issued a restraining order due to the use or threatened use of physical violence against another individual; or An individual who has been involuntarily confined to a psychiatric hospital within the past 60 months or voluntarily admitted within the past 6 months. Defines “long gun” as any firearm other than a pistol or revolver (Sec. 1). Requires an individual to obtain a long gun eligibility certificate prior to the purchase or transfer of a long gun, effective April 1, 2014 (Sec.1). Establishes a fee of 35 dollars for a long gun eligibility certificate and for each renewal, both which expire 5 years after issuance (Sec. 4). Requires a gun dealer to initiate a background check for prospective long gun buyers including the individual’s criminal and mental health history (Sec. 1). Expands the list of specific types of firearms that are considered assault weapons (Secs. 25-26). Prohibits the sale of any assault weapon to any individual who is not a licensed gun dealer (Sec. 28). Classifies the sale or purchase of a large capacity magazine after January 1, 2014 as a class D felony (Sec. 23). Defines “large capacity magazine” as a firearm magazine with the capacity to store more than 10 rounds of ammunition (Sec. 23). Authorizes certain individuals to purchase or possess a large capacity magazine, including but not limited to (Sec 23): Members of the military, police force, or Department of Corrections; Individuals or businesses manufacturing large capacity magazines; and A licensed gun dealer. Requires an individual convicted of a crime with a deadly weapon or found not guilty by reason of mental disease for an offense committed with a deadly weapon to be included in a firearm registry that includes the following personal information (Sec. 20): The name and physical description of the offender; The current resident address of the offender; The date of conviction and release of the offender; and The description of the offense. Requires the Commissioner of Mental Health and Addictive Services to maintain information on the involuntary or voluntary admission to mental health facilities and provide that information to the Commissioner of Emergency Services and Public Protection (Sec. 11). Prohibits an individual from keeping a loaded firearm on his or her property if a resident of the premises poses a risk of imminent personal injury or injury toward other individuals (Sec. 54). Prohibits the transfer or sale of a semi-automatic rifle that accepts a magazine with a capacity exceeding 5 rounds to an individual who is less than 21 years of age (Sec. 1). Prohibits the sale of ammunition or magazines to any individual under 18 years of age, or any individual without a valid permit to carry a pistol or revolver (Sec. 14). Classifies the possession of a firearm with armor piercing bullets or incendiary .50 caliber bullets as a class D felony (Sec. 32)."}