{"votes": {"No": [["Lonnie  Marcus  Randolph\n                  Jr.", "4527", "Democratic", "IN", "2"], ["Earline  S.  Rogers", "4531", "Democratic", "IN", "3"], ["Karen  R.  Tallian", "56544", "Democratic", "IN", "4"], ["John  E.  Broden", "34378", "Democratic", "IN", "10"], ["Thomas  J.  Wyss", "4540", "Republican", "IN", "15"], ["Timothy  S. 'Tim'  Lanane", "1864", "Democratic", "IN", "25"], ["Greg  Taylor", "102846", "Democratic", "IN", "33"], ["Jean  D.  Breaux", "76214", "Democratic", "IN", "34"], ["Vi  Simpson", "4533", "Democratic", "IN", "40"]], "Yes": [["Frank  Ed  Mrvan\n                  Jr.", "18459", "Democratic", "IN", "1"], ["Ed  Charbonneau", "88705", "Republican", "IN", "5"], ["Dorothy  S. 'Sue'  Landske", "4518", "Republican", "IN", "6"], ["Brandt  Hershman", "34280", "Republican", "IN", "7"], ["Jim  Arnold", "70834", "Democratic", "IN", "8"], ["Ryan  D.  Mishler", "33992", "Republican", "IN", "9"], ["Joseph  C. 'Joe'  Zakas", "15179", "Republican", "IN", "11"], ["Carlin  J.  Yoder", "102888", "Republican", "IN", "12"], ["Marlin  A.  Stutzman", "34230", "Republican", "IN", "13"], ["Dennis  K.  Kruse", "4683", "Republican", "IN", "14"], ["David  C.  Long", "10446", "Republican", "IN", "16"], ["Gary  P. 'Doc'  Dillon", "18522", "Republican", "IN", "17"], ["Randall 'Randy'  Head", "102892", "Republican", "IN", "18"], ["Travis  Holdman", "100497", "Republican", "IN", "19"], ["Howard  A. 'Luke'  Kenley", "4517", "Republican", "IN", "20"], ["James  R. 'Jim'  Buck", "4631", "Republican", "IN", "21"], ["Ronald  J. 'Ron'  Alting", "18533", "Republican", "IN", "22"], ["Phillip  L. 'Phil'  Boots", "58562", "Republican", "IN", "23"], ["Connie  Lawson", "10447", "Republican", "IN", "24"], ["Sue  E.  Errington", "10394", "Democratic", "IN", "26"], ["Allen  E.  Paul", "4526", "Republican", "IN", "27"], ["Beverly  J.  Gard", "4499", "Republican", "IN", "28"], ["Michael  Andrew 'Mike'  Delph", "68073", "Republican", "IN", "29"], ["Scott  Schneider", "84889", "Republican", "IN", "30"], ["James  W. 'Jim'  Merritt\n                  Jr.", "4521", "Republican", "IN", "31"], ["Patricia  L.  Miller", "4522", "Republican", "IN", "32"], ["R.  Michael  Young", "4728", "Republican", "IN", "35"], ["Darryl  Brent  Waltz", "34387", "Republican", "IN", "36"], ["Richard  D.  Bray", "4504", "Republican", "IN", "37"], ["Timothy  D. 'Tim'  Skinner", "34086", "Democratic", "IN", "38"], ["John  M.  Waterman", "4538", "Republican", "IN", "39"], ["Greggory  F. 'Greg'  Walker", "56821", "Republican", "IN", "41"], ["Jean  A.  Leising", "357", "Republican", "IN", "42"], ["Johnny  W.  Nugent", "4524", "Republican", "IN", "43"], ["Brent  Ellis  Steele", "4712", "Republican", "IN", "44"], ["James  A. 'Jim'  Lewis\n                  Jr.", "4519", "Democratic", "IN", "45"], ["Connie Weigleb  Sipes", "1852", "Democratic", "IN", "46"], ["Richard  D.  Young\n                  Jr.", "4541", "Democratic", "IN", "47"], ["Lindel  O.  Hume", "4514", "Democratic", "IN", "48"], ["Bob  Deig", "56950", "Democratic", "IN", "49"], ["Vaneta  Becker", "4625", "Republican", "IN", "50"]], "Did Not Vote": [], "NA": []}, "synopsis": "Vote to adopt a conference report that authorizes employees, unless below listed as exempt, to have firearms and ammunition in locked vehicles at work.", "link": "https://justfacts.votesmart.org/bill/10963/29397/authorizing-firearms-at-workplace", "name": "HB 1065 - Authorizing Firearms at Workplace - Indiana Key Vote", "pg": "Highlights: Prohibits restriction of the lawful possession, transfer, sale, transportation, storage, display or use of firearms or ammunition during the following (Sec. 2): Disaster Emergency; An Energy Emergency; or Local Disaster Emergency. Prohibits possession, transfer, sale, transportation, storage, display and use of a firearm or ammunition in or on the following during any of the conditions above (Sec. 2): In or on school property; In or on property that is being used by a school for a school function; On a school bus; On the property of: A childcare institution; An emergency childcare shelter caring institution; A private secure facility; A group home; An emergency shelter care group home; A penal facility; or A domestic violence shelter; In violation of federal law; In or on property belonging to an approved post secondary education institution; At a person's residence; or Property owned, operated, used by or controlled by an entity that is required to: Conduct vulnerability assessments; Develop and implement a site security plan under the US Department of Homeland Security's Chemical Facility Anti-Terrorism Standards; or Have a security plan under the Maritime Transportation Security Act of 2002. Defines \"Governmental Entity\" as the state or a political subdivision of the state (Sec. 4) Prohibits employers from prohibiting employees who legally possess a firearm or ammunition from keeping the firearm or ammunition locked in the trunk, in the glove compartment, or stored out of plain sight in an employee's locked vehicle. (Sec. 7) Exempts employers of the following from adopting or enforcing the ordinance (Sec. 7): In or on school property; In or on property that is being used by a school for a school function; On a school bus; On the property of: A child caring institution; An emergency childcare shelter caring institution; A private secure facility; A group home; An emergency shelter care group home; A childcare center; A penal facility; In violation of federal law; In or on property belonging to an approved post secondary education institution; At a person's residence; Property of a person that is subject to the United States Department of Homeland Security's Chemical Facility Anti-Terrorism Standards issued on April 9, 2007; Licensed by the United States Nuclear Regulatory Commission under Title 10 of the Code of Federal Regulations; Property owned by: A public utility that generates and transmits electric power; A department of public utilities created under IC 8-1-11.1; or In the personal vehicle of the employee, if the employee is a direct support professional who: Works directly with individuals with developmental disabilities to assist the individuals become integrated into the Individuals community or the least restrictive environment; and Uses the employee's personal vehicle while transporting an individual with developmental disabilities. Authorizes an individual who believes they have been harmed by a violation of this to act to bring a civil action against the person who is alleged to have made the violation (Sec. 7). Authorizes the court to do the following in the case of violation of the lack of prohibition of firearms on work premises (Sec. 7): Award actual damages and court costs and attorney's fees to the prevailing individual; and Enjoin further violations of the chapter."}