{"votes": {"No": [["Randi  Becker", "108265", "Republican", "WA", "2"], ["Mike  Padden", "135587", "Republican", "WA", "4"], ["Jeff  Holy", "140096", "Republican", "WA", "6"], ["Shelly  Anne  Short", "108332", "Republican", "WA", "7"], ["Sharon  Raye  Brown", "122346", "Republican", "WA", "8"], ["Mark  G.  Schoesler", "3237", "Republican", "WA", "9"], ["Barbara  Bailey", "51332", "Republican", "WA", "10"], ["Brad  Hawkins", "140108", "Republican", "WA", "12"], ["Judith 'Judy'  Warnick", "67062", "Republican", "WA", "13"], ["Curtis  King", "101906", "Republican", "WA", "14"], ["Jim  Honeyford", "3205", "Republican", "WA", "15"], ["Maureen  S.  Walsh", "51330", "Republican", "WA", "16"], ["Lynda  Wilson", "153068", "Republican", "WA", "17"], ["Ann  Rivers", "126326", "Republican", "WA", "18"], ["Dean  A.  Takko", "51539", "Democratic", "WA", "19"], ["John  E.  Braun", "140192", "Republican", "WA", "20"], ["Hans  Zeiger", "126354", "Republican", "WA", "25"], ["Steve  O'Ban", "126366", "Republican", "WA", "28"], ["Phil  Fortunato", "26196", "Republican", "WA", "31"], ["Timothy 'Tim'  Sheldon", "3241", "Democratic", "WA", "35"], ["Keith  L.  Wagoner", "177725", "Republican", "WA", "39"], ["Doug  Ericksen", "26187", "Republican", "WA", "42"]], "Yes": [["Guy  Palumbo", "140184", "Democratic", "WA", "1"], ["Andy  Billig", "126294", "Democratic", "WA", "3"], ["Mark  Mullet", "140187", "Democratic", "WA", "5"], ["Bob  Alan  Hasegawa", "51576", "Democratic", "WA", "11"], ["Marko  Liias", "102020", "Democratic", "WA", "21"], ["Samuel  W. 'Sam'  Hunt", "56150", "Democratic", "WA", "22"], ["Christine  Rolfes", "65880", "Democratic", "WA", "23"], ["Kevin  Van De Wege", "51685", "Democratic", "WA", "24"], ["Emily  Randall", "183038", "Democratic", "WA", "26"], ["Jeannie  L.  Darneille", "56078", "Democratic", "WA", "27"], ["Steve  E.  Conway", "3073", "Democratic", "WA", "29"], ["Claire  Wilson", "183049", "Democratic", "WA", "30"], ["Jesse  Salomon", "65997", "Democratic", "WA", "32"], ["Karen  L.  Keiser", "3195", "Democratic", "WA", "33"], ["Joe  Nguyen", "183064", "Democratic", "WA", "34"], ["Reuven  M.  Carlyle", "108281", "Democratic", "WA", "36"], ["Rebecca  Saldaña", "176079", "Democratic", "WA", "37"], ["John  R.  McCoy", "56219", "Democratic", "WA", "38"], ["Elizabeth 'Liz'  Lovelett", "186185", "Democratic", "WA", "40"], ["Lisa  Z.  Wellman", "171027", "Democratic", "WA", "41"], ["Jamie  D.  Pedersen", "66760", "Democratic", "WA", "43"], ["Steve  Hobbs", "68782", "Democratic", "WA", "44"], ["Manka  Dhingra", "176442", "Democratic", "WA", "45"], ["David  Frockt", "126427", "Democratic", "WA", "46"], ["Mona  Das", "183115", "Democratic", "WA", "47"], ["Patricia 'Patty'  Kuderer", "166011", "Democratic", "WA", "48"], ["Annette  Cleveland", "140199", "Democratic", "WA", "49"]], "Did Not Vote": [], "NA": []}, "synopsis": "Vote to pass a bill that increases the state hazardous waste tax.", "link": "https://justfacts.votesmart.org/bill/27107/69406/increases-the-state-hazardous-substance-tax", "name": "SB 5993 - Increases the State Hazardous Substance Tax - Washington Key Vote", "pg": "Highlights: Specifies that beginning July 1, 2019, the rate of the tax on petroleum products will be $1.09 per barrel, and the tax collected must be deposited as follows (Sec. 201): 60 percent to the model toxics control operating account; 25 percent to the model toxics control capital account; and 15 percent to the model toxics control stormwater account. Requires that monies collected be deposited in the model toxics control capital account (Sec. 201). Establishes the model toxics control operating account in the state treasury, and specifies money in this account to be used to address (Sec. 202): The state’s responsibility for hazardous waste planning, management, regulation, enforcement, technical assistance, and public education; The state’s responsibility for solid waste planning, management, regulation, enforcement, technical assistance, and public education; The hazardous waste clean-up program required under this act; State matching funds required under federal cleanup law; Financial assistance for local programs and plans, including local solid waste financial assistance; State government programs for the safe reduction, recycling, or disposal of paint and hazardous wastes from households, small businesses, and agriculture; Oil and hazardous materials spill prevention, preparedness, training, and response activities; Water and environmental health protection and monitoring programs; and Development and demonstration of alternative management technologies designed to carry out hazardous waste management priorities. Appropriates $50 million per biennium to the motor vehicle fund to be used exclusively for transportation stormwater activities and projects, until the beginning of the ensuing biennium after the enactment of an additive transportation funding act (Sec. 201). Defines “additive transportation funding act” as an act in which the combined total of new revenues deposited into the motor vehicle fund and the multi-model transportation account exceed $2 billion per biennium attributable solely to an increase in revenue from the enactment of the act (Sec. 201). Requires the Department of Ecology to compile a list of petroleum products that are not easily measured on a per barrel basis (Sec. 201). Establishes the model toxics control capital account in the state treasury for the purposes of improvement, rehabilitation, remediation, and cleanup of toxic sites and other capital-related expenditures, and the following money must be deposited into this account (Sec. 203): The costs of remedial actions recovered under this act; Penalties collected or recovered under this act; and Any other money appropriated or transferred to the account by the legislature. Specifies that money in the model toxics control capital account can only be used for capital projects and activities that carry out the purposes of this act and for financial assistance to local governments or other persons to carry out those projects or activities, including but not limited to, the following remedial actions (Sec. 203): Extended grant agreements; Grants or loans to local governments for remedial actions, with the Department prioritizing funding of remedial actions at: Facilities on the Department’s hazardous sites list with a high hazard ranking for which there is an approved remedial action work plan or an equivalent document under federal cleanup law; Brownfield properties within a redevelopment opportunity zone if the local government is a prospective purchaser of the property and there is a department-approved remedial action work plan or equivalent document under the federal cleanup law; Department-conducted remedial actions; and Grants to persons intending to remediate contaminated real property for development of affordable housing."}