{"votes": {"No": [["Randi  Becker", "108265", "Republican", "WA", "2"], ["Mike  Padden", "135587", "Republican", "WA", "4"], ["Jeff  Holy", "140096", "Republican", "WA", "6"], ["Shelly  Anne  Short", "108332", "Republican", "WA", "7"], ["Sharon  Raye  Brown", "122346", "Republican", "WA", "8"], ["Mark  G.  Schoesler", "3237", "Republican", "WA", "9"], ["Judith 'Judy'  Warnick", "67062", "Republican", "WA", "13"], ["Curtis  King", "101906", "Republican", "WA", "14"], ["Jim  Honeyford", "3205", "Republican", "WA", "15"], ["Maureen  S.  Walsh", "51330", "Republican", "WA", "16"], ["John  E.  Braun", "140192", "Republican", "WA", "20"], ["Keith  L.  Wagoner", "177725", "Republican", "WA", "39"], ["Doug  Ericksen", "26187", "Republican", "WA", "42"]], "Yes": [["Guy  Palumbo", "140184", "Democratic", "WA", "1"], ["Andy  Billig", "126294", "Democratic", "WA", "3"], ["Mark  Mullet", "140187", "Democratic", "WA", "5"], ["Bob  Alan  Hasegawa", "51576", "Democratic", "WA", "11"], ["Brad  Hawkins", "140108", "Republican", "WA", "12"], ["Ann  Rivers", "126326", "Republican", "WA", "18"], ["Dean  A.  Takko", "51539", "Democratic", "WA", "19"], ["Marko  Liias", "102020", "Democratic", "WA", "21"], ["Samuel  W. 'Sam'  Hunt", "56150", "Democratic", "WA", "22"], ["Christine  Rolfes", "65880", "Democratic", "WA", "23"], ["Kevin  Van De Wege", "51685", "Democratic", "WA", "24"], ["Hans  Zeiger", "126354", "Republican", "WA", "25"], ["Emily  Randall", "183038", "Democratic", "WA", "26"], ["Jeannie  L.  Darneille", "56078", "Democratic", "WA", "27"], ["Steve  O'Ban", "126366", "Republican", "WA", "28"], ["Steve  E.  Conway", "3073", "Democratic", "WA", "29"], ["Claire  Wilson", "183049", "Democratic", "WA", "30"], ["Jesse  Salomon", "65997", "Democratic", "WA", "32"], ["Karen  L.  Keiser", "3195", "Democratic", "WA", "33"], ["Joe  Nguyen", "183064", "Democratic", "WA", "34"], ["Timothy 'Tim'  Sheldon", "3241", "Democratic", "WA", "35"], ["Reuven  M.  Carlyle", "108281", "Democratic", "WA", "36"], ["Rebecca  Saldaña", "176079", "Democratic", "WA", "37"], ["Elizabeth 'Liz'  Lovelett", "186185", "Democratic", "WA", "40"], ["Lisa  Z.  Wellman", "171027", "Democratic", "WA", "41"], ["Jamie  D.  Pedersen", "66760", "Democratic", "WA", "43"], ["Steve  Hobbs", "68782", "Democratic", "WA", "44"], ["Manka  Dhingra", "176442", "Democratic", "WA", "45"], ["David  Frockt", "126427", "Democratic", "WA", "46"], ["Mona  Das", "183115", "Democratic", "WA", "47"], ["Patricia 'Patty'  Kuderer", "166011", "Democratic", "WA", "48"], ["Annette  Cleveland", "140199", "Democratic", "WA", "49"]], "Did Not Vote": [["Barbara  Bailey", "51332", "Republican", "WA", "10"], ["Lynda  Wilson", "153068", "Republican", "WA", "17"], ["Phil  Fortunato", "26196", "Republican", "WA", "31"], ["John  R.  McCoy", "56219", "Democratic", "WA", "38"]], "NA": [["Derek  Stanford", "126288", "Democratic", "WA", "1"]]}, "synopsis": "Vote to pass with amendment a bill that requires tug boat escorts for certain oil barges.", "link": "https://justfacts.votesmart.org/bill/27280/69696/requires-tug-boat-escorts-for-certain-oil-barges", "name": "HB 1578 - Requires Tug Boat Escorts for Certain Oil Barges - Washington Key Vote", "pg": "Highlights: Defines “waterborne vessel or barge” as any ship, barge, or other watercraft capable of traveling on the navigable waters of this state and capable of transporting any crude oil or petroleum product in quantities of ten thousand gallons or more for purposes other than providing fuel for its motor or engine (Sec. 2). Defines “oil tanker” as a self-propelled deep draft tank vessel designed to transport oil in bulk, but does not include an articulated tug barge tank vessel (Sec. 2). Authorizes an oil tanker of 40 to 125,000 deadweight tons to operate in the waters east of a line extending from Discovery Island light south to New Dungeness light and all points in the Puget Sound area to the edge of what is considered the territorial boundaries of Washington, as long as the oil tanker is escorted by a tug or tugs that have an aggregate shaft horsepower equal to at least 5 percent of the deadweight tons of the escorted oil tanker (Sec. 2). Authorizes the following, beginning September 1, 2020, to operate in Rosario Strait and connected waterways to the east with the aid of a tug or tugs that have an aggregate shaft horsepower equal to at least 5 percent of the deadweight tons of 40,000 deadweight ton oil tanker (Sec. 2): Oil tankers between 5,000 and 40,000 thousand deadweight tons; and Both articulated tug barges and towed waterborne vessels or barges; Resigned to transport oil in bulk internal to the hull; and Greater than 5,000 deadweight tons. Specifies that the requirements of the above highlight does not apply to vessels providing bunkering or refueling services, a towed general cargo deck barge, and can be adjusted or suspended by rule by the board of pilotage commissioners (Sec. 2). Establishes that an oil tanker, articulated tug barge, or towed waterborne vessel or barge in ballast or when unladen, does not require a tug in escort (Sec. 2). Requires, by December 31, 2025, the board of pilotage commissioners to adopt rules concerning tug escorts in order to better address the peculiarities of Puget Sound in consultation with (Sec. 3): The department of ecology; Potentially affected federally recognized Indian treaty fishing tribes; Other federally recognized treaty tribes with potentially affected interests; The results of the most recently completed vessel traffic risk assessments; The report developed by the department of ecology required under section 206, chapter 262, Laws of 2018; The recommendations included in the southern resident orca task force report, November 2018, and any subsequent research or reports on related topics; Changing vessel traffic trends; and For any formally proposed draft rules or adopted rules, identified estimates of expected costs and benefits of the rule of state government agencies and private persons or businesses. Requires the board of pilotage commissioners to publish a document identifying the sources of information used in developing the rules (Sec. 3). Requires the department to develop and maintain a model to quantitatively assess current and potential future risks of oil spills from covered vessels in Washington water (Sec. 4). Requires the department to establish the Salish Sea shared waters forum to address common issues in the cross-boundary waterways between Washington state and British Columbia (Sec. 6). Requires the department, in advance of the 2019 meeting, to discuss the options of an emergency response system with all potentially affected federally recognized Indian treaty tribes and, as relevant, with organizations like, but not limited to, the coast Salish gathering (Sec. 6). Expands the following information that pipelines transporting crude oil need to report to the department concerning the oil transported through that pipeline, to include the gravity of the crude oil as measured by the standards developed by the American petroleum institute, and the type of crude oil (Sec. 7)."}