{"votes": {"No": [["Randi  Becker", "108265", "Republican", "WA", "2"], ["Mike  Padden", "135587", "Republican", "WA", "4"], ["Mark  Mullet", "140187", "Democratic", "WA", "5"], ["Jeff  Holy", "140096", "Republican", "WA", "6"], ["Shelly  Anne  Short", "108332", "Republican", "WA", "7"], ["Sharon  Raye  Brown", "122346", "Republican", "WA", "8"], ["Mark  G.  Schoesler", "3237", "Republican", "WA", "9"], ["Barbara  Bailey", "51332", "Republican", "WA", "10"], ["Brad  Hawkins", "140108", "Republican", "WA", "12"], ["Judith 'Judy'  Warnick", "67062", "Republican", "WA", "13"], ["Curtis  King", "101906", "Republican", "WA", "14"], ["Jim  Honeyford", "3205", "Republican", "WA", "15"], ["Maureen  S.  Walsh", "51330", "Republican", "WA", "16"], ["Lynda  Wilson", "153068", "Republican", "WA", "17"], ["Ann  Rivers", "126326", "Republican", "WA", "18"], ["Dean  A.  Takko", "51539", "Democratic", "WA", "19"], ["John  E.  Braun", "140192", "Republican", "WA", "20"], ["Hans  Zeiger", "126354", "Republican", "WA", "25"], ["Phil  Fortunato", "26196", "Republican", "WA", "31"], ["Timothy 'Tim'  Sheldon", "3241", "Democratic", "WA", "35"], ["Keith  L.  Wagoner", "177725", "Republican", "WA", "39"], ["Doug  Ericksen", "26187", "Republican", "WA", "42"]], "Yes": [["Guy  Palumbo", "140184", "Democratic", "WA", "1"], ["Andy  Billig", "126294", "Democratic", "WA", "3"], ["Bob  Alan  Hasegawa", "51576", "Democratic", "WA", "11"], ["Marko  Liias", "102020", "Democratic", "WA", "21"], ["Samuel  W. 'Sam'  Hunt", "56150", "Democratic", "WA", "22"], ["Christine  Rolfes", "65880", "Democratic", "WA", "23"], ["Kevin  Van De Wege", "51685", "Democratic", "WA", "24"], ["Emily  Randall", "183038", "Democratic", "WA", "26"], ["Jeannie  L.  Darneille", "56078", "Democratic", "WA", "27"], ["Steve  O'Ban", "126366", "Republican", "WA", "28"], ["Steve  E.  Conway", "3073", "Democratic", "WA", "29"], ["Claire  Wilson", "183049", "Democratic", "WA", "30"], ["Jesse  Salomon", "65997", "Democratic", "WA", "32"], ["Karen  L.  Keiser", "3195", "Democratic", "WA", "33"], ["Joe  Nguyen", "183064", "Democratic", "WA", "34"], ["Reuven  M.  Carlyle", "108281", "Democratic", "WA", "36"], ["Rebecca  Saldaña", "176079", "Democratic", "WA", "37"], ["John  R.  McCoy", "56219", "Democratic", "WA", "38"], ["Elizabeth 'Liz'  Lovelett", "186185", "Democratic", "WA", "40"], ["Lisa  Z.  Wellman", "171027", "Democratic", "WA", "41"], ["Jamie  D.  Pedersen", "66760", "Democratic", "WA", "43"], ["Steve  Hobbs", "68782", "Democratic", "WA", "44"], ["Manka  Dhingra", "176442", "Democratic", "WA", "45"], ["David  Frockt", "126427", "Democratic", "WA", "46"], ["Mona  Das", "183115", "Democratic", "WA", "47"], ["Patricia 'Patty'  Kuderer", "166011", "Democratic", "WA", "48"], ["Annette  Cleveland", "140199", "Democratic", "WA", "49"]], "Did Not Vote": [], "NA": [["Derek  Stanford", "126288", "Democratic", "WA", "1"]]}, "synopsis": "Vote to concur with house amendments and pass a bill that authorizes the state Department of Ecology to ban certain chemicals found in consumer products.", "link": "https://justfacts.votesmart.org/bill/27284/69711/authorizes-the-department-of-ecology-to-ban-certain-chemicals-in-consumer-products", "name": "SB 5135 - Authorizes the Department of Ecology to Ban Certain Chemicals in Consumer Products - Washington Key Vote", "pg": "Highlights: Defines “department” as the department of ecology (Sec. 1). Defines “manufacturer” as any person, firm, association, partnership, corporation, governmental entity, organization, or joint ventures that produces a product or is an importer or domestic distributor of a product sold or offered for sale in or into the state (Sec. 1). Defines “consumer product” as any item, including any component parts and packaging, sold for residential or commercial use (Sec. 1). Requires the department, in consultation with the department of health, every five years, to report to the relevant committees of the legislature its decision to designate at least five priority chemicals that meet at least one of the following (Sec. 2): The chemical or a member of a class of chemicals are identified as a: High priority chemical of high concern for children; or Persistent, bioaccumulative toxin; The chemical or members of a class of chemicals are regulated in consumer products or as a hazardous substance; or The department decides that the chemical or members of a class of chemicals are a concern for sensitive populations and sensitive species after considering: A chemical’s or members of a class of chemicals’ hazard traits or environmental or toxicological endpoints; A chemical’s or members of a class of chemicals’ aggregate effects; A chemical’s or members of a class of chemicals’ cumulative effects with other chemicals with the same or similar hazard traits or environmental or toxicological endpoints; A chemical’s or members of a class of chemicals’ environmental fate; The potential for a chemical or members of a class of chemicals to degrade, form reaction products, or metabolize into another chemical or a chemical exhibiting one or more hazard traits or environmental or toxicological endpoints, or both; The potential for the chemical or class of chemicals to contribute to or cause adverse health or environmental impacts; The chemical’s or class of chemicals’ potential impact on sensitive populations, sensitive species, or environmentally sensitive habitats; or Potential exposures to the chemical or members of a class of chemicals. Requires the department, in consultation with the department of health, every five years beginning June 1, 2020, to identify priority consumer products that are a significant source of or use of priority chemicals, and to submit reports identifying these priority consumer products to the relevant committees of the legislature (Sec. 3 & 5). Exempts the department from identifying certain products as priority consumer products, such as, but not limited to, plastic shipping pallets made before 2012, food or beverages, and tobacco products (Sec. 3). Requires the department in consultation with the department of health, every five years beginning June 1, 2022, to decide upon regulatory actions for increasing transparency and reducing the use of priority consumer products, and to adopt rules to implement these regulatory actions by June 1, 2023 (Sec. 4 & 5). Requires the department to notify the public of the identification of priority chemicals and priority consumer products, which must also be published in the Washington State Register (Sec. 5). Establishes that a manufacturer in violation of this act will be subject to a civil penalty of no more than $5,000 for each violation, although the penalty will be increased for repeat violators (Sec. 7)."}