{"votes": {"No": [["Randi  Becker", "108265", "Republican", "WA", "2"], ["Mike  Padden", "135587", "Republican", "WA", "4"], ["Jeff  Holy", "140096", "Republican", "WA", "6"], ["Shelly  Anne  Short", "108332", "Republican", "WA", "7"], ["Sharon  Raye  Brown", "122346", "Republican", "WA", "8"], ["Mark  G.  Schoesler", "3237", "Republican", "WA", "9"], ["Barbara  Bailey", "51332", "Republican", "WA", "10"], ["Judith 'Judy'  Warnick", "67062", "Republican", "WA", "13"], ["Curtis  King", "101906", "Republican", "WA", "14"], ["Jim  Honeyford", "3205", "Republican", "WA", "15"], ["Maureen  S.  Walsh", "51330", "Republican", "WA", "16"], ["Lynda  Wilson", "153068", "Republican", "WA", "17"], ["Ann  Rivers", "126326", "Republican", "WA", "18"], ["John  E.  Braun", "140192", "Republican", "WA", "20"], ["Christine  Rolfes", "65880", "Democratic", "WA", "23"], ["Kevin  Van De Wege", "51685", "Democratic", "WA", "24"], ["Hans  Zeiger", "126354", "Republican", "WA", "25"], ["Steve  O'Ban", "126366", "Republican", "WA", "28"], ["Phil  Fortunato", "26196", "Republican", "WA", "31"], ["Timothy 'Tim'  Sheldon", "3241", "Democratic", "WA", "35"], ["Keith  L.  Wagoner", "177725", "Republican", "WA", "39"], ["Doug  Ericksen", "26187", "Republican", "WA", "42"]], "Yes": [["Guy  Palumbo", "140184", "Democratic", "WA", "1"], ["Andy  Billig", "126294", "Democratic", "WA", "3"], ["Mark  Mullet", "140187", "Democratic", "WA", "5"], ["Bob  Alan  Hasegawa", "51576", "Democratic", "WA", "11"], ["Brad  Hawkins", "140108", "Republican", "WA", "12"], ["Dean  A.  Takko", "51539", "Democratic", "WA", "19"], ["Marko  Liias", "102020", "Democratic", "WA", "21"], ["Samuel  W. 'Sam'  Hunt", "56150", "Democratic", "WA", "22"], ["Emily  Randall", "183038", "Democratic", "WA", "26"], ["Jeannie  L.  Darneille", "56078", "Democratic", "WA", "27"], ["Steve  E.  Conway", "3073", "Democratic", "WA", "29"], ["Claire  Wilson", "183049", "Democratic", "WA", "30"], ["Karen  L.  Keiser", "3195", "Democratic", "WA", "33"], ["Joe  Nguyen", "183064", "Democratic", "WA", "34"], ["Reuven  M.  Carlyle", "108281", "Democratic", "WA", "36"], ["Rebecca  Saldaña", "176079", "Democratic", "WA", "37"], ["John  R.  McCoy", "56219", "Democratic", "WA", "38"], ["Elizabeth 'Liz'  Lovelett", "186185", "Democratic", "WA", "40"], ["Lisa  Z.  Wellman", "171027", "Democratic", "WA", "41"], ["Jamie  D.  Pedersen", "66760", "Democratic", "WA", "43"], ["Steve  Hobbs", "68782", "Democratic", "WA", "44"], ["Manka  Dhingra", "176442", "Democratic", "WA", "45"], ["David  Frockt", "126427", "Democratic", "WA", "46"], ["Mona  Das", "183115", "Democratic", "WA", "47"], ["Patricia 'Patty'  Kuderer", "166011", "Democratic", "WA", "48"], ["Annette  Cleveland", "140199", "Democratic", "WA", "49"]], "Did Not Vote": [["Jesse  Salomon", "65997", "Democratic", "WA", "32"]], "NA": []}, "synopsis": "Vote to pass a bill that establishes a state paint stewardship recycling program, effective July 29, 2019.", "link": "https://justfacts.votesmart.org/bill/27438/70267/establishes-a-paint-stewardship-program", "name": "HB 1652 - Establishes a Paint Stewardship Program - Washington Key Vote", "pg": "Highlights: Requires all producers of architectural paint selling in or into the state to participate in an approved state paint stewardship plan for covered entities through membership in and appropriate funding of a stewardship organization (Sec. 3). Defines “covered entity” as the following (Sec. 2): Household; Conditionally exempt small quantity generator of leftover oil-based and latex architectural paint; or A generator of dangerous waste that brings leftover architectural latex paint to a paint program collection site operating under an approved state paint stewardship plan. Prohibits producers not participating in a stewardship program from selling architectural paint in or into the state of Washington (Sec. 3). Prohibits paint retailers from selling architectural paint manufactured or distributed by a producer not in compliance with this act (Sec. 3). Requires a stewardship organization representing producers to submit a plan for the implementation of a paint stewardship program to the Department of Ecology for approval by May 30, 2020, or within 1 year of the effective date of this act (Sec. 3). Requires a stewardship organization to annually submit a report structured to be used as a basis for annual plan review by the department, by October 15, 2020, and must include the following elements, including but not limited to (Sec. 5 & 8): A description of the methods the organization used to reduce, reuse, collect, transport, recycle, and process leftover paint; The volume of latex and oil-based paint collected by the organization in the preceding fiscal year, including any increase in the total volume of paint collected each year, and the costs of the paint per gallon collected; The volume of latex and oil-based paint collected by the method of disposition, including reuse, recycling, energy recovery, and disposal; and An estimate of the total weight of all paint containers recycled by the program. Requires all stewardship plans use geographic information modeling to determine the number and distribution of collection sites based on the following criteria (Sec. 4): At least 90 percent of Washington residents must have a permanent collection site within a fifteen-mile radius; and One additional permanent site must be established for every 30,000 residents of an urbanized area and for every urban cluster of at least 30,000 residents distributed to provide convenient and reasonably equitable access for residents within each. Establishes the paint product stewardship account within the state treasury, for which all monies must be spent only for administering and enforcing paint stewardship programs (Sec. 10). Authorizes a stewardship organization to pay an annual administrative fee in an amount sufficient to cover only the department’s cost of administering and enforcing a paint stewardship program (Sec. 5). Defines “architectural paint” or “paint” as interior and exterior architectural coatings, sold in a container of 5 gallons or less, but does not mean industrial coatings, original equipment coatings, or specialty coatings (Sec. 2). Defines a “stewardship organization” as a nonprofit organization created by a producer or group of producers to implement a paint stewardship program required under this act (Sec. 2). Defines “producer” as a manufacturer of architectural paint that is sold, offered for sale, or distributed in Washington under the producer’s own name or other brand names (Sec. 2)."}