{"votes": {"No": [["Jim  McCune", "51573", "Republican", "WA", "2"], ["Mike  Padden", "135587", "Republican", "WA", "4"], ["Jeff  Holy", "140096", "Republican", "WA", "6"], ["Shelly  Anne  Short", "108332", "Republican", "WA", "7"], ["Sharon  Raye  Brown", "122346", "Republican", "WA", "8"], ["Mark  G.  Schoesler", "3237", "Republican", "WA", "9"], ["Ron  Muzzall", "187523", "Republican", "WA", "10"], ["Brad  Hawkins", "140108", "Republican", "WA", "12"], ["Judith 'Judy'  Warnick", "67062", "Republican", "WA", "13"], ["Curtis  King", "101906", "Republican", "WA", "14"], ["Jim  Honeyford", "3205", "Republican", "WA", "15"], ["Perry  L.  Dozier", "116092", "Republican", "WA", "16"], ["Lynda  Wilson", "153068", "Republican", "WA", "17"], ["Ann  Rivers", "126326", "Republican", "WA", "18"], ["Jeff  Wilson", "192763", "Republican", "WA", "19"], ["John  E.  Braun", "140192", "Republican", "WA", "20"], ["Chris  Gildon", "183034", "Republican", "WA", "25"], ["Phil  Fortunato", "26196", "Republican", "WA", "31"], ["Timothy 'Tim'  Sheldon", "3241", "Democratic", "WA", "35"], ["Keith  L.  Wagoner", "177725", "Republican", "WA", "39"], ["Doug  Ericksen", "26187", "Republican", "WA", "42"]], "Yes": [["Derek  Stanford", "126288", "Democratic", "WA", "1"], ["Andy  Billig", "126294", "Democratic", "WA", "3"], ["Mark  Mullet", "140187", "Democratic", "WA", "5"], ["Bob  Alan  Hasegawa", "51576", "Democratic", "WA", "11"], ["Marko  Liias", "102020", "Democratic", "WA", "21"], ["Samuel  W. 'Sam'  Hunt", "56150", "Democratic", "WA", "22"], ["Christine  Rolfes", "65880", "Democratic", "WA", "23"], ["Kevin  Van De Wege", "51685", "Democratic", "WA", "24"], ["Emily  Randall", "183038", "Democratic", "WA", "26"], ["Jeannie  L.  Darneille", "56078", "Democratic", "WA", "27"], ["T'wina  Nobles", "192771", "Democratic", "WA", "28"], ["Steve  E.  Conway", "3073", "Democratic", "WA", "29"], ["Claire  Wilson", "183049", "Democratic", "WA", "30"], ["Jesse  Salomon", "65997", "Democratic", "WA", "32"], ["Karen  L.  Keiser", "3195", "Democratic", "WA", "33"], ["Joe  Nguyen", "183064", "Democratic", "WA", "34"], ["Reuven  M.  Carlyle", "108281", "Democratic", "WA", "36"], ["Rebecca  Saldaña", "176079", "Democratic", "WA", "37"], ["June  Grube  Robinson", "150066", "Democratic", "WA", "38"], ["Elizabeth 'Liz'  Lovelett", "186185", "Democratic", "WA", "40"], ["Lisa  Z.  Wellman", "171027", "Democratic", "WA", "41"], ["Jamie  D.  Pedersen", "66760", "Democratic", "WA", "43"], ["Steve  Hobbs", "68782", "Democratic", "WA", "44"], ["Manka  Dhingra", "176442", "Democratic", "WA", "45"], ["David  Frockt", "126427", "Democratic", "WA", "46"], ["Mona  Das", "183115", "Democratic", "WA", "47"], ["Patricia 'Patty'  Kuderer", "166011", "Democratic", "WA", "48"], ["Annette  Cleveland", "140199", "Democratic", "WA", "49"]], "Did Not Vote": [], "NA": []}, "synopsis": "Vote to pass a bill that establishes the Environmental Justice Council to adopt guidelines and provide technical assistance to support agency environmental justice work.", "link": "https://justfacts.votesmart.org/bill/30352/78025/establishes-the-environmental-justice-council", "name": "SB 5141 - Establishes the Environmental Justice Council - Washington Key Vote", "pg": "Highlights: Defines \"environmental justice\" as the fair treatment and meaningful involvement of all people regardless of race, color, national origin, or income with respect to the development, implementation, and enforcement of environmental laws, rules, and policies. This includes addressing disproportionate environmental and health impacts in all laws, rules, and policies with environmental impacts by prioritizing vulnerable populations and overburdened communities, equitably distributing resources and benefits, and eliminating harm (Sec. 2-9). Requires the Departments of Agriculture, Commerce, Ecology, Health, Natural Resources, Transportation, and the Puget Sound partnership are required to comply with all provisions of this law. All other state agencies should strive to apply the laws of the state of Washington, and the rules and policies of the agency, in accordance with the policies of this chapter including, to the extent feasible, the incorporation into agency decisions of the principles of environmental justice assessment processes (Sec. 3). Requires each agency to include an environmental justice implementation plan within its strategic plan or other planning document that involves the following (Sec. 12-1): Agency-specific goals and deliverables to reduce environmental and health disparities and for otherwise achieving environmental justice in the agency's programs; Metrics to track and measure accomplishments of the agency goals and deliverables; Methods to provide equitable access and ensure nondiscrimination in agency practices to solicit and receive information and opinions from members of the public; Strategies to ensure compliance with existing federal and state laws and policies relating to environmental justice; A plan for community engagement; and Specific plans and timelines for incorporating environmental justice considerations into agency activities as required under this chapter. Requires agencies to regularly conduct compliance reviews of existing laws and policies that guide community engagement, and where gaps exist, ensure compliance for the following (Sec. 13-2): Title VI of the civil rights act, prohibiting discrimination based on race, color, or national origin and requiring meaningful access to people with limited English proficiency, and disability; Executive Order 05-03, requiring plain talk when communicating with the public; and Executive Order 13166, requiring meaningful access to agency programs and services for people with limited English proficiency. Establishes the Environmental Justice Council to advise agencies on incorporating environmental justice into agency activities (Sec. 20-1). Specifies nothing in this act prevents other state agencies from adopting environmental justice policies and processes consistent with this act (Sec. 21)."}