{"votes": {"No": [["Jim  McCune", "51573", "Republican", "WA", "2"], ["Mike  Padden", "135587", "Republican", "WA", "4"], ["Jeff  Holy", "140096", "Republican", "WA", "6"], ["Shelly  Anne  Short", "108332", "Republican", "WA", "7"], ["Sharon  Raye  Brown", "122346", "Republican", "WA", "8"], ["Mark  G.  Schoesler", "3237", "Republican", "WA", "9"], ["Ron  Muzzall", "187523", "Republican", "WA", "10"], ["Bob  Alan  Hasegawa", "51576", "Democratic", "WA", "11"], ["Brad  Hawkins", "140108", "Republican", "WA", "12"], ["Judith 'Judy'  Warnick", "67062", "Republican", "WA", "13"], ["Curtis  King", "101906", "Republican", "WA", "14"], ["Jim  Honeyford", "3205", "Republican", "WA", "15"], ["Perry  L.  Dozier", "116092", "Republican", "WA", "16"], ["Lynda  Wilson", "153068", "Republican", "WA", "17"], ["Ann  Rivers", "126326", "Republican", "WA", "18"], ["Jeff  Wilson", "192763", "Republican", "WA", "19"], ["John  E.  Braun", "140192", "Republican", "WA", "20"], ["Kevin  Van De Wege", "51685", "Democratic", "WA", "24"], ["Chris  Gildon", "183034", "Republican", "WA", "25"], ["Phil  Fortunato", "26196", "Republican", "WA", "31"], ["Timothy 'Tim'  Sheldon", "3241", "Democratic", "WA", "35"], ["Keith  L.  Wagoner", "177725", "Republican", "WA", "39"], ["Elizabeth 'Liz'  Lovelett", "186185", "Democratic", "WA", "40"], ["Doug  Ericksen", "26187", "Republican", "WA", "42"]], "Yes": [["Derek  Stanford", "126288", "Democratic", "WA", "1"], ["Andy  Billig", "126294", "Democratic", "WA", "3"], ["Mark  Mullet", "140187", "Democratic", "WA", "5"], ["Marko  Liias", "102020", "Democratic", "WA", "21"], ["Samuel  W. 'Sam'  Hunt", "56150", "Democratic", "WA", "22"], ["Christine  Rolfes", "65880", "Democratic", "WA", "23"], ["Emily  Randall", "183038", "Democratic", "WA", "26"], ["Jeannie  L.  Darneille", "56078", "Democratic", "WA", "27"], ["T'wina  Nobles", "192771", "Democratic", "WA", "28"], ["Steve  E.  Conway", "3073", "Democratic", "WA", "29"], ["Claire  Wilson", "183049", "Democratic", "WA", "30"], ["Jesse  Salomon", "65997", "Democratic", "WA", "32"], ["Karen  L.  Keiser", "3195", "Democratic", "WA", "33"], ["Joe  Nguyen", "183064", "Democratic", "WA", "34"], ["Reuven  M.  Carlyle", "108281", "Democratic", "WA", "36"], ["Rebecca  Saldaña", "176079", "Democratic", "WA", "37"], ["June  Grube  Robinson", "150066", "Democratic", "WA", "38"], ["Lisa  Z.  Wellman", "171027", "Democratic", "WA", "41"], ["Jamie  D.  Pedersen", "66760", "Democratic", "WA", "43"], ["Steve  Hobbs", "68782", "Democratic", "WA", "44"], ["Manka  Dhingra", "176442", "Democratic", "WA", "45"], ["David  Frockt", "126427", "Democratic", "WA", "46"], ["Mona  Das", "183115", "Democratic", "WA", "47"], ["Patricia 'Patty'  Kuderer", "166011", "Democratic", "WA", "48"], ["Annette  Cleveland", "140199", "Democratic", "WA", "49"]], "Did Not Vote": [], "NA": []}, "synopsis": "Vote to pass a bill that requires the state of Washington to reach a carbon emissions reduction goal of 0 by 2050.", "link": "https://justfacts.votesmart.org/bill/30597/78971/requires-the-state-to-reach-0-carbon-emissions-by-2050", "name": "SB 5126 - Requires the State to Reach 0 Carbon Emissions by 2050 - Washington Key Vote", "pg": "Highlights: Defines \"Department\" as the Department of Ecology (Sec. 2-17). Defines \"Program\" as the greenhouse gas emissions cap and invest program (Sec. 2-42). Alleges Washington is already experiencing environmental and community impacts due to climate change through increasingly devastating wildfires, flooding, droughts, rising temperatures, and sea levels, and ocean acidification (Sec. 1-2). Requires the department to complete an evaluation by December 31, 2045, of the performance of the program, and make adjustments in the annual budgets to ensure achievement of 2050 emission reduction limits (Sec. 6-2). Specifies the following emissions are exempt from coverage in the program, regardless of the emissions reported (Sec. 7-6): Emissions from the combustion of aviation fuels supplied in Washington that are combusted outside of Washington; Emissions from watercraft fuels supplied in Washington that are combusted outside of Washington; Emissions from a coal-fired electric generation facility exempted from additional greenhouse gas limitations, requirements, or performance standards; and Emissions from facilities with North American industry classification system code 92811 (national security). Authorizes the department to cancel or restrict a previously approved auction participation application or reject a new application if the department determines that a registered entity has (Sec. 9-8): Provided false or misleading facts; Withheld material information that could influence a decision by the department; Violated any part of the auction rules; Violated registration requirements; or Violated any of the rules regarding the conduct of the auction. Specifies the annual allocation of allowances for direct distribution to an entity identified as emissions-intensive and trade-exposed during the first compliance period of the program must be equal to the covered entity's proportional obligation of the program budget for phase one, multiplied by (Sec. 10-2): During calendar year 2023, 90 percent; During calendar year 2024, 85 percent; During calendar year 2025, 80 percent; and During calendar year 2026, 75 percent. Requires allowances allocated at no cost to natural gas companies to be consigned to auction for the benefit of low-income customers (Sec. 12-2). Requires all covered and opt-in entities to submit compliance instruments on time to meet the entities' compliance obligations and comply with all requirements for monitoring, reporting, holding, and transferring emission allowances (Sec. 17-1). Requires the department to seek to link with other jurisdictions with established allowance-based greenhouse gas emission reduction programs to (Sec. 18-1): Allow for the mutual use and recognition of compliance instruments issued by Washington and other linked jurisdictions; Broaden the greenhouse gas emission reduction opportunities to reduce the costs of compliance on covered entities and consumers; Enable allowance auctions to be held jointly and provide for the use of a unified tracking system for compliance instruments; Enhance market security; Reduce program administration costs; and Provide consistent requirements for covered entities whose operations span jurisdictional boundaries. Establishes the climate investment account in the state treasury. All receipts from the auction of allowances authorized by this law must be deposited into the account (Sec. 20-1)."}