{"votes": {"No": [["Timothy  W. 'Tim'  Carpenter", "3477", "Democratic", "WI", "3"], ["G. Spencer  Coggs", "3478", "Democratic", "WI", "6"], ["Christopher  J. 'Chris'  Larson", "109307", "Democratic", "WI", "7"], ["Timothy  F. 'Tim'  Cullen", "126963", "Democratic", "WI", "15"], ["Mark  F.  Miller", "26258", "Democratic", "WI", "16"], ["Fred  A.  Risser", "3460", "Democratic", "WI", "26"], ["Jon  B.  Erpenbach", "26379", "Democratic", "WI", "27"], ["Dave  Hansen", "56438", "Democratic", "WI", "30"]], "Yes": [["Frank  G.  Lasee", "3517", "Republican", "WI", "1"], ["Robert  L.  Cowles", "3440", "Republican", "WI", "2"], ["Lena  C.  Taylor", "51747", "Democratic", "WI", "4"], ["Leah  Vukmir", "52001", "Republican", "WI", "5"], ["Alberta  Darling", "3441", "Republican", "WI", "8"], ["Joseph  K. 'Joe'  Leibham", "26308", "Republican", "WI", "9"], ["Sheila  E.  Harsdorf", "3498", "Republican", "WI", "10"], ["Neal  J.  Kedzie", "13857", "Republican", "WI", "11"], ["Jim  Holperin", "108855", "Democratic", "WI", "12"], ["Scott  L.  Fitzgerald", "3446", "Republican", "WI", "13"], ["Luther  S.  Olsen", "3524", "Republican", "WI", "14"], ["Dale  W.  Schultz", "3463", "Republican", "WI", "17"], ["Randy  Hopper", "108861", "Republican", "WI", "18"], ["Michael  G.  Ellis", "3444", "Republican", "WI", "19"], ["Glenn  Grothman", "3493", "Republican", "WI", "20"], ["Van  H.  Wanggaard", "68677", "Republican", "WI", "21"], ["Robert  W. 'Bob'  Wirch", "3557", "Democratic", "WI", "22"], ["Terry  Moulton", "51967", "Republican", "WI", "23"], ["Julie  M.  Lassa", "26310", "Democratic", "WI", "24"], ["Robert  Jauch", "3453", "Democratic", "WI", "25"], ["Mary  A.  Lazich", "3518", "Republican", "WI", "28"], ["Pamela  Gail 'Pam'  Galloway", "126969", "Republican", "WI", "29"], ["Kathleen  Vinehout", "67069", "Democratic", "WI", "31"], ["Dan  Kapanke", "56375", "Republican", "WI", "32"], ["Rich  Zipperer", "67075", "Republican", "WI", "33"]], "Did Not Vote": [], "NA": []}, "synopsis": "Vote to pass a bill that amends existing statues relating to the concealment and carrying of various types of weapons.", "link": "https://justfacts.votesmart.org/bill/13600/35964/weapons-law-amendments", "name": "SB 93 - Weapons Law Amendments - Wisconsin Key Vote", "pg": "Highlights: Defines \"weapon\" as a handgun, an electric weapon, a knife other than a switchblade, or a billy club (Sec. 38). Defines a \"handgun\" as any weapon designed or redesigned, or made or remade, and intended to be fired while held in one hand that uses the energy of an explosive to expel a projectile through a rifled bore, excluding machine guns, short-barreled rifles, or short-barreled shotguns (Sec. 38). Defines \"encased\" as the condition of being enclosed in any case which entirely conceals the weapon, whereas existing law required the case to be expressly made for the purpose of containing a weapon (Sec. 29). Requires firearms and bows to be enclosed in a carrying case, unless the firearm is a handgun or the bow is unstrung (Sec. 3). Prohibits any person from transporting a weapon in a motorboat or vehicle, with the exception of the following weapons (Sec. 30-31): Handguns; Unloaded firearms; or Unstrung or encased bows and crossbows. Authorizes an employer to prohibit licensee that it employs from carrying a concealed weapon in the course of the licensee's employment (Sec. 38). Specifies that an employer may not prohibit a licensee or an out-of-state licensee, as a condition of employment, from carrying a concealed weapon or ammunition in the licensee's own motor vehicle, regardless of whether the motor vehicle is used in the course of employment or whether the motor vehicle is driven or parked on property used by the employer (Sec. 38). Prohibits any person from knowingly possessing a firearm at a place that the individual knows, or has reasonable cause to believe, is in or on the grounds of a school, whereas existing law prohibited the possession of a firearm anywhere within a school zone (Sec. 91). Prohibits any individual from knowingly possessing a firearm at a place the individual knows, or has reasonable cause to believe, is within 1,000 feet of the grounds of a school, except for the following individuals (Sec. 91-96): Individuals with conceal and carry licenses; State-certified commission wardens; and Individuals who are legally hunting in a school forest if the school board has decided that hunting may be allowed in the school forest. Prohibits a person from possessing a firearm in state parks, unless the firearm is unloaded and enclosed in a carrying case, except for any of the following individuals (Secs. 4-8): Law enforcement officers employed by a public agency in the state; Qualified out-of-state law enforcement officers; Former law enforcement officers; and Individuals with conceal and carry licenses, as long as the firearm is a handgun. Prohibits a person from hunting or trapping within any wildlife refuge while having possession of any gun, firearm, bow, or crossbow, unless it is unloaded, unstrung, and enclosed in a carrying case, except for any of the following individuals (Secs. 9-10): Law enforcement officers employed by a public agency in the state; Qualified out-of-state law enforcement officers; Former law enforcement officers; and Individuals with conceal and carry licenses, as long as the firearm is a handgun. Establishes that statues concerning disorderly conduct or disturbing the peace may not be enforced to prohibit the open or concealed carry of a weapon, unless the circumstances indicate a criminal or malicious intent on the part of the person (Sec. 21). Appropriates funds for the Department of Justice for fiscal years 2011-2013 (Sec. 100)."}