{"votes": {"No": [["John  B.  Coghill\n                  Jr.", "15804", "Republican", "AK", "B"], ["Joe  J.  Thomas", "65655", "Democratic", "AK", "D"], ["Fred  J.  Dyson", "12745", "Republican", "AK", "F"], ["Linda  K.  Menard", "107666", "Republican", "AK", "G"], ["Kevin  G.  Meyer", "27210", "Republican", "AK", "M"], ["Catherine  A. 'Cathy'  Giessel", "117402", "Republican", "AK", "N"], ["Thomas  H. 'Tom'  Wagoner", "27170", "Republican", "AK", "Q"]], "Yes": [["Albert  M.  Kookesh", "12794", "Democratic", "AK", "C"], ["Joe  Paskvan", "107658", "Democratic", "AK", "E"], ["Bill  P.  Wielechowski", "68283", "Democratic", "AK", "H"], ["Johnny  Ellis", "8812", "Democratic", "AK", "J"], ["Hollis  S.  French\n                  II", "27243", "Democratic", "AK", "J"], ["Bettye  J.  Davis", "8848", "Democratic", "AK", "K"], ["Gary  L.  Stevens", "12784", "Republican", "AK", "P"], ["Dennis  Egan", "111163", "Democratic", "AK", "Q"], ["Bert  K.  Stedman", "27391", "Republican", "AK", "R"], ["Lyman  F.  Hoffman", "8816", "Democratic", "AK", "S"], ["Donald  C. 'Donny'  Olson", "27314", "Democratic", "AK", "T"]], "Did Not Vote": [["Charlie  R.  Huggins", "27390", "Republican", "AK", "D"], ["Lesil  L.  McGuire", "27321", "Republican", "AK", "L"]], "NA": []}, "synopsis": "Vote to pass a bill that creates the Alaska Coastal Policy Board and extends the termination date of the Alaska coastal management program to January 1, 2017.", "link": "https://justfacts.votesmart.org/bill/13605/35995/extending-the-coastal-management-program", "name": "SB 45 - Extending the Coastal Management Program - Alaska Key Vote", "pg": "Highlights: Establishes the Alaska Coastal Policy Board, which shall be made up of five public members appointed by the governor, including the following (Sec. 3): One at-large member and an alternate member from any coastal resource district who is a representative of a native regional corporation; and -Four members from a list composed of at least three names from each region, and four alternate members from a list composed of at least three names from each region, nominated and submitted by the coastal resource district. Requires the Alaska Coastal Policy Board to conduct the following tasks (Sec. 3): Make recommendations to the department relating to the approval or modification of a district coastal management plan; -Provide a forum for the discussion of issues related to this chapter, and the coastal uses and resource of the state; and -Annually solicit from state and federal agencies information as to whether they implemented any new statutes or regulations affecting coastal uses or resources; and -Review and provide comments to the department on regultions proposed. Requires coastal management plans created by coastal resource districts to ensure that policies meet the following standards (Sec. 7): Are clear and concise as to the activities and persons affected by the policies; -Use prescriptive or performance-based standards written in precise and enforceable language; -Address a coastal use or resource of concern to the residents of the district; and -Employ the least restrictive means to achieve the objectives of the enforceable policies."}