{"votes": {"No": [], "Yes": [["John  W.  Fonfara", "7180", "Democratic", "CT", "1"], ["Douglas  McCrory", "30617", "Democratic", "CT", "2"], ["Saud  Anwar", "172151", "Democratic", "CT", "3"], ["Stephen 'Steve'  Cassano", "126719", "Democratic", "CT", "4"], ["Derek  Slap", "172159", "Democratic", "CT", "5"], ["Gennaro  Bizzarro", "154827", "Republican", "CT", "6"], ["John  A.  Kissel", "7116", "Republican", "CT", "7"], ["Kevin  D.  Witkos", "30602", "Republican", "CT", "8"], ["Matthew  L. 'Matt'  Lesser", "107330", "Democratic", "CT", "9"], ["Gary  A.  Winfield", "109789", "Democratic", "CT", "10"], ["Martin  M.  Looney", "7117", "Democratic", "CT", "11"], ["Christine  Cohen", "185729", "Democratic", "CT", "12"], ["Mary  Daugherty  Abrams", "183863", "Democratic", "CT", "13"], ["James  Maroney", "141199", "Democratic", "CT", "14"], ["Joan  V.  Hartley", "7199", "Democratic", "CT", "15"], ["Robert  C. 'Rob'  Sampson", "126739", "Republican", "CT", "16"], ["George  S.  Logan", "172346", "Republican", "CT", "17"], ["Heather  B.  Somers", "142461", "Republican", "CT", "18"], ["Catherine  Ann 'Cathy'  Osten", "126682", "Democratic", "CT", "19"], ["Paul  M.  Formica", "68405", "Republican", "CT", "20"], ["Kevin  C.  Kelly", "126697", "Republican", "CT", "21"], ["Marilyn  Moore", "109782", "Democratic", "CT", "22"], ["Dennis  Bradley", "172357", "Democratic", "CT", "23"], ["Julie  Kushner", "185761", "Democratic", "CT", "24"], ["Bob  Duff", "30430", "Democratic", "CT", "25"], ["Will  Haskell", "185765", "Democratic", "CT", "26"], ["Carlo  Leone", "30262", "Democratic", "CT", "27"], ["Tony  Hwang", "107374", "Republican", "CT", "28"], ["Mae  M.  Flexer", "107174", "Democratic", "CT", "29"], ["Craig  A.  Miner", "53584", "Republican", "CT", "30"], ["Henri  Martin", "142336", "Republican", "CT", "31"], ["Eric  C.  Berthel", "154862", "Republican", "CT", "32"], ["Leonard  A. 'Len'  Fasano", "30404", "Republican", "CT", "34"], ["Daniel  A.  Champagne", "72871", "Republican", "CT", "35"], ["Alexandra  Kasser", "185783", "Democratic", "CT", "36"]], "Did Not Vote": [["Norman  Needleman", "172370", "Democratic", "CT", "33"]], "NA": []}, "synopsis": "Vote to pass a bill that amends The Connecticut Property Transfer Act of 1985 and authorizes the development and implementation of a release-based remediation program.", "link": "https://justfacts.votesmart.org/bill/29075/75712/amends-the-connecticut-property-transfer-act-of-1985", "name": "HB 7001 - Amends The Connecticut Property Transfer Act of 1985 - Connecticut Key Vote", "pg": "Highlights: Specifies that “release” means any spilling, leaking, pumping, pouring, emitting, emptying, discharging, injecting, escaping, leaching, dumping, or disposing onto or into the land and waters of the state of (Sec 15): Oil, petroleum, or chemical liquids or solids; Liquid or gaseous products; or Hazardous waste. Requires any person who creates or maintains an illegal release to the land and waters of the state to report and remediate it to the identified standards (Sec 17). Authorizes the Commissioner of Energy and Environmental Protection to co-chair and convene a working group in the Department of Energy and Environmental Protection for the purpose of providing advice and feedback for regulations to be adopted (Sec 19). Specifies that the regulations should include, but are not limited to, provisions regarding (Sec 19): Reporting requirements for any releases; Procedures and deadlines for remediation; Standards for remediation, including environmental use restrictions; Verification and Commisioner’s audit of remediation; Supervision of remediation, based on the nature of the release; and Any required fees. Requires the Commissioner to specify tiers of release based on the risk that correlates to the (Sec 19): Existence, source, nature, and extent of a release; Nature and extent of danger to public health, safety, welfare, and the environment; Magnitude and complexity of the actions necessary to assess, contain, or remove the release; Extent to which the proposed remediation will leave behind pollutants; and Extent to which the oversight of the commission is necessary to ensure compliance. Requires the Commissioner to specify the types of releases to be reported and the timeframe for reporting for any new regulation adopted by the group (Sec 19). Requires the Commissioner, when establishing standards for remediation, to (Sec 19): Consider the previous standards set forth; Give preference to permanent cleanup methods; Provide flexibility for licensed environmental professionals to establish and implement risk-based alternative cleanup standards; Provide for less stringent standards for polluted properties utilized for purposes other than residential land use; and Consider any additional factors deemed appropriate. Authorizes the regulations regarding audits to (Sec 19): Allow the Commissioner to audit any verification; Set goals for the number of audits to be conducted; Prioritize the auditing of higher-risk releases; Utilize multiple levels of auditing; and Provide certain timeframes for commencing audits. Requires the Commissioner to audit a sufficient number of verifications to ensure the protection of human health and the environment, and a high frequency of compliance with regulations (Sec 20). Specifies that no owner should be liable for costs or damages with respect to any release on or emanating from their property, provided (Sec 21): The owner did not create the release and is not responsible for the creation of the release; The owner is not affiliated with any person responsible for the release through familial, contractual, corporate, or financial relationships; and The release has been remediated in accordance with all regulations. Authorizes the Commissioner to issue an order, requiring a person that created or maintained a release to comply with remediation regulations (Sec 18)."}