{"votes": {"No": [["Craig  A.  Miner", "53584", "Republican", "CT", "30"]], "Yes": [["John  W.  Fonfara", "7180", "Democratic", "CT", "1"], ["Douglas  McCrory", "30617", "Democratic", "CT", "2"], ["Saud  Anwar", "172151", "Democratic", "CT", "3"], ["Stephen 'Steve'  Cassano", "126719", "Democratic", "CT", "4"], ["Derek  Slap", "172159", "Democratic", "CT", "5"], ["Gennaro  Bizzarro", "154827", "Republican", "CT", "6"], ["John  A.  Kissel", "7116", "Republican", "CT", "7"], ["Kevin  D.  Witkos", "30602", "Republican", "CT", "8"], ["Matthew  L. 'Matt'  Lesser", "107330", "Democratic", "CT", "9"], ["Gary  A.  Winfield", "109789", "Democratic", "CT", "10"], ["Martin  M.  Looney", "7117", "Democratic", "CT", "11"], ["Christine  Cohen", "185729", "Democratic", "CT", "12"], ["Mary  Daugherty  Abrams", "183863", "Democratic", "CT", "13"], ["James  Maroney", "141199", "Democratic", "CT", "14"], ["Joan  V.  Hartley", "7199", "Democratic", "CT", "15"], ["Robert  C. 'Rob'  Sampson", "126739", "Republican", "CT", "16"], ["George  S.  Logan", "172346", "Republican", "CT", "17"], ["Heather  B.  Somers", "142461", "Republican", "CT", "18"], ["Catherine  Ann 'Cathy'  Osten", "126682", "Democratic", "CT", "19"], ["Paul  M.  Formica", "68405", "Republican", "CT", "20"], ["Kevin  C.  Kelly", "126697", "Republican", "CT", "21"], ["Marilyn  Moore", "109782", "Democratic", "CT", "22"], ["Dennis  Bradley", "172357", "Democratic", "CT", "23"], ["Julie  Kushner", "185761", "Democratic", "CT", "24"], ["Bob  Duff", "30430", "Democratic", "CT", "25"], ["Will  Haskell", "185765", "Democratic", "CT", "26"], ["Carlo  Leone", "30262", "Democratic", "CT", "27"], ["Tony  Hwang", "107374", "Republican", "CT", "28"], ["Mae  M.  Flexer", "107174", "Democratic", "CT", "29"], ["Henri  Martin", "142336", "Republican", "CT", "31"], ["Eric  C.  Berthel", "154862", "Republican", "CT", "32"], ["Norman  Needleman", "172370", "Democratic", "CT", "33"], ["Leonard  A. 'Len'  Fasano", "30404", "Republican", "CT", "34"], ["Daniel  A.  Champagne", "72871", "Republican", "CT", "35"], ["Alexandra  Kasser", "185783", "Democratic", "CT", "36"]], "Did Not Vote": [], "NA": []}, "synopsis": "Vote to pass a bill that expands the existing environmental justice law.", "link": "https://justfacts.votesmart.org/bill/29625/76528/expands-the-existing-environmental-justice-law", "name": "HB 7008 - Expands the Existing Environmental Justice Law - Connecticut Key Vote", "pg": "Highlights: Defines \"environmental justice community\" as a United States census block group, as determined in accordance with the most recent United States census, in which 30 percent or more of the population consists of low-income persons who are not institutionalized and have an income below 200 percent of the federal poverty level (Sec. 1). Defines \"affecting facility\" as any of the following, including (Sec. 1): An electric generating facility with a capacity of more than ten megawatts; A sludge or solid waste incinerator or combustor; A sewage treatment plant with a capacity of more than 50 million gallons per day; An intermediate processing center, volume reduction facility or multi-town recycling facility with a combined monthly volume in excess of 25 tons; A new or expanded landfill, including, but not limited to, a landfill that contains ash, construction and demolition debris or solid waste; A medical waste incinerator; or A major source of air pollution as defined by the federal Clean Air Act. Requires meaningful public participation from an environmental justice community in the decision making process on proposed facilities or the expansion of an existing facility that may adversely affect such resident’s environment or health (Sec. 1). Defines “community environmental benefit agreement” as a written agreement entered into by the chief elected official or town manager of a municipality and owner or developer of a new or expanded affecting facility that provides financial resources to combat impacts reasonably related to the facility, including impacts on the environment such as air quality and watercourses, quality of life, and asthma rates (Sec. 1). Specifies that a community environmental benefit agreement may also include the following, including (Sec. 1): Diesel pollution reduction; Electric vehicle charging infrastructure construction; or Establishment of a wellness clinic. Specifies that a public participation plan shall be used in order to facilitate meaningful public participation in the regulatory and certification process of an affecting facility, and requires the plan include posting reasonably visible signs on the proposed or existing facility in all languages that at least 15 percent of the population of the environmental justice community living within a half-mile radius of the facility speaks (Sec. 1). Establishes that the Department of Energy or Connecticut Siting Council shall not take any action on a facility that applicants permit filed on or after November 1, 2020, if the applicant fails to undertake the aforementioned requirements (Sec. 1)."}