{"votes": {"No": [["John  A.  Kissel", "7116", "Republican", "CT", "7"], ["Robert  C. 'Rob'  Sampson", "126739", "Republican", "CT", "16"], ["Heather  B.  Somers", "142461", "Republican", "CT", "18"], ["Paul  M.  Formica", "68405", "Republican", "CT", "20"], ["Kevin  C.  Kelly", "126697", "Republican", "CT", "21"], ["Craig  A.  Miner", "53584", "Republican", "CT", "30"], ["Henri  Martin", "142336", "Republican", "CT", "31"], ["Eric  C.  Berthel", "154862", "Republican", "CT", "32"], ["Paul  Cicarella\n                  Jr.", "193684", "Republican", "CT", "34"], ["Daniel  A.  Champagne", "72871", "Republican", "CT", "35"]], "Yes": [["John  W.  Fonfara", "7180", "Democratic", "CT", "1"], ["Douglas  McCrory", "30617", "Democratic", "CT", "2"], ["Saud  Anwar", "172151", "Democratic", "CT", "3"], ["Stephen 'Steve'  Cassano", "126719", "Democratic", "CT", "4"], ["Derek  Slap", "172159", "Democratic", "CT", "5"], ["Richard 'Rick'  Lopes", "138610", "Democratic", "CT", "6"], ["Kevin  D.  Witkos", "30602", "Republican", "CT", "8"], ["Matthew  L. 'Matt'  Lesser", "107330", "Democratic", "CT", "9"], ["Gary  A.  Winfield", "109789", "Democratic", "CT", "10"], ["Martin  M.  Looney", "7117", "Democratic", "CT", "11"], ["Christine  Cohen", "185729", "Democratic", "CT", "12"], ["Mary  Daugherty  Abrams", "183863", "Democratic", "CT", "13"], ["James  Maroney", "141199", "Democratic", "CT", "14"], ["Joan  V.  Hartley", "7199", "Democratic", "CT", "15"], ["Jorge  Cabrera", "183866", "Democratic", "CT", "17"], ["Catherine  Ann 'Cathy'  Osten", "126682", "Democratic", "CT", "19"], ["Marilyn  Moore", "109782", "Democratic", "CT", "22"], ["Dennis  Bradley", "172357", "Democratic", "CT", "23"], ["Julie  Kushner", "185761", "Democratic", "CT", "24"], ["Bob  Duff", "30430", "Democratic", "CT", "25"], ["Will  Haskell", "185765", "Democratic", "CT", "26"], ["Patricia  Billie  Miller", "105769", "Democratic", "CT", "27"], ["Tony  Hwang", "107374", "Republican", "CT", "28"], ["Mae  M.  Flexer", "107174", "Democratic", "CT", "29"], ["Norman  Needleman", "172370", "Democratic", "CT", "33"], ["Alexandra  Kasser", "185783", "Democratic", "CT", "36"]], "Did Not Vote": [], "NA": []}, "synopsis": "Vote to pass a bill that authorizes climate change adaptation for the infrastructure for shoreline and inland communities.", "link": "https://justfacts.votesmart.org/bill/31442/81613/authorizes-climate-change-adaptation-for-shoreline-and-inland-communities", "name": "HB 6441 - Authorizes Climate Change Adaptation for Shoreline and Inland Communities - Connecticut Key Vote", "pg": "Highlights: Establishes a municipal stormwater authority has the following powers (Sec. 2): To sue and be sued; To acquire, hold and convey any estate, real or personal; To contract; To borrow money, including by the issuance of bonds, provided the issuance of such bonds is approved by the legislative body of the municipality in which such authority district is located; To recommend to the legislative body of such a municipality the imposition of fees upon the taxable interests in real property within such authority districts. Establishes any charge due to a municipal stormwater authority and any fee levied and not paid in full on or before 30 days after the due date will thereupon be delinquent and will bear interest from the due date at the rate charged by the municipality's tax collector for such rates and in such manner as provided for delinquent property taxes (Sec. 3). Authorizes 2 or more municipalities to, by concurrent votes of their legislative bodies, agree to jointly exercise through joint flood prevention, climate resilience, and erosion control board powers. The joint flood prevention, climate resilience, and erosion control board will have jurisdiction over each municipality subject to such agreement (Sec. 4-2). Establishes a Clean Energy Fund which will be within the Connecticut Green Bank. The fund may receive any amount required by law to be deposited into the fund and may receive any federal funds as may become available to the state for clean energy investments (Sec. 19-4.c-1). Establishes an Environmental Infrastructure Fund which will be within the Connecticut Green Bank. The fund may receive any amount required by law to be deposited into the fund and may receive any federal funds as may become available to the state for environmental infrastructure investments, except that the fund will not receive (Sec. 19-2.A): Ratepayer or Regional Greenhouse Gas Initiative funds; Funds that have been deposited in, or are required to be deposited in, an account of the Clean Water Fund; or Funds collected from a water company, Requires the Connecticut Green Bank to develop standards to govern the administration of said bank through rules, policies, and procedures that specify borrower eligibility, terms and conditions of support, and other relevant criteria, standards, or procedures (Sec. 19-2.B). Prohibits the Connecticut Green Bank from applying, directly or through a subsidiary, to be eligible for grants under (Sec. 19.G): The Clean Water Act, as amended from time to time, without the approval of the State Treasurer and the Commissioner of Energy and Environmental Protection; or The Safe Drinking Water Act, as amended from time to time, without the approval of the State Treasurer and the Commissioner of Public Health. Authorizes bonds to be issued as serial bonds or as term bonds, or the Connecticut Green Bank, in its discretion, to issue bonds of both types. The bonds will be authorized by resolution of the members of the board of directors of said bank and will bear such date or dates, mature at such time or times, not exceeding 25 years for bonds issued for clean energy and 50 years for bonds issued for environmental infrastructure from their respective dates and in each case not to exceed the expected useful life of the underlying project or projects (Sec. 23.c)."}