{"votes": {"No": [["Rosanna  Gabaldón", "141336", "Democratic", "AZ", "2"], ["Sally  Ann  Gonzales", "12275", "Democratic", "AZ", "3"], ["Lisa  Otondo", "28473", "Democratic", "AZ", "4"], ["Jamescita 'Mae'  Peshlakai", "141360", "Democratic", "AZ", "7"], ["Victoria  Steele", "141367", "Democratic", "AZ", "9"], ["Kirsten  Engel", "171720", "Democratic", "AZ", "10"], ["Sean  Bowie", "171663", "Democratic", "AZ", "18"], ["Guadalupe  Chavira 'Lupe'  Contreras", "141487", "Democratic", "AZ", "19"], ["Lela  Alston", "123722", "Democratic", "AZ", "24"], ["Juan  Mendez", "141502", "Democratic", "AZ", "26"], ["Rebecca  Rios", "3107", "Democratic", "AZ", "27"], ["Christine  Porter  Marsh", "184542", "Democratic", "AZ", "28"], ["Martín  J.  Quezada", "123716", "Democratic", "AZ", "29"], ["Otoniel 'Tony'  Navarrete", "171893", "Democratic", "AZ", "30"]], "Yes": [["Karen  Fann", "123640", "Republican", "AZ", "1"], ["Sonny  Borrelli", "129361", "Republican", "AZ", "5"], ["Wendy  J.  Rogers", "123618", "Republican", "AZ", "6"], ["Thomas  J. 'T.J.'  Shope", "141366", "Republican", "AZ", "8"], ["Venden 'Vince'  Leach", "153854", "Republican", "AZ", "11"], ["Warren  Petersen", "141381", "Republican", "AZ", "12"], ["Sine  Kerr", "178430", "Republican", "AZ", "13"], ["David  M.  Gowan\n                  Sr.", "28241", "Republican", "AZ", "14"], ["Nancy  K.  Barto", "58371", "Republican", "AZ", "15"], ["Kelly  Townsend", "123798", "Republican", "AZ", "16"], ["Javan 'J.D.'  Mesnard", "123791", "Republican", "AZ", "17"], ["Paul  Boyer", "141493", "Republican", "AZ", "20"], ["Rick  Gray", "123693", "Republican", "AZ", "21"], ["David  Livingston", "141496", "Republican", "AZ", "22"], ["Michelle  B.  Ugenti-Rita", "123686", "Republican", "AZ", "23"], ["Tyler  Pace", "184537", "Republican", "AZ", "25"]], "Did Not Vote": [], "NA": []}, "synopsis": "Vote to pass a bill that requires aquifer protection permits.", "link": "https://justfacts.votesmart.org/bill/30140/77543/requires-aquifer-protection-permits", "name": "HB 2042 - Requires Aquifer Protection Permits - Arizona Key Vote", "pg": "Highlights: Authorizes exempting specifically described classes or categories of facilities from the aquifer protection permit requirements of this article on a finding either that there is no reasonable probability of degradation of the aquifer or that aquifer water quality will be maintained and protected because the discharges from the facilities are regulated under other federal or state programs that provide the same or greater aquifer water quality protection (Sec. 1.A). Exempts numerous entities, facilities, and activities from the aquifer permitting process including, but not limited to the following (Sec. 1.B): Household and domestic activities; Household gardening, lawn watering, lawn care, landscape maintenance and related activities; The noncommercial use of consumer products generally available to and used by the public; Ponds used for watering livestock and wildlife; Mining overburden returned to the excavation site including any common material that has been excavated and removed from the excavation site and has not been subjected to any chemical or leaching agent or process of any kind; Facilities used solely for surface transportation or storage of groundwater, surface water for beneficial use of reclaimed water that is regulated beneficial use; Discharge to a community sewer system; and Municipal solid waste landfills. Establishes an underground injection control permit program, including a permitting process (Sec. 2.A). Prohibits any underground injection activity if it is conducted in a manner that allows the movement of fluid containing any contaminant into underground sources of drinking water and if the presence of that contaminant may endanger underground sources of drinking water (Sec. 2.C). Authorizes the director of a facility to adopt rules to establish and operate the underground injection control permit (Sec. 2.D). Prohibits a facility from discharging any pollutants inconsistent with the director's decision until the appeal process is completed If an appeal is taken from the director's decision to issue a permit for a new facility (Sec. 3.A). Specifies if an appeal is taken from the director's decision to grant, deny, modify or revoke a permit for a facility already subject to a permit, the facility may continue to operate as long as the operation complies with the conditions of the existing permit until final disposition of the appeal (Sec. 3-2)."}