{"status": "OK", "bill": {"bill_id": 1145761, "change_hash": "4a418019dcfd4276b1c5fba22ef74ae9", "session_id": 1647, "session": {"session_id": 1647, "state_id": 37, "year_start": 2019, "year_end": 2019, "prefile": 0, "sine_die": 1, "prior": 1, "special": 0, "session_tag": "Regular Session", "session_title": "2019 Regular Session", "session_name": "2019 Legislative Measures"}, "url": "https://legiscan.com/OR/bill/HB2251/2019", "state_link": "https://olis.oregonlegislature.gov/liz/2019R1/Measures/Overview/HB2251", "completed": 1, "status": 6, "status_date": "2019-06-30", "progress": [{"date": "2019-01-14", "event": 1}, {"date": "2019-01-15", "event": 9}, {"date": "2019-06-30", "event": 6}], "state": "OR", "state_id": 37, "bill_number": "HB2251", "bill_type": "B", "bill_type_id": "1", "body": "H", "body_id": 81, "current_body": "H", "current_body_id": 81, "title": "Relating to firearms.", "description": "Defines \"assault rifle.\" Prohibits transfer of handgun or assault rifle to person under 21 years of age. Punishes violation by maximum of 364 days' imprisonment, $6,250 fine, or both. Restricts transfer of firearm by gun dealer or private party if Department of State Police is unable to determine whether recipient is qualified to receive firearm. Authorizes transfer after 30 days as long as gun dealer or transferor does not know or have reason to believe recipient is disqualified from completing transfer. Provides that person subject to certain court protective orders is prohibited from possessing firearms if person had opportunity to be heard on order and failed to request hearing. Punishes violation of prohibition by maximum of 364 days' imprisonment, $6,250 fine, or both. Requires court to order relinquishment of firearms when person is convicted of certain domestic violence offenses or subject to certain court orders. Requires person to transfer firearms within 24 hours of court order and to file affidavit within 48 hours of court order. Requires hospitals to submit data concerning patients with injuries caused by firearms to Oregon Health Authority and to electronic emergency medical services data system managed by authority. Creates crime of endangering a minor by allowing access to a firearm. Punishes by maximum of 364 days' imprisonment, $6,250 fine, or both. Prohibits possession of firearm by person convicted of endangering a minor by allowing access to a firearm for five-year period after conviction. Creates process for obtaining relief from prohibition. Provides that minor may lawfully possess firearm only with permission of parent or guardian. Prohibits transfer of firearm to person convicted of endangering a minor by allowing access to a firearm for five-year period after conviction. Requires permission of minor's parent or guardian for temporary transfer of firearm to minor. Requires gun dealer to post notice concerning obligation to prevent minors from accessing firearm without consent of minor's parent or guardian.", "pending_committee_id": 0, "committee": [], "referrals": [{"date": "2019-01-15", "committee_id": 1844, "chamber": "H", "chamber_id": 81, "name": "Judiciary"}], "history": [{"date": "2019-01-14", "action": "First reading. Referred to Speaker's desk.", "chamber": "H", "chamber_id": 81, "importance": 1}, {"date": "2019-01-15", "action": "Referred to Judiciary with subsequent referral to Ways and Means.", "chamber": "H", "chamber_id": 81, "importance": 1}, {"date": "2019-06-30", "action": "In committee upon adjournment.", "chamber": "H", "chamber_id": 81, "importance": 1}], "sponsors": [], "sasts": [], "subjects": [], "texts": [{"doc_id": 1843585, "date": "0000-00-00", "type": "Introduced", "type_id": 1, "mime": "application/pdf", "mime_id": 2, "url": "https://legiscan.com/OR/text/HB2251/id/1843585", "state_link": "https://olis.oregonlegislature.gov/liz/2019R1/Downloads/MeasureDocument/HB2251/Introduced", "text_size": 76391, "text_hash": "735169bc3e6223774a75d83d49af6e12"}], "votes": [], "amendments": [], "supplements": [], "calendar": []}}