{"status": "OK", "bill": {"bill_id": 204591, "change_hash": "470a831bb807ec11ae964b15de4a21f1", "session_id": 77, "session": {"session_id": 77, "state_id": 52, "year_start": 2009, "year_end": 2010, "prefile": 0, "sine_die": 1, "prior": 1, "special": 0, "session_tag": "Regular Session", "session_title": "2009-2010 Regular Session", "session_name": "111th Congress"}, "url": "https://legiscan.com/US/bill/SB160/2009", "state_link": "https://www.congress.gov/bill/111th-congress/senate-bill/160/all-info", "completed": 0, "status": 2, "status_date": "2009-03-02", "progress": [{"date": "2009-01-06", "event": 1}, {"date": "2009-01-06", "event": 9}, {"date": "2009-02-11", "event": 10}, {"date": "2009-03-02", "event": 2}], "state": "US", "state_id": 52, "bill_number": "SB160", "bill_type": "B", "bill_type_id": "1", "body": "S", "body_id": 115, "current_body": "H", "current_body_id": 114, "title": "District of Columbia House Voting Rights Act of 2009", "description": "Title I: District of Columbia House Voting Rights Act of 2009 - District of Columbia House Voting Rights Act of 2009 - (Sec. 2) Considers the District of Columbia a congressional district for purposes of representation in the House of Representatives. Declares that the District shall not be considered a state for purposes of representation in the Senate. Applies to the District in the same manner as it applies to a state the federal law providing for the 15th and subsequent decennial censuses and for apportionment of Representatives in Congress. Limits the District to one Member under any reapportionment of Members. Modifies the formula regarding the number of presidential electors to subject it to the 23rd amendment to the Constitution in the case of the District. (Sec. 3) Increases membership of the House from 435 to 437 Members. Provides for a reapportionment of Members resulting from such increase. Requires: (1) the President to submit to Congress a revised version of the most recent statement of such apportionment reflecting that the District of Columbia is entitled to one Representative and identifying Utah as the other state entitled to one Representative; and (2) the Clerk of the House, upon receipt of such revision, to make such identifications to the Speaker of the House. (Sec. 4) Requires the additional Representative to which the state of Utah is entitled to be elected pursuant to a redistricting plan enacted by the state. (Sec. 6) Repeals provisions of: (1) the District of Columbia Delegate Act establishing the office of District of Columbia Delegate to the House of Representatives; and (2) the District of Columbia Statehood Constitution Convention Initiative of 1979 providing for election of a Representative for the District. Makes conforming amendments to the District of Columbia Elections Code of 1955. (Sec. 8) Sets forth procedures for expedited judicial review of any action brought to challenge the constitutionality of any provision of this Act or any amendment made by it.  Grants Members of Congress the right to intervene or file legal pleadings or briefs either in support of or opposition to the position of a party in any action in which the constitutionality of any provision of this Act or any amendment made by this Act is challenged. Authorizes any Member of Congress to bring such an action. (Sec. 9) Amends the Communications Act of 1934 to direct the Federal Communications Commission (FCC) to take action to encourage and promote diversity in communication media ownership and to ensure that broadcast station licenses are used in the public interest. (Sec. 10) Denies the FCC authority to require broadcasters to present opposing viewpoints on controversial issues of public importance, commonly referred to as the Fairness Doctrine. Title II: Second Amendment Enforcement Act - Second Amendment Enforcement Act - (Sec. 203) Amends specified law prohibiting the killing of wild birds and wild animals in the District of Columbia to declare that nothing in it or any other provision of law shall authorize or be construed to permit the Council, the Mayor, or any governmental or regulatory authority of the District to prohibit, constructively prohibit, or unduly burden the ability of persons otherwise not prohibited from possessing firearms under federal law from acquiring, possessing in their homes or businesses, or using for sporting, self-protection or other lawful purposes, any firearm neither prohibited by federal law nor subject to the National Firearms Act. Denies the District any authority to enact laws or regulations that discourage or eliminate the private ownership or use of firearms. Declares that nothing in such prohibitions shall be construed to prohibit the District from regulating or prohibiting the carrying of firearms by a person, either concealed or openly, other than at the person's dwelling place, place of business, or on other land possessed by the person. (Sec. 204) Amends the Firearms Control Regulations Act of 1975 (FCRA) to repeal the definition of a machine gun as any firearm which shoots, is designed to shoot, or can be readily converted or restored to shoot semiautomatically, more than 12 shots without manual reloading. (Thus repeals the ban on semiautomatic weapons.) Redefines \"machine gun\" as any firearm which shoots, is designed to shoot, or may be readily restored to shoot automatically, more than one shot without manual reloading by a single function of the trigger. Includes the frame or receiver of any such weapon, any part designed and intended solely and exclusively, or combination of parts designed and intended, for use in converting a weapon into a machine gun, and any combination of parts from which a machine gun can be assembled if such parts are in the possession or under the control of a person. (Sec. 205) Repeals the District's: (1) registration requirement for possession of firearms; and (2) requirement that licensed firearms dealers keep records of ammunition received into inventory and ammunition sold or transferred. Maintains the current ban on the possession and control of a sawed-off shotgun, machine gun, or short-barreled rifle. (Sec. 206) Amends FCRA to allow an individual to possess ammunition in the District if the individual owns (currently, holds the valid registration certificate for) a firearm of the same gauge or caliber as such ammunition. (In effect, repeals the handgun ammunition ban.) (Sec. 207) Repeals the requirement that firearms in the possession of individuals (other than law enforcement personnel) must be kept unloaded, disassembled, or with the trigger locked, unless the firearm is kept at an individual's place of business, or while being used for lawful recreational purposes within the District of Columbia. (Sec. 208) Eliminates criminal penalties for: (1) possessing an unregistered firearm; or (2) carrying a pistol whether loaded or unloaded in one's dwelling house, place of business, or on land possessed by such person. Makes conforming amendments to the District of Columbia Code. (Sec. 210) Amends the federal criminal code to make it lawful for any licensed importer, licensed manufacturer, licensed dealer, or licensed collector to sell or deliver a handgun to a District resident if such licensee's place of business is located in Maryland or Virginia. (Sec. 211) Repeals the Firearms Registration Act of 2008 and the Firearms Registration Emergency Amendment Act of 2008, as passed by the District of Columbia.", "pending_committee_id": 0, "committee": [], "referrals": [{"date": "2009-01-06", "committee_id": 2329, "chamber": "S", "chamber_id": 115, "name": "Homeland Security And Governmental Affairs"}], "history": [{"date": "2009-01-06", "action": "Sponsor introductory remarks on measure. (CR S141-142)", "chamber": "", "chamber_id": 0, "importance": 0}, {"date": "2009-01-06", "action": "Read twice and referred to the Committee on Homeland Security and Governmental Affairs. (text of measure as introduced: CR S142-143)", "chamber": "", "chamber_id": 0, "importance": 1}, {"date": "2009-02-11", "action": "Committee on Homeland Security and Governmental Affairs. Ordered to be reported with an amendment in the nature of a substitute favorably.", "chamber": "", "chamber_id": 0, "importance": 1}, {"date": "2009-02-12", "action": "Committee on Homeland Security and Governmental Affairs. Reported by Senator Lieberman with an amendment in the nature of a substitute. Without written report.", "chamber": "", "chamber_id": 0, "importance": 0}, {"date": "2009-02-12", "action": "Placed on Senate Legislative Calendar under General Orders. Calendar No. 23.", "chamber": "", "chamber_id": 0, "importance": 0}, {"date": "2009-02-13", "action": "Motion to proceed to consideration of measure made in Senate. (consideration: CR S2347)", "chamber": "", "chamber_id": 0, "importance": 0}, {"date": "2009-02-13", "action": "Cloture motion on the motion to proceed to the bill presented in Senate. (consideration: CR S2347; text: CR S2347)", "chamber": "", "chamber_id": 0, "importance": 0}, {"date": "2009-02-13", "action": "Motion to proceed to consideration of measure withdrawn in Senate by Unanimous Consent. (consideration: CR S2347)", "chamber": "", "chamber_id": 0, "importance": 0}, {"date": "2009-02-23", "action": "Motion to proceed to measure considered in Senate. (consideration: CR S2353-2360)", "chamber": "", "chamber_id": 0, "importance": 0}, {"date": "2009-02-24", "action": "Motion to proceed to measure considered in Senate. (consideration: CR S2390-2398)", "chamber": "", "chamber_id": 0, "importance": 0}, {"date": "2009-02-24", "action": "Cloture on the motion to proceed to the bill invoked in Senate by Yea-Nay Vote. 62 - 34. Record Vote Number: 65. (consideration: CR S2397-2398; text: CR S2397)", "chamber": "", "chamber_id": 0, "importance": 0}, {"date": "2009-02-24", "action": "Motion to proceed to consideration of measure agreed to in Senate by Unanimous Consent. (consideration: CR S2398)", "chamber": "", "chamber_id": 0, "importance": 0}, {"date": "2009-02-24", "action": "Measure laid before Senate by motion. (consideration: CR S2398-2399; text of measure as reported in Senate: CR S2398-2399)", "chamber": "", "chamber_id": 0, "importance": 0}, {"date": "2009-02-25", "action": "Considered by Senate. (consideration: CR S2434-2461)", "chamber": "", "chamber_id": 0, "importance": 0}, {"date": "2009-02-25", "action": "Point of order that the measure violates the Constitution raised in Senate.", "chamber": "", "chamber_id": 0, "importance": 0}, {"date": "2009-02-25", "action": "S.AMDT.574 Amendment SA 574 proposed by Senator Kyl. (consideration: CR S2442; text: CR S2442)To provide for the expedited judicial review for Members of Congress.", "chamber": "", "chamber_id": 0, "importance": 0}, {"date": "2009-02-25", "action": "S.AMDT.574 Amendment SA 574 agreed to in Senate by Voice Vote.", "chamber": "", "chamber_id": 0, "importance": 0}, {"date": "2009-02-25", "action": "S.AMDT.575 Amendment SA 575 proposed by Senator Ensign. (consideration: CR S2442-2444, S2456-2458, S2458-2460, S2461)To restore Second Amendment rights in the District of Columbia.", "chamber": "", "chamber_id": 0, "importance": 0}, {"date": "2009-02-25", "action": "S.AMDT.576 Amendment SA 576 proposed by Senator Coburn to Amendment SA 575. (consideration: CR S2444-2451)To restore Second Amendment rights in the District of Columbia.", "chamber": "", "chamber_id": 0, "importance": 0}, {"date": "2009-02-25", "action": "By a decision of the Senate the point of order that the measure violates the Constitution was not well taken by Yea-Nay Vote. 36 - 62. Record Vote Number: 67.", "chamber": "", "chamber_id": 0, "importance": 0}, {"date": "2009-02-25", "action": "S.AMDT.579 Amendment SA 579 proposed by Senator Thune. (consideration: CR S2451-2452; text: CR S2451)To amend chapter 44 of title 18, United States Code, to allow citizens who have concealed carry permits from the State or the District of Columbia in which they reside to carry concealed firearms in another State or the District of Columbia that grants concealed carry permits, if the individual complies with the laws of the State or District of Columbia.", "chamber": "", "chamber_id": 0, "importance": 0}, {"date": "2009-02-25", "action": "S.AMDT.585 Amendment SA 585 proposed by Senator Kyl. (consideration: CR S2452-2454)To provide for the retrocession of the District of Columbia to the State of Maryland, and for other purposes.", "chamber": "", "chamber_id": 0, "importance": 0}, {"date": "2009-02-25", "action": "S.AMDT.581 Amendment SA 581 proposed by Senator Coburn. (consideration: CR S2458, S2460; text: CR S2458)In the nature of a substitute.", "chamber": "", "chamber_id": 0, "importance": 0}, {"date": "2009-02-25", "action": "S.AMDT.581 Amendment SA 581 not agreed to in Senate by Yea-Nay Vote. 7 - 91. Record Vote Number: 68.", "chamber": "", "chamber_id": 0, "importance": 0}, {"date": "2009-02-25", "action": "Cloture motion on the measure presented in Senate. (consideration: CR S2461; text: CR S2461)", "chamber": "", "chamber_id": 0, "importance": 0}, {"date": "2009-02-26", "action": "Considered by Senate. (consideration: CR S2507-2542)", "chamber": "", "chamber_id": 0, "importance": 0}, {"date": "2009-02-26", "action": "S.AMDT.575 Considered by Senate. (consideration: CR S2507, S2513-2516, S2526-2538)", "chamber": "", "chamber_id": 0, "importance": 0}, {"date": "2009-02-26", "action": "S.AMDT.576 Considered by Senate. (consideration: CR S2507)", "chamber": "", "chamber_id": 0, "importance": 0}, {"date": "2009-02-26", "action": "S.AMDT.579 Considered by Senate. (consideration: CR S2508, S2525-2526)", "chamber": "", "chamber_id": 0, "importance": 0}, {"date": "2009-02-26", "action": "S.AMDT.585 Considered by Senate. (consideration: CR S2508-2512)", "chamber": "", "chamber_id": 0, "importance": 0}, {"date": "2009-02-26", "action": "S.AMDT.585 Amendment SA 585 not agreed to in Senate by Yea-Nay Vote. 30 - 67. Record Vote Number: 69.", "chamber": "", "chamber_id": 0, "importance": 0}, {"date": "2009-02-26", "action": "S.AMDT.587 Amendment SA 587 proposed by Senator Ensign. (consideration: CR S2512-2513, S2520-2522; text: CR S2512)To reauthorize the DC School Choice Incentive Act of 2003 for fiscal year 2010.", "chamber": "", "chamber_id": 0, "importance": 0}, {"date": "2009-02-26", "action": "S.AMDT.573 Amendment SA 573 proposed by Senator DeMint. (consideration: CR S2516-2517, S2524-2525; text: CR S2516)To prevent the Federal Communications Commission from repromulgating the fairness doctrine.", "chamber": "", "chamber_id": 0, "importance": 0}, {"date": "2009-02-26", "action": "S.AMDT.591 Amendment SA 591 proposed by Senator Durbin. (consideration: CR S2517-2520, S2522-2524; text: CR S2522)To encourage and promote diversity in communication media ownership, and to ensure that the public airwaves are used in the public interest.", "chamber": "", "chamber_id": 0, "importance": 0}, {"date": "2009-02-26", "action": "S.AMDT.591 Amendment SA 591 agreed to in Senate by Yea-Nay Vote. 57 - 41. Record Vote Number: 70.", "chamber": "", "chamber_id": 0, "importance": 0}, {"date": "2009-02-26", "action": "S.AMDT.573 Amendment SA 573 agreed to in Senate by Yea-Nay Vote. 87 - 11. Record Vote Number: 71.", "chamber": "", "chamber_id": 0, "importance": 0}, {"date": "2009-02-26", "action": "S.AMDT.579 Proposed amendment SA 579 withdrawn in Senate. (consideration: CR S2525)", "chamber": "", "chamber_id": 0, "importance": 0}, {"date": "2009-02-26", "action": "S.AMDT.587 Proposed amendment SA 587 withdrawn in Senate. (consideration: CR S2525)", "chamber": "", "chamber_id": 0, "importance": 0}, {"date": "2009-02-26", "action": "S.AMDT.576 Proposed amendment SA 576 withdrawn in Senate. (consideration: CR S2525)", "chamber": "", "chamber_id": 0, "importance": 0}, {"date": "2009-02-26", "action": "S.AMDT.575 Amendment SA 575 agreed to in Senate by Yea-Nay Vote. 62 - 36. Record Vote Number: 72.", "chamber": "", "chamber_id": 0, "importance": 0}, {"date": "2009-02-26", "action": "The committee substitute as amended agreed to by Unanimous Consent. (consideration: CR S2538)", "chamber": "", "chamber_id": 0, "importance": 0}, {"date": "2009-02-26", "action": "Cloture motion on the measure withdrawn by unanimous consent in Senate. (consideration: CR S2525)", "chamber": "", "chamber_id": 0, "importance": 0}, {"date": "2009-02-26", "action": "Passed Senate with an amendment by Yea-Nay Vote. 61 - 37. Record Vote Number: 73. (text: CR S2538-2541)", "chamber": "", "chamber_id": 0, "importance": 0}, {"date": "2009-02-27", "action": "Message on Senate action sent to the House.", "chamber": "", "chamber_id": 0, "importance": 0}, {"date": "2009-02-27", "action": "Message on Senate action sent to the House.", "chamber": "", "chamber_id": 0, "importance": 0}, {"date": "2009-03-02", "action": "Received in the House.", "chamber": "", "chamber_id": 0, "importance": 1}, {"date": "2009-03-02", "action": "Held at the desk.", "chamber": "", "chamber_id": 0, "importance": 0}], "sponsors": [{"people_id": 9404, "person_hash": "6wpy5if6", "party_id": "1", "state_id": 52, "party": "D", "role_id": 2, "role": "Sen", "name": "Hillary Clinton", "first_name": "Hillary", "middle_name": "Rodham", "last_name": "Clinton", "suffix": "", "nickname": "", "district": "SD-NY", "ftm_eid": 16563536, "votesmart_id": 55463, "opensecrets_id": "N00000019", "knowwho_pid": 205532, "ballotpedia": "Hillary_Clinton", "sponsor_type_id": 0, "sponsor_order": 0, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 9423, "person_hash": "mswz9g79", "party_id": "1", "state_id": 52, "party": "D", "role_id": 2, "role": "Sen", "name": "Dianne Feinstein", "first_name": "Dianne", "middle_name": "", "last_name": "Feinstein", "suffix": "", "nickname": "", "district": "SD-CA", "ftm_eid": 26294, "votesmart_id": 53273, "opensecrets_id": "N00007364", "knowwho_pid": 165201, "ballotpedia": "Dianne_Feinstein", "sponsor_type_id": 0, "sponsor_order": 0, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 9424, "person_hash": "6qelz58n", "party_id": "1", "state_id": 52, "party": "D", "role_id": 2, "role": "Sen", "name": "Patrick Leahy", "first_name": "Patrick", "middle_name": "J.", "last_name": "Leahy", "suffix": "", "nickname": "", "district": "SD-VT", "ftm_eid": 19890007, "votesmart_id": 53353, "opensecrets_id": "N00009918", "knowwho_pid": 165283, "ballotpedia": "Patrick_Leahy_(Vermont)", "sponsor_type_id": 0, "sponsor_order": 0, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 9425, "person_hash": "dayilu15", "party_id": "1", "state_id": 52, "party": "D", "role_id": 2, "role": "Sen", "name": "Thomas Carper", "first_name": "Thomas", "middle_name": "R.", "last_name": "Carper", "suffix": "", "nickname": "", "district": "SD-DE", "ftm_eid": 8428238, "votesmart_id": 22421, "opensecrets_id": "N00012508", "knowwho_pid": 205484, "ballotpedia": "Tom_Carper", "sponsor_type_id": 0, "sponsor_order": 0, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 9434, "person_hash": "tz8vuv7x", "party_id": "3", "state_id": 52, "party": "I", "role_id": 2, "role": "Sen", "name": "Bernard Sanders", "first_name": "Bernard", "middle_name": "", "last_name": "Sanders", "suffix": "", "nickname": "", "district": "SD-VT", "ftm_eid": 9960190, "votesmart_id": 27110, "opensecrets_id": "N00000528", "knowwho_pid": 159116, "ballotpedia": "Bernie_Sanders", "sponsor_type_id": 0, "sponsor_order": 0, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 9449, "person_hash": "3caiq25x", "party_id": "1", "state_id": 52, "party": "D", "role_id": 2, "role": "Sen", "name": "Arlen Specter", "first_name": "Arlen", "middle_name": "", "last_name": "Specter", "suffix": "", "nickname": "", "district": "SD-PA", "ftm_eid": 0, "votesmart_id": 53340, "opensecrets_id": "N00001604", "knowwho_pid": 165267, "ballotpedia": "", "sponsor_type_id": 0, "sponsor_order": 0, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 9453, "person_hash": "j02i0ny9", "party_id": "1", "state_id": 52, "party": "D", "role_id": 2, "role": "Sen", "name": "Russell Feingold", "first_name": "Russell", "middle_name": "D.", "last_name": "Feingold", "suffix": "", "nickname": "", "district": "SD-WI", "ftm_eid": 0, "votesmart_id": 53361, "opensecrets_id": "N00000036", "knowwho_pid": 165288, "ballotpedia": "Russ_Feingold", "sponsor_type_id": 0, "sponsor_order": 0, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 9457, "person_hash": "c26gy5cr", "party_id": "2", "state_id": 52, "party": "R", "role_id": 2, "role": "Sen", "name": "George Voinovich", "first_name": "George", "middle_name": "V.", "last_name": "Voinovich", "suffix": "", "nickname": "", "district": "SD-OH", "ftm_eid": 0, "votesmart_id": 21745, "opensecrets_id": "N00003583", "knowwho_pid": 165262, "ballotpedia": "George_V._Voinovich", "sponsor_type_id": 0, "sponsor_order": 0, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 9461, "person_hash": "66g3oa32", "party_id": "1", "state_id": 52, "party": "D", "role_id": 2, "role": "Sen", "name": "Mary Landrieu", "first_name": "Mary", "middle_name": "L.", "last_name": "Landrieu", "suffix": "", "nickname": "", "district": "SD-LA", "ftm_eid": 0, "votesmart_id": 661, "opensecrets_id": "N00005395", "knowwho_pid": 165228, "ballotpedia": "Mary_Landrieu", "sponsor_type_id": 0, "sponsor_order": 0, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 9418, "person_hash": "gq720wp9", "party_id": "1", "state_id": 52, "party": "D", "role_id": 2, "role": "Sen", "name": "Christopher Dodd", "first_name": "Christopher", "middle_name": "J.", "last_name": "Dodd", "suffix": "", "nickname": "", "district": "SD-CT", "ftm_eid": 0, "votesmart_id": 53277, "opensecrets_id": "N00000581", "knowwho_pid": 165205, "ballotpedia": "Chris_Dodd", "sponsor_type_id": 0, "sponsor_order": 0, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 9416, "person_hash": "72kz5utx", "party_id": "1", "state_id": 52, "party": "D", "role_id": 2, "role": "Sen", "name": "Barbara Mikulski", "first_name": "Barbara", "middle_name": "A.", "last_name": "Mikulski", "suffix": "", "nickname": "", "district": "SD-MD", "ftm_eid": 19889207, "votesmart_id": 53304, "opensecrets_id": "N00001945", "knowwho_pid": 165232, "ballotpedia": "Barbara_Mikulski", "sponsor_type_id": 0, "sponsor_order": 0, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 9405, "person_hash": "i4x14koe", "party_id": "1", "state_id": 52, "party": "D", "role_id": 2, "role": "Sen", "name": "Richard Durbin", "first_name": "Richard", "middle_name": "", "last_name": "Durbin", "suffix": "", "nickname": "", "district": "SD-IL", "ftm_eid": 3414130, "votesmart_id": 26847, "opensecrets_id": "N00004981", "knowwho_pid": 165219, "ballotpedia": "Dick_Durbin", "sponsor_type_id": 0, "sponsor_order": 0, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 9406, "person_hash": "3onoeul6", "party_id": "1", "state_id": 52, "party": "D", "role_id": 2, "role": "Sen", "name": "Edward Kennedy", "first_name": "Edward", "middle_name": "M.", "last_name": "Kennedy", "suffix": "", "nickname": "", "district": "SD-MA", "ftm_eid": 0, "votesmart_id": 53305, "opensecrets_id": "N00000308", "knowwho_pid": 165229, "ballotpedia": "Edward_Kennedy", "sponsor_type_id": 0, "sponsor_order": 0, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 9407, "person_hash": "09ahs9g6", "party_id": "1", "state_id": 52, "party": "D", "role_id": 2, "role": "Sen", "name": "John Kerry", "first_name": "John", "middle_name": "F.", "last_name": "Kerry", "suffix": "", "nickname": "", "district": "SD-MA", "ftm_eid": 3557076, "votesmart_id": 53306, "opensecrets_id": "N00000245", "knowwho_pid": 165230, "ballotpedia": "John_Kerry", "sponsor_type_id": 0, "sponsor_order": 0, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 9409, "person_hash": "x95u59b3", "party_id": "1", "state_id": 52, "party": "D", "role_id": 2, "role": "Sen", "name": "Frank Lautenberg", "first_name": "Frank", "middle_name": "R.", "last_name": "Lautenberg", "suffix": "", "nickname": "", "district": "SD-NJ", "ftm_eid": 0, "votesmart_id": 53324, "opensecrets_id": "N00000659", "knowwho_pid": 165253, "ballotpedia": "Frank_Lautenberg", "sponsor_type_id": 0, "sponsor_order": 0, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 9410, "person_hash": "w4jr8019", "party_id": "1", "state_id": 52, "party": "D", "role_id": 2, "role": "Sen", "name": "Carl Levin", "first_name": "Carl", "middle_name": "", "last_name": "Levin", "suffix": "", "nickname": "", "district": "SD-MI", "ftm_eid": 0, "votesmart_id": 53307, "opensecrets_id": "N00001691", "knowwho_pid": 165235, "ballotpedia": "Carl_Levin", "sponsor_type_id": 0, "sponsor_order": 0, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 9411, "person_hash": "47wleugh", "party_id": "3", "state_id": 52, "party": "I", "role_id": 2, "role": "Sen", "name": "Joseph Lieberman", "first_name": "Joseph", "middle_name": "I.", "last_name": "Lieberman", "suffix": "", "nickname": "", "district": "SD-CT", "ftm_eid": 0, "votesmart_id": 53278, "opensecrets_id": "N00000616", "knowwho_pid": 165206, "ballotpedia": "Joe_Lieberman_(Connecticut)", "sponsor_type_id": 0, "sponsor_order": 0, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 9412, "person_hash": "hjkdvux6", "party_id": "1", "state_id": 52, "party": "D", "role_id": 2, "role": "Sen", "name": "Claire McCaskill", "first_name": "Claire", "middle_name": "", "last_name": "McCaskill", "suffix": "", "nickname": "", "district": "SD-MO", "ftm_eid": 4742989, "votesmart_id": 2109, "opensecrets_id": "N00027694", "knowwho_pid": 240412, "ballotpedia": "Claire_McCaskill", "sponsor_type_id": 0, "sponsor_order": 0, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 9414, "person_hash": "5pzkxb3w", "party_id": "1", "state_id": 52, "party": "D", "role_id": 2, "role": "Sen", "name": "Charles Schumer", "first_name": "Charles", "middle_name": "E.", "last_name": "Schumer", "suffix": "", "nickname": "Chuck", "district": "SD-NY", "ftm_eid": 19890086, "votesmart_id": 26976, "opensecrets_id": "N00001093", "knowwho_pid": 165260, "ballotpedia": "Chuck_Schumer", "sponsor_type_id": 0, "sponsor_order": 0, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 9489, "person_hash": "y03u5uak", "party_id": "2", "state_id": 52, "party": "R", "role_id": 2, "role": "Sen", "name": "Orrin Hatch", "first_name": "Orrin", "middle_name": "G.", "last_name": "Hatch", "suffix": "", "nickname": "", "district": "SD-UT", "ftm_eid": 1673075, "votesmart_id": 53352, "opensecrets_id": "N00009869", "knowwho_pid": 165279, "ballotpedia": "Orrin_Hatch", "sponsor_type_id": 0, "sponsor_order": 0, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}], "sasts": [{"type_id": 8, "type": "Related", "sast_bill_number": "HB157", "sast_bill_id": 194703}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB665", "sast_bill_id": 195211}, {"type_id": 8, "type": "Related", "sast_bill_number": "SJR11", "sast_bill_id": 204022}], "subjects": [{"subject_id": 13525, "subject_name": "Congress"}, {"subject_id": 13432, "subject_name": "Congressional elections"}, {"subject_id": 13364, "subject_name": "Constitution and constitutional amendments"}, {"subject_id": 13494, "subject_name": "Elections, voting, political campaign regulation"}, {"subject_id": 13590, "subject_name": "House of Representatives"}, {"subject_id": 13418, "subject_name": "Judicial review and appeals"}, {"subject_id": 13588, "subject_name": "Members of Congress"}, {"subject_id": 13388, "subject_name": "Presidents and presidential powers"}, {"subject_id": 13575, "subject_name": "Utah"}, {"subject_id": 13167, "subject_name": "District of Columbia"}], "texts": [{"doc_id": 477617, "date": "2010-11-27", "type": "Introduced", "type_id": 1, "mime": "application/pdf", "mime_id": 2, "url": "https://legiscan.com/US/text/SB160/id/477617", "state_link": "https://www.congress.gov/111/bills/s160/BILLS-111s160is.pdf", "text_size": 142837, "text_hash": "276c538972997be6407c590ea3c0d877"}, {"doc_id": 477619, "date": "2010-11-27", "type": "Introduced", "type_id": 1, "mime": "application/pdf", "mime_id": 2, "url": "https://legiscan.com/US/text/SB160/id/477619", "state_link": "https://www.congress.gov/111/bills/s160/BILLS-111s160rs.pdf", "text_size": 210547, "text_hash": "1713cad5b43b8fdb113eed09d0c7b8d0"}, {"doc_id": 477621, "date": "2010-11-27", "type": "Engrossed", "type_id": 4, "mime": "application/pdf", "mime_id": 2, "url": "https://legiscan.com/US/text/SB160/id/477621", "state_link": "https://www.congress.gov/111/bills/s160/BILLS-111s160es.pdf", "text_size": 159831, "text_hash": "78516f155b7ddaf96f24ba2a4f0726a6"}], "votes": [], "amendments": [], "supplements": [], "calendar": []}}