{"status": "OK", "bill": {"bill_id": 517160, "change_hash": "6bf7f8a2071196ee94ba3aa79d43c662", "session_id": 1026, "session": {"session_id": 1026, "state_id": 52, "year_start": 2013, "year_end": 2014, "prefile": 0, "sine_die": 1, "prior": 1, "special": 0, "session_tag": "Regular Session", "session_title": "2013-2014 Regular Session", "session_name": "113th Congress"}, "url": "https://legiscan.com/US/bill/SB374/2013", "state_link": "https://www.congress.gov/bill/113th-congress/senate-bill/374/all-info", "completed": 0, "status": 1, "status_date": "2013-02-25", "progress": [{"date": "2013-02-25", "event": 1}, {"date": "2013-02-25", "event": 9}, {"date": "2013-03-12", "event": 10}], "state": "US", "state_id": 52, "bill_number": "SB374", "bill_type": "B", "bill_type_id": "1", "body": "S", "body_id": 115, "current_body": "S", "current_body_id": 115, "title": "Fix Gun Checks Act of 2013", "description": "Fix Gun Checks Act of 2013 - Title I: Ensuring That All Individuals Who Should Be Prohibited From Buying A Gun Are Listed In The National Instant Criminal Background Check System - (Sec. 101) Amends the NICS Improvement Amendments Act of 2007 (NICS Act) to eliminate from the records concerning persons who are prohibited from possessing or receiving a firearm about which a state must submit estimates to the Attorney General for purposes of the National Instant Criminal Background Check System: (1) a record that identifies a person for whom an indictment has been returned for a crime punishable by imprisonment for a term exceeding one year or who is a fugitive from justice and for which a record of final disposition is not available; and (2) a record that identifies a person who is an unlawful user of, or addicted to, a controlled substance. Directs the Attorney General to establish the applicable time period for the occurrence of events (currently, within the prior 20 years) in pertinent records.  Replaces provisions requiring that a specified percentage of grants to states and Indian tribal governments for establishing, planning, or improving identification technologies for firearms eligibility determinations be used to maintain a relief from disabilities program with provisions authorizing states to use such grants for such a program. Authorizes appropriations for FY2014-FY2018 for such grants and eliminates allocation restrictions based on the percentage of records states provide. (Sec. 102) Revises the periods during which the Attorney General may withhold Edward Byrne Memorial Justice Assistance Grant funds from states that do not provide specified percentages of required records. Eliminates the Attorney General's authority to waive such withholding if a state provides evidence it is making a reasonable effort to comply.  Requires the Attorney General to publish and made available on a publicly accessible website an annual report that ranks states by the ratio of number of records submitted by each state under the NICS Act to the estimated total number of available records of the state. (Sec. 103) Amends the Brady Handgun Violence Prevention Act (Brady Act) to include federal courts as federal agencies from which the Attorney General is authorized to secure information on persons prohibited from receiving a firearm. Title II: Requiring a Background Check for Every Firearm Sale - (Sec. 202) Amends the Brady Act to prohibit any person who does not hold a federal firearms license from transferring a firearm to any other unlicensed person unless a licensed importer, manufacturer, or dealer: (1) has first taken possession of the firearm for the purpose of complying with national instant criminal background check requirements; and (2) upon taking possession, complies with all firearms requirements as if transferring the firearm from the licensee's inventory to the unlicensed transferee. Specifies exceptions, including for: (1) bona fide gifts between immediate family members; (2) a transfer from a decedent's estate; (3) a transfer of possession between unlicensed persons in the transferor's home for less than seven days; and (4) certain temporary transfers without the transfer of title in connection with lawful hunting or sporting purposes at a shooting range, at a shooting competition, or while hunting, fishing, or trapping during hunting season. Authorizes the Attorney General to implement this section with regulations that shall include provisions: (1) setting a maximum fee that may be charged by licensees for services provided, and (2) requiring a transaction record of any transfer that occurs between an unlicensed transferor and unlicensed transferee. (Sec. 203) Makes it unlawful for any person who lawfully possesses or owns a firearm that has been shipped transported, or possessed in interstate or foreign commerce to fail to report the theft or loss of the firearm to the Attorney General and the appropriate local authorities within 24 hours of discovering it.", "pending_committee_id": 0, "committee": [], "referrals": [{"date": "2013-02-25", "committee_id": 2330, "chamber": "S", "chamber_id": 115, "name": "Judiciary"}], "history": [{"date": "2013-02-25", "action": "Read twice and referred to the Committee on the Judiciary.", "chamber": "S", "chamber_id": 115, "importance": 1}, {"date": "2013-03-12", "action": "Committee on the Judiciary. Ordered to be reported with an amendment in the nature of a substitute favorably.", "chamber": "S", "chamber_id": 115, "importance": 1}, {"date": "2013-03-12", "action": "Committee on the Judiciary. Reported by Senator Leahy with an amendment in the nature of a substitute. Without written report.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2013-03-12", "action": "Placed on Senate Legislative Calendar under General Orders. Calendar No. 25.", "chamber": "S", "chamber_id": 115, "importance": 0}], "sponsors": [{"people_id": 9414, "person_hash": "5pzkxb3w", "party_id": "1", "state_id": 52, "party": "D", "role_id": 2, "role": "Sen", "name": "Charles Schumer", "first_name": "Charles", "middle_name": "E.", "last_name": "Schumer", "suffix": "", "nickname": "Chuck", "district": "SD-NY", "ftm_eid": 19890086, "votesmart_id": 26976, "opensecrets_id": "N00001093", "knowwho_pid": 165260, "ballotpedia": "Chuck_Schumer", "sponsor_type_id": 1, "sponsor_order": 1, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}], "sasts": [{"type_id": 8, "type": "Related", "sast_bill_number": "SB649", "sast_bill_id": 537616}], "subjects": [{"subject_id": 13364, "subject_name": "Constitution and constitutional amendments"}, {"subject_id": 13374, "subject_name": "Criminal justice information and records"}, {"subject_id": 13341, "subject_name": "Firearms and explosives"}, {"subject_id": 13210, "subject_name": "Health information and medical records"}, {"subject_id": 13231, "subject_name": "Intergovernmental relations"}, {"subject_id": 13314, "subject_name": "Mental health"}, {"subject_id": 13285, "subject_name": "State and local government operations"}, {"subject_id": 13340, "subject_name": "Crime and law enforcement"}], "texts": [{"doc_id": 770483, "date": "2013-03-01", "type": "Introduced", "type_id": 1, "mime": "application/pdf", "mime_id": 2, "url": "https://legiscan.com/US/text/SB374/id/770483", "state_link": "https://www.congress.gov/113/bills/s374/BILLS-113s374is.pdf", "text_size": 249227, "text_hash": "380c4df686e2f382929724194496df95"}, {"doc_id": 788963, "date": "2013-03-13", "type": "Introduced", "type_id": 1, "mime": "application/pdf", "mime_id": 2, "url": "https://legiscan.com/US/text/SB374/id/788963", "state_link": "https://www.congress.gov/113/bills/s374/BILLS-113s374rs.pdf", "text_size": 275779, "text_hash": "9f151a5f7fe2a37a83d444c90b0b3a77"}], "votes": [], "amendments": [], "supplements": [], "calendar": []}}