{"status": "OK", "bill": {"bill_id": 537616, "change_hash": "3ae89bee3141ab0af5a521ec43c502e6", "session_id": 1026, "session": {"session_id": 1026, "state_id": 52, "year_start": 2013, "year_end": 2014, "prefile": 0, "sine_die": 1, "prior": 1, "special": 0, "session_tag": "Regular Session", "session_title": "2013-2014 Regular Session", "session_name": "113th Congress"}, "url": "https://legiscan.com/US/bill/SB649/2013", "state_link": "https://www.congress.gov/bill/113th-congress/senate-bill/649/all-info", "completed": 0, "status": 1, "status_date": "2013-03-21", "progress": [{"date": "2013-03-21", "event": 1}], "state": "US", "state_id": 52, "bill_number": "SB649", "bill_type": "B", "bill_type_id": "1", "body": "S", "body_id": 115, "current_body": "S", "current_body_id": 115, "title": "Safe Communities, Safe Schools Act of 2013", "description": "Safe Communities, Safe Schools Act of 2013 - Amends the NICS Improvement Amendments Act of 2007 (NICS Act), the Brady Handgun Violence Prevention Act (Brady Act), the Omnibus Crime Control and Safe Streets Act of 1968, and the federal criminal code to require background checks for all firearm sales, prohibit straw purchases of firearms, and expand the school safety grant program.  Fix Gun Checks Act of 2013 - Amends the NICS Act to eliminate from the records concerning persons who are prohibited from possessing or receiving a firearm, about which a state must submit estimates to the Attorney General for purposes of the National Instant Criminal Background Check System: (1) a record that identifies a person for whom an indictment has been returned for a crime punishable by imprisonment for a term exceeding one year or who is a fugitive from justice and for which a record of final disposition is not available; and (2) a record that identifies a person who is an unlawful user of, or addicted to, a controlled substance. Directs the Attorney General to establish the applicable time period for the occurrence of events which would disqualify a person from possessing a firearm (currently, within the prior 20 years) in pertinent records. Replaces provisions requiring that a specified percentage of grants to states and Indian tribal governments for establishing, planning, or improving identification technologies for firearms eligibility determinations be used to maintain a relief from disabilities program with provisions authorizing states to use such grants for such a program. Authorizes appropriations for FY2014-FY2018 for such grants and eliminates allocation restrictions based on the percentage of records states provide. Revises the periods during which the Attorney General may withhold Edward Byrne Memorial Justice Assistance Grant funds from states that do not provide specified percentages of required records. Eliminates the Attorney General's authority to waive such withholding if a state provides evidence it is making a reasonable effort to comply.  Requires the Attorney General to publish and make available on a publicly accessible website an annual report that ranks states by the ratio of the number of records submitted by each state under the NICS Act to the estimated total number of available records of the state. Amends the Brady Act to include federal courts as federal agencies from which the Attorney General is authorized to secure information on persons prohibited from receiving a firearm. Amends the Brady Act to prohibit any person who does not hold a federal firearms license from transferring a firearm to any other unlicensed person unless a licensed importer, manufacturer, or dealer: (1) has first taken possession of the firearm for the purpose of complying with national instant criminal background check requirements; and (2) upon taking possession, complies with all firearms requirements as if transferring the firearm from the licensee's inventory to the unlicensed transferee. Specifies exceptions, including for: (1) bona fide gifts between immediate family members; (2) a transfer from a decedent's estate; (3) a transfer of possession between unlicensed persons in the transferor's home for less than seven days; and (4) certain temporary transfers without the transfer of title in connection with lawful hunting or sporting purposes at a shooting range, at a shooting competition, or while hunting, fishing, or trapping during hunting season. Authorizes the Attorney General to implement this section with regulations that shall include provisions: (1) setting a maximum fee that may be charged by licensees for services provided, and (2) requiring a transaction record of any transfer that occurs between an unlicensed transferor and unlicensed transferee. Makes it unlawful for any person who lawfully possesses or owns a firearm that has been shipped, transported, or possessed in interstate or foreign commerce to fail to report the theft or loss of the firearm to the Attorney General and the appropriate local authorities within 24 hours of discovery.  Stop Illegal Trafficking in Firearms Act of 2013 - Amends the federal criminal code to prohibit any person, other than a licensed firearms importer, manufacturer, collector, or dealer (licensed dealer), from knowingly purchasing in interstate or foreign commerce (including through receipt on consignment or by way of pledge or pawn as security for payment) a firearm from a licensed dealer, or from any person who is not a licensed dealer, for another individual, knowing or having reasonable cause to believe that such individual meets specified criteria disqualifying such individual from possessing a firearm. Sets forth an enhanced penalty for such a violation committed knowing or with reasonable cause to believe that any firearm involved will be used to commit a crime of violence. Specifies exceptions for purchases for certain bona fide gifts or for a bona fide winner of an organized raffle, contest, or auction. Prohibits: (1) transferring two or more firearms to, or receiving two or more firearms from, a person in interstate or foreign commerce knowing or with the reasonable belief that such transfer, possession, or receipt would violate a federal law punishable by a term of imprisonment exceeding one year; or (2) attempting or conspiring to commit such conduct. Authorizes an enhanced penalty for someone who organizes or supervises such conduct. Subjects: (1) property derived from or used to commit such an offense to forfeiture, and (2) a person who derives profits from such an offense to a fine equal to twice such profits. Includes firearm trafficking offenses: (1) among offenses for which wiretapping may be authorized, (2) within the definition of \"racketeering activity,\" and (3) within the definition of \"specified unlawful activity\" for purposes of money laundering violations. Directs the U.S. Sentencing Commission to review and amend its guidelines and policy statements to: (1) ensure that persons convicted of offenses involving straw purchases of firearms and firearms trafficking are subject to increased penalties; and (2) reflect congressional intent that a person convicted of such offense who is affiliated with a gang, cartel, or organized crime ring should be subject to higher penalties. Amends the Brady Handgun Violence Prevention Act to prohibit the sale or other disposition of a firearm or ammunition knowing or having reasonable cause to believe that the purchaser intends to: (1) sell or otherwise dispose of it to a person in a category of individuals excluded from firearms possession, (2) sell or otherwise dispose of it in furtherance of a crime of violence or drug trafficking offense, or (3) export it in violation of law.  Increases the maximum terms of imprisonment for violating prohibitions against:  selling firearms or ammunition to any person knowing or having reasonable cause to believe that such person is disqualified from possessing such firearms or ammunition; any such disqualified person transporting or possessing any firearm or ammunition in interstate or foreign commerce or receiving any firearm or ammunition that has been has been transported in interstate or foreign commerce; receiving or transferring a firearm or ammunition knowing or having reasonable cause to believe that it will be used to commit a crime of violence, a drug trafficking crime, or other specified crimes under the Arms Export Control Act, the International Emergency Economic Powers Act, the Foreign Narcotics Kingpin Designation Act, or the Immigration and Nationality Act; or smuggling into or out of the United States a firearm or ammunition with intent to engage in or promote conduct that is punishable under the Controlled Substances Act, the Controlled Substances Import and Export Act, or maritime drug law enforcement provisions or that constitutes a crime of violence.  Prohibits the Department of Justice (DOJ) and any of its law enforcement coordinate agencies from conducting any operation where a federal firearms licensee is directed or encouraged to sell firearms to an individual if DOJ or a coordinate agency knows or has reasonable cause to believe that such individual is purchasing such firearms on behalf of another for an illegal purpose, unless the Attorney General, the Deputy Attorney General, or the Assistant Attorney General for the Criminal Division approves the operation in writing and determines that the agency has prepared an operational plan to prevent firearms from being transferred to third parties without law enforcement taking reasonable steps to lawfully interdict those firearms. School and Campus Safety Enhancements Act of 2013 - Amends the Omnibus Crime Control and Safe Streets Act of 1968 to authorize school security grants by the DOJ Office of Community Oriented Policing Services to be used for the installation of surveillance equipment and the establishment of hotlines or tiplines for the reporting of potentially dangerous students and situations.  Requires a grant application to be accompanied by a report that is signed by the heads of each law enforcement agency and school district with jurisdiction over the schools where the safety improvements will be implemented and that demonstrates that each proposed use of the grant funds will be: (1) an effective means for improving school safety, (2) consistent with a comprehensive approach to preventing school violence, and (3) individualized to the needs of each school. Requires the Director of the Office of Community Oriented Policing Services and the Secretary of Education to establish an interagency task force to develop and promulgate a set of advisory school safety guidelines. Authorizes appropriations for such grant program for FY2014-FY2023. Center to Advance, Monitor, and Preserve University Security Safety Act of 2013 or CAMPUS Safety Act of 2013 - Amends the Omnibus Crime Control and Safe Streets Act of 1968 to authorize the Attorney General to: (1) establish and operate a National Center for Campus Public Safety; and (2) make subawards to institutions of higher education and other nonprofit organizations to assist the Center in carrying out its assigned functions, including providing education and training for public safety personnel of institutions of higher education, identifying and disseminating information, policies, and best practices relevant to campus public safety, and promoting cooperation among public safety and emergency management personnel of institutions of higher education and their collaborative partners.", "pending_committee_id": 0, "committee": [], "referrals": [], "history": [{"date": "2013-03-21", "action": "Introduced in the Senate. Read the first time. Placed on Senate Legislative Calendar under Read the First Time. (text of measure as introduced: CR S2158-2162)", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2013-03-22", "action": "Read the second time. Placed on Senate Legislative Calendar under General Orders. Calendar No. 32.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2013-04-08", "action": "Motion to proceed to consideration of measure made in Senate. (consideration: CR S2440-2449)", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2013-04-09", "action": "Motion to proceed to consideration of measure made in Senate. (consideration: CR S2475-2478, S2482-2492)", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2013-04-09", "action": "Cloture motion on the motion to proceed to the bill presented in Senate. (consideration: CR S2492; text: CR S2492)", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2013-04-10", "action": "Motion to proceed to measure considered in Senate. (consideration: CR S2512-2542, S2547-2551)", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2013-04-11", "action": "Motion to proceed to measure considered in Senate. (consideration: CR S2572-2581, S2581-2583, S2584)", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2013-04-11", "action": "Cloture on the motion to proceed to the bill invoked in Senate by Yea-Nay Vote. 68 - 31. Record Vote Number: 95. (consideration: CR S2580; text: CR S2580)", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2013-04-11", "action": "Motion to proceed to consideration of measure agreed to in Senate by Voice Vote. (consideration: CR S2584)", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2013-04-11", "action": "Measure laid before Senate by motion. (consideration: CR S2584)", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2013-04-11", "action": "S.AMDT.715 Amendment SA 715 proposed by Senator Manchin. (consideration: CR S2584)To protect Second Amendment rights, ensure that all individuals who should be prohibited from buying a firearm are listed in the National Instant Criminal Background Check System, and provide a responsible and consistent background check process.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2013-04-16", "action": "Considered by Senate. (consideration: CR S2663-2665, S2666-2670, S2676-2679)", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2013-04-16", "action": "S.AMDT.715 Considered by Senate. (consideration: CR S2663)", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2013-04-17", "action": "Considered by Senate. (consideration: CR S2699-2729, S2729-2744)", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2013-04-17", "action": "S.AMDT.715 Considered by Senate. (consideration: CR S2699, S2709, S2729-2730, S2739-2740)", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2013-04-17", "action": "S.AMDT.711 Amendment SA 711 proposed by Senator Feinstein. (consideration: CR S2699-2706, S2741-2742)To regulate assault weapons, to ensure that the right to keep and bear arms is not unlimited, and for other purposes.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2013-04-17", "action": "S.AMDT.719 Amendment SA 719 proposed by Senator Cornyn. (consideration: CR S2706-2709, S2710, S2741; text: CR S2707)To allow reciprocity for the carrying of certain concealed firearms.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2013-04-17", "action": "S.AMDT.717 Amendment SA 717 proposed by Senator Barrasso. (consideration: CR S2709-2719; text: CR S2709-2710)To withhold 5 percent of Community Oriented Policing Services program Federal funding from States and local governments that release sensitive and confidential information on law-abiding gun owners and victims of domestic violence.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2013-04-17", "action": "S.AMDT.720 Amendment SA 720 proposed by Senator Burr. (consideration: CR S2719-2721, S2742; text: CR S2719)To protect the Second Amendment rights of veterans and their families.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2013-04-17", "action": "S.AMDT.725 Amendment SA 725 proposed by Senator Grassley. (consideration: CR S2721-2724, S2733-2738, S2740)To address gun violence, improve the availability of records to the National Instant Criminal Background Check System, address mental illness in the criminal justice system, and end straw purchases and trafficking of illegal firearms, and for other purposes.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2013-04-17", "action": "S.AMDT.730 Amendment SA 730 proposed by Senator Harkin. (consideration: CR S2730-2732)To reauthorize and improve programs related to mental health and substance use disorders.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2013-04-17", "action": "S.AMDT.713 Amendment SA 713 proposed by Senator Leahy. (consideration: CR S2732-2733, S2740-2741)To increase public safety by punishing and deterring firearms trafficking.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2013-04-17", "action": "S.AMDT.715 Amendment SA 715, under the order of 4/16/13, not having achieved 60 votes in the affirmative, was not agreed to in Senate by Yea-Nay Vote. 54 - 46. Record Vote Number: 97.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2013-04-17", "action": "S.AMDT.715 Motion by Senator Reid to reconsider the vote by which amendment SA 715 (Record Vote No. 97) was not agreed to entered in Senate.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2013-04-17", "action": "S.AMDT.725 Amendment SA 725, under the order of 4/16/13, not having achieved 60 votes in the affirmative, was not agreed to in Senate by Yea-Nay Vote. 52 - 48. Record Vote Number: 98.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2013-04-17", "action": "S.AMDT.713 Amendment SA 713, under the order of 4/16/13, not having achieved 60 votes in the affirmative, was not agreed to in Senate by Yea-Nay Vote. 58 - 42. Record Vote Number: 99.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2013-04-17", "action": "S.AMDT.719 Amendment SA 719, under the order of 4/16/13, not having achieved 60 votes in the affirmative, was not agreed to in Senate by Yea-Nay Vote. 57 - 43. Record Vote Number: 100.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2013-04-17", "action": "S.AMDT.711 Amendment SA 711, under the order of 4/16/13, not having achieved 60 votes in the affirmative, was not agreed to in Senate by Yea-Nay Vote. 40 - 60. Record Vote Number: 101.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2013-04-17", "action": "S.AMDT.720 Amendment SA 720, under the order of 4/16/13, not having achieved 60 votes in the affirmative, was not agreed to in Senate by Yea-Nay Vote. 56 - 44. Record Vote Number: 102.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2013-04-17", "action": "S.AMDT.714 Amendment SA 714 proposed by Senator Blumenthal for Senator Lautenberg. (consideration: CR S2738-2739, S2742-2744; text: CR S2743)To regulate large capacity ammunition feeding devices.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2013-04-17", "action": "S.AMDT.714 Amendment SA 714, under the order of 4/16/13, not having achieved 60 votes in the affirmative, was not agreed to in Senate by Yea-Nay Vote. 46 - 54. Record Vote Number: 103.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2013-04-18", "action": "Considered by Senate. (consideration: CR S2777-2782)", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2013-04-18", "action": "S.AMDT.717 Considered by Senate. (consideration: CR S2777, S2780-2781)", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2013-04-18", "action": "S.AMDT.730 Considered by Senate. (consideration: CR S2777, S2781)", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2013-04-18", "action": "S.AMDT.717 Amendment SA 717, under the order of 4/16/13, having achieved 60 votes in the affirmative, was agreed to in Senate by Yea-Nay Vote. 67 - 30. Record Vote Number: 104.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2013-04-18", "action": "S.AMDT.730 Amendment SA 730, under the order of 4/16/13, having achieved 60 votes in the affirmative, was agreed to in Senate by Yea-Nay Vote. 95 - 2. Record Vote Number: 105.", "chamber": "S", "chamber_id": 115, "importance": 0}], "sponsors": [{"people_id": 9398, "person_hash": "53dynib3", "party_id": "1", "state_id": 52, "party": "D", "role_id": 2, "role": "Sen", "name": "Harry Reid", "first_name": "Harry", "middle_name": "", "last_name": "Reid", "suffix": "", "nickname": "", "district": "SD-NV", "ftm_eid": 18930590, "votesmart_id": 53320, "opensecrets_id": "N00009922", "knowwho_pid": 165257, "ballotpedia": "Harry_Reid", "sponsor_type_id": 1, "sponsor_order": 1, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 15418, "person_hash": "0wvwru9t", "party_id": "1", "state_id": 52, "party": "D", "role_id": 2, "role": "Sen", "name": "Tim Kaine", "first_name": "Tim", "middle_name": "", "last_name": "Kaine", "suffix": "", "nickname": "", "district": "SD-VA", "ftm_eid": 5743146, "votesmart_id": 50772, "opensecrets_id": "N00033177", "knowwho_pid": 140385, "ballotpedia": "Tim_Kaine", "sponsor_type_id": 2, "sponsor_order": 2, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}], "sasts": [{"type_id": 8, "type": "Related", "sast_bill_number": "HB955", "sast_bill_id": 524725}, {"type_id": 8, "type": "Related", "sast_bill_number": "SB54", "sast_bill_id": 470324}, {"type_id": 8, "type": "Related", "sast_bill_number": "SB146", "sast_bill_id": 477324}, {"type_id": 8, "type": "Related", "sast_bill_number": "SB374", "sast_bill_id": 517160}, {"type_id": 8, "type": "Related", "sast_bill_number": "SB433", "sast_bill_id": 521005}, {"type_id": 8, "type": "Related", "sast_bill_number": "SB443", "sast_bill_id": 523362}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB359", "sast_bill_id": 470224}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB1470", "sast_bill_id": 544772}], "subjects": [{"subject_id": 13126, "subject_name": "Administrative law and regulatory procedures"}, {"subject_id": 13376, "subject_name": "Child safety and welfare"}, {"subject_id": 13305, "subject_name": "Citizenship and naturalization"}, {"subject_id": 13429, "subject_name": "Crime prevention"}, {"subject_id": 13373, "subject_name": "Criminal investigation, prosecution, interrogation"}, {"subject_id": 13374, "subject_name": "Criminal justice information and records"}, {"subject_id": 13344, "subject_name": "Criminal procedure and sentencing"}, {"subject_id": 13654, "subject_name": "Currency"}, {"subject_id": 13159, "subject_name": "Department of Justice"}, {"subject_id": 13345, "subject_name": "Drug trafficking and controlled substances"}, {"subject_id": 13171, "subject_name": "Education programs funding"}, {"subject_id": 13172, "subject_name": "Educational facilities and institutions"}, {"subject_id": 13174, "subject_name": "Elementary and secondary education"}, {"subject_id": 13472, "subject_name": "Emergency planning and evacuation"}, {"subject_id": 13184, "subject_name": "Executive agency funding and structure"}, {"subject_id": 13341, "subject_name": "Firearms and explosives"}, {"subject_id": 20790, "subject_name": "First responders and emergency personnel"}, {"subject_id": 13210, "subject_name": "Health information and medical records"}, {"subject_id": 13215, "subject_name": "Higher education"}, {"subject_id": 13403, "subject_name": "Immigration status and procedures"}, {"subject_id": 13231, "subject_name": "Intergovernmental relations"}, {"subject_id": 13236, "subject_name": "Law enforcement administration and funding"}, {"subject_id": 13314, "subject_name": "Mental health"}, {"subject_id": 13741, "subject_name": "Organized crime"}, {"subject_id": 13317, "subject_name": "Smuggling and trafficking"}, {"subject_id": 13285, "subject_name": "State and local government operations"}, {"subject_id": 13662, "subject_name": "U.S. Sentencing Commission"}, {"subject_id": 13343, "subject_name": "Violent crime"}, {"subject_id": 13340, "subject_name": "Crime and law enforcement"}], "texts": [{"doc_id": 802288, "date": "2013-03-25", "type": "Introduced", "type_id": 1, "mime": "application/pdf", "mime_id": 2, "url": "https://legiscan.com/US/text/SB649/id/802288", "state_link": "https://www.congress.gov/113/bills/s649/BILLS-113s649pcs.pdf", "text_size": 295236, "text_hash": "4bf0a0756e19a542b80f5b1daa83e7ab"}], "votes": [{"roll_call_id": 263428, "date": "2013-04-11", "desc": "On Cloture on the Motion to Proceed S. 649", "yea": 68, "nay": 31, "nv": 1, "absent": 0, "total": 100, "passed": 1, "chamber": "S", "chamber_id": 115, "url": "https://legiscan.com/US/rollcall/SB649/id/263428", "state_link": "https://www.senate.gov/legislative/LIS/roll_call_votes/vote1131/vote_113_1_00095.xml"}, {"roll_call_id": 267226, "date": "2013-04-17", "desc": "On the Amendment S.Amdt. 715 to S. 649 (Safe Communities, Safe Schools Act of2013)", "yea": 54, "nay": 46, "nv": 0, "absent": 0, "total": 100, "passed": 0, "chamber": "S", "chamber_id": 115, "url": "https://legiscan.com/US/rollcall/SB649/id/267226", "state_link": "https://www.senate.gov/legislative/LIS/roll_call_votes/vote1131/vote_113_1_00097.xml"}, {"roll_call_id": 267227, "date": "2013-04-17", "desc": "On the Amendment S.Amdt. 715 to S. 649 (Safe Communities, Safe Schools Act of2013)", "yea": 54, "nay": 46, "nv": 0, "absent": 0, "total": 100, "passed": 0, "chamber": "S", "chamber_id": 115, "url": "https://legiscan.com/US/rollcall/SB649/id/267227", "state_link": "https://www.senate.gov/legislative/LIS/roll_call_votes/vote1131/vote_113_1_00097.xml"}, {"roll_call_id": 267228, "date": "2013-04-17", "desc": "On the Amendment S.Amdt. 725 to S. 649 (Safe Communities, Safe Schools Act of2013)", "yea": 52, "nay": 48, "nv": 0, "absent": 0, "total": 100, "passed": 0, "chamber": "S", "chamber_id": 115, "url": "https://legiscan.com/US/rollcall/SB649/id/267228", "state_link": "https://www.senate.gov/legislative/LIS/roll_call_votes/vote1131/vote_113_1_00098.xml"}, {"roll_call_id": 267229, "date": "2013-04-17", "desc": "On the Amendment S.Amdt. 713 to S. 649 (Safe Communities, Safe Schools Act of2013)", "yea": 58, "nay": 42, "nv": 0, "absent": 0, "total": 100, "passed": 0, "chamber": "S", "chamber_id": 115, "url": "https://legiscan.com/US/rollcall/SB649/id/267229", "state_link": "https://www.senate.gov/legislative/LIS/roll_call_votes/vote1131/vote_113_1_00099.xml"}, {"roll_call_id": 267230, "date": "2013-04-17", "desc": "On the Amendment S.Amdt. 719 to S. 649 (Safe Communities, Safe Schools Act of2013)", "yea": 57, "nay": 43, "nv": 0, "absent": 0, "total": 100, "passed": 0, "chamber": "S", "chamber_id": 115, "url": "https://legiscan.com/US/rollcall/SB649/id/267230", "state_link": "https://www.senate.gov/legislative/LIS/roll_call_votes/vote1131/vote_113_1_00100.xml"}, {"roll_call_id": 267231, "date": "2013-04-17", "desc": "On the Amendment S.Amdt. 711 to S. 649 (Safe Communities, Safe Schools Act of2013)", "yea": 40, "nay": 60, "nv": 0, "absent": 0, "total": 100, "passed": 0, "chamber": "S", "chamber_id": 115, "url": "https://legiscan.com/US/rollcall/SB649/id/267231", "state_link": "https://www.senate.gov/legislative/LIS/roll_call_votes/vote1131/vote_113_1_00101.xml"}, {"roll_call_id": 267232, "date": "2013-04-17", "desc": "On the Amendment S.Amdt. 720 to S. 649 (Safe Communities, Safe Schools Act of2013)", "yea": 56, "nay": 44, "nv": 0, "absent": 0, "total": 100, "passed": 0, "chamber": "S", "chamber_id": 115, "url": "https://legiscan.com/US/rollcall/SB649/id/267232", "state_link": "https://www.senate.gov/legislative/LIS/roll_call_votes/vote1131/vote_113_1_00102.xml"}, {"roll_call_id": 267233, "date": "2013-04-17", "desc": "On the Amendment S.Amdt. 714 to S. 649 (Safe Communities, Safe Schools Act of2013)", "yea": 46, "nay": 54, "nv": 0, "absent": 0, "total": 100, "passed": 0, "chamber": "S", "chamber_id": 115, "url": "https://legiscan.com/US/rollcall/SB649/id/267233", "state_link": "https://www.senate.gov/legislative/LIS/roll_call_votes/vote1131/vote_113_1_00103.xml"}, {"roll_call_id": 268514, "date": "2013-04-18", "desc": "On the Amendment S.Amdt. 717 to S. 649 (Safe Communities, Safe Schools Act of2013)", "yea": 67, "nay": 30, "nv": 3, "absent": 0, "total": 100, "passed": 1, "chamber": "S", "chamber_id": 115, "url": "https://legiscan.com/US/rollcall/SB649/id/268514", "state_link": "https://www.senate.gov/legislative/LIS/roll_call_votes/vote1131/vote_113_1_00104.xml"}, {"roll_call_id": 268515, "date": "2013-04-18", "desc": "On the Amendment S.Amdt. 730 to S. 649 (Safe Communities, Safe Schools Act of2013)", "yea": 95, "nay": 2, "nv": 3, "absent": 0, "total": 100, "passed": 1, "chamber": "S", "chamber_id": 115, "url": "https://legiscan.com/US/rollcall/SB649/id/268515", "state_link": "https://www.senate.gov/legislative/LIS/roll_call_votes/vote1131/vote_113_1_00105.xml"}], "amendments": [], "supplements": [], "calendar": []}}