{"status": "OK", "bill": {"bill_id": 678901, "change_hash": "868c5f893935b24e7d9d705e0750d7dd", "session_id": 1107, "session": {"session_id": 1107, "state_id": 46, "year_start": 2015, "year_end": 2015, "prefile": 0, "sine_die": 1, "prior": 1, "special": 0, "session_tag": "Regular Session", "session_title": "2015 Regular Session", "session_name": "2015 Regular Session"}, "url": "https://legiscan.com/VA/bill/SB1178/2015", "state_link": "https://lis.virginia.gov/cgi-bin/legp604.exe?151+sum+SB1178", "completed": 0, "status": 1, "status_date": "2015-01-13", "progress": [{"date": "2015-01-13", "event": 1}, {"date": "2015-01-13", "event": 9}], "state": "VA", "state_id": 46, "bill_number": "SB1178", "bill_type": "B", "bill_type_id": "1", "body": "S", "body_id": 8, "current_body": "S", "current_body_id": 8, "title": "Firearms; numerous changes to laws regarding.", "description": "Firearms; penalties. Makes numerous changes to laws regarding firearms. The bill provides that a person may be held civilly liable for injury to the person or property of another or for wrongful death resulting from the use of a firearm by a child under the age of 14 or in the commission of a crime if it can be shown by clear and convincing evidence that the firearm came into the possession of the child or person who committed the crime because of the failure of the civil defendant to adequately secure the firearm. The bill allows localities to enact an ordinance to prohibit the possession of pneumatic guns on school property, at school functions held on public property, and on school buses. The bill removes the provision that local ordinances on gun buy-back programs must require that the gun be offered for sale by public auction or sealed bids. The bill creates criminal penalties for adults who leave unsecured firearms where they are accessible by children or who negligently supervise children with firearms. The bill creates a Class 1 misdemeanor for a person who is under the influence of alcohol or illegal drugs to carry a loaded firearm on or about his person in a public place, and a person found guilty is ineligible to apply for a concealed handgun permit for a period of five years. The bill also creates a Class 2 misdemeanor for a person who carries a loaded firearm on or about his person onto the premises of any restaurant or club licensed to sell and serve alcoholic beverages for on-premises consumption and consumes an alcoholic beverage while on the premises. The bill also creates a Class 2 misdemeanor for a person who is not a licensed dealer to sell, rent, trade, or transfer a firearm to a person who is not a licensed dealer and for a person who is not a licensed dealer to buy, rent, trade, or transfer a firearm from a person who is not a licensed dealer; certain transfers are exempted, such as between immediate family members, when necessary to prevent imminent death or great bodily harm, and by operation of law. The bill removes the ability to take an electronic, video, or online course for demonstration of competence with a handgun by an applicant for a concealed handgun permit. The bill also requires a fingerprint-based criminal history record information check before issuance of a concealed handgun permit. The bill removes the prohibition on the clerk of a circuit court who issues a concealed handgun permit from publicly disclosing an applicant's name and any other information contained in a concealed handgun permit application or in any order issuing a concealed handgun permit. The bill limits the number of firearms that a person may purchase to one firearm in a 30-day period, subject to certain exceptions.", "pending_committee_id": 0, "committee": [], "referrals": [{"date": "2015-01-13", "committee_id": 162, "chamber": "S", "chamber_id": 8, "name": "Courts of Justice"}], "history": [{"date": "2015-01-13", "action": "Prefiled and ordered printed; offered 01/14/15 15100426D", "chamber": "S", "chamber_id": 8, "importance": 0}, {"date": "2015-01-13", "action": "Referred to Committee for Courts of Justice", "chamber": "S", "chamber_id": 8, "importance": 1}, {"date": "2015-01-26", "action": "Failed to report (defeated) in Courts of Justice (5-Y 10-N)", "chamber": "S", "chamber_id": 8, "importance": 0}], "sponsors": [{"people_id": 683, "person_hash": "gm46wrfb", "party_id": "1", "state_id": 46, "party": "D", "role_id": 2, "role": "Sen", "name": "Adam Ebbin", "first_name": "Adam", "middle_name": "P.", "last_name": "Ebbin", "suffix": "", "nickname": "", "district": "SD-030", "ftm_eid": 6410921, "votesmart_id": 50868, "opensecrets_id": "", "knowwho_pid": 221587, "ballotpedia": "Adam_Ebbin", "sponsor_type_id": 1, "sponsor_order": 1, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}], "sasts": [], "subjects": [], "texts": [{"doc_id": 1071265, "date": "2015-01-13", "type": "Prefiled", "type_id": 11, "mime": "text/html", "mime_id": 1, "url": "https://legiscan.com/VA/text/SB1178/id/1071265", "state_link": "https://lis.virginia.gov/cgi-bin/legp604.exe?151+ful+SB1178+hil", "text_size": 65557, "text_hash": "942bd25d34b1e7e529151cc145ef0721"}], "votes": [{"roll_call_id": 385833, "date": "2015-01-26", "desc": "Senate: Failed to report (defeated) in Courts of Justice (5-Y 10-N)", "yea": 5, "nay": 10, "nv": 0, "absent": 0, "total": 15, "passed": 0, "chamber": "S", "chamber_id": 8, "url": "https://legiscan.com/VA/rollcall/SB1178/id/385833", "state_link": "https://lis.virginia.gov/cgi-bin/legp604.exe?151+vot+S03V0098+SB1178"}], "amendments": [], "supplements": [], "calendar": []}}