{"status": "OK", "bill": {"bill_id": 763864, "change_hash": "f580c91e1ef783f407fac53a15b35f86", "session_id": 1156, "session": {"session_id": 1156, "state_id": 52, "year_start": 2015, "year_end": 2016, "prefile": 0, "sine_die": 1, "prior": 1, "special": 0, "session_tag": "Regular Session", "session_title": "2015-2016 Regular Session", "session_name": "114th Congress"}, "url": "https://legiscan.com/US/bill/SB874/2015", "state_link": "https://www.congress.gov/bill/114th-congress/senate-bill/874/all-info", "completed": 0, "status": 1, "status_date": "2015-03-26", "progress": [{"date": "2015-03-26", "event": 1}, {"date": "2015-03-26", "event": 9}], "state": "US", "state_id": 52, "bill_number": "SB874", "bill_type": "B", "bill_type_id": "1", "body": "S", "body_id": 115, "current_body": "S", "current_body_id": 115, "title": "Second Amendment Enforcement Act of 2015", "description": "Second Amendment Enforcement Act of 2015 Declares that nothing in a certain prohibition against killing wild birds and wild animals in the District of Columbia, or any other provision of law, shall authorize or be construed to permit the District of Columbia Council, the Mayor, or any District governmental or regulatory authority to prohibit or unduly burden the ability of persons otherwise not prohibited from possessing firearms under federal law from acquiring or using for lawful purposes any firearm neither prohibited by federal law nor subject to the National Firearms Act. Denies the District any authority to enact laws or regulations that discourage or eliminate the private ownership or use of firearms for legitimate purposes. Amends the Firearms Control Regulations Act of 1975 (FCRA) to repeal the District's registration requirement for possession of firearms. Maintains the current ban on the possession and control of a sawed-off shotgun, machine gun, or short-barreled rifle. Prohibits dealing, importing, or manufacturing firearms without complying with federal law requirements. Declares that, in the case of a sale or transfer of a handgun to a District resident, a federally licensed importer, manufacturer, or dealer of firearms in Maryland or Virginia shall be treated as a dealer licensed in the District if certain requirements are met. Prohibits selling, transferring or otherwise disposing of any firearm or ammunition to any person if the sellers or transferors know that such person is prohibited by federal law from possessing or receiving it. Bars individuals prohibited by federal law from possessing a firearm in the District. Repeals specified District policies and requirements regarding the keeping or storing of firearms. Eliminates criminal penalties for possession of unregistered firearms. Amends the District of Columbia Code to: (1) allow District property owners to prohibit or restrict the possession of firearms on their property, (2) authorize certain individuals to carry firearms in certain places and for certain purposes, (3) prescribe requirements for lawful transportation of firearms, and (4) prohibit the use of toy and antique pistols to commit a violent or dangerous crime. Authorizes the District to prohibit or restrict the possession of firearms, except to certain lessees, within any building or structure under its control, or in any area of it, which has implemented security measures to identify and exclude unauthorized or hazardous persons or articles. Requires the District Chief of Police to issue a five-year license to carry a concealed pistol on or about the person to any qualified individual who completes the application process. Repeals: (1) FCRA requirements that a gun offender register and verify certain identifiable information with the Chief; and (2) specified District of Columbia Acts, in order to conform with this Act. Restores and revives any provision of law amended or repealed by such Acts as if they had not been enacted into law.", "pending_committee_id": 2329, "committee": {"committee_id": 2329, "chamber": "S", "chamber_id": 115, "name": "Homeland Security And Governmental Affairs"}, "referrals": [{"date": "2015-03-26", "committee_id": 2329, "chamber": "S", "chamber_id": 115, "name": "Homeland Security And Governmental Affairs"}], "history": [{"date": "2015-03-26", "action": "Read twice and referred to the Committee on Homeland Security and Governmental Affairs.", "chamber": "S", "chamber_id": 115, "importance": 1}], "sponsors": [{"people_id": 11910, "person_hash": "8u29wj1z", "party_id": "2", "state_id": 52, "party": "R", "role_id": 2, "role": "Sen", "name": "Marco Rubio", "first_name": "Marco", "middle_name": "", "last_name": "Rubio", "suffix": "", "nickname": "", "district": "SD-FL", "ftm_eid": 12999040, "votesmart_id": 1601, "opensecrets_id": "N00030612", "knowwho_pid": 193597, "ballotpedia": "Marco_Rubio", "sponsor_type_id": 1, "sponsor_order": 1, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}], "sasts": [{"type_id": 1, "type": "Same As", "sast_bill_number": "HB1701", "sast_bill_id": 763779}, {"type_id": 8, "type": "Related", "sast_bill_number": "SB2359", "sast_bill_id": 799333}], "subjects": [{"subject_id": 13374, "subject_name": "Criminal justice information and records"}, {"subject_id": 13167, "subject_name": "District of Columbia"}, {"subject_id": 13341, "subject_name": "Firearms and explosives"}, {"subject_id": 13312, "subject_name": "Licensing and registrations"}, {"subject_id": 13523, "subject_name": "Retail and wholesale trades"}, {"subject_id": 13285, "subject_name": "State and local government operations"}, {"subject_id": 13340, "subject_name": "Crime and law enforcement"}], "texts": [{"doc_id": 1195442, "date": "2015-04-06", "type": "Introduced", "type_id": 1, "mime": "application/pdf", "mime_id": 2, "url": "https://legiscan.com/US/text/SB874/id/1195442", "state_link": "https://www.congress.gov/114/bills/s874/BILLS-114s874is.pdf", "text_size": 309596, "text_hash": "d367999804354540035e88de69ef27a7"}], "votes": [], "amendments": [], "supplements": [], "calendar": []}}