{"status": "OK", "bill": {"bill_id": 799333, "change_hash": "5f66b2a5715e46b88ed9263768f58c5d", "session_id": 1156, "session": {"session_id": 1156, "state_id": 52, "year_start": 2015, "year_end": 2016, "prefile": 0, "sine_die": 1, "prior": 1, "special": 0, "session_tag": "Regular Session", "session_title": "2015-2016 Regular Session", "session_name": "114th Congress"}, "url": "https://legiscan.com/US/bill/SB2359/2015", "state_link": "https://www.congress.gov/bill/114th-congress/senate-bill/2359/all-info", "completed": 0, "status": 1, "status_date": "2015-12-03", "progress": [{"date": "2015-12-03", "event": 1}], "state": "US", "state_id": 52, "bill_number": "SB2359", "bill_type": "B", "bill_type_id": "1", "body": "S", "body_id": 115, "current_body": "S", "current_body_id": 115, "title": "Defend Our Capital Act of 2015", "description": "Defend Our Capital Act of 2015 This bill requires the District of Columbia Chief of Police to issue a five-year license to carry a concealed firearm on or about the person to any qualified individual who completes the application process. The District of Columbia Code is amended to authorize certain individuals to carry firearms in certain places and for certain purposes. The federal criminal code is amended to allow an individual who is not prohibited by federal law from possessing, transporting, shipping, or receiving a firearm, and who is carrying a government-issued photographic identification document and a valid license or permit issued pursuant to state law to carry a concealed firearm, or who is otherwise entitled and not prohibited from carrying a concealed firearm in the individual's state of residence, to possess or carry a concealed handgun (other than a machinegun or destructive device) shipped or transported in interstate or foreign commerce in any state other than the individual's state of residence (reciprocity) if that other state: has a statute that allows state residents to obtain licenses or permits to carry concealed firearms; or does not prohibit the carrying of concealed firearms by state residents for lawful purposes. A qualified member of the Armed Forces shall be exempt from the prohibition against knowingly possessing or causing a firearm or other dangerous weapon to be present in a federal facility if that facility is any land or building owned or leased by the Department of Defense. The Uniform Code of Military Justice is amended similarly to declare that the possession of a concealed or open carry firearm by a member of the Armed Forces on a military installation, if lawful under the laws of the state in which the installation is located, shall not be an offense subject to court-martial. The federal criminal code is amended to allow a qualified member of the Armed Forces with required identification to carry a concealed firearm shipped or transported in interstate or foreign commerce. The D.C. Official Code is amended to declare that nothing in a certain prohibition against killing wild birds and wild animals in the District of Columbia, or any other provision of law, shall authorize or be construed to permit the District of Columbia Council, the Mayor, or any District governmental or regulatory authority to prohibit or unduly burden the ability of persons otherwise not prohibited from possessing firearms under federal law from acquiring or using for lawful purposes any firearm neither prohibited by federal law nor subject to the National Firearms Act. The District shall not have any authority to enact laws or regulations that discourage or eliminate the private ownership or use of firearms for legitimate purposes. The Firearms Control Regulations Act of 1975 (FCRA) is amended to repeal the District's registration requirement for possession of firearms. The current ban on the possession and control of a sawed-off shotgun, machine gun, or short-barreled rifle shall continue. The bill prohibits dealing, importing, or manufacturing firearms without complying with federal law requirements. In the case of a sale or transfer of a handgun to a District resident, a federally licensed importer, manufacturer, or dealer of firearms in Maryland or Virginia shall be treated as a dealer licensed in the District if certain requirements are met. The bill prohibits selling, transferring or otherwise disposing of any firearm or ammunition to any person if the sellers or transferors know that such person is prohibited by federal law from possessing or receiving it. The bill bars any individuals prohibited by federal law from possessing a firearm in the District. Specified District policies and requirements regarding the keeping or storing of firearms are repealed. The bill eliminates criminal penalties for possession of unregistered firearms and ammunition. Amends the District of Columbia Code to: (1) allow District property owners to prohibit or restrict the possession of firearms on their property, and (2) prohibit the use of toy and antique firearms to commit a violent or dangerous crime. Authorizes the District to prohibit or restrict the possession of firearms, except to certain lessees, within any building or structure under its control, or in any area of it, which has implemented security measures to identify and exclude unauthorized or hazardous persons or articles. Repeals: (1) FCRA requirements that a gun offender register and verify certain identifiable information with the Chief; and (2) specified District of Columbia Acts, in order to conform with this Act. Restores and revives any provision of law amended or repealed by such Acts as if they had not been enacted into law. The federal criminal code is amended to repeal the federal interstate handgun transfer ban. The ban on possession of firearms and dangerous weapons in federal facilities shall not apply to the lawful storage or possession of one within a publicly accessible, non-sensitive area of real property (without security measures) owned or leased by the federal government.", "pending_committee_id": 0, "committee": [], "referrals": [], "history": [{"date": "2015-12-03", "action": "Introduced in the Senate. Read the first time. Placed on Senate Legislative Calendar under Read the First Time.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2015-12-07", "action": "Read the second time. Placed on Senate Legislative Calendar under General Orders. Calendar No. 314.", "chamber": "S", "chamber_id": 115, "importance": 0}], "sponsors": [{"people_id": 11893, "person_hash": "kj744t8v", "party_id": "2", "state_id": 52, "party": "R", "role_id": 2, "role": "Sen", "name": "Rand Paul", "first_name": "Rand", "middle_name": "", "last_name": "Paul", "suffix": "", "nickname": "", "district": "SD-KY", "ftm_eid": 9337758, "votesmart_id": 117285, "opensecrets_id": "N00030836", "knowwho_pid": 285781, "ballotpedia": "Rand_Paul", "sponsor_type_id": 1, "sponsor_order": 1, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}], "sasts": [{"type_id": 8, "type": "Related", "sast_bill_number": "HB1701", "sast_bill_id": 763779}, {"type_id": 8, "type": "Related", "sast_bill_number": "SB874", "sast_bill_id": 763864}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB402", "sast_bill_id": 684594}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB923", "sast_bill_id": 724475}, {"type_id": 8, "type": "Related", "sast_bill_number": "SB498", "sast_bill_id": 724395}, {"type_id": 8, "type": "Related", "sast_bill_number": "SB1839", "sast_bill_id": 787985}], "subjects": [{"subject_id": 13126, "subject_name": "Administrative law and regulatory procedures"}, {"subject_id": 13384, "subject_name": "Administrative remedies"}, {"subject_id": 13374, "subject_name": "Criminal justice information and records"}, {"subject_id": 13153, "subject_name": "Department of Defense"}, {"subject_id": 13167, "subject_name": "District of Columbia"}, {"subject_id": 13172, "subject_name": "Educational facilities and institutions"}, {"subject_id": 13174, "subject_name": "Elementary and secondary education"}, {"subject_id": 13341, "subject_name": "Firearms and explosives"}, {"subject_id": 13880, "subject_name": "Freedom of information"}, {"subject_id": 13196, "subject_name": "Government buildings, facilities, and property"}, {"subject_id": 13231, "subject_name": "Intergovernmental relations"}, {"subject_id": 13418, "subject_name": "Judicial review and appeals"}, {"subject_id": 13312, "subject_name": "Licensing and registrations"}, {"subject_id": 13244, "subject_name": "Military facilities and property"}, {"subject_id": 13484, "subject_name": "Military personnel and dependents"}, {"subject_id": 13285, "subject_name": "State and local government operations"}, {"subject_id": 13340, "subject_name": "Crime and law enforcement"}], "texts": [{"doc_id": 1277340, "date": "2015-12-11", "type": "Introduced", "type_id": 1, "mime": "application/pdf", "mime_id": 2, "url": "https://legiscan.com/US/text/SB2359/id/1277340", "state_link": "https://www.congress.gov/114/bills/s2359/BILLS-114s2359pcs.pdf", "text_size": 302817, "text_hash": "18fcaa9c31697a5df3b878fd5834d890"}], "votes": [], "amendments": [], "supplements": [], "calendar": []}}