{"votes": {"No": [["Coleman  A.  Young\n                  II", "66445", "Democratic", "MI", "1"], ["Morris  W.  Hood\n                  III", "37313", "Democratic", "MI", "3"], ["Ian  Conyers", "176055", "Democratic", "MI", "4"], ["David  M.  Knezek\n                  Jr.", "139894", "Democratic", "MI", "5"], ["Hoon-Yung  Hopgood", "37791", "Democratic", "MI", "6"], ["Steven 'Steve'  Bieda", "19835", "Democratic", "MI", "9"], ["Tory  Rocca", "37606", "Republican", "MI", "10"], ["Vincent  Gregory", "88592", "Democratic", "MI", "11"], ["Rebekah  Warren", "19884", "Democratic", "MI", "18"], ["Curtis  Hertel\n                  Jr.", "87212", "Democratic", "MI", "23"], ["Jim  Ananich", "37901", "Democratic", "MI", "27"]], "Yes": [["Patrick  J.  Colbeck", "123123", "Republican", "MI", "7"], ["Jack  Brandenburg", "19956", "Republican", "MI", "8"], ["James 'Jim'  Marleau", "38124", "Republican", "MI", "12"], ["Martin  J. 'Marty'  Knollenberg", "38241", "Republican", "MI", "13"], ["David  B. 'Dave'  Robertson", "38344", "Republican", "MI", "14"], ["Mike  Kowall", "19994", "Republican", "MI", "15"], ["Mike  Shirkey", "124194", "Republican", "MI", "16"], ["Dale  W.  Zorn", "88207", "Republican", "MI", "17"], ["Michael  L. 'Mike'  Nofs", "38437", "Republican", "MI", "19"], ["Margaret  E.  O'Brien", "76335", "Republican", "MI", "20"], ["John  M.  Proos\n                  IV", "38165", "Republican", "MI", "21"], ["Joe  Hune", "37928", "Republican", "MI", "22"], ["Rick  A.  Jones", "37786", "Republican", "MI", "24"], ["Phillip  J. 'Phil'  Pavlov", "38280", "Republican", "MI", "25"], ["Tonya  Schuitmaker", "124539", "Republican", "MI", "26"], ["Peter  F.  MacGregor", "124237", "Republican", "MI", "28"], ["David  S. 'Dave'  Hildenbrand", "124560", "Republican", "MI", "29"], ["Arlan  B.  Meekhof", "65687", "Republican", "MI", "30"], ["Mike  L.  Green", "8682", "Republican", "MI", "31"], ["Kenneth  B. 'Ken'  Horn", "65768", "Republican", "MI", "32"], ["Judy  K.  Emmons", "38055", "Republican", "MI", "33"], ["Goeff  Hansen", "38297", "Republican", "MI", "34"], ["Darwin  L.  Booher", "37894", "Republican", "MI", "35"], ["Jim  Stamas", "105707", "Republican", "MI", "36"], ["Wayne  A.  Schmidt", "87093", "Republican", "MI", "37"]], "Did Not Vote": [], "NA": []}, "synopsis": "Vote to concur with house amendments and pass a bill that establishes new state environmental rules committees.", "link": "https://justfacts.votesmart.org/bill/25219/63974/establishes-a-new-environmental-rules-committee", "name": "SB 653 - Establishes a New Environmental Rules Committee - Michigan Key Vote", "pg": "Highlights: Establishes the Environmental Permit Review Commision in the Department of Environmental Quality (Sec. 1313). Requires the Commision to consist of 15 individuals appointed by the governor within 60 days after the passage of this act (Sec. 1313). Requires each member of the commission to have 1 or more of the following: 6 years of full-time relevant experience as a practicing engineer, geologist, hydrologist, or hydrogeologist and is licensed or registered to practice by the state, tribe, or US Territory or the Commonwealth of Puerto Rico; or A master’s degree from an accredited institution of higher education in a discipline of engineering or science related to air or water and the equivalent of 8 years of full-time relevant experience. Prohibits an individual from being a member of the commision if any of the following apply (Sec. 1313): The individual is currently employed in any office, department, or agency of the state; The individual is a party to 1 or more contacts with the Department of Environmental Quality and the compensation paid under those contracts in any of the preceding 3 years represented more than 5 percent of the individual’s annual gross income in the preceding year The individual is employed by an entity that is a party to 1 or more contracts with the department and the individual’s employer under those contracts in any of the preceding three years 3 years represented more than 5 percent of the employer’s annual gross revenue in that preceding year. The individual was employed by the department within the preceding 3 years. Requires an individual appointed to the commission to serve a 4 year term and may be reappointed (Sec. 1313) Specifies that after an individual serves on the commission for 2 consecutive terms the individual is not eligible to serve on the commission for 2 years (Sec. 1313). Requires the terms to be staggered for individuals appointed to the commission so that (Sec. 1313): 5 terms expire in 2 years; 5 expire in 3 years; and 5 terms expire in 4 years. Authorizes the governor to remove a member of the commission for either of the following (Sec. 1313): Incompetence; Dereliction of duty; Wrongdoing; Transgression; Failing to perform an act that is required by law while in office; or Any other good cause. Requires individuals appointed to the commission to serve without compensation (Sec. 1313) Authorizes members of the commission to receive reimbursement for their actual and necessary expenses incurred in the performance of their official duties as members of the commision (Sec. 1313). Requires the commission to conduct public meeting (Sec. 1313). Authorizes a permit applicant to seek a review by a panel by submitting a petition to the Director of the Department of Environmental Quality before the permit has been approved or denied, with the petition including (Sec. 1315): Relevant Facts; Any Data; Any Analysis; Any Opinion; and Supporting documentation. Authorizes the director to contact the petitioner regarding the issuing in dispute and negotiate for a period not exceeding 45 days, a resolution to the dispute, if the director believes the dispute can be solved without the panel (Sec. 1315). Requires the panel to be held within 45 days after the director received the petition, with 3 members of the commission being selected by the director to serve on the panel based on their relative experience (Sec. 1315). Requires that to serve on the panel, the commision member must submit a form not to accept employment from the petitioner before 1 year after a decision is rendered on the matter (Sec. 1315). Requires the members of the panel to select a chairperson (Sec. 1315). Requires a majority of the votes on the panel to conduct official action (Sec. 1315). Requires the panel to provide a written notice of recommendations to the director and the petitioner within 45 days after the hearing on the petition (Sec. 1315). Requires the director to come to a decision within 60 days after receiving the written notice from the panel (Sec. 1315). Requires the department to incorporate the recommendation into the terms of the permit if the direct agrees with the recommendations (Sec. 1315). Requires that if the direct disagrees with the recommendation, the direct will include specific rationale for rejecting the recommendation in the written decision (Sec. 1315). Prohibits a member of the commision from participating in the panel if there is a conflict of interest, which include (Sec. 1315): The applicant has hired that member or the member’s employer on any environmental matter within the previous 3 years; The member has been an employee of the applicant within the previous 3 years; The member has more than 1% ownership interest in the applicant. Requires an administrative law judge to preside, and make and issue the final decision in the case of a contested permit (Sec. 1317)."}