{"votes": {"No": [["Coleman  A.  Young\n                  II", "66445", "Democratic", "MI", "1"], ["Morris  W.  Hood\n                  III", "37313", "Democratic", "MI", "3"], ["Ian  Conyers", "176055", "Democratic", "MI", "4"], ["David  M.  Knezek\n                  Jr.", "139894", "Democratic", "MI", "5"], ["Hoon-Yung  Hopgood", "37791", "Democratic", "MI", "6"], ["Steven 'Steve'  Bieda", "19835", "Democratic", "MI", "9"], ["Tory  Rocca", "37606", "Republican", "MI", "10"], ["Vincent  Gregory", "88592", "Democratic", "MI", "11"], ["Rebekah  Warren", "19884", "Democratic", "MI", "18"], ["Curtis  Hertel\n                  Jr.", "87212", "Democratic", "MI", "23"], ["Jim  Ananich", "37901", "Democratic", "MI", "27"]], "Yes": [["Patrick  J.  Colbeck", "123123", "Republican", "MI", "7"], ["Jack  Brandenburg", "19956", "Republican", "MI", "8"], ["James 'Jim'  Marleau", "38124", "Republican", "MI", "12"], ["Martin  J. 'Marty'  Knollenberg", "38241", "Republican", "MI", "13"], ["David  B. 'Dave'  Robertson", "38344", "Republican", "MI", "14"], ["Mike  Kowall", "19994", "Republican", "MI", "15"], ["Mike  Shirkey", "124194", "Republican", "MI", "16"], ["Dale  W.  Zorn", "88207", "Republican", "MI", "17"], ["Michael  L. 'Mike'  Nofs", "38437", "Republican", "MI", "19"], ["Margaret  E.  O'Brien", "76335", "Republican", "MI", "20"], ["John  M.  Proos\n                  IV", "38165", "Republican", "MI", "21"], ["Joe  Hune", "37928", "Republican", "MI", "22"], ["Rick  A.  Jones", "37786", "Republican", "MI", "24"], ["Phillip  J. 'Phil'  Pavlov", "38280", "Republican", "MI", "25"], ["Tonya  Schuitmaker", "124539", "Republican", "MI", "26"], ["Peter  F.  MacGregor", "124237", "Republican", "MI", "28"], ["David  S. 'Dave'  Hildenbrand", "124560", "Republican", "MI", "29"], ["Arlan  B.  Meekhof", "65687", "Republican", "MI", "30"], ["Mike  L.  Green", "8682", "Republican", "MI", "31"], ["Kenneth  B. 'Ken'  Horn", "65768", "Republican", "MI", "32"], ["Judy  K.  Emmons", "38055", "Republican", "MI", "33"], ["Goeff  Hansen", "38297", "Republican", "MI", "34"], ["Darwin  L.  Booher", "37894", "Republican", "MI", "35"], ["Jim  Stamas", "105707", "Republican", "MI", "36"], ["Wayne  A.  Schmidt", "87093", "Republican", "MI", "37"]], "Did Not Vote": [["Tom  A.  Casperson", "38110", "Republican", "MI", "38"]], "NA": []}, "synopsis": "Vote to concur with House amendments and pass a bill that establishes an 11-member stakeholder committee to review and amend environmental rules.", "link": "https://justfacts.votesmart.org/bill/25220/63980/establishes-11-member-stakeholder-committee-to-review-and-amend-environmental-regulations", "name": "SB 652 - Establishes 11-Member Stakeholder Committee to Review and Amend Environmental Regulations - Michigan Key Vote", "pg": "Highlights: Establishes an independent Environmental Rules Review Committee (Sec. 65). Specificies the purpose of the Environmental Rules Review Committee is to Oversee all rule-making of the Department of the Environmental Quality (Sec. 65). Requires that the review committee shall be made up of the following non-voting members (Sec. 65): The Director of the Department of Environmental Quality, or his or her designee; The Director of the Department of Health and Human Services, or his or her designee; The Director of the Department of Agriculture and Rural Development, or his or her designee; and The Director of the Department of Natural Resources, or his or her designee. Requires that the review committee shall be made up of the following voting members appointed by the governor and with the advice and consent of the senate (Sec. 65): 1 individual who represents a statewide manufacturing organization; 1 individual who represents the solid waste management industry; 1 individual who represents a statewide organization that represents small businesses; 1 individual who represents public utilities that engage in the generation, transmission, or distribution of electricity; 1 individual who represents a statewide environmental organization; 1 individual who represents the oil and gas industry; 1 individual who represents a statewide agricultural organization; 1 individual who represents local governments; 1 individual who represents a statewide land conservancy organization; 2 individuals who represent the general public; and 1 individual who is a public health professional. Requires voting members to possess knowledge, experience, or education that qualifies him or her to represent the represented constituency (Sec. 65). Prohibits the an individual from serving as a voting member of the review committee if any of the following apply (Sec. 65): The individual is an employee of any office, department, or agency of the state of Michigan; The individual is a party to 1 or more contracts with the Department of Environmental Quality and the Compensation paid under those contracts in any of the preceding 3 years represented more than 5 percent of the individual’s annual gross income in the preceding year; The individual is employed by a person that is in a contract with the Department of Environmental Quality and the compensation paid to the individual’s employer under those contracts in any of the preceding 3 years represented more than 5 percent of the employer’s annual gross revenue in that preceding year; The individual was employed by the Department of Environmental Quality within the preceding 3 years. Authorizes an individual who is a lobbyist to serve on the review committee if the individual does not simultaneously receive compensation or reimbursement of actual expenses for lobbying from more than 1 person while serving as a member of the committee (Sec. 65). Prohibits more than six members of the voting members of the committee from being of the same political party (Sec. 65). Specifies the term limits for voting members of the committee as follows (Sec. 65) 4 members shall serve 4 year terms; 4 members shall serve 3 years terms; and 4 members shall serve 2 year terms. Prohibits voting members from serving more than 3 consecutive terms (Sec. 65) Authorizes voting members to be appointed again after not serving for 1 full term (Sec. 65) Specifies the term of a voting member of the committee continues until a successor is appointed (Sec. 65). Authorizes the governor to remove voting members for repeated absence from meeting (Sec. 65) Requires the governor to appoint a new member of the committee if a vacancy occurs for either of the following reasons (Sec. 65): A member’s death prior to their term ending; A member’s resignation prior to their term ending; A member is removed prior to their term ending; or A member’s term has expired. Prohibits the committee from conducting any business or perform any duties while there is a vacancy, except in the following circumstances (Sec. 65) If the vacancy is created by death, resignation, or removal, the committee can continue to conduct business and perform duties unless the governor does not appoint an individual to fill the vacancy within 90 days, then the committee shall not conduct business. If the vacancy is created by the senate’s disapproval of an appointment, the committee may continue to conduct business and perform duties unless the governor doesn’t fill the vacancy within 90 days. Requires the committee to serve without compensation but may be reimbursed by the Department of Environmental Quality for actual and necessary expenses incurred in the performance of their official duties as member (Sec. 65). Requires the Directors of Department of Environmental Quality and the Department of Health and Human Services select a science advisor to participate in meetings of the committee and provide expert advice to the committee (Sec. 65). Requires the Department of Environmental Quality to provide copies of drafts of rule proposals and regulatory impact to the committee (Sec. 66). Requires the committee to meet at 1 or more times to consider the draft proposal to ensure it meets all of the following criteria (Sec. 66): The proposed rules do not exceed the rule-making delegation; The proposed rules are consistent with the law; The proposed rule are necessary and suitable to achieve its purpose in proportion to the burdens they place on individuals and businesses; The proposed rules are clear and unambiguous as reasonably appropriate considering the subject matter of the proposed rules and the individuals and Businesses that will be required to comply with it; and The proposed rules are based on sound and objective scientific reasoning. Requires the committee to make 1 of the following determination within 35 days after receiving the draft proposal (Sec. 66): A majority of voting members of the committee determined that the draft proposal meets criteria; or A majority of voting members of the committee determined that the draft proposal does not meet criteria, or that additional review is needed to determine whether or not the rules meet criteria. Requires the committee to notify the Department of Environmental Quality in writing of the Determination, including an explanation as to either why the draft rules didn’t meet criteria or needs further review (Sec. 66) Requires the Department of Environmental Quality to address the committee’s determination by taking actions that may include (Sec. 66): Convening meetings with stakeholders or groups of stakeholders; Providing further information to the committee; or Revising the draft proposal. Requires the Department of Environmental Quality to hold public hearings only if 1 of the following occurs: The committee decides the draft proposal meets criteria; The committee determines that the draft proposal or revision submitted by the department meets the criteria; 90 days after the department receives a notice the committee has not determined that the draft proposal or revision does not meet the criteria; The committee fails to make a determination within 35 days after receiving the draft proposal. Requires the Department of Environmental Quality to prepare and submit to the committee an agency report containing a synopsis of the comments made at the public hearing and a description to any suggested changes within 120 days after the hearing (Sec. 66) Requires the Department of Environmental Quality to withdraw it’s rule request if it does not submit an agency report (Sec. 66). Requires the committee to meet 1 or more times to discuss the report and comments made and to vote on whether to approve or reject the rule proposal (Sec. 66). Requires the committee to submit a notice of objection to the Direct of the Department of Environmental Quality and the Governor explaining why the committee approved or disapproved of the proposal and have the department attempt to resolve any issues the committee has with the proposal (Sec. 66). Requires the Department of Environmental Quality to submit a written finding to the Governor on the draft proposal or revision if the department cannot resolve the issues within an 11 month period (Sec. 66). Requires the governor to either (Sec. 66): Concur with the Department of Environmental Quality and have the Director proceed with the draft rule; or Disagree with the department and direct the department to withdraw the rule proposal."}