{"votes": {"No": [["Coleman  A.  Young\n                  II", "66445", "Democratic", "MI", "1"], ["Morris  W.  Hood\n                  III", "37313", "Democratic", "MI", "3"], ["Ian  Conyers", "176055", "Democratic", "MI", "4"], ["David  M.  Knezek\n                  Jr.", "139894", "Democratic", "MI", "5"], ["Hoon-Yung  Hopgood", "37791", "Democratic", "MI", "6"], ["Steven 'Steve'  Bieda", "19835", "Democratic", "MI", "9"], ["Vincent  Gregory", "88592", "Democratic", "MI", "11"], ["Rebekah  Warren", "19884", "Democratic", "MI", "18"], ["Joe  Hune", "37928", "Republican", "MI", "22"], ["Curtis  Hertel\n                  Jr.", "87212", "Democratic", "MI", "23"], ["Rick  A.  Jones", "37786", "Republican", "MI", "24"], ["Tonya  Schuitmaker", "124539", "Republican", "MI", "26"], ["Jim  Ananich", "37901", "Democratic", "MI", "27"]], "Yes": [["Adam  Hollier", "139871", "Democratic", "MI", "2"], ["Patrick  J.  Colbeck", "123123", "Republican", "MI", "7"], ["Jack  Brandenburg", "19956", "Republican", "MI", "8"], ["Tory  Rocca", "37606", "Republican", "MI", "10"], ["James 'Jim'  Marleau", "38124", "Republican", "MI", "12"], ["Martin  J. 'Marty'  Knollenberg", "38241", "Republican", "MI", "13"], ["David  B. 'Dave'  Robertson", "38344", "Republican", "MI", "14"], ["Mike  Kowall", "19994", "Republican", "MI", "15"], ["Mike  Shirkey", "124194", "Republican", "MI", "16"], ["Dale  W.  Zorn", "88207", "Republican", "MI", "17"], ["Michael  L. 'Mike'  Nofs", "38437", "Republican", "MI", "19"], ["Margaret  E.  O'Brien", "76335", "Republican", "MI", "20"], ["John  M.  Proos\n                  IV", "38165", "Republican", "MI", "21"], ["Phillip  J. 'Phil'  Pavlov", "38280", "Republican", "MI", "25"], ["Peter  F.  MacGregor", "124237", "Republican", "MI", "28"], ["David  S. 'Dave'  Hildenbrand", "124560", "Republican", "MI", "29"], ["Arlan  B.  Meekhof", "65687", "Republican", "MI", "30"], ["Mike  L.  Green", "8682", "Republican", "MI", "31"], ["Kenneth  B. 'Ken'  Horn", "65768", "Republican", "MI", "32"], ["Judy  K.  Emmons", "38055", "Republican", "MI", "33"], ["Goeff  Hansen", "38297", "Republican", "MI", "34"], ["Darwin  L.  Booher", "37894", "Republican", "MI", "35"], ["Jim  Stamas", "105707", "Republican", "MI", "36"], ["Wayne  A.  Schmidt", "87093", "Republican", "MI", "37"], ["Tom  A.  Casperson", "38110", "Republican", "MI", "38"]], "Did Not Vote": [], "NA": []}, "synopsis": "Vote to pass a bill that establishes the Mackinac Straits Corridor Authority.", "link": "https://justfacts.votesmart.org/bill/25759/65185/establishes-mackinac-straits-corridor-authority", "name": "SB 1197 - Establishes Mackinac Straits Corridor Authority - Michigan Key Vote", "pg": "Highlights: Establishes the Mackinac Straits Corridor Authority within the state transportation department (Sec. 14B). Requires the Mackinac Straits Corridor Authority to exercise its duties through the Corridor Authority Board (Sec. 14B). Requires the Corridor Authority Board to consist of 3 members appointed by the Governor with the advice and consent of the Senate (Sec. 14B). Requires that no more than 2 members of the Corridor Authority Board to be members of the same political parties (Sec. 14B). Requires members of the Corridor Authority Board to serve for terms of 6 years or until a successor is appointed and qualified, whichever is later (Sec. 14B). Requires the Governor, with the advice and consent of the Senate, to make an appointment of the unexpired term in the same manner as the original appointment, if a vacancy occurs on the Corridor Authority Board (Sec. 14B). Requires members of the Corridor Authority Board to serve without compensation, with members of the board being reimbursed for their actual and necessary expenses incurred in the the performance of their official duties as member of the Corridor Authority Board, unless they decline to accept reimbursement (Sec. 14B). Prohibits an individual who is a member of the Mackinac Bridge Authority Board to serve as a member of the Corridor Authority Board during his or her term as a member of the of the Mackinac Bridge Authority Board (Sec. 14B). Establishes the Straits Protection Fund within the state treasury (Sec. 14C). Authorities the state treasurer to receive money or other assets from any source for deposit into the Straits Protection Fund (Sec. 14C). Requires the state treasurer to direct the investment of the Straits Protection Fund (Sec. 14C). Requires the state treasurer to credit to the Straits protection Fund interest and earnings from fund investments (Sec. 14C). Requires the money in the Straits Protection Fund at the close of the Fiscal year to remain in the Straits Protection Fund and not lapse into the General Fund (Sec. 14C). Defines “Mackinac Straits Corridor Authority” as the Mackinac Straits Corridor created in this section (Sec. 14). Defines “corridor authority board” as the board of directors of the Mackinac Straits Corridor (Sec. 14). Defines “utility tunnel” as a tunnel joining and connecting the upper and lower peninsulas of this state at the Straits of Mackinac for the purpose of accommodating utility infrastructure, including, but not limited to, pipelines, electric transmission lines, facilities for the transmission of data and telecommunications, all useful and related facilities, equipment, and structures, and all necessary tangible or intangible real and personal property, licenses, franchises, easements, and rights-of-way (Sec. 14). Authorizes the Mackinac Bridge Authority to acquire, construct, operate, maintain, improve, repair, and manage a utility tunnel (Sec. 14A). Requires the Mackinac Bridge Authority to determine the rates charged for the services offered by the utility tunnel (Sec. 14A). Authorizes the Mackinac Bridge Authority to enter into contracts or agreements necessary to perform its duties and powers under this act, including, but not limited to, leasing the right to use a utility tunnel on terms and for consideration determined by by the Mackinac Bridge Authority (Sec. 14A). Authorizes the Mackinac Bridge Authority to purchase or otherwise acquire at a fair and reasonable price property and property rights in connection with the construction of a utility tunnel, including, but not limited to (Sec. 14A) Roads and structures; Right-of-way, franchises and easements; Other interest in land, including land under water; The riparian rights of any individual; and The right to cut off light, air, and access to real property. Authorizes the Mackinac Bridge Authority to enter on any public land water, or premises to make a survey, sounding, or examination in connection with the construction of a utility tunnel (Sec. 14A). Authorizes the Mackinac Bridge Authority to perform all acts necessary to secure the consent of any department, agency, instrumentality, or officer of the United States government or this state to the construction and operation of a utility tunnel and the charging of fees for its use, and to secure the approval of any department, agency, instrumentality, or officer of the United States Government or this state required by law to approve the plans, specifications, and location of the utility tunnel or the fees to be charged for the use of the utility tunnel (Sec. 14A). Specifies the carrying out of the Mackinac Bridge Authorities purposes, including a utility tunnel, are for the benefit of the people of this state and constitute a public purpose, and the Mackinac Bridge Authority is performing an essential government function in the exercise of the powers conferred upon by this act (Sec. 14A). Exempts all property owned by the Mackinac Bridge Authority related to a utility tunnel from all taxes levied by this state and all of its political subdivisions and taxing districts, and the Mackinac Bridge Authority is not required to pay taxes or assessments upon its activities or upon any of its revenues (Sec. 14A). Requires all duties, responsibilities, authorities, and powers related to a utility tunnel and any money in the Straits Protection Fund to be transferred to the Corridor Authority Board upon the appointment of the members of the Corridor Authority Board (Sec. 14D). Specifies that the transfer of duties, responsibilities, authorities, powers, and money does not require any action by the Mackinac Bridge Authority or any other entity (Sec. 14D). Requires the Corridor Authority Board to exercise its duties independently of the state transportation department and the Mackinac Bridge Authority (Sec. 14D). Requires the Corridor Authority Board to provide a report to the Mackinac Bridge Authority at least 1 time per year regarding aspects of the of the utility tunnel that could affect the Mackinac Bridge Authority, including, but not limited to, the progress of construction and utility leasing (Sec. 14D). Specifies that the operation of a utility tunnel, including, but not limited to, the leasing of space in the utility tunnel to a utility, is not in competition with the bridge (Sec. 14D). Requires the Mackinac Straits Corridor Authority to enter into an agreement or a series of agreements, no later than December 31, 2018, for the construction, maintenance, operation, and decommissioning of a utility tunnel, if the Mackinac Straits Corridor Authority Finds all of the following (Sec. 14D): That the governor has supplied a proposed tunnel agreement to the Mackinac Straits Corridor Authority on or before December 21, 2018; That he proposed tunnel agreement allows for the use of the utility tunnel by multiple utilities, provides an option to better connect the upper and lower peninsulas of this state, and provides a route to allow utilities to be laid without future disturbance to the bottomlands of the straits of Mackinac; That the proposed tunnel agreement requires gathering of geotechnical information before construction to ensure that construction of a utility tunnel is feasible; That the proposed tunnel agreement provides the Mackinac Straits Corridor Authority with a Mechanism to Ensure that a utility tunnel is built to sufficient technical specifications and maintained properly to ensure a long asset life and secondary containment for any leak or pollution from utilities using the tunnel; That the proposed tunnel agreement does not require any obligation of funds that is inconsistent with this act, and that the proposed tunnel agreement provides a mechanism under which all costs of construction, maintenance, operation, and decommissioning of the utility tunnel are borne by a private party and not by the Mackinac Straits Corridor Authority, its predecessor, of a successor. That the proposed tunnel agreement does not require the use of the power of eminent domain; That the proposed tunnel agreement does not exempt any entity that constructs or uses the utility tunnel from the obligation to obtain any required governmental permits or approvals for the construction or use of the utility tunnel; That the proposed tunnel agreement does not exempt an entity using the utility tunnel from the payment of a tax or similar obligation; and That the proposed tunnel agreement does not require the Mackinac Straits Corridor Authority to Bring or defend a legal claim for which the attorney general is not required to provide counsel. Requires the attorney general to provide for the cost of representation by an attorney licensed to practice in this state if the attorney general declines to represent the Mackinac Bridge Authority or the Mackinac Straits Corridor Authority in a matter related to the utility tunnel (Sec. 14D). Specifies that “matter related to the utility tunnel” includes, but is not limited to, 1 or more of the following (Sec. 14D): A claim seeking a judicial determination that the tunnel agreement is legally invalid; A claim seeking to enjoin performance under the tunnel agreement; A claim challenging the validity of any governmental approval or permit granted based upon an application submitted singly or jointly by the Mackinac Straits Corridor Authority; A claim challenging a governmental entity’s denial of a governmental approval or permit submitted singly or jointly by the Mackinac Straits Utility Tunnel Authority; A claim challenging the right to use any land of this state for which the Mackinac Bridge Authority or the Mackinac Straits Corridor Authority was granted the right to use; A claim alleging a failure to perform under the tunnel agreement that limits either the use of the utility tunnel, or the ability to operate the utility infrastructure within the utility tunnel, if the utility is in full compliance with the terms of a lease granted by the Mackinac Straits Corridor Authority; or A claim challenging the validity of or seeking to enjoin the issuance of any approval regarding the utility tunnel. Prohibits the Mackinac Bridge Authority and the Mackinac Straits Corridor Authority to pay or obligate any money or assets related to the utility tunnel except money that is deposited into the Straits Protection Fund or any escrow or reserve fund created under the tunnel agreement (Sec. 14E)."}