{"votes": {"No": [["Rodger  Mell  Smitherman", "5617", "Democratic", "AL", "18"], ["Bobby  D.  Singleton", "27551", "Democratic", "AL", "24"], ["Kirk  Hatcher", "180541", "Democratic", "AL", "26"], ["William  M. 'Billy'  Beasley", "15872", "Democratic", "AL", "28"], ["Vivian  Davis  Figures", "15216", "Democratic", "AL", "33"]], "Yes": [["Timothy  I. 'Tim'  Melson", "149972", "Republican", "AL", "1"], ["Tom  Butler", "5594", "Republican", "AL", "2"], ["Arthur  W.  Orr", "57118", "Republican", "AL", "3"], ["Garlan  Gudger", "180619", "Republican", "AL", "4"], ["Greg  J.  Reed", "121561", "Republican", "AL", "5"], ["Larry  Collins  Stutts", "152242", "Republican", "AL", "6"], ["Steve  Livingston", "149964", "Republican", "AL", "8"], ["Clay  Scofield", "121565", "Republican", "AL", "9"], ["Andrew  Jones", "180625", "Republican", "AL", "10"], ["Randy  Price", "149979", "Republican", "AL", "13"], ["Dan  Roberts", "180628", "Republican", "AL", "15"], ["JT 'Jabo'  Waggoner", "5619", "Republican", "AL", "16"], ["Shay  Shelnutt", "149989", "Republican", "AL", "17"], ["Gerald  Allen", "5621", "Republican", "AL", "21"], ["Greg  Albritton", "15990", "Republican", "AL", "22"], ["Will  Barfoot", "56865", "Republican", "AL", "25"], ["Donnie  Chesteen", "121549", "Republican", "AL", "29"], ["Clyde  Chambliss\n                  Jr.", "79831", "Republican", "AL", "30"], ["Jimmy  W.  Holley", "16030", "Republican", "AL", "31"], ["Chris  Elliott", "156759", "Republican", "AL", "32"], ["John  W. 'Jack'  Williams", "153872", "Republican", "AL", "34"], ["David  Sessions", "129898", "Republican", "AL", "35"]], "Did Not Vote": [["Sam  Givhan", "180622", "Republican", "AL", "7"], ["Jim  McClendon", "27471", "Republican", "AL", "11"], ["Del  Marsh", "15983", "Republican", "AL", "12"], ["Priscilla  Dunn", "16019", "Democratic", "AL", "19"], ["Linda  Foster  Coleman-Madison", "27684", "Democratic", "AL", "20"], ["Malika  Sanders-Fortier", "180351", "Democratic", "AL", "23"], ["Tom  Whatley", "121573", "Republican", "AL", "27"]], "NA": []}, "synopsis": "Vote to pass a bill that prohibits state and local governments from enforcing any federal firearms act.", "link": "https://justfacts.votesmart.org/bill/30549/78842/prohibits-state-and-local-governments-from-enforcing-any-federal-firearms-act", "name": "SB 358 - Prohibits State and Local Governments from Enforcing Any Federal Firearms Act - Alabama Key Vote", "pg": "Highlights: Alleges the Second Amendment to the United States Constitution protects an individual's right to \"keep and bear arms\" and further provides that the right to keep and bear arms may not be infringed (Sec. 2-1). Prohibits public funds of this state or any political subdivision of this state from being used for the implementation, regulation, or enforcement of any executive order or directive issued by the President of the United States, or of any act of the United States Congress, that becomes effective after January 1, 2021, that regulates the ownership, use, or possession of firearms, ammunition, or firearm accessories (Sec. 2.b-1). Establishes any appointed or elected official, officer, employee, or agent of the state, or any political subdivision of the state, who knowingly violates this section, on a first violation, is guilty of a Class C misdemeanor and will be fined not less than $500 or more than $5,000 (Sec. 2.c-1). Authorizes, upon the adoption of a rule, order, ordinance, resolution, or other official policy by a political subdivision of the state which intentionally requires actions that violate Section 2, a resident of this state to file a complaint with the Attorney General (Sec. 3). Establishes a firearm, a firearm accessory, or ammunition that is commercially or privately manufactured in Alabama, that is sold in Alabama, and that remains within the borders of Alabama is not subject to federal law or regulation, including registration, under the authority of the United State Congress to regulate interstate commerce, as the item has not traveled in interstate commerce (Sec. 4-4.c). Specifies generic and insignificant parts that have other manufacturing or consumer product applications are not firearms, ammunition, or firearm accessories, and their importation into Alabama and incorporation into a firearm, ammunition, or a firearm accessory manufactured in Alabama does not subject the firearm, ammunition, or firearm accessory to federal regulation (Sec. 4-4-2). Exempts a firearm manufactured in this state from federal law or regulation only if the firearm has the words \"Made in Alabama\" clearly stamped on a central metallic part of the firearm, such as the receiver or frame (Sec. 4-4-3.e). Prohibits this law from applying to the following (Sec. 4-4-3.g): A firearm that cannot be carried and used by one person. A firearm that has a bore diameter greater than 1.5 inches and that uses smokeless powder and not black powder as a propellant. Ammunition with a projectile that explodes using an explosion of chemical energy after the projectile leaves the firearm. A firearm that discharges two or more projectiles with one activation of the trigger or other firing device. Establishes any tax, levy, fee, or stamp imposed on firearms, ammunition, or firearm accessories not common to all other goods and services that might reasonably be expected to create a chilling effect on the purchase or ownership of those items by law abiding residents of the state infringes on the people's right to keep and bear arms (Sec. 5.a)."}