{"votes": {"No": [], "Yes": [["Adam  G.  Hinds", "171993", "Democratic", "MA", "Berkshire, Hampshire, Franklin and Hampden"], ["Paul  R.  Feeney", "67571", "Democratic", "MA", "Bristol and Norfolk"], ["Michael  J.  Rodrigues", "4834", "Democratic", "MA", "First Bristol and Plymouth"], ["Mark  C.  Montigny", "4749", "Democratic", "MA", "Second Bristol and Plymouth"], ["Julian  Andre  Cyr", "171999", "Democratic", "MA", "Cape and Islands"], ["Joan  B.  Lovely", "35974", "Democratic", "MA", "Second Essex"], ["Brendan  P.  Crighton", "123763", "Democratic", "MA", "Third Essex"], ["Bruce  E.  Tarr", "4759", "Republican", "MA", "First Essex and Middlesex"], ["Barbara  A.  L'Italien", "35813", "Democratic", "MA", "Second Essex and Middlesex"], ["James  T. 'Jim'  Welch", "36030", "Democratic", "MA", "Hampden"], ["Eric  Philip  Lesser", "154131", "Democratic", "MA", "First Hampden and Hampshire"], ["Donald  F. 'Don'  Humason\n                  Jr.", "35895", "Republican", "MA", "Second Hampden and Hampshire"], ["Patricia  D. 'Pat'  Jehlen", "4820", "Democratic", "MA", "Second Middlesex"], ["Michael  J. 'Mike'  Barrett", "141572", "Democratic", "MA", "Third Middlesex"], ["Cindy  F.  Friedman", "176469", "Democratic", "MA", "Fourth Middlesex"], ["Jason  M.  Lewis", "109548", "Democratic", "MA", "Fifth Middlesex"], ["Cynthia Stone 'Cindy'  Creem", "18877", "Democratic", "MA", "First Middlesex and Norfolk"], ["Sal  N.  DiDomenico", "75393", "Democratic", "MA", "Middlesex and Suffolk"], ["James  B. 'Jamie'  Eldridge", "36072", "Democratic", "MA", "Middlesex and Worcester"], ["John  F.  Keenan", "78257", "Democratic", "MA", "Norfolk and Plymouth"], ["Michael  F. 'Mike'  Rush", "35666", "Democratic", "MA", "Norfolk and Suffolk"], ["Richard  J.  Ross", "36049", "Republican", "MA", "Norfolk, Bristol and Middlesex"], ["Walter  F.  Timilty", "18998", "Democratic", "MA", "Norfolk, Bristol and Plymouth"], ["Viriato  Manuel 'Vinny'  deMacedo", "18895", "Republican", "MA", "Plymouth and Barnstable"], ["Marc  R.  Pacheco", "4754", "Democratic", "MA", "First Plymouth and Bristol"], ["Michael  D.  Brady", "74825", "Democratic", "MA", "Second Plymouth and Bristol"], ["Patrick  M.  O'Connor", "75467", "Republican", "MA", "Plymouth and Norfolk"], ["Nicholas  Patrick 'Nick'  Collins", "125266", "Democratic", "MA", "First Suffolk"], ["Sonia  Rosa  Chang-Diaz", "109511", "Democratic", "MA", "Second Suffolk"], ["Joseph  A. 'Joe'  Boncore", "172052", "Democratic", "MA", "First Suffolk and Middlesex"], ["William  N. 'Will'  Brownsberger", "66893", "Democratic", "MA", "Second Suffolk and Middlesex"], ["Harriette  L.  Chandler", "4778", "Democratic", "MA", "First Worcester"], ["Michael  O. 'Mike'  Moore", "109518", "Democratic", "MA", "Second Worcester"], ["Anne  M.  Gobi", "35956", "Democratic", "MA", "Worcester, Hampden, Hampshire and Middlesex"], ["Dean  A.  Tran", "77264", "Republican", "MA", "Worcester and Middlesex"], ["Ryan  C.  Fattman", "124937", "Republican", "MA", "Worcester and Norfolk"]], "Did Not Vote": [["Kathleen  A.  O'Connor-Ives", "141568", "Democratic", "MA", "First Essex"]], "NA": []}, "synopsis": "Vote to concur with house amendments and pass a bill that authorizes $2 billion in environmental funding for implementing climate change adaptation measures.", "link": "https://justfacts.votesmart.org/bill/25282/64460/authorizes-funds-for-climate-change-adaptation-and-environmental-protection", "name": "H 4835 - Authorizes Funds for Climate Change Adaptation and Environmental Protection - Massachusetts Key Vote", "pg": "Highlights: Appropriates funds for an environmental and natural resources improvements (Sec. 1). Appropriates $2 million for a program to provide grants and low-interest loans to owners or operators of a dispensing facility that retails gasoline and other petroleum products, for the purpose of replacing and modernizing existing single-walled underground petroleum storage tank equipment and related leak detection equipment, funds can be used for but not limited to (Sec. 2): Engineering; Tank removal; and Construction and infrastructure replacement to install double-walled underground petroleum storage tank equipment and related leak detection equipment. Requires the Massachusetts Development Finance Agency to implement load and grant program for small business owners with regards to gasoline retail no later than January 31, 2019 (Sec. 2). Appropriates $10.5 million for improvements and replacements to the infrastructure and holdings of the executive office of energy and environmental affairs and its departments and divisions (Sec. 2). Appropriates $225 million for grant programs for land, soil, water and natural resource conservation, open space preservation, watershed remediation, and coastal resource protection (Sec. 2). Appropriates $100 million for the design, construction, reconstruction, rehabilitation, retrofitting, and repair or removal of coastal infrastructure and resiliency measures (Sec. 2). Appropriates $85 million for the design, construction, reconstruction, rehabilitation, retrofitting, repair or removal of municipally-owned dams, publicly owned dams and other dams for which emergency action or statewide hazard mitigation is required and for inland flood control projects and projects for related facilities and equipment (Sec. 2). Appropriates $32 million for the acquisition of land and interests in land by the executive office of energy and environmental affairs and its departments and divisions and for associated costs (Sec. 2). Appropriates $150 million for investment in water and air quality protection (Sec. 2). Appropriates $9 million for discovery, assessment, containment, monitoring, cleanup and closure of existing or closed solid waste facilities causing or threatening to cause pollution and for capital expenditure associated with composting and recycling programs consistent with the comprehensive statewide solid waste master plan (Sec. 2). Appropriates $45 million for the assessment, containment, monitoring, cleanup, control, removal of or response actions concerning oil or hazardous materials or for any other action necessary Appropriates $30 million for the acquisition of land and interests in land by the department of fish and game and for associated costs, including (Sec. 2): Planning; Studies; Due diligence; Title and appraisal services; and Site restoration and stewardship. Appropriates $50 million for the department of fish and game and its divisions for the following (Sec. 2): Planning; Design; Engineering; Construction; Reconstruction; Renovation; Repair; Demolition; Acquisition; Enhancements; Improvements; Removal and replacement of the infrastructure; and Facilities and equipment. Appropriates $55 million for river and wetland restoration programs in the division of ecological restoration, the riverways program and the office of the commissioner of fish and game (Sec. 2). Appropriates $54 million for the purpose of developing and implementing programs designed to address agricultural economic and environmental sustainability (Sec. 2). Appropriates $20 million for a program to acquire agricultural preservation restrictions (Sec. 2). Appropriates $75.5 million for natural resource restoration and protection and in compliance with laws and regulations, and for purposes of the following (Sec. 2): Improvements and costs associated with site assessment; Containment; Cleanup; Control; Disposal; and Removal or exchange of or response actions concerning hazardous materials or substances. Appropriates $40 million for the acquisition of land and interests in land by the department of conservation and recreation and for associated costs, including the following (Sec. 2): planning; study; due diligence; title and appraisal services; and site restoration and stewardship. Appropriates $20 million for natural resource restoration and protection, including protection and rehabilitation of lakes, ponds, rivers and streams and associated watersheds, and for improvements and costs associated with site assessment, containment, cleanup, control, removal of or response actions concerning hazardous materials or substances at forests, parks,reservations, water bodies and other properties of the department of conservation and recreation (Sec. 2). Appropriates $50 million for the design, construction, reconstruction, improvement or rehabilitation of department or navigable coastal and inland waterways projects (Sec. 2). Appropriates $105 million for the design, construction, reconstruction, rehabilitation, retrofitting, repair or removal of state-owned dams for which emergency action or statewide hazard mitigation is required, and for inland flood control projects and projects for related facilities and equipment (Sec. 2). Appropriates $1 million for the protection and rehabilitation of lakes, ponds, rivers and streams and associated watersheds Appropriates $420 million for the planning, design, construction, reconstruction, repair, removal, demolition, improvement, furnishing, equipping or rehabilitation of recreational facilities and historic sites (Sec. 2). Appropriates $160 million for the planning, design, construction, reconstruction, repair, improvement or rehabilitation of department of the following (Sec. 2): Conservation and recreation parkways; Boulevards; Multi-use trails; Internal state park roads and recreational trails; and Pedestrian bridges and related appurtenances and equipment. Appropriates $100 million for implementation of the integrated state hazard mitigation and climate change adaptation plan (Sec. 2A). Appropriates $75 million for the municipal vulnerability preparedness grant program to support and provide technical assistance for cities and towns to complete the following (Sec. 2A): Climate-related vulnerability assessments; Develop action-oriented resiliency plans; Complete integrated climate change adaptation plans; local hazard mitigation plans; and implement local and regional adaptation solutions identified through such plans. Appropriates $5 million to capitalize the Global Warming Solutions Trust Fund (Sec. 2A). Appropriates $10 million for the climate change science and data program to support the development and maintenance of data (Sec. 2A). Appropriates $15 million for the electric vehicle incentive program to provide grants to public entities for the following (Sec. 2A): Passenger plug-in vehicles for fleets; Install charging stations for public electric vehicles; and And promote the establishment of vehicle charging stations. Appropriates $6 million for the development and support of climate-oriented emergency response and natural hazard preparedness programs and climate change coordination with the executive office of energy and environmental affairs (Sec 2A). Appropriates $60.3 million for the Massachusetts Clean Water Trust (Sec 2B). Appropriates $10 million for a tree planting greening program for projects throughout the commonwealth on publicly-owned land (Sec. 2C). Appropriates $30 million for a program to be administered by the secretary of energy and environmental affairs to acquire land for the purposes of open space, recreation and conservation (Sec. 2C). Appropriates $60 millin for the acquisition, development, construction and improvement of parks in urban and suburban neighborhoods currently underserved with parks and that are consistent with attainment of environmental equity (Sec. 2C). Appropriates $25 million for investment in trails such as the following (Sec. 2C); Planning; Engineering; Design; Permitting; Construction; Repair; Technical assistance; Improvement of trails; and Acquisition of property interests for trail purposes. Appropriates $25 million for a forestry and tree planting program for projects throughout the commonwealth (Sec. 2C). Appropriates $55 million for the complete streets program for complete streets grants to municipalities; (Sec. 2D). Appropriates $992 million or projects on the interstate and non-interstate federal highway system (Sec. 2E)."}