{"synopsis": "\n\nSpecifies that it shall be unlawful for any individual to carry onto or possess on a licensed child care center premise, child care center-provided transportation, or areas of facilities used exclusively by a child care center the following (Sec. 1):\n\n\n\nAny firearm;\n\n\nAny dangerous weapon as described in previous law;\n\n\nAny air gun, including air pistol or air rifle designed to propel a BB, pellet, or other projectile by the discharge of compressed air; and\n\n\nAny portable device manufactured to function as a weapon and which is commonly known as a stun gun.\n\n\n\n \n\n\nSpecifies that individuals found to have violated this act shall be guilty of a gross misdemeanor and will have their concealed pistol license revoked for a period of 3 years (Sec. 1).\n\n\nSpecies that this act will not apply to family daycare providers’ homes as defined under previous law but requires that any firearm, ammunition, or other dangerous weapons be stored in a secure area when children are present on the premises (Sec. 1).\n\n\nRequires that the secure area to be inaccessible to children and consist of a locked gun safe or a locked room where each firearm is stored unloaded with a trigger lock or other disabling feature (Sec. 2).\n\n", "votes": {"No": ["167730", "126292", "122454", "108310", "170923", "182978", "176145", "51403", "51502", "174139", "156728", "67158", "94643", "170954", "153060", "186024", "182997", "153062", "26221", "183004", "59953", "170980", "170990", "51472", "126322", "183011", "171003", "51707", "13970", "51452", "183031", "183034", "126264", "153100", "153122", "171117", "140147", "152929", "51339", "153155"], "Yes": ["174166", "160583", "140089", "16446", "182973", "182974", "182988", "51456", "140106", "114465", "148105", "51404", "171007", "51637", "135725", "94646", "94645", "126361", "80588", "171109", "153111", "183047", "56285", "171113", "189242", "80550", "183059", "108273", "150064", "3157", "126390", "140153", "140152", "26171", "51333", "150066", "51591", "183093", "183092", "148810", "183096", "183101", "171054", "3172", "26108", "183108", "68784", "51435", "108342", "176532", "183116", "51662", "174177", "122354", "129758", "126320"], "Did Not Vote": ["56110", "126394"], "NA": []}}