{"votes": {"No": [["James  Wiley 'Jim'  Nielsen", "104331", "Republican", "CA", "4"], ["Andreas  Borgeas", "111778", "Republican", "CA", "8"], ["Shannon  L.  Grove", "120204", "Republican", "CA", "16"], ["Scott  Thomas  Wilk", "138539", "Republican", "CA", "21"], ["Mike  Morrell", "29706", "Republican", "CA", "23"], ["Jeff  Stone", "82828", "Republican", "CA", "28"], ["Ling-Ling  Chang", "129527", "Republican", "CA", "29"], ["Patricia  C. 'Pat'  Bates", "16585", "Republican", "CA", "36"], ["John  M. W.  Moorlach", "82725", "Republican", "CA", "37"], ["Brian  W.  Jones", "70781", "Republican", "CA", "38"]], "Yes": [["Mike  McGuire", "129749", "Democratic", "CA", "2"], ["Bill  Dodd", "82641", "Democratic", "CA", "3"], ["Cathleen  Galgiani", "57629", "Democratic", "CA", "5"], ["Richard  Pan", "120159", "Democratic", "CA", "6"], ["Steve  Glazer", "151749", "Democratic", "CA", "7"], ["Nancy  Skinner", "104350", "Democratic", "CA", "9"], ["Robert  A. 'Bob'  Wieckowski", "71025", "Democratic", "CA", "10"], ["Scott  Wiener", "129655", "Democratic", "CA", "11"], ["Anna  M.  Caballero", "58583", "Democratic", "CA", "12"], ["Gerald  A. 'Jerry'  Hill", "81552", "Democratic", "CA", "13"], ["Melissa  Hurtado", "179956", "Democratic", "CA", "14"], ["James  T. 'Jim'  Beall\n                  Jr.", "58229", "Democratic", "CA", "15"], ["William  W. 'Bill'  Monning", "104370", "Democratic", "CA", "17"], ["Robert 'Bob'  Hertzberg", "9756", "Democratic", "CA", "18"], ["Hannah-Beth  Jackson", "16826", "Democratic", "CA", "19"], ["Connie  M.  Leyva", "151805", "Democratic", "CA", "20"], ["Susan  Rubio", "129493", "Democratic", "CA", "22"], ["Maria  Elena  Durazo", "179971", "Democratic", "CA", "24"], ["Anthony  J.  Portantino\n                  Jr.", "69513", "Democratic", "CA", "25"], ["Benjamin 'Ben'  Allen", "151677", "Democratic", "CA", "26"], ["Henry  Stern", "169182", "Democratic", "CA", "27"], ["Holly  J.  Mitchell", "120230", "Democratic", "CA", "30"], ["Bob  J.  Archuleta", "71279", "Democratic", "CA", "32"], ["Thomas 'Tom'  Umberg", "29299", "Democratic", "CA", "34"], ["Steven  Craig  Bradford", "56752", "Democratic", "CA", "35"], ["Toni  G.  Atkins", "70372", "Democratic", "CA", "39"], ["Ben  Hueso", "70366", "Democratic", "CA", "40"]], "Did Not Vote": [["Richard  D.  Roth", "138416", "Democratic", "CA", "31"]], "NA": []}, "synopsis": "Vote to pass a bill that prohibits individuals from buying more than one gun per month.", "link": "https://justfacts.votesmart.org/bill/26871/68743/prohibits-purchasing-more-than-one-gun-per-month", "name": "SB 61 - Prohibits Purchasing More than One Gun per Month - California Key Vote", "pg": "Highlights: Prohibits individuals, until July 1, 2021, from making applications to purchase more than one handgun within a 30 day period (Sec. 4). Specifies that this regulation will not apply to the following (Sec. 4): Any law enforcement agency; Any agency authorized to carry out law enforcement duties; Any state or local correctional facility; Any private security company licensed to do business in California; Any full-time paid peace officer authorized to carry a firearm during their employment; Any motion picture, television, or video production company or entertainment or theatrical company whose production by its nature involves the use of a firearm; Any individual who can claim an exemption from the waiting period put forth in Section 27540; Any transaction conducted through a licensed firearms dealer pursuant to Chapter 5; Any individual licensed as a collector and has a current certificate of eligibility issued by the Department of Justice; The exchange of a handgun where the dealer purchased that firearm from the individual seeking the exchange within the 30 day period immediately preceding the date of exchange or replacement; The replacement of a handgun that was lost or stolen; The return of a handgun to its owner; and A community college certified by the Commission on Peace Officer Standards and Training to present the law enforcement academy basic course or other commission-certified law enforcement training. Prohibits individuals, beginning July 1, 2021, from making applications to purchase more than one handgun within a 30 day period, yet does not apply to the sub-highlights referred to in the previous highlight, in addition to (Sec. 6): The purchase of a firearm, other than a handgun, or a semiautomatic centerfire rifle by an individual possessing a valid, unexpired hunting license issued by the Department of Fish and Wildlife; The purchase of a semiautomatic centerfire rifle by an individual possessing a valid, unexpired hunting license issued by the Department of Fish and Wildlife and a current certificate of eligibility issued by the Department of Justice; The acquisition of a firearm, other than a handgun, or a semiautomatic centerfire rifle at an auction or similar event put on by a nonprofit public benefit or mutual benefit corporation to fund the activities of that corporation or local chapters of that corporation; The acquisition of a semiautomatic centerfire rifle, at an auction or similar event conducted by a nonprofit public benefit or mutual benefit corporation to fund the activities of that corporation or local chapters of that corporation by an individual possessing a valid, unexpired hunting license issued by the Department of Fish and Wildlife, and or a current certificate of eligibility issued by the Department of Justice; and The purchase of a firearm, other than a handgun, by an individual who provides proper identification as an honorably discharged member of the United States Armed Forces, the National Guard, the Air National Guard, or the active reserve components of the United States and has a current certificate of eligibility issued by the Department of Justice. Amends the messages written on block-lettered warnings licensees are required to post within the licensed premises (Sec. 1). Amends the commencement date of Section 27510, which prohibits a licensed individual from selling, supplying, delivering, or giving possession or control of a semiautomatic centerfire rifle to any individual under 21 years of age, to January 1, 2021 (Sec. 3). Expands the categories of individuals under 21 years of age exempt from the aforementioned highlight to include individuals that provide proper identification as an honorably discharged member of the United States Armed Forces, the National Guard, the Air National Guard, or the active reserve components of the United States and have a current certificate of eligibility issued by the Department of Justice, as well as individuals who possess valid, unexpired hunting licenses issued by the Department of Fish and Wildlife and have a current certificate of eligibility issued by the Department of Justice (Sec. 3). Amends the conditions under which a dealer can and cannot deliver a firearm to an individual (Sec. 6). Amends the exceptions to circumstances in which a violation of this article is classified as more than a misdemeanor (Sec. 7)."}