{"status": "OK", "bill": {"bill_id": 1067275, "change_hash": "197167b4c9c04b8e74810d75e8b7c242", "session_id": 1519, "session": {"session_id": 1519, "state_id": 46, "year_start": 2018, "year_end": 2018, "prefile": 0, "sine_die": 1, "prior": 1, "special": 0, "session_tag": "Regular Session", "session_title": "2018 Regular Session", "session_name": "2018 Regular Session"}, "url": "https://legiscan.com/VA/bill/SB967/2018", "state_link": "https://lis.virginia.gov/cgi-bin/legp604.exe?181+sum+SB967", "completed": 0, "status": 1, "status_date": "2018-01-19", "progress": [{"date": "2018-01-19", "event": 1}, {"date": "2018-01-19", "event": 9}], "state": "VA", "state_id": 46, "bill_number": "SB967", "bill_type": "B", "bill_type_id": "1", "body": "S", "body_id": 8, "current_body": "S", "current_body_id": 8, "title": "Electric utility regulation; grid modernization, energy efficiency.", "description": "Electric utility regulation. Provides that, in lieu of the biennial review proceedings previously required, Dominion Energy Virginia (DEV) and Appalachian Power (AEP) will be subject to triennial reviews of their rates, terms, and conditions for generation, distribution, and transmission services. The measure advances the termination of the Transitional Rate Period for DEV by two years, to December 31, 2017. The termination of the Transitional Rate Period for AEP remains December 31, 2017. For DEV, the first review after its Transitional Rate Period will be held in 2021, which is one year earlier than currently scheduled. For AEP, the first review after its Transitional Rate Period will be held in 2020, which is unchanged. In the triennial review proceedings, overearnings that might have been refunded to customers may be reduced by the amounts invested by DEV in certain new solar or wind generation facilities or on electric distribution grid transformation projects. The measure also: (i) excludes from the definition of \"public utility\" for purposes of the Utility Facility Act a company that provides storage of electric energy that is not for sale to the public, if the company is not organized as a public utility; (ii) authorizes an investor-owned electric utility, if a cable operator does not elect to relocate facilities underground when the electric utility relocates its facilities underground, to either convey poles to the cable operator or retain ownership of the poles; (iii) provides that an energy efficiency program proposed by an electric utility is in the public interest if the net present value of the benefits exceeds the net present value of the costs as determined by any three of four benefit cost tests; (iv) establishes a new rate adjustment clause category for electric distribution grid transformation project expenses; (v) increases the amount of capacity of solar generation facilities constructed by a utility that are in the public interest from 50 megawatts to 4,000 megawatts, including rooftop solar installations with a capacity of not less than 50 kilowatts; (vi) declares that the conversion of an investor-owned electric utility's existing overhead distribution tap lines with new underground facilities are cost beneficial and that related costs are reasonable and prudently incurred if the average cost per customer does not exceed $20,000 and the costs per mile do not exceed $750,000; (vii) declares that electric distribution grid transformation projects, offshore wind generation facilities with a capacity of not more than 16 megawatts, and all onshore wind generation facilities are in the public interest and that the costs thereof may be recovered either through a rate adjustment clause or through a customer credit reinvestment offset; (viii) provides that in any triennial review certain costs, including costs for certain meters and costs of coal combustion byproduct management, may be deferred for recovery in future periods; (ix) requires the SCC to enter an order on a petition for approval of a solar generation facility within six months after the petition's filing; and (x) allows utilities to avoid being required to credit customers with 70 percent of the amount of overearnings by applying a customer credit reinvestment offset for expenses on new solar and wind generation facilities and electric distribution grid transformation projects. The provision creating the customer credit reinvestment offset expires on July 1, 2028. The measure also includes enactment clauses that (a) establish a pilot program consisting of the approval of the underground construction of two electrical transmission lines and directs the SCC to approve as a qualifying project a transmission line that appears to track the I-66 Hybrid Route that has been considered in the application of DEV for the Haymarket transmission line project in Prince William County and approve a rate adjustment clause to allow the utility to recover from the utility's Virginia jurisdictional customers the costs of the project; (b) require DEV to provide current customers a one-time bill credit of $133 million; (c) require DEV to roll certain costs associated with the conversion of certain generation facilities to utilize biomass as fuel into its base rates; (d) require reductions in the rates for all incumbent electric utilities to reflect reductions in federal tax liability resulting from the enactment of federal tax legislation; and (e) require DEV and AEP to continue funding for pilot programs for energy assistance and weatherization for low-income, elderly, and disabled individuals. This bill was incorporated into SB 966.", "pending_committee_id": 0, "committee": [], "referrals": [{"date": "2018-01-19", "committee_id": 161, "chamber": "S", "chamber_id": 8, "name": "Commerce and Labor"}, {"date": "2018-02-02", "committee_id": 3889, "chamber": "S", "chamber_id": 8, "name": "Commerce and Labor: Electric Utility"}], "history": [{"date": "2018-01-19", "action": "Presented and ordered printed 18105575D", "chamber": "S", "chamber_id": 8, "importance": 0}, {"date": "2018-01-19", "action": "Referred to Committee on Commerce and Labor", "chamber": "S", "chamber_id": 8, "importance": 1}, {"date": "2018-01-19", "action": "Introduced bill reprinted 18105575D", "chamber": "S", "chamber_id": 8, "importance": 0}, {"date": "2018-02-02", "action": "Assigned C&L sub: Electric Utility", "chamber": "S", "chamber_id": 8, "importance": 0}, {"date": "2018-02-05", "action": "Incorporated by Commerce and Labor ", "chamber": "S", "chamber_id": 8, "importance": 0}], "sponsors": [{"people_id": 790, "person_hash": "tckeabr2", "party_id": "1", "state_id": 46, "party": "D", "role_id": 2, "role": "Sen", "name": "Richard Saslaw", "first_name": "Richard", "middle_name": "L.", "last_name": "Saslaw", "suffix": "", "nickname": "Dick", "district": "SD-035", "ftm_eid": 5704076, "votesmart_id": 5110, "opensecrets_id": "", "knowwho_pid": 199417, "ballotpedia": "Dick_Saslaw", "sponsor_type_id": 1, "sponsor_order": 1, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}], "sasts": [], "subjects": [], "texts": [{"doc_id": 1695040, "date": "2018-01-19", "type": "Introduced", "type_id": 1, "mime": "text/html", "mime_id": 1, "url": "https://legiscan.com/VA/text/SB967/id/1695040", "state_link": "https://lis.virginia.gov/cgi-bin/legp604.exe?181+ful+SB967+hil", "text_size": 138038, "text_hash": "3539ec7bc44e88081111542ea01cbd63"}, {"doc_id": 1695041, "date": "2018-01-19", "type": "Introduced", "type_id": 1, "mime": "text/html", "mime_id": 1, "url": "https://legiscan.com/VA/text/SB967/id/1695041", "state_link": "https://lis.virginia.gov/cgi-bin/legp604.exe?181+ful+SB967+hil", "text_size": 138038, "text_hash": "3539ec7bc44e88081111542ea01cbd63"}], "votes": [{"roll_call_id": 694671, "date": "2018-02-05", "desc": "Senate: Incorporated by Commerce and Labor ", "yea": 13, "nay": 0, "nv": 0, "absent": 0, "total": 13, "passed": 1, "chamber": "S", "chamber_id": 8, "url": "https://legiscan.com/VA/rollcall/SB967/id/694671", "state_link": "https://lis.virginia.gov/cgi-bin/legp604.exe?181+vot+S02V0089+SB0967"}], "amendments": [], "supplements": [], "calendar": [{"type_id": 1, "type": "Hearing", "date": "2018-02-05", "time": "00:00", "location": "", "description": "Senate Committee on Commerce and Labor Hearing"}]}}