{"status": "OK", "bill": {"bill_id": 1313458, "change_hash": "22c7b7e20b2f421e0edc70bde0a11924", "session_id": 1718, "session": {"session_id": 1718, "state_id": 46, "year_start": 2020, "year_end": 2020, "prefile": 0, "sine_die": 1, "prior": 1, "special": 0, "session_tag": "Regular Session", "session_title": "2020 Regular Session", "session_name": "2020 Regular Session"}, "url": "https://legiscan.com/VA/bill/HB1677/2020", "state_link": "https://lis.virginia.gov/cgi-bin/legp604.exe?201+sum+HB1677", "completed": 0, "status": 1, "status_date": "2020-01-17", "progress": [{"date": "2020-01-17", "event": 1}, {"date": "2020-01-17", "event": 9}], "state": "VA", "state_id": 46, "bill_number": "HB1677", "bill_type": "B", "bill_type_id": "1", "body": "H", "body_id": 7, "current_body": "H", "current_body_id": 7, "title": "Electric utility regulation; retail customer choice.", "description": "Electric utility regulation; retail customer choice. Replaces the Virginia Electric Utility Regulation Act with a system under which retail customers will be able to purchase electricity from the retail electric provider of their choice. The measure requires each incumbent investor-owned utility, electric cooperative, and municipal electric authority by January 10, 2021, to file with the State Corporation Commission a plan by which it will separate its customer energy services business activities that are otherwise also already widely available in the competitive market from its regulated utility activities by September 1, 2021, and to separate its business activities into an electric distribution utility, an electric transmission utility, a power generation company, and a retail electric provider, or into a single electric transmission and distribution utility, by January 1, 2022. Such separation may be accomplished by creating separate investor-owned companies, cooperatives, or municipal electric authorities or through the sale of assets to a third party. The measure provides consumer safeguards, including requirements that a retail customer have the right to choose a retail electric provider and to have access to providers of energy efficiency services, to on-site distributed generation, and to providers of energy generated by renewable energy resources. When customer choice commences, a retail electric provider that is serving a retail customer on December 31, 2021, may continue to serve that customer until the customer chooses service from a different retail electric provider. If the Commission determines that a region served by an incumbent electric utility is unable to offer fair competition and reliable service to all retail customer classes on January 1, 2022, the measure requires the Commission to delay customer choice for the region. The Commission may use pilot projects to evaluate the ability of each region served by an incumbent electric utility to implement customer choice. After January 1, 2022, an incumbent electric utility may not sell electricity or otherwise participate in the market for electricity except for the purpose of buying electricity to serve its own needs or while competition for the region served by the utility is delayed. The measure requires the Commission to designate, through a bid process or other method, retail electric providers to serve as providers of last resort, which will be required to offer a customer retail service at a rate approved by the Commission. Metering services will be provided by an area's incumbent electric utility or the electric distribution utility separated from the incumbent electric utility. Each electric distribution utility is required to bill a customer's retail electric provider for non-bypassable delivery charges equal to the sum of electric utility charges by customer class based on a forecasted 2022 test year and the generic customer classes and generic rate design established by the Commission and a system benefit fund fee. The system benefit fund fee will be allocated to retail electric customers on the basis of the amount of kilowatt hours used and will be set by the Commission in an amount to cover the costs of customer education programs, a percentage of income payment plan, weatherization programs, and energy efficiency programs. The measure requires electric distribution utilities to deploy advanced metering and meter information networks for all of their residential customers and nonresidential customers within three years after the start date of customer choice, the costs of which shall be recovered by a non-bypassable surcharge. The measure authorizes the Commission to mitigate market power abuses associated with the transmission, distribution, and sale of electricity. The measure requires the Commission to establish by March 1, 2021, an independent distribution system operator (IDSO) that will operate and plan the distribution systems of all electric distribution utilities and perform other duties, including ensuring open access to the distribution systems for all buyers and sellers of electricity on nondiscriminatory terms. The IDSO's costs will be recovered through a reasonable and competitively neutral rate or fee that is within a range determined by the Commission. Distribution utilities are required to transfer the management and control of their distribution system assets to the IDSO and to observe the IDSO's policies, rules, guidelines, and procedures. By January 1, 2021, each electric utility is required to file proposed tariffs for its open-access distribution service, and the Commission is required to set tariffs for electric utility services and the system benefit fund fee for each utility by January 1, 2022. The rates are required to afford the utility a reasonable opportunity to recover its reasonable costs and a reasonable rate of return, fairly allocate the utility's costs among customers, and provide an appropriate price signal to customers with respect to renewable energy. The measure requires incumbent retail electric providers to make available from January 1, 2022, until January 1, 2027, \"price to beat rates\" to residential and small commercial retail electric customers in its former service area that are six percent less than the incumbent electric utility's corresponding average rates that were in effect on January 1, 2019, adjusted to reflect the wholesale power cost basis. Incumbent retail electric providers are prohibited from charging these customers rates that are different from the price to beat until the earlier of 36 months after the date customer choice is introduced or the date that at least 40 percent of the electric power consumed in the utility's service area before customer choice is committed to be served by independent retail electric providers. The measure requires that retail electric providers be certified by the Commission and that aggregators register with the Commission. The measure establishes a Percentage of Income Payment Plan (PIPP) providing financial assistance for residential customers whose household income is at or below 150 percent of the federal nonfarm poverty level. Under the PIPP, the level of payment responsibility to be borne by an eligible customer is based on a percentage of the customer's income. Participants in the PIPP will receive a monthly credit for the amount by which the participant's actual monthly bill for electric service or the statewide average monthly bill amount for that month, whichever is less, exceeds 10 percent of the participant's monthly household income if the participant's residence's primary source of space heating is electricity or six percent of the participant's monthly household income if the participant's residence's primary source of space heating is natural gas or propane. The Commission is also required to establish and implement a home weatherization program. The measure requires the IDSO to identify the achievable cost-effective energy efficiency potential for each electric distribution utility service area in the Commonwealth and, if it determines that an electric distribution utility service area has achievable cost-effective energy efficiency potential, to issue a solicitation for bids from persons to develop and implement energy efficiency programs that achieve this potential. The measure authorizes any distributed electricity generation owner to connect distributed electricity generation to an electric distribution utility system and authorizes a retail electric provider to contract with a distributed electricity generation owner to provide that surplus electricity produced by distributed electricity generation is made available for sale to the retail electric provider and that the net value of that surplus electricity valued at the energy price at the location of the distributed electricity generator is credited to the distributed electricity generation owner. The measure provides that electric authorities and municipalities that provide electric transmission or distribution service are subject to the jurisdiction of the Commission. The measure recasts the Commission on Electric Utility Regulation as the Commission on Energy Reform and extends its sunset until July 1, 2022. The measure eliminates the requirement that the Commission find that a utility's proposed construction of a new generation facility of 100 megawatts or more is necessary to enable the utility to furnish reasonably adequate service and facilities at reasonable and just rates. The measure retains net energy metering programs with provisions that revise the compensation structure for the energy produced by distributed customer-generators to implement time-based and location-based market prices. The measure provides that a person that sells electric energy generated from an onsite distributed electric generation facility to a customer pursuant to a third-party power purchase agreement or distributed electric generation lease agreement is not a public service corporation. The measure repeals the provisions establishing requirements for the filing of integrated resources plans by electric utilities.", "pending_committee_id": 4178, "committee": {"committee_id": 4178, "chamber": "H", "chamber_id": 7, "name": "Labor and Commerce"}, "referrals": [{"date": "2020-01-17", "committee_id": 4178, "chamber": "H", "chamber_id": 7, "name": "Labor and Commerce"}, {"date": "2020-01-21", "committee_id": 4183, "chamber": "H", "chamber_id": 7, "name": "Labor and Commerce: Subcommittee #3"}, {"date": "2020-02-04", "committee_id": 4178, "chamber": "H", "chamber_id": 7, "name": "Labor and Commerce"}], "history": [{"date": "2020-01-17", "action": "Presented and ordered printed 20104977D", "chamber": "H", "chamber_id": 7, "importance": 0}, {"date": "2020-01-17", "action": "Referred to Committee on Labor and Commerce", "chamber": "H", "chamber_id": 7, "importance": 1}, {"date": "2020-01-21", "action": "Assigned L & C sub: Subcommittee #3", "chamber": "H", "chamber_id": 7, "importance": 0}, {"date": "2020-01-30", "action": "Subcommittee recommends continuing to 2021 by voice vote", "chamber": "H", "chamber_id": 7, "importance": 0}, {"date": "2020-02-04", "action": "Continued to 2021 in Labor and Commerce by voice vote", "chamber": "H", "chamber_id": 7, "importance": 0}], "sponsors": [{"people_id": 1471, "person_hash": "z81xcdd3", "party_id": "1", "state_id": 46, "party": "D", "role_id": 1, "role": "Rep", "name": "Mark Keam", "first_name": "Mark", "middle_name": "L.", "last_name": "Keam", "suffix": "", "nickname": "", "district": "HD-035", "ftm_eid": 1359222, "votesmart_id": 111170, "opensecrets_id": "", "knowwho_pid": 282951, "ballotpedia": "Mark_Keam", "sponsor_type_id": 1, "sponsor_order": 1, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 758, "person_hash": "to1pk179", "party_id": "2", "state_id": 46, "party": "R", "role_id": 1, "role": "Rep", "name": "Lee Ware", "first_name": "Lee", "middle_name": "", "last_name": "Ware", "suffix": "Jr.", "nickname": "", "district": "HD-065", "ftm_eid": 6572453, "votesmart_id": 15440, "opensecrets_id": "", "knowwho_pid": 199487, "ballotpedia": "Lee_Ware", "sponsor_type_id": 1, "sponsor_order": 2, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}], "sasts": [], "subjects": [], "texts": [{"doc_id": 2102723, "date": "2020-01-17", "type": "Introduced", "type_id": 1, "mime": "text/html", "mime_id": 1, "url": "https://legiscan.com/VA/text/HB1677/id/2102723", "state_link": "https://lis.virginia.gov/cgi-bin/legp604.exe?201+ful+HB1677+hil", "text_size": 586992, "text_hash": "0a204bf6d4bc33ea989494f702ac3359"}], "votes": [], "amendments": [], "supplements": [], "calendar": [{"type_id": 1, "type": "Hearing", "date": "2020-01-23", "time": "00:00", "location": "House Committee Room", "description": "House Labor and Commerce - Subcommittee #3 Committee Hearing"}, {"type_id": 1, "type": "Hearing", "date": "2020-01-30", "time": "00:00", "location": "House Committee Room", "description": "House Labor and Commerce - Subcommittee #3 Committee Hearing"}, {"type_id": 1, "type": "Hearing", "date": "2020-02-04", "time": "00:00", "location": "House Committee Room", "description": "House Labor and Commerce Committee Hearing"}]}}