{"status": "OK", "bill": {"bill_id": 1549948, "change_hash": "1d9fc3dd1717656de0e28ea2b4563290", "session_id": 1955, "session": {"session_id": 1955, "state_id": 14, "year_start": 2022, "year_end": 2022, "prefile": 0, "sine_die": 1, "prior": 0, "special": 0, "session_tag": "Regular Session", "session_title": "2022 Regular Session", "session_name": "2022 Regular Session"}, "url": "https://legiscan.com/IN/bill/SB0314/2022", "state_link": "http://iga.in.gov/legislative/2022/bills/senate/314/", "completed": 0, "status": 1, "status_date": "2022-01-11", "progress": [{"date": "2022-01-11", "event": 1}, {"date": "2022-01-11", "event": 9}], "state": "IN", "state_id": 14, "bill_number": "SB0314", "bill_type": "B", "bill_type_id": "1", "body": "S", "body_id": 38, "current_body": "S", "current_body_id": 38, "title": "Net metering for electricity generation.", "description": "Net metering for electricity generation. Amends the statute concerning distributed electricity generation as follows: (1) Repeals provisions requiring an electricity supplier's net metering tariff to remain available to customers until the earlier of: (A) January 1 of the first calendar year after the calendar year in which the aggregate amount of net metering facility nameplate capacity under the electricity supplier's net metering tariff equals at least 1.5% of the electricity supplier's most recent summer peak load; or (B) July 1, 2022. (2) Repeals provisions requiring an electricity supplier to: (A) petition the Indiana utility regulatory commission (IURC) for a rate for the procurement of excess distributed generation produced by customers owning a distributed generation facility; and (B) credit, at the approved rate, customers for excess distributed generation supplied to the electricity supplier. (3) Provides that an electricity supplier's net metering tariff must be made and remain available to customers at least until January 1 of the first calendar year after the calendar year in which the aggregate amount of net metering facility nameplate capacity under the electricity supplier's net metering tariff equals at least 5% (versus 1.5% under current law) of the electricity supplier's most recent summer peak load. (4) Requires an electricity supplier to petition, before July 1, 2022, the IURC for approval of a new or amended net metering tariff that does the following: (A) Provides that the aggregate amount of net metering facility nameplate capacity made available for participation by customers under the net metering tariff is at least 5% of the electricity supplier's most recent summer peak load. (B) Provides that the minimum net metering facility nameplate capacity made available is subject to the reservation of: (i) 30% (versus 40% under current law) for participation by residential customers; and (ii) not more than 5% (versus 15% under current law) for participation by customers that install a net metering facility that uses organic waste biomass. (5) Provides that before July 1, 2022, the IURC shall make similar amendments to its net metering rules. (6) Provides that a customer that installs a net metering facility on the customer's premises before the net metering tariff of the customer's electricity supplier terminates under the bill's provisions shall continue to be served under the net metering tariff until the customer removes from the customer's premises or replaces the net metering facility. (Current law requires the customer to continue to be served under the net metering tariff until: (A) the customer removes or replaces the net metering facility; or (B) either July 1, 2032, or July 1, 2047, depending on the date of installation; whichever is earlier.) Specifies that any repairs, updates, or upgrades to portions of a net metering facility that do not increase the nameplate capacity of the net metering facility are not considered a replacement of the net metering facility for purposes of these provisions. (7) Makes conforming changes in other provisions of the statute. Adds a noncode provision to address electricity suppliers that have applied for approval, or received approval, for an excess distributed generation rate or tariff from the IURC under current law, and to require: (1) the IURC to: (A) close any pending proceeding for an electricity supplier that has not yet received approval for an excess distributed generation rate or tariff; and (B) direct the electricity supplier to file a petition with the IURC for approval of a new or amended net metering tariff, as required under the bill; and (2) an electricity supplier that has been granted approval by the IURC of an excess distributed generation rate and tariff to file with the IURC, not later than 30 days after the enactment of the bill, a petition for approval of a new or amended net metering tariff, as required under the bill.", "pending_committee_id": 2722, "committee": {"committee_id": 2722, "chamber": "S", "chamber_id": 38, "name": "Utilities"}, "referrals": [{"date": "2022-01-11", "committee_id": 2722, "chamber": "S", "chamber_id": 38, "name": "Utilities"}], "history": [{"date": "2022-01-11", "action": "Authored by Senator Yoder", "chamber": "S", "chamber_id": 38, "importance": 0}, {"date": "2022-01-11", "action": "First reading: referred to Committee on Utilities", "chamber": "S", "chamber_id": 38, "importance": 1}, {"date": "2022-01-20", "action": "Senator Ford J.D. added as coauthor", "chamber": "S", "chamber_id": 38, "importance": 0}], "sponsors": [{"people_id": 22087, "person_hash": "dcvlp4vo", "party_id": "1", "state_id": 14, "party": "D", "role_id": 2, "role": "Sen", "name": "Shelli Yoder", "first_name": "Shelli", "middle_name": "", "last_name": "Yoder", "suffix": "", "nickname": "", "district": "SD-040", "ftm_eid": 17657992, "votesmart_id": 135982, "opensecrets_id": "", "knowwho_pid": 395644, "ballotpedia": "Shelli_Yoder", "sponsor_type_id": 1, "sponsor_order": 1, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 19709, "person_hash": "1h70mo1k", "party_id": "1", "state_id": 14, "party": "D", "role_id": 2, "role": "Sen", "name": "J.D. Ford", "first_name": "J.D.", "middle_name": "", "last_name": "Ford", "suffix": "", "nickname": "", "district": "SD-029", "ftm_eid": 44857990, "votesmart_id": 178147, "opensecrets_id": "", "knowwho_pid": 484114, "ballotpedia": "J.D._Ford", "sponsor_type_id": 2, "sponsor_order": 2, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}], "sasts": [], "subjects": [], "texts": [{"doc_id": 2469310, "date": "2022-01-10", "type": "Introduced", "type_id": 1, "mime": "application/pdf", "mime_id": 2, "url": "https://legiscan.com/IN/text/SB0314/id/2469310", "state_link": "http://iga.in.gov/static-documents/6/2/7/3/6273a76f/SB0314.01.INTR.pdf", "text_size": 265479, "text_hash": "7e36c0034e5cd879a7626ddce6512a59"}], "votes": [], "amendments": [], "supplements": [{"supplement_id": 221086, "date": "2022-01-10", "type": "Fiscal Note", "type_id": 1, "title": "Fiscal Note", "description": "Fiscal Note #1: Introduced Senate Bill (S)", "mime": "application/pdf", "mime_id": 2, "url": "https://legiscan.com/IN/supplement/SB0314/id/221086", "state_link": "http://iga.in.gov/static-documents/3/3/6/a/336afaff/SB0314.01.INTR.FN001.pdf", "supplement_size": 77020, "supplement_hash": "d7370fdf8f8efa29d8ce430b986f9d8a"}], "calendar": []}}