{"status": "OK", "bill": {"bill_id": 199789, "change_hash": "9e4642364ad6051719c6fe63e21df158", "session_id": 77, "session": {"session_id": 77, "state_id": 52, "year_start": 2009, "year_end": 2010, "prefile": 0, "sine_die": 1, "prior": 1, "special": 0, "session_tag": "Regular Session", "session_title": "2009-2010 Regular Session", "session_name": "111th Congress"}, "url": "https://legiscan.com/US/bill/HR5/2009", "state_link": "https://www.congress.gov/bill/111th-congress/house-resolution/5/all-info", "completed": 0, "status": 1, "status_date": "2009-01-06", "progress": [{"date": "2009-01-06", "event": 1}], "state": "US", "state_id": 52, "bill_number": "HR5", "bill_type": "R", "bill_type_id": "2", "body": "H", "body_id": 114, "current_body": "H", "current_body_id": 114, "title": "Adopting rules for the One Hundred Eleventh Congress.", "description": "Adopts the Rules of the House of Representatives for the 110th Congress as the Rules for the 111th Congress, with amendments. (Sec. 2) Amends Rule II (Other Officers and Officials) to require the House Inspector General to provide investigative and advisory services to the House and joint entities in a manner consistent with government-wide standards. Amends Rule X (Organization of Committee) to require the Committee on Homeland Security to review and study on a primary and continuing basis all government activities, programs, and organizations related to homeland security that fall within its primary legislative jurisdiction. Requires the Committee on House Administration to oversee the management of services provided to the House by the Architect of the Capitol (AOC), except those that lie within the jurisdiction of the Committee on Transportation and Infrastructure. Allows a Member to exceed the tenure limitation for Members on the Budget Committee if elected to serve a second consecutive Congress as the chair or as the ranking minority member. Eliminates the term limit for all committee and subcommittee chairs and ranking minority members. Amends Rule XV (Business in Order on Special Days) to require a committee's chair or other authorized member to announce to the House a request for the Call of the Calendar Wednesday on the preceding legislative day. Makes a conforming amendment to Rule XIII (Calendars and Committee Reports). Amends Rule XIX (Motions Following the Amendment Stage) to authorize the Chair to postpone further consideration of a measure to a time designated by the Speaker when the previous question is operating to adoption or passage of such measure pursuant to a special rule in the House. Permits a motion to recommit a bill or joint resolution to include instructions only in the form of a direction to report an amendment or amendments back to the House forthwith (that is, the House must report on the amended measure within minutes). Amends Rule XX (Voting and Quorum Calls) to repeal the prohibition against, and thus allow, holding open a record vote by electronic device for the sole purpose of reversing the vote's outcome. Amends Rule XXI (Restrictions on Certain Bills) to make it out of order to consider any conference report to accompany a regular general appropriation bill unless the joint explanatory statement includes: (1) a list of congressional earmarks, limited tax benefits, and limited tariff benefits in the conference report or joint statement (and the name of any requesting Member, Delegate, Resident Commissioner, or Senator) that were neither committed to the conference committee by either chamber nor in a report of a committee of either chamber on such bill or on a companion measure; or (2) a statement that the proposition contains no congressional earmarks, limited tax benefits, or limited tariff benefits. Revises the Pay-As-You Go (PAYGO) rules of the House with respect to Congressional Budget Office (CBO) baselines (in order to align the rules with Senate rules so that both chambers use the same CBO baselines). Allows one House-passed measure to pay for spending in a separate House-passed measure if the two are linked at the engrossment stage. Allows for emergency exceptions to PAYGO for provisions designated as emergency spending in a bill, a joint resolution, an amendment made in order as original text by a special order of business, a conference report, or an amendment between the chambers. Requires the Chair to put the question of consideration with respect to such a provision. Requires a PAYGO evaluation of any other amendments to a bill or joint resolution to disregard any designation of emergency. Amends Rule XXVII (Disclosure by Members and Staff of Employment Negotiations) to revise the requirement that Members of Congress disclose negotiations for post-congressional employment by repealing the termination of such requirement upon the election of the Member's successor. Extends such disclosure requirement until the end of the departing Member's term. Replaces masculine references in the Rules of the House with gender neutral references. (Sec. 3) Continues from the 110th Congress certain similar budget-related separate orders. Increases from six to seven the maximum number of subcommittees authorized for the Committee on Armed Services. Maintains at a maximum of: (1) seven the number of subcommittees authorized for the Committee on Foreign Affairs; and (2) six the number of subcommittees authorized for the Committee on Transportation and Infrastructure. Prohibits the House from providing access to any exercise facility available exclusively to Members and former Members, officers and former officers, and their spouses to any former Member, former officer, or spouse who is a registered lobbyist or agent of a foreign principal. Reserves H.B. 1 through H.B. 10 for assignment by the Speaker. Declares that certain accelerated legislative procedures required by the Medicare Prescription Drug, Improvement, and Modernization Act of 2003 (MPDIMA) for a presidential legislative proposal in response to a Medicare funding warning shall not apply during the 111th Congress. (The MPDIMA requires, in the event that 45% or more of Medicare&#146;s funding comes from general tax revenues for two years in a row, that the president submit, and Congress debate, legislation to slow spending.) (Sec. 4) Establishes the House Select Committee on Energy Independence and Global Warming. Continues: (1) the House Democracy Assistance Commission; (2) the Tom Lantos Human Rights Commission; (3) the Office of Congressional Ethics (treating such Office as a standing committee for purposes of hiring consultants); (4) the Empanelling Investigative Subcommittee of the Committee on Standards of Official Conduct; and (5) certain authorities of the Committee on the Judiciary and the Office of General Counsel with respect to the civil action Committee on the Judiciary v. Harriet Meirs et al. (Sec. 5) Sets forth the rule for consideration of H.B. 11 (Lilly Ledbetter Fair Pay Act) and H.B. 12 (Paycheck Fairness Act).", "pending_committee_id": 0, "committee": [], "referrals": [], "history": [{"date": "2009-01-06", "action": "Considered as privileged matter. (consideration: CR H6-20)", "chamber": "", "chamber_id": 0, "importance": 0}, {"date": "2009-01-06", "action": "DEBATE - The House proceeded with one hour of debate on H. Res. 5.", "chamber": "", "chamber_id": 0, "importance": 0}, {"date": "2009-01-06", "action": "The previous question was ordered without objection. (consideration: CR H19)", "chamber": "", "chamber_id": 0, "importance": 0}, {"date": "2009-01-06", "action": "Mr. Dreier moved to commit with instructions to a Select Committee. (consideration: CR H19-20; text: CR H19)", "chamber": "", "chamber_id": 0, "importance": 0}, {"date": "2009-01-06", "action": "The previous question on the motion to commit was ordered without objection. (consideration: CR H19-20)", "chamber": "", "chamber_id": 0, "importance": 0}, {"date": "2009-01-06", "action": "On motion to commit with instructions Failed by the Yeas and Nays: 174 - 249 (Roll No. 3).", "chamber": "", "chamber_id": 0, "importance": 0}, {"date": "2009-01-06", "action": "On agreeing to the resolution Agreed to by the Yeas and Nays: 242 - 181 (Roll no. 4). (text: CR H6-10)", "chamber": "", "chamber_id": 0, "importance": 0}, {"date": "2009-01-06", "action": "Motion to reconsider laid on the table Agreed to without objection.", "chamber": "", "chamber_id": 0, "importance": 0}, {"date": "2009-01-06", "action": "H. Res.5 provides one hour of debate each for H.R. 11 and H.R. 12. Both bills are to be considered in the House. Both H.R. 11 and H.R. 12 are considered read and are closed to amendments. After passage of both H.R. 11 and H.R. 12, the text of H.R. 12 shall be appended at the end of H.R. 11 as new matter and H.R. 12 shall be laid on the table.", "chamber": "", "chamber_id": 0, "importance": 0}], "sponsors": [{"people_id": 9065, "person_hash": "2on8y3dn", "party_id": "1", "state_id": 52, "party": "D", "role_id": 1, "role": "Rep", "name": "Steny Hoyer", "first_name": "Steny", "middle_name": "H.", "last_name": "Hoyer", "suffix": "", "nickname": "", "district": "HD-MD-5", "ftm_eid": 5702081, "votesmart_id": 26890, "opensecrets_id": "N00001821", "knowwho_pid": 158889, "ballotpedia": "Steny_Hoyer", "sponsor_type_id": 0, "sponsor_order": 0, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}], "sasts": [{"type_id": 8, "type": "Related", "sast_bill_number": "HB11", "sast_bill_id": 194557}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB12", "sast_bill_id": 194558}], "subjects": [{"subject_id": 13525, "subject_name": "Congress"}, {"subject_id": 13131, "subject_name": "Air quality"}, {"subject_id": 13134, "subject_name": "Appropriations"}, {"subject_id": 13503, "subject_name": "Budget deficits and national debt"}, {"subject_id": 13138, "subject_name": "Budget process"}, {"subject_id": 13143, "subject_name": "Climate change"}, {"subject_id": 13677, "subject_name": "Congressional committees"}, {"subject_id": 13466, "subject_name": "Congressional operations and organization"}, {"subject_id": 13146, "subject_name": "Congressional oversight"}, {"subject_id": 13177, "subject_name": "Employment discrimination and employee rights"}, {"subject_id": 13520, "subject_name": "Energy storage, supplies, demand"}, {"subject_id": 13184, "subject_name": "Executive agency funding and structure"}, {"subject_id": 13367, "subject_name": "General taxation matters"}, {"subject_id": 13198, "subject_name": "Government employee pay, benefits, personnel management"}, {"subject_id": 13199, "subject_name": "Government ethics and transparency, public corruption"}, {"subject_id": 13201, "subject_name": "Government investigations"}, {"subject_id": 14003, "subject_name": "House Committee on Armed Services"}, {"subject_id": 14004, "subject_name": "House Committee on Foreign Affairs"}, {"subject_id": 13901, "subject_name": "House Committee on House Administration"}, {"subject_id": 14005, "subject_name": "House Committee on Transportation and Infrastructure"}, {"subject_id": 13590, "subject_name": "House of Representatives"}, {"subject_id": 13402, "subject_name": "Human rights"}, {"subject_id": 13342, "subject_name": "Lawyers and legal services"}, {"subject_id": 13591, "subject_name": "Legislative rules and procedure"}, {"subject_id": 13242, "subject_name": "Medicare"}, {"subject_id": 13588, "subject_name": "Members of Congress"}, {"subject_id": 13652, "subject_name": "Public participation and lobbying"}, {"subject_id": 13326, "subject_name": "Sex, gender, sexual orientation discrimination"}, {"subject_id": 13665, "subject_name": "Sports and recreation facilities"}, {"subject_id": 13678, "subject_name": "Tariffs"}, {"subject_id": 13297, "subject_name": "Wages and earnings"}], "texts": [{"doc_id": 480978, "date": "2010-11-27", "type": "Introduced", "type_id": 1, "mime": "application/pdf", "mime_id": 2, "url": "https://legiscan.com/US/text/HR5/id/480978", "state_link": "https://www.congress.gov/111/bills/hres5/BILLS-111hres5eh.pdf", "text_size": 157828, "text_hash": "22645a930c10e6286987776c47d8c162"}], "votes": [], "amendments": [], "supplements": [], "calendar": []}}