{"status": "OK", "bill": {"bill_id": 202194, "change_hash": "062ea21f89132e71485e8c0078fe8278", "session_id": 77, "session": {"session_id": 77, "state_id": 52, "year_start": 2009, "year_end": 2010, "prefile": 0, "sine_die": 1, "prior": 1, "special": 0, "session_tag": "Regular Session", "session_title": "2009-2010 Regular Session", "session_name": "111th Congress"}, "url": "https://legiscan.com/US/bill/SB1631/2009", "state_link": "https://www.congress.gov/bill/111th-congress/senate-bill/1631/all-info", "completed": 0, "status": 1, "status_date": "2009-08-06", "progress": [{"date": "2009-08-06", "event": 1}, {"date": "2009-08-06", "event": 9}], "state": "US", "state_id": 52, "bill_number": "SB1631", "bill_type": "B", "bill_type_id": "1", "body": "S", "body_id": 115, "current_body": "S", "current_body_id": 115, "title": "Customs Facilitation and Trade Enforcement Reauthorization Act of 2009", "description": "Customs Facilitation and Trade Enforcement Reauthorization Act of 2009 - Establishes in the Department of Homeland Security (DHS) the U.S. Customs and Border Protection Agency (CBP Agency), which shall be headed by a Commissioner of U.S. Customs and Border Protection.  Amends the Homeland Security Act of 2002 to transfer all functions of the U.S. Customs and Border Protection (CBP) of DHS (formerly the U.S. Customs Service) to the CBP Agency. Establishes within the Agency an Office of Trade. Transfers all functions of the CBP Office of International Trade and the Office of International Affairs to the Office of Trade. Directs the Commissioner to appoint within the Office of Trade a Trade Advocate. Transfers all functions of the CBP Office of Trade Relations to the Office of Trade. Establishes within the Office of Field Operations of the CBP Agency a Customs Facilitation and Trade Enforcement Division. Directs the Commissioner to designate at least 40 Commercial Enforcement Officers within the Office. Establishes an interagency Customs Review Board to review changes to U.S. customs regulations, interpretations, or practices that are proposed or may be adopted by the CBP Agency. Establishes in the DHS the U.S. Immigration and Customs Enforcement Agency (ICE Agency). Establishes the position of Chief of Policy and Strategy for the ICE Agency. Amends the Customs and Trade Act of 1990 to direct the Commissioner and the Director of Trade Policy to develop jointly every two years, and submit to specified congressional committees, a Joint Strategic Plan for enforcing U.S. customs and trade laws. Directs the DHS Secretary, acting through the Commissioner, to develop additional trade benefits for Tier 1, Tier 2, and Tier 3 participants in the Customs-Trade Partnership Against Terrorism program. Amends the Tariff Act of 1930 to direct the Commissioner to establish a voluntary Customs Facilitation Partnership Program to facilitate the entry of merchandise into the United States and provide certain trade benefits to importers that meet or exceed certain minimum program requirements. Directs the Secretary of the Treasury and the DHS Secretary jointly to establish a Commercial Customs Operations Advisory Committee. Amends the Consolidated Omnibus Budget Reconciliation Act of 1985 (COBRA) to require the deposit of $325 million from collected customs user fees into the Customs Commercial and Homeland Security Automation Account to complete development of the Automated Commercial Environment computer system. Directs the Secretary of DHS to establish within the CBP Agency Office of Trade a Commercial Targeting Division to conduct commercial risk assessment targeting and, when needed, issue trade alerts with respect to cargo destined for the United States. Directs the Commissioner and the Director jointly to develop and update, and report to Congress, a strategy for uniform enforcement of U.S. illegal drug control laws. Directs the DHS Secretary to establish a program to assign importer of record numbers. Establishes an interagency Import Safety Working Group. Directs the DHS Secretary to develop a Joint Import Safety Rapid Response Plan that sets forth protocols for the CBP Agency to coordinate federal responses to cargo entering the United States that poses a threat to the health or safety of U.S. consumers. Directs the DHS Secretary to establish within the ICE Agency a National Intellectual Property Rights Coordination Center to coordinate U.S. activities to prevent the import and export of goods that infringe intellectual property rights. Revises eligibility requirements for the drawback (refund) of duties paid on eligible merchandise imported into the United States and later exported. Prescribes or revises requirements for: (1) penalties for a custom broker convicted of committing an act of terrorism; (2) duty-free treatment of imported articles exported and reimported without having been advanced in value or improved in condition; and (3) assignment of CBP Agency employees to perform customs services for charter flight passengers and their baggage. Directs the President to establish a pilot program for designating 24-hour commercial land border ports of entry on the northern and southern U.S. borders. Extends the prohibition against the importation of goods made with convict, forced, or indentured labor to include goods made by means of coercion (i.e., an employer withholding the passport of a foreign worker to compel production of the good) or by one or more individuals who were being subjected to human trafficking. Establishes within the ICE Agency an Office for Labor Enforcement. Requires the Commissioner to ensure that appropriate CBP Agency resources address concerns that honey as well as contraband archaeological or ethnological material is being imported into the United States in violation of U.S. customs laws. Increases from $200 to $500 the retail value of articles that may be imported duty-free into the United States by one person on one day. Requires the Secretary of the Treasury to prescribe regulations for the entry of merchandise valued between $250 and $2,500.", "pending_committee_id": 0, "committee": [], "referrals": [], "history": [{"date": "2009-08-06", "action": "Read twice and referred to the Committee on Finance.", "chamber": "", "chamber_id": 0, "importance": 1}, {"date": "2009-08-07", "action": "Sponsor introductory remarks on measure. (CR S9075)", "chamber": "", "chamber_id": 0, "importance": 0}, {"date": "2009-10-20", "action": "Committee on Finance. Hearings held. Hearings printed: S.Hrg. 111-971.", "chamber": "", "chamber_id": 0, "importance": 0}], "sponsors": [{"people_id": 9439, "person_hash": "98vpht77", "party_id": "1", "state_id": 52, "party": "D", "role_id": 2, "role": "Sen", "name": "Max Baucus", "first_name": "Max", "middle_name": "", "last_name": "Baucus", "suffix": "", "nickname": "", "district": "SD-MT", "ftm_eid": 0, "votesmart_id": 53315, "opensecrets_id": "N00004643", "knowwho_pid": 165243, "ballotpedia": "Max_Baucus", "sponsor_type_id": 0, "sponsor_order": 0, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 9484, "person_hash": "1zy2f3m5", "party_id": "2", "state_id": 52, "party": "R", "role_id": 2, "role": "Sen", "name": "Chuck Grassley", "first_name": "Chuck", "middle_name": "", "last_name": "Grassley", "suffix": "", "nickname": "", "district": "SD-IA", "ftm_eid": 6338995, "votesmart_id": 53293, "opensecrets_id": "N00001758", "knowwho_pid": 165215, "ballotpedia": "Chuck_Grassley", "sponsor_type_id": 0, "sponsor_order": 0, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}], "sasts": [], "subjects": [{"subject_id": 13126, "subject_name": "Administrative law and regulatory procedures"}, {"subject_id": 13127, "subject_name": "Advisory bodies"}, {"subject_id": 13135, "subject_name": "Aviation and airports"}, {"subject_id": 13136, "subject_name": "Border security and unlawful immigration"}, {"subject_id": 13452, "subject_name": "Competitiveness, trade promotion, trade deficits"}, {"subject_id": 13146, "subject_name": "Congressional oversight"}, {"subject_id": 13147, "subject_name": "Consumer affairs"}, {"subject_id": 13157, "subject_name": "Department of Homeland Security"}, {"subject_id": 13165, "subject_name": "Department of the Treasury"}, {"subject_id": 13345, "subject_name": "Drug trafficking and controlled substances"}, {"subject_id": 13177, "subject_name": "Employment discrimination and employee rights"}, {"subject_id": 13184, "subject_name": "Executive agency funding and structure"}, {"subject_id": 13521, "subject_name": "Food supply, safety, and labeling"}, {"subject_id": 13743, "subject_name": "Free trade and trade barriers"}, {"subject_id": 13200, "subject_name": "Government information and archives"}, {"subject_id": 13547, "subject_name": "Historical and cultural resources"}, {"subject_id": 13614, "subject_name": "Intellectual property"}, {"subject_id": 13234, "subject_name": "Labor standards"}, {"subject_id": 13317, "subject_name": "Smuggling and trafficking"}, {"subject_id": 13678, "subject_name": "Tariffs"}, {"subject_id": 13431, "subject_name": "Terrorism"}, {"subject_id": 13416, "subject_name": "Trade restrictions"}, {"subject_id": 13648, "subject_name": "User charges and fees"}, {"subject_id": 20709, "subject_name": ""}], "texts": [{"doc_id": 415230, "date": "2010-11-27", "type": "Introduced", "type_id": 1, "mime": "application/pdf", "mime_id": 2, "url": "https://legiscan.com/US/text/SB1631/id/415230", "state_link": "https://www.congress.gov/111/bills/s1631/BILLS-111s1631is.pdf", "text_size": 386691, "text_hash": "3ee80268187644b1c93fa4087eeaad0b"}], "votes": [], "amendments": [], "supplements": [], "calendar": []}}