{"status": "OK", "bill": {"bill_id": 346083, "change_hash": "8504d0757aaa8919670d5e866f9f4c82", "session_id": 84, "session": {"session_id": 84, "state_id": 52, "year_start": 2011, "year_end": 2012, "prefile": 0, "sine_die": 1, "prior": 1, "special": 0, "session_tag": "Regular Session", "session_title": "2011-2012 Regular Session", "session_name": "112th Congress"}, "url": "https://legiscan.com/US/bill/SB2029/2011", "state_link": "https://www.congress.gov/bill/112th-congress/senate-bill/2029/all-info", "completed": 0, "status": 1, "status_date": "2011-12-17", "progress": [{"date": "2011-12-17", "event": 1}, {"date": "2011-12-17", "event": 9}], "state": "US", "state_id": 52, "bill_number": "SB2029", "bill_type": "B", "bill_type_id": "1", "body": "S", "body_id": 115, "current_body": "S", "current_body_id": 115, "title": "Online Protection and Enforcement of Digital Trade Act", "description": "Online Protection and Enforcement of Digital Trade Act or OPEN Act - Amends the Tariff Act of 1930 to establish a violation, and an unfair practice in import trade, for an Internet site dedicated to infringing activity (ISDIA) that facilitates imports into the United States. Defines ISDIA as an Internet site that is accessed through a nondomestic domain name, conducts business directed to U.S. residents, has only limited purpose or use other than engaging in infringing activity, and whose owner or operator primarily uses the site to: (1) willfully commit specified criminal copyright offenses or circumvent technological measures controlling access to protected work, or (2) use counterfeit trademarks in a manner punishable under specified provisions of the Lanham Act. Defines a “nondomestic domain name” as a domain name for which the domain name registry that issued the domain name and operates the relevant top level domain, the domain name registrar for the domain name, and the owner and the operator of the Internet site associated with the domain name, are not located in the United States. Sets forth procedures under which the U.S. International Trade Commission (USITC) is: (1) authorized to investigate alleged violations of this Act on its own initiative, or (2) required to investigate any such alleged violation upon receiving a complaint by the owner of a copyright or trademark that is the subject of the infringing activity. Directs the USITC to terminate, or not initiate, an investigation with respect to a complaint if it has reason to believe, based on information before the USITC, that the domain name associated with the Internet site is not a nondomestic domain name. Requires that such matters be referred to the Attorney General (AG) for further proceedings as the AG determines appropriate. Directs the USITC to terminate, or not initiate, an investigation with respect to a domain name if the operator of the Internet site associated with the domain name provides in a legal notice on the site: (1) contact information of a person authorized to receive service of process, and (2) consent to jurisdiction and venue of the U.S. district courts and acceptance of service of process from the AG with respect to specified criminal copyright and trafficking in counterfeit goods or services offenses and violations. Conditions such termination or non-initiation on the operator also accepting service and waiving objections to jurisdiction in the event of the filing of a civil action in the appropriate U.S. district court based on copyright infringement, circumvention of copyright protection systems, or the use or reproduction of counterfeit registered marks in commerce. Requires complainants to identify any financial transaction provider or Internet advertising service that may be required to take specified measures upon receiving a copy of a USITC order with respect to an ISDIA. Directs the USITC to submit ISDIA violation determinations to the President along with any order issued pursuant to the determination. Requires that the determination and order shall cease to have force or effect if the President disapproves of the determination for policy reasons and notifies the USITC within 60 days after the determination. Authorizes the USITC to: (1) issue a cease and desist order against an Internet site (and its owner and operator) determined to be an ISDIA operated or maintained in violation of this Act, and (2) permit complainants to serve a copy of the order on financial transaction providers and Internet advertising services supplying services to the site.  Requires, upon receiving a copy of such an order and subject to specified limitations: (1) a financial transaction provider to take reasonable measures designed to prevent or prohibit the completion of payment transactions by the provider that involve customers located in the United States and the ISDIA, and (2) an Internet advertising service to take technically feasible measures intended to cease serving advertisements to the ISDIA in situations in which the service would directly share revenues generated by the advertisements with the ISDIA operator. Provides immunity from liability and civil suits to financial transaction providers and Internet advertising services for certain actions designed to comply with such an order. Allows the AG to bring an action for injunctive relief against: (1) any person subject to such a cease and desist order, or (2) a financial transaction provider or Internet advertising service on which an order is served that knowingly and willfully fails to comply with the order. Permits a defendant to establish an affirmative defense by showing that it does not have the technical means to comply without incurring an unreasonable economic burden or that the order is inconsistent with this Act. Authorizes a financial transaction provider or Internet advertising service, acting in good faith and based on credible evidence, to cease or refuse to provide services to an Internet site the provider or service determines to be an Internet site that endangers the public health. Defines an “Internet site that endangers the public health” as an Internet site that is primarily designed or operated for the purpose of, has only limited purpose or use other than, or is marketed by its operator or another person acting in concert with that operator for use in offering, selling, dispensing, or distributing any prescription medication, and does so regularly without a valid prescription. Authorizes the USITC to appoint hearing officers for specified proceedings. Authorizes the Secretary of Homeland Security (DHS), if the Commissioner responsible for U.S. Customs and Border Protection suspects that imported merchandise violates provisions of the Lanham Act prohibiting the importation of goods bearing infringing marks or names, to share with the holder of the trademark suspected of being infringed for purposes of determining whether such a violation is occurring: (1) information about the merchandise, packaging, or labels; or (2) unredacted samples or photographs of such items. Authorizes the Secretary to notify the appropriate copyright owner if the Commissioner seizes merchandise suspected of being imported into the United States in violation of federal copyright laws prohibiting persons from manufacturing, importing, offering to the public, providing, or otherwise trafficking products or services that circumvent: (1) a technological measure that controls access to a protected work, or (2) protection afforded by a technological measure that protects a right of a copyright owner. Directs the USITC to prescribe regulatory: (1) procedures for receiving information from the public about ISDIAs, and (2) guidance to rights holders on initiating investigations under this Act.", "pending_committee_id": 2326, "committee": {"committee_id": 2326, "chamber": "S", "chamber_id": 115, "name": "Finance"}, "referrals": [{"date": "2011-12-17", "committee_id": 2326, "chamber": "S", "chamber_id": 115, "name": "Finance"}], "history": [{"date": "2011-12-17", "action": "Sponsor introductory remarks on measure. (CR S8783)", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2011-12-17", "action": "Read twice and referred to the Committee on Finance.", "chamber": "S", "chamber_id": 115, "importance": 1}], "sponsors": [{"people_id": 9417, "person_hash": "9kl7g1rn", "party_id": "1", "state_id": 52, "party": "D", "role_id": 2, "role": "Sen", "name": "Ron Wyden", "first_name": "Ron", "middle_name": "", "last_name": "Wyden", "suffix": "", "nickname": "", "district": "SD-OR", "ftm_eid": 5397600, "votesmart_id": 27036, "opensecrets_id": "N00007724", "knowwho_pid": 165265, "ballotpedia": "Ron_Wyden", "sponsor_type_id": 1, "sponsor_order": 1, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 9427, "person_hash": "ajo63a1r", "party_id": "1", "state_id": 52, "party": "D", "role_id": 2, "role": "Sen", "name": "Maria Cantwell", "first_name": "Maria", "middle_name": "", "last_name": "Cantwell", "suffix": "", "nickname": "", "district": "SD-WA", "ftm_eid": 3465258, "votesmart_id": 27122, "opensecrets_id": "N00007836", "knowwho_pid": 205537, "ballotpedia": "Maria_Cantwell", "sponsor_type_id": 2, "sponsor_order": 2, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 9305, "person_hash": "t3dzh81l", "party_id": "2", "state_id": 52, "party": "R", "role_id": 2, "role": "Sen", "name": "Jerry Moran", "first_name": "Jerry", "middle_name": "", "last_name": "Moran", "suffix": "", "nickname": "", "district": "HD-KS-1", "ftm_eid": 19889609, "votesmart_id": 542, "opensecrets_id": "N00005282", "knowwho_pid": 158858, "ballotpedia": "Jerry_Moran", "sponsor_type_id": 2, "sponsor_order": 3, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}], "sasts": [{"type_id": 8, "type": "Related", "sast_bill_number": "HB3782", "sast_bill_id": 371474}, {"type_id": 8, "type": "Related", "sast_bill_number": "SB3426", "sast_bill_id": 432248}], "subjects": [{"subject_id": 13126, "subject_name": "Administrative law and regulatory procedures"}, {"subject_id": 13384, "subject_name": "Administrative remedies"}, {"subject_id": 13322, "subject_name": "Civil actions and liability"}, {"subject_id": 13743, "subject_name": "Free trade and trade barriers"}, {"subject_id": 13614, "subject_name": "Intellectual property"}, {"subject_id": 13233, "subject_name": "Internet and video services"}, {"subject_id": 13416, "subject_name": "Trade restrictions"}, {"subject_id": 13861, "subject_name": "U.S. International Trade Commission"}, {"subject_id": 13147, "subject_name": "Consumer affairs"}, {"subject_id": 13198, "subject_name": "Government employee pay, benefits, personnel management"}, {"subject_id": 13200, "subject_name": "Government information and archives"}, {"subject_id": 13618, "subject_name": "Judges"}, {"subject_id": 13445, "subject_name": "Jurisdiction and venue"}, {"subject_id": 13639, "subject_name": "Marketing and advertising"}, {"subject_id": 13490, "subject_name": "Prescription drugs"}, {"subject_id": 13452, "subject_name": "Competitiveness, trade promotion, trade deficits"}, {"subject_id": 22688, "subject_name": "Government studies and investigations"}, {"subject_id": 13731, "subject_name": "Foreign trade and international finance"}], "texts": [{"doc_id": 505088, "date": "2011-12-29", "type": "Introduced", "type_id": 1, "mime": "application/pdf", "mime_id": 2, "url": "https://legiscan.com/US/text/SB2029/id/505088", "state_link": "https://www.congress.gov/112/bills/s2029/BILLS-112s2029is.pdf", "text_size": 205399, "text_hash": "fb8b2e84638c0604df5588dce6674879"}], "votes": [], "amendments": [], "supplements": [], "calendar": []}}