{"status": "OK", "bill": {"bill_id": 439555, "change_hash": "9ad5df696053a68785947e377112b59d", "session_id": 84, "session": {"session_id": 84, "state_id": 52, "year_start": 2011, "year_end": 2012, "prefile": 0, "sine_die": 1, "prior": 1, "special": 0, "session_tag": "Regular Session", "session_title": "2011-2012 Regular Session", "session_name": "112th Congress"}, "url": "https://legiscan.com/US/bill/HB6656/2011", "state_link": "https://www.congress.gov/bill/112th-congress/house-bill/6656/all-info", "completed": 0, "status": 1, "status_date": "2012-12-13", "progress": [{"date": "2012-12-13", "event": 1}, {"date": "2012-12-13", "event": 9}, {"date": "2012-12-13", "event": 9}, {"date": "2012-12-13", "event": 9}, {"date": "2012-12-13", "event": 9}, {"date": "2012-12-26", "event": 9}], "state": "US", "state_id": 52, "bill_number": "HB6656", "bill_type": "B", "bill_type_id": "1", "body": "H", "body_id": 114, "current_body": "H", "current_body_id": 114, "title": "Customs Enhanced Enforcement and Trade Facilitation Act of 2012", "description": "Customs Enhanced Trade Facilitation and Enforcement Act of 2012 - Establishes U.S. Customs and Border Protection (CBP), in the Department of Homeland Security (DHS), as the U.S. Customs and Border Protection Agency (CBPA), headed by the Commissioner of U.S. Customs and Border Protection. Transfers specified functions, assets, liabilities, and duties of the U.S. Customs Service formally to the CBPA.  Requires the President to separate budget requests for CBPA commercial operations and for the enforcement of U.S. customs and trade laws by the U.S. Immigration and Customs Enforcement (ICE). Amends the Customs Procedural Reform and Simplification Act of 1978 to authorize appropriations to ICE for FY2013-FY2015. Directs the CBPA Commissioner and the Director of ICE to develop jointly and submit to Congress a Joint Strategic Plan for enforcing U.S. customs and trade laws and for facilitating U.S. international trade. Requires the DHS Secretary to consult with specified congressional committees before negotiating and before entering Mutual Recognition Arrangements or similar agreements between the United States and and a foreign government providing for mutual recognition of supply chain security programs and customs revenue functions. Directs the Secretary of the Treasury and the DHS Secretary to establish jointly a Commercial Customs Operations Advisory Committee. Amends the Consolidated Omnibus Budget Reconciliation Act of 1985 to extend through FY2015 the requirement for deposit of customs user fees in the Customs Commercial and Homeland Security Automation Account. Increases the annual amount of such deposits. Specifies a certain amount of appropriations authorized through FY2015 to complete the development, establishment, and implementation of the Automated Commercial Environment computer system for the processing of entered or released merchandise and for other DHS purposes. Amends the Tariff Act of 1930 to require the Secretary of the Treasury to ensure that each agency participating in the International Trade Data System (ITDS) uses it to collect and distribute data and documentation for clearing or licensing the importation or exportation of cargo, and does not use any other system for such purposes. Requires the head of each federal agency that requires documentation for clearing or licensing the importation and exportation of cargo to develop the necessary information technology infrastructure to support the operation of the ITDS. Directs the DHS Secretary to establish within the Office of International Trade (OIT) a Commercial Targeting Division containing individual National Targeting and Analysis Groups set up for each of several specified priority trade issues. Amends the Trade Act of 2002 to repeal the prohibition against use by the Secretary of the Treasury of certain trade data for merchandise entry or commercial enforcement determinations. Authorizes the DHS Secretary to establish within OIT Centers of Excellence and Expertise to facilitate legitimate trade through increasing specific industry knowledge and uniformity of cargo clearance procedures. Requires the DHS Inspector General (IG) to report to Congress on CBPA oversight of revenue protection and enforcement measures. Requires the DHS Secretary and the Secretary of the Treasury to report jointly to Congress on CBPA efforts to ensure the secure transportation of merchandise in bond through the United States and the collection of revenue owed upon the entry of such merchandise into the United States for consumption. Directs the Comptroller General (GAO) to report to Congress on the effectiveness of CBPA trade enforcement activities. Directs the CBPA Commissioner to establish priorities and performance standards to measure the development and levels of achievement of specified CBPA modernization, trade facilitation, and trade enforcement functions and programs. Directs the CBPA Commissioner to establish educational seminars to improve the ability of CBPA personnel to classify and appraise articles imported into the United States in accordance with U.S. customs laws. Directs the DHS Secretary to establish an importer of record program to assign and maintain importer of record numbers. Requires the CBPA to maintain a centralized database of importer of record numbers, including a history of numbers associated with each importer. Directs the Secretary of the Treasury to prescribe minimum standards to require customs brokers to implement, and importers (including nonresident importers) to comply with, reasonable procedures for collecting information to identify U.S. and non-resident importers seeking to import merchandise into the United States. Directs the CBPA Commissioner to report to Congress recommendations for: (1) determining the most effective way to require foreign nationals to provide customs brokers with accurate information, comparable to that required of U.S. nationals, on the identity of foreign nationals seeking to import merchandise into the United States; and (2) establishing a system for such brokers and agencies to review information maintained by relevant federal agencies to verify the identity of importers, including nonresident importers, seeking to import merchandise into the United States. Requires the CBPA Commissioner to: (1) establish a new importer program that directs CBPA to adjust bond amounts for new importers based on the level of risk assessed by CBPA for protection of federal revenue, and (2) require a non-resident importer of record to designate a resident agent in the United States. Establishes an interagency committee composed of representatives of each covered federal agency to set up a certified importer program meeting specified requirements. Amends the Tariff Act of 1930 to authorize the Secretary of the Treasury, at the time merchandise is presented for examination, to give the owner of a copyright or a registered mark: (1) any information appearing on the merchandise or its retail packaging; (2) a sample, or digital image, of the merchandise and its retail packaging; or (3) any packing material accompanying a sample, if a sample is provided, that bears either a mark suspected of being a counterfeit mark of the registered mark, or a work suspected of infringing the copyright. Directs the DHS Secretary to establish within the CBPA Office of International Trade a Trade Remedy Law Enforcement Division (including a National Targeting and Analysis Group) to prevent and counter evasion of antidumping or countervailing duty orders with respect to covered merchandise entered into the United States. Directs the National Targeting and Analysis Group dedicated to preventing and countering evasion to establish targeted risk assessment methodologies and standards for: (1) evaluating the risk that cargo destined for the United States may constitute evading covered merchandise, and (2) issuing Trade Alerts to U.S. ports of entry directing further inspection of specific merchandise to ensure compliance with U.S. trade remedy laws. Requires the Group also to use information available from the Automated Targeting System, the Automated Entry System, the International Trade Data System, and the Treasury Enforcement Communications System to administer such methodologies and standards.  Directs the Secretary of the Treasury to require a single entry bond, in addition to any continuous bond, in any case in which there is a reasonable belief, based on evidence, that merchandise which may be subject to a countervailing duty order or antidumping duty order is being entered into the United States by means of evasion. Prescribes procedures for investigating allegations of evasion and making preliminary and final determinations, as well as actions to be taken if final determinations are affirmative. Requires the CBPA Commissioner to exercise all authorities to collect information needed to make a determination on whether merchandise is entered into the United States through evasion. Directs the CBPA Commissioner to employ sufficient personnel who have expertise in and responsibility for preventing and investigating the entry of covered merchandise into the United States through evasion. Directs the Comptroller General to report to Congress an estimate of the amount of duties that could not be collected on covered merchandise that entered U.S. customs territory through evasion during FY2011-FY2012 because the Commissioner did not have the authority to reliquidate the entries of such merchandise. Amends the Tariff Act of 1930 to eliminate the option of an importer to post a bond or security in lieu of a cash deposit for each entry of merchandise exported into the United States by a new exporter (shipper) and producer that is the subject of a review by the administering authority as to whether antidumping or countervailing duties shall be imposed on such merchandise. Requires the weighted average dumping margin or individual countervailing duty rate determined for a new exporter (shipper) or producer of merchandise in a review by the administering authority as to whether antidumping or countervailing duties shall be imposed to be based solely on the bona fide U.S. sales made by the exporter or producer during the period of review. Amends the Tariff Act of 1930 authorizes imposition of a monetary penalty on, or revocation or suspension of a license or permit of, any customs broker convicted of committing or conspiring to commit an act of terrorism. Raises from $200 to $800 the general de minimus aggregate fair retail value in the country of shipment of duty-free articles imported by one person on one day. Amends the Consolidated Omnibus Budget Reconciliation Act of 1985 to change from quarterly to monthly the periodic remittance of collected customs user fees to the Secretary of the Treasury. Subjects to an administrative penalty of double the amount of such fees for any failure to remit them. Prohibits any refund of collected fees from the Customs User Fee Account. Allows drawback (refund of paid customs duties) in a specified amount only if: (1) the manufacturer or producer of articles has received the imported, duty-paid merchandise or substitute merchandise, directly or indirectly; and (2) the exporter or destroyer of articles has received the manufactured or produced article or substitute article, directly or indirectly. Extends from three years to five years the period from the date of receipt by a manufacturer or producer of imported, duty-paid merchandise during which, for purposes of allowing a drawback of paid duties, the imported duty-paid merchandise and any other merchandise (whether imported or domestic) of the same kind and quality are used in the manufacture or production of articles.  Requires any person claiming drawback to maintain, as proof of exportation, the record of exportation entered in the automated export system of the U.S. government or, if the exporter is unable to use that system, records kept in the normal course of business similar to the information contained in such record of exportation. Revises other specified drawback requirements. Amends the Harmonized Tariff Schedule of the United States with respect to duties on warranty repairs or alterations of articles exported from and then returned to the United States. Allows commingling of fungible goods exported from the United States for such purposes. Allows use of an inventory management method to account for the origin, value, and classification of such goods. Declares that, if a person chooses to use an inventory management method with respect to fungible goods, that person shall use the same inventory management method for any other goods with respect to which the person claims fungibility. Allows duty-free treatment for certain federal property returned to the United States. Authorizes appropriations for FY2013 for the salaries and expenses of the U.S. International Trade Commission (USITC) and of the Office of the United States Trade Representative (USTR). Authorizes appropriations to the USITC for necessary expenses for FY2014-FY2015. Expresses the sense of Congress that the Interagency Trade Enforcement Center has the potential to strengthen the monitoring and enforcement of U.S. rights under international trade agreements and the enforcement of domestic trade laws.", "pending_committee_id": 2544, "committee": {"committee_id": 2544, "chamber": "H", "chamber_id": 114, "name": "Subcommittee on Border and Maritime Security"}, "referrals": [{"date": "2012-12-13", "committee_id": 2317, "chamber": "H", "chamber_id": 114, "name": "Ways And Means"}, {"date": "2012-12-26", "committee_id": 2544, "chamber": "H", "chamber_id": 114, "name": "Subcommittee on Border and Maritime Security"}], "history": [{"date": "2012-12-13", "action": "Referred to the Committee on Ways and Means, and in addition to the Committees on Homeland Security, and the Budget, for a period to be subsequently determined by the Speaker, in each case for consideration of such provisions as fall within the jurisdiction of the committee concerned.", "chamber": "H", "chamber_id": 114, "importance": 1}, {"date": "2012-12-13", "action": "Referred to House Ways and Means", "chamber": "H", "chamber_id": 114, "importance": 1}, {"date": "2012-12-13", "action": "Referred to House Homeland Security", "chamber": "H", "chamber_id": 114, "importance": 1}, {"date": "2012-12-13", "action": "Referred to House Budget", "chamber": "H", "chamber_id": 114, "importance": 1}, {"date": "2012-12-26", "action": "Referred to the Subcommittee on Border and Maritime Security.", "chamber": "H", "chamber_id": 114, "importance": 1}], "sponsors": [{"people_id": 9090, "person_hash": "hs2gw8hc", "party_id": "1", "state_id": 52, "party": "D", "role_id": 1, "role": "Rep", "name": "Jim McDermott", "first_name": "Jim", "middle_name": "", "last_name": "McDermott", "suffix": "", "nickname": "", "district": "HD-WA-7", "ftm_eid": 3526222, "votesmart_id": 140387, "opensecrets_id": "N00009829", "knowwho_pid": 159123, "ballotpedia": "Jim_McDermott_(Alaska)", "sponsor_type_id": 1, "sponsor_order": 1, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 9079, "person_hash": "0bacckjs", "party_id": "1", "state_id": 52, "party": "D", "role_id": 1, "role": "Rep", "name": "Sander Levin", "first_name": "Sander", "middle_name": "M.", "last_name": "Levin", "suffix": "", "nickname": "", "district": "HD-MI-9", "ftm_eid": 782914, "votesmart_id": 26918, "opensecrets_id": "N00003950", "knowwho_pid": 158906, "ballotpedia": "Sandy_Levin", "sponsor_type_id": 2, "sponsor_order": 2, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}], "sasts": [{"type_id": 8, "type": "Related", "sast_bill_number": "HB3057", "sast_bill_id": 341727}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB5708", "sast_bill_id": 426630}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB5821", "sast_bill_id": 428808}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB6110", "sast_bill_id": 431864}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB6642", "sast_bill_id": 437003}, {"type_id": 8, "type": "Related", "sast_bill_number": "SB1133", "sast_bill_id": 335584}, {"type_id": 8, "type": "Related", "sast_bill_number": "SB1581", "sast_bill_id": 341480}], "subjects": [{"subject_id": 13126, "subject_name": "Administrative law and regulatory procedures"}, {"subject_id": 13384, "subject_name": "Administrative remedies"}, {"subject_id": 13127, "subject_name": "Advisory bodies"}, {"subject_id": 13413, "subject_name": "Business records"}, {"subject_id": 13742, "subject_name": "Canada"}, {"subject_id": 13452, "subject_name": "Competitiveness, trade promotion, trade deficits"}, {"subject_id": 13144, "subject_name": "Computers and information technology"}, {"subject_id": 13146, "subject_name": "Congressional oversight"}, {"subject_id": 20695, "subject_name": "Customs enforcement"}, {"subject_id": 13157, "subject_name": "Department of Homeland Security"}, {"subject_id": 13184, "subject_name": "Executive agency funding and structure"}, {"subject_id": 13737, "subject_name": "Federal officials"}, {"subject_id": 13743, "subject_name": "Free trade and trade barriers"}, {"subject_id": 13198, "subject_name": "Government employee pay, benefits, personnel management"}, {"subject_id": 13200, "subject_name": "Government information and archives"}, {"subject_id": 13614, "subject_name": "Intellectual property"}, {"subject_id": 13235, "subject_name": "Latin America"}, {"subject_id": 13312, "subject_name": "Licensing and registrations"}, {"subject_id": 13243, "subject_name": "Mexico"}, {"subject_id": 13744, "subject_name": "Office of the U.S. Trade Representative"}, {"subject_id": 13258, "subject_name": "Performance measurement"}, {"subject_id": 13678, "subject_name": "Tariffs"}, {"subject_id": 13431, "subject_name": "Terrorism"}, {"subject_id": 13694, "subject_name": "Trade agreements and negotiations"}, {"subject_id": 13416, "subject_name": "Trade restrictions"}, {"subject_id": 13861, "subject_name": "U.S. International Trade Commission"}, {"subject_id": 13648, "subject_name": "User charges and fees"}, {"subject_id": 13303, "subject_name": "Youth employment and child labor"}, {"subject_id": 13731, "subject_name": "Foreign trade and international finance"}, {"subject_id": 22688, "subject_name": "Government studies and investigations"}], "texts": [{"doc_id": 672096, "date": "2012-12-21", "type": "Introduced", "type_id": 1, "mime": "application/pdf", "mime_id": 2, "url": "https://legiscan.com/US/text/HB6656/id/672096", "state_link": "https://www.congress.gov/112/bills/hr6656/BILLS-112hr6656ih.pdf", "text_size": 490035, "text_hash": "906a3b5b1c93ab51b07acaa7fbd906f9"}], "votes": [], "amendments": [], "supplements": [], "calendar": []}}