{"status": "OK", "bill": {"bill_id": 538132, "change_hash": "6ca6c1c1e12a263a41356190fee633c6", "session_id": 1026, "session": {"session_id": 1026, "state_id": 52, "year_start": 2013, "year_end": 2014, "prefile": 0, "sine_die": 1, "prior": 1, "special": 0, "session_tag": "Regular Session", "session_title": "2013-2014 Regular Session", "session_name": "113th Congress"}, "url": "https://legiscan.com/US/bill/SB662/2013", "state_link": "https://www.congress.gov/bill/113th-congress/senate-bill/662/all-info", "completed": 0, "status": 1, "status_date": "2013-03-22", "progress": [{"date": "2013-03-22", "event": 1}, {"date": "2013-03-22", "event": 9}], "state": "US", "state_id": 52, "bill_number": "SB662", "bill_type": "B", "bill_type_id": "1", "body": "S", "body_id": 115, "current_body": "S", "current_body_id": 115, "title": "Trade Facilitation and Trade Enforcement Reauthorization Act of 2013", "description": "Trade Facilitation and Trade Enforcement Reauthorization Act of 2013 - Revises the organization, in the Department of Homeland Security (DHS), of the U.S. Customs and Border Protection and renames it the U.S. Customs and Border Protection Agency (CBP Agency), headed by the Commissioner of U.S. Customs and Border Protection.  Amends the Homeland Security Act of 2002 to transfer all functions of the U.S. Customs and Border Protection of DHS to the CBP Agency. Requires appointment of between two and three Deputy Commissioners, including a Deputy Commissioner for Trade. Establishes in the office of the Commissioner a Trade Advocate. Directs the DHS Secretary to transfer to the Trade Advocate all functions of the CBP Agency Office of Trade Relations, which is hereby abolished. Establishes within the CBP Agency an Office of Trade, absorbing all functions of the CBP Office of International Trade, which is hereby abolished. Establishes within the CBP Agency an Office of International Affairs. Establishes in the Office of Field Operations of the CBP Agency a Trade Facilitation and Trade Enforcement Division. Directs the Commissioner to designate at least 40 commercial enforcement officers within the Office. Directs the Commissioner to establish a Customs Facilitation and Enforcement Interagency Committee to improve coordination among federal agencies with respect to the movement of merchandise into and out of the United States (trade facilitation) and enforcement of U.S. customs and trade laws (trade enforcement). Directs the Committee to establish a Customs Facilitation and Enforcement Review Group. Requires two separate budget requests for the CBP Agency, one for commercial operations and one for noncommercial operations. Establishes in the DHS Office of Policy a Director of Trade Policy. Renames the U.S. Immigration and Customs Enforcement (ICE), in DHS, the U.S. Immigration and Customs Enforcement Agency (ICE Agency).  Requires two separate budget requests for the ICE Agency, one for customs operations and one for other operations. Amends the Customs and Trade Act of 1990 to direct the Commissioner of the CBP Agency and the ICE Director to develop jointly every two years, and report to Congress, a joint strategic plan for improving trade facilitation and trade enforcement. Directs the Commissioner to ensure that CBP Agency partnership programs, such as the Customs-Trade Partnership Against Terrorism, provide trade benefits to importers or exporters that meet program requirements. Amends the Tariff Act of 1930 to direct the Commissioner to establish a voluntary government-private sector trade facilitation partnership program, or modify an existing one, to enhance trade facilitation and trade enforcement and provide certain trade benefits to importers that meet certain minimum requirements. Directs the Commissioner to develop and implement CBP Agency-wide Centers of Excellence and Expertise. Directs the Secretary of the Treasury and the DHS Secretary jointly to establish a Customs Operations Advisory Committee (effectively replacing the Advisory Committee on Commercial Operations of the U.S. Customs Service). Amends the Consolidated Omnibus Budget Reconciliation Act of 1985 (COBRA) to authorize appropriations for FY2014-FY2018 to complete development, and provide for the operation and maintenance, of the Automated Commercial Environment computer system. Amends the Tariff Act of 1930 to require the Secretary of the Treasury to work with the head of each agency participating in the International Trade Data System (ITDS) and the Interagency Steering Committee to ensure that each such agency, among other duties, develops and maintains the necessary information technology infrastructure to support the operation of the ITDS, submit all data to the ITDS electronically, and arrange to share information between each agency and the CBP Agency. Directs the DHS Secretary to establish within the CBP Agency Office of Trade a Commercial Targeting Division to conduct commercial risk assessment targeting and, when needed, issue trade alerts with respect to cargo destined for the United States.  Directs the Commissioner and the ICE Director jointly to develop or update, and report to Congress, a strategy for uniform enforcement of U.S. illegal drug control laws. Requires the Inspector General (IG) of the Department of the Treasury to report to specified congressional committees on IG oversight of revenue protection and enforcement measures. Requires the DHS Secretary and the Secretary of the Treasury to report jointly to specified congressional committees on security and revenue measures with respect to merchandise transported in bond. Directs the DHS Secretary to establish a program to assign importer of record numbers.  Establishes an interagency Import Safety Working Group. Directs the DHS Secretary to develop a joint import safety rapid response plan that sets forth protocols for the CBP Agency to: (1) coordinate federal responses to cargo entering the United States that poses a threat to the health or safety of U.S. consumers, and (2) use in recovering from or mitigating the effects of actions and responses to such an incident.  Directs the DHS Secretary to establish within the ICE Agency a National Intellectual Property Rights Coordination Center to coordinate U.S. activities to prevent the import and export of goods that infringe intellectual property rights.  Requires the Commissioner of the CBP Agency, upon suspicion that merchandise is being imported into the United States in violation of U.S. trademark or copyright infringement laws, and belief that testing of the merchandise by the owner of a trademark or a copyright would assist in determining a violation, to provide the trademark or copyright owner any information appearing on the merchandise and its packaging and labels, including any unredacted images of them. Authorizes the DHS Secretary to establish in the ICE Agency priority trade enforcement coordination centers. Enforcing Orders and Reducing Customs Evasion Act of 2013 - Amends the Tariff Act of 1930 to require the Commissioner, upon the filing of an allegation or a referral from another federal agency, to investigate claims of evasion of antidumping or countervailing duties (including any cash deposits or other security) with respect to covered merchandise entered into the United States. Requires the Commissioner, in the case of an affirmative determination based on substantial evidence, to: (1) suspend liquidation of unliquidated entries of covered merchandise and extend the period for liquidation of covered merchandise entered before such determination, (2) request the administering authority (Secretary of Commerce or other responsible U.S. officer) to identify the applicable antidumping or countervailing duties or cash deposit rate for such entries, (3) require the posting of cash deposits and assess duties, and (4) take appropriate additional enforcement measures. Revises eligibility requirements for the drawback (refund) of duties paid on eligible merchandise imported into the United States and later exported or destroyed. Prescribes or revises requirements for: (1) penalties for a custom broker convicted of committing an act of terrorism, (2) duty-free treatment under the Harmonized Tariff Schedule of the United States of certain federal property exported and reimported without having been advanced in value or improved in condition while abroad, and (3) assignment under COBRA of CBP Agency employees to perform customs services for charter flight passengers and their baggage. Directs the President to establish a pilot program for designating 24-hour commercial land border ports of entry on the northern and southern U.S. borders. Eliminates the consumptive demand exception to the prohibition on the importation of goods made with convict labor, forced labor, or indentured labor. Requires the Commissioner to ensure that appropriate CBP Agency resources address concerns that honey as well as contraband archaeological or ethnological material is being imported into the United States in violation of U.S. customs laws. Increases from $200 to $800 the retail value of articles that may be imported duty-free into the United States by one person on one day. Requires the Secretary of the Treasury to prescribe regulations for the entry of merchandise valued between $250 and $2,500. Amends the Department of Homeland Security Appropriations Act, 2013 to repeal the authority of the Commissioner to enter into reimbursable fee agreements for up to five years for the provision of CBP services, including additional services at existing and new CBP-serviced facilities (including but not limited to payment of overtime) and land border facilities.", "pending_committee_id": 0, "committee": [], "referrals": [{"date": "2013-03-22", "committee_id": 2326, "chamber": "S", "chamber_id": 115, "name": "Finance"}], "history": [{"date": "2013-03-22", "action": "Read twice and referred to the Committee on Finance.", "chamber": "S", "chamber_id": 115, "importance": 1}, {"date": "2013-05-22", "action": "Committee on Finance. Hearings held. Hearings printed: S.Hrg. 113-215.", "chamber": "S", "chamber_id": 115, "importance": 0}], "sponsors": [{"people_id": 9439, "person_hash": "98vpht77", "party_id": "1", "state_id": 52, "party": "D", "role_id": 2, "role": "Sen", "name": "Max Baucus", "first_name": "Max", "middle_name": "", "last_name": "Baucus", "suffix": "", "nickname": "", "district": "SD-MT", "ftm_eid": 0, "votesmart_id": 53315, "opensecrets_id": "N00004643", "knowwho_pid": 165243, "ballotpedia": "Max_Baucus", "sponsor_type_id": 1, "sponsor_order": 1, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 9489, "person_hash": "y03u5uak", "party_id": "2", "state_id": 52, "party": "R", "role_id": 2, "role": "Sen", "name": "Orrin Hatch", "first_name": "Orrin", "middle_name": "G.", "last_name": "Hatch", "suffix": "", "nickname": "", "district": "SD-UT", "ftm_eid": 1673075, "votesmart_id": 53352, "opensecrets_id": "N00009869", "knowwho_pid": 165279, "ballotpedia": "Orrin_Hatch", "sponsor_type_id": 2, "sponsor_order": 2, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}], "sasts": [{"type_id": 8, "type": "Related", "sast_bill_number": "HB3004", "sast_bill_id": 563336}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB5247", "sast_bill_id": 655245}], "subjects": [{"subject_id": 13126, "subject_name": "Administrative law and regulatory procedures"}, {"subject_id": 13127, "subject_name": "Advisory bodies"}, {"subject_id": 13612, "subject_name": "Agricultural trade"}, {"subject_id": 13135, "subject_name": "Aviation and airports"}, {"subject_id": 13136, "subject_name": "Border security and unlawful immigration"}, {"subject_id": 13138, "subject_name": "Budget process"}, {"subject_id": 13452, "subject_name": "Competitiveness, trade promotion, trade deficits"}, {"subject_id": 13144, "subject_name": "Computers and information technology"}, {"subject_id": 13146, "subject_name": "Congressional oversight"}, {"subject_id": 13147, "subject_name": "Consumer affairs"}, {"subject_id": 20695, "subject_name": "Customs enforcement"}, {"subject_id": 13157, "subject_name": "Department of Homeland Security"}, {"subject_id": 13345, "subject_name": "Drug trafficking and controlled substances"}, {"subject_id": 13184, "subject_name": "Executive agency funding and structure"}, {"subject_id": 13737, "subject_name": "Federal officials"}, {"subject_id": 13521, "subject_name": "Food supply, safety, and labeling"}, {"subject_id": 13743, "subject_name": "Free trade and trade barriers"}, {"subject_id": 13198, "subject_name": "Government employee pay, benefits, personnel management"}, {"subject_id": 13200, "subject_name": "Government information and archives"}, {"subject_id": 22688, "subject_name": "Government studies and investigations"}, {"subject_id": 13547, "subject_name": "Historical and cultural resources"}, {"subject_id": 13522, "subject_name": "Homeland security"}, {"subject_id": 13402, "subject_name": "Human rights"}, {"subject_id": 13614, "subject_name": "Intellectual property"}, {"subject_id": 13232, "subject_name": "International organizations and cooperation"}, {"subject_id": 13234, "subject_name": "Labor standards"}, {"subject_id": 13671, "subject_name": "Public-private cooperation"}, {"subject_id": 13678, "subject_name": "Tariffs"}, {"subject_id": 13694, "subject_name": "Trade agreements and negotiations"}, {"subject_id": 13416, "subject_name": "Trade restrictions"}, {"subject_id": 13533, "subject_name": "Travel and tourism"}, {"subject_id": 13648, "subject_name": "User charges and fees"}, {"subject_id": 13731, "subject_name": "Foreign trade and international finance"}], "texts": [{"doc_id": 815212, "date": "2013-04-08", "type": "Introduced", "type_id": 1, "mime": "application/pdf", "mime_id": 2, "url": "https://legiscan.com/US/text/SB662/id/815212", "state_link": "https://www.congress.gov/113/bills/s662/BILLS-113s662is.pdf", "text_size": 563027, "text_hash": "beb0fb1bd9286b158ba4705c85fbc134"}], "votes": [], "amendments": [], "supplements": [], "calendar": []}}