{"status": "OK", "bill": {"bill_id": 654846, "change_hash": "b69343fe3909efbf1e39cf0279ef0b41", "session_id": 1107, "session": {"session_id": 1107, "state_id": 46, "year_start": 2015, "year_end": 2015, "prefile": 0, "sine_die": 1, "prior": 1, "special": 0, "session_tag": "Regular Session", "session_title": "2015 Regular Session", "session_name": "2015 Regular Session"}, "url": "https://legiscan.com/VA/bill/SB505/2015", "state_link": "https://lis.virginia.gov/cgi-bin/legp604.exe?151+sum+SB505", "completed": 0, "status": 1, "status_date": "2014-01-08", "progress": [{"date": "2014-01-08", "event": 1}, {"date": "2014-01-08", "event": 9}], "state": "VA", "state_id": 46, "bill_number": "SB505", "bill_type": "B", "bill_type_id": "1", "body": "S", "body_id": 8, "current_body": "S", "current_body_id": 8, "title": "Natural gas; incentives for expanded use as transportation fuel, report.", "description": "Natural gas; incentives for expanded use as transportation fuel. Establishes financial and regulatory incentives for expanding the use of compressed natural gas (CNG) and liquefied natural gas (LNG) for transportation purposes in the Commonwealth. Vehicles fueled, wholly or partially, by natural gas are authorized to weigh up to 2,000 pounds more than the applicable weight limit, and the bill provides that limits on hauling hazardous materials over a bridge or through a tunnel do not apply to fuel required to propel the vehicle. The bill provides for the titling and registration of natural gas vehicles (NGVs) and converted natural gas vehicles, including a provision that the motor vehicle titling tax on NGVs apply to the value of such vehicle without a CNG or LNG system. The bill establishes a Natural Gas Vehicle Incentive Fund and grant programs through which moneys in the Fund may be expended for increasing public access to natural gas fueling stations, purchasing NGVs, or converting vehicles to natural gas. Revenues for the Fund come from moneys allocated by the Commonwealth Transportation Board; registration fees for NGVs; clean special fuel license plate fees; the Natural Gas Consumption Tax; severance taxes on natural gas; revenues from taxes on pipeline transmission and distribution companies, including the special regulatory revenue tax; and such other funds as may be appropriated. The bill also exempts natural gas home refueling appliances from the sales and use tax, allows taxicabs fueled by natural gas to move to the front of an airport queue, allows trucks bearing clean special fuel stickers to use high-occupancy vehicle lanes, and provides for the reimbursement of tolls for operators of NGVs. The bill further allows public access to state fueling areas and clarifies that refunds on motor fuel taxes apply to commercial equipment using natural gas. The measure requires the Department of General Services' plan for the replacement of state-owned or operated vehicles with alternative-fueled vehicles to include a provision requiring the purchase of NGVs rather than conventional vehicles or other vehicles that operate using alternative fuels whenever the life-cycle cost for such vehicles is not more than 10 percent greater than for conventional vehicles. The measure increases the membership of the Board of Directors of the Virginia Universities Clean Energy Development and Economic Stimulus Foundation to include a nonlegislative citizen member who shall represent an association advocating growth in North America of the use and acceptance of vehicles powered by natural gas. The purpose of the Foundation is expanded to include advancing the goal of increasing the number of NGVs operating within the Commonwealth. The powers of the Foundation's Board of Directors are augmented to include providing assistance to the Department of Motor Vehicles in its awarding of competitive grants and other incentives relating to NGV fueling facilities and related infrastructure, conversions of conventionally fueled vehicles to NGVs, and purchases of original equipment manufacturer (OEM) NGVs. The measure exempts certain materials provided to the Department of Motor Vehicles from the public records requirements of the Freedom of Information Act. Memoranda, staff evaluations, and other records prepared by the Department or its staff exclusively for the evaluation of grant applications are also exempted from the Act. The measure authorizes the Department to hold closed meetings to discuss or consider such records. The measure requires that CNG sold at retail for use as a motor fuel be dispensed in gasoline gallon equivalent (GGE) units or diesel gallon equivalent (DGE) units and that LNG sold at retail for use as a motor fuel be dispensed in DGE units. The measure provides that, notwithstanding weights and measures equivalents published by the National Institute of Standards and Technology, a GGE of CNG shall initially be set at 5.66 pounds, a DGE of CNG shall initially be set at 6.38 pounds, and a DGE of LNG shall initially be set at 6.06 pounds. These levels may be changed pursuant to regulation adopted by the Commissioner of Agriculture and Consumer Services if changes occur in the energy content of motor fuels, in which event the Commissioner shall take into consideration whether the National Conference on Weights and Measures has adopted similar standards for dispensing CNG and LNG. Commencing January 1, 2015, any dispenser used for the sale of CNG or LNG at retail for use as motor fuel shall display the GGE or the DGE unit as the primary display information provided. The dispenser shall indicate (i) the number of GGEs or DGEs sold, (ii) the total sales price of the CNG or LNG dispensed, and (iii) the sales price per GGE or DGE of the CNG or LNG sold. The measure excludes any person who is not a public service corporation and who provides CNG or LNG fueling service at retail from the meaning of the terms \"public utility,\" \"public service corporation,\" or \"public service company.\" The ownership or operation of a facility at which such a fueling service is sold, and the selling of such service from that facility, does not render the person a public utility, public service corporation, or public service company solely because of that sale, ownership, or operation. The provision of CNG or LNG fueling service by a person who is not a public utility shall not constitute the retail sale of natural gas if the natural gas furnished in connection with the provision of such service is used solely for transportation purposes. Providing CNG or LNG fueling service is declared to be a permitted natural gas utility activity of a certificated natural gas utility. A natural gas utility may establish a CNG home fueling appliance loan program under which it may offer to its residential customers the option to lease a CNG home fueling appliance from the utility at amounts that are subsidized by the utility. Finally, the measure requires the Virginia Port Authority to conduct a study of the issues related to the siting of LNG storage and refueling facilities in the Hampton Roads region for transportation purposes.", "pending_committee_id": 164, "committee": {"committee_id": 164, "chamber": "S", "chamber_id": 8, "name": "Finance and Appropriations"}, "referrals": [{"date": "2014-01-08", "committee_id": 170, "chamber": "S", "chamber_id": 8, "name": "Transportation"}, {"date": "2014-01-22", "committee_id": 164, "chamber": "S", "chamber_id": 8, "name": "Finance and Appropriations"}], "history": [{"date": "2014-01-08", "action": "Prefiled and ordered printed; offered 01/08/14 14100492D", "chamber": "S", "chamber_id": 8, "importance": 0}, {"date": "2014-01-08", "action": "Referred to Committee on Transportation", "chamber": "S", "chamber_id": 8, "importance": 1}, {"date": "2014-01-22", "action": "Committee substitute printed to Web only 14103952D-S1", "chamber": "S", "chamber_id": 8, "importance": 0}, {"date": "2014-01-22", "action": "Rereferred from Transportation (14-Y 0-N)", "chamber": "S", "chamber_id": 8, "importance": 0}, {"date": "2014-01-22", "action": "Rereferred to Finance", "chamber": "S", "chamber_id": 8, "importance": 0}, {"date": "2014-02-04", "action": "Continued to 2015 in Finance (17-Y 0-N)", "chamber": "S", "chamber_id": 8, "importance": 0}, {"date": "2014-12-04", "action": "Left in Finance", "chamber": "S", "chamber_id": 8, "importance": 0}], "sponsors": [{"people_id": 797, "person_hash": "a5rvr70t", "party_id": "2", "state_id": 46, "party": "R", "role_id": 2, "role": "Sen", "name": "Frank Wagner", "first_name": "Frank", "middle_name": "W.", "last_name": "Wagner", "suffix": "", "nickname": "", "district": "SD-007", "ftm_eid": 6270516, "votesmart_id": 5199, "opensecrets_id": "", "knowwho_pid": 199443, "ballotpedia": "Frank_Wagner", "sponsor_type_id": 1, "sponsor_order": 1, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}], "sasts": [], "subjects": [], "texts": [{"doc_id": 1040286, "date": "2014-01-08", "type": "Prefiled", "type_id": 11, "mime": "text/html", "mime_id": 1, "url": "https://legiscan.com/VA/text/SB505/id/1040286", "state_link": "https://lis.virginia.gov/cgi-bin/legp604.exe?151+ful+SB505+hil", "text_size": 226994, "text_hash": "24a443cd3dcb729a7883711a27410f6f"}, {"doc_id": 1040287, "date": "2014-01-22", "type": "Comm Sub", "type_id": 2, "mime": "text/html", "mime_id": 1, "url": "https://legiscan.com/VA/text/SB505/id/1040287", "state_link": "https://lis.virginia.gov/cgi-bin/legp604.exe?151+ful+SB505S1+hil", "text_size": 217827, "text_hash": "5d7b5c3dcb1465b700f8dc5cf2c94003"}], "votes": [{"roll_call_id": 375952, "date": "2014-01-22", "desc": "Senate: Rereferred from Transportation (14-Y 0-N)", "yea": 14, "nay": 0, "nv": 0, "absent": 0, "total": 14, "passed": 1, "chamber": "S", "chamber_id": 8, "url": "https://legiscan.com/VA/rollcall/SB505/id/375952", "state_link": "https://lis.virginia.gov/cgi-bin/legp604.exe?151+vot+S11C0042+SB0505"}, {"roll_call_id": 375953, "date": "2014-02-04", "desc": "Senate: Continued to 2015 in Finance (17-Y 0-N)", "yea": 17, "nay": 0, "nv": 0, "absent": 0, "total": 17, "passed": 1, "chamber": "S", "chamber_id": 8, "url": "https://legiscan.com/VA/rollcall/SB505/id/375953", "state_link": "https://lis.virginia.gov/cgi-bin/legp604.exe?151+vot+S05C0121+SB0505"}], "amendments": [], "supplements": [], "calendar": []}}