{"status": "OK", "bill": {"bill_id": 662787, "change_hash": "63a20f8cacbabe653c11c11a0e131024", "session_id": 1026, "session": {"session_id": 1026, "state_id": 52, "year_start": 2013, "year_end": 2014, "prefile": 0, "sine_die": 1, "prior": 1, "special": 0, "session_tag": "Regular Session", "session_title": "2013-2014 Regular Session", "session_name": "113th Congress"}, "url": "https://legiscan.com/US/bill/SB2994/2013", "state_link": "https://www.congress.gov/bill/113th-congress/senate-bill/2994/all-info", "completed": 0, "status": 1, "status_date": "2014-12-10", "progress": [{"date": "2014-12-10", "event": 1}, {"date": "2014-12-10", "event": 9}], "state": "US", "state_id": 52, "bill_number": "SB2994", "bill_type": "B", "bill_type_id": "1", "body": "S", "body_id": 115, "current_body": "S", "current_body_id": 115, "title": "Leveling the Playing Field Act", "description": "Leveling the Playing Field Act - Amends the Tariff Act of 1930 with respect to the administration and enforcement of antidumping (AD) and countervailing duty (CVD) orders.  Declares that neither the administering authority (the Secretary of Commerce, or another U.S. officer given the responsibility by law) nor the U.S. International Trade Commission (ITC), as the case may be, is required to determine, or make any adjustments to, a countervailable subsidy rate or weighted average dumping margin based on any assumptions about information the interested party would have provided if it had complied with a request for information. Specifies circumstances in which neither the administering authority nor the ITC is required to corroborate information, including that relating to any dumping margin or subsidy rate calculated on the basis of it, when the administering authority or the ITC uses an inference adverse to the interests of a party that has failed to cooperate with an investigation, even if the information was submitted by that party in a separate proceeding or a separate segment of the same proceeding. Prescribes requirements for the kinds of subsidy rates or dumping margins used in the relevant proceedings when the administering authority uses an inference adverse to a party's interests. Prescribes additional economic factors for the ITC to evaluate when determining whether imports have caused or threatened material injury to a domestic industry. Requires such factors to be evaluated within the context of the business cycle and conditions of competition that are distinct to the affected industry. Repeals the requirement that, in the course of a review of an AD or CVD order for merchandise a new exporter or producer claims it did not export to the United States, the administering authority direct the Customs Service to allow the importer to post a bond or security in lieu of a cash deposit for each entry of the subject merchandise. Makes an exporter or producer eligible for an individual weighted average dumping margin or individual countervailing duty rate in such a review only if the exporter or producer demonstrates that all its sales of the subject merchandise in the United States, or for exportation to the United States, during the period in question are bona fide and the buyer is not affiliated with that exporter or producer. Directs the Commissioner responsible for U.S. Customs and Border Protection to require merchandise, upon entry into U.S. customs territory, to be accompanied by any mandatory importer or exporter certification that the merchandise is not subject to a duty because it does not fall within the scope of any AD or CVD order. Prescribes civil and criminal penalties for failure to comply with the requirement. Specifies factors for the administering authority to consider when deciding, in CVD or AD investigations and reviews, whether it would be unduly burdensome to: (1) accept voluntary responses from exporters or producers not initially selected for examination, and so (2) determine not to establish an individual countervailable subsidy rate or an individual weighted average dumping margin for them. Authorizes the administering authority, in valuing the factors of production to determine the normal value of merchandise exported from a nonmarket economy country, to disregard price or cost values if there is reason to believe or suspect that the subject merchandise is being subsidized or dumped, without actually investigating and determining that subsidization or dumping has occurred. Requires the administering authority to take into account, when determining whether a foreign country has a nonmarket economy, to consider the extent to which the country's government enforces and administers its laws, legal and administrative procedures, and other policies in an open and transparent manner that affords all parties, whether foreign or domestic, due process and equal and non-discriminatory treatment. Applies the requirements of this Act to goods from Canada and Mexico.", "pending_committee_id": 2326, "committee": {"committee_id": 2326, "chamber": "S", "chamber_id": 115, "name": "Finance"}, "referrals": [{"date": "2014-12-10", "committee_id": 2326, "chamber": "S", "chamber_id": 115, "name": "Finance"}], "history": [{"date": "2014-12-10", "action": "Read twice and referred to the Committee on Finance.", "chamber": "S", "chamber_id": 115, "importance": 1}], "sponsors": [{"people_id": 9402, "person_hash": "bsdo1kgr", "party_id": "1", "state_id": 52, "party": "D", "role_id": 2, "role": "Sen", "name": "Sherrod Brown", "first_name": "Sherrod", "middle_name": "", "last_name": "Brown", "suffix": "", "nickname": "", "district": "SD-OH", "ftm_eid": 3439679, "votesmart_id": 27018, "opensecrets_id": "N00003535", "knowwho_pid": 159013, "ballotpedia": "Sherrod_Brown", "sponsor_type_id": 1, "sponsor_order": 1, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}], "sasts": [], "subjects": [{"subject_id": 13742, "subject_name": "Canada"}, {"subject_id": 13452, "subject_name": "Competitiveness, trade promotion, trade deficits"}, {"subject_id": 13148, "subject_name": "Corporate finance and management"}, {"subject_id": 20695, "subject_name": "Customs enforcement"}, {"subject_id": 13169, "subject_name": "Economic performance and conditions"}, {"subject_id": 13743, "subject_name": "Free trade and trade barriers"}, {"subject_id": 22688, "subject_name": "Government studies and investigations"}, {"subject_id": 13493, "subject_name": "Inflation and prices"}, {"subject_id": 13235, "subject_name": "Latin America"}, {"subject_id": 13243, "subject_name": "Mexico"}, {"subject_id": 13678, "subject_name": "Tariffs"}, {"subject_id": 13694, "subject_name": "Trade agreements and negotiations"}, {"subject_id": 13731, "subject_name": "Foreign trade and international finance"}], "texts": [{"doc_id": 1057783, "date": "2014-12-23", "type": "Introduced", "type_id": 1, "mime": "application/pdf", "mime_id": 2, "url": "https://legiscan.com/US/text/SB2994/id/1057783", "state_link": "https://www.congress.gov/113/bills/s2994/BILLS-113s2994is.pdf", "text_size": 273501, "text_hash": "002dd6cd4fde7bd29c913c9d35b5499b"}], "votes": [], "amendments": [], "supplements": [], "calendar": []}}