{"status": "OK", "bill": {"bill_id": 709361, "change_hash": "331b3efbac8342d42fe12ad5f29637a0", "session_id": 1156, "session": {"session_id": 1156, "state_id": 52, "year_start": 2015, "year_end": 2016, "prefile": 0, "sine_die": 1, "prior": 1, "special": 0, "session_tag": "Regular Session", "session_title": "2015-2016 Regular Session", "session_name": "114th Congress"}, "url": "https://legiscan.com/US/bill/HB644/2015", "state_link": "https://www.congress.gov/bill/114th-congress/house-bill/644/all-info", "completed": 1, "status": 4, "status_date": "2016-02-24", "progress": [{"date": "2015-02-02", "event": 1}, {"date": "2015-02-02", "event": 9}, {"date": "2015-02-04", "event": 10}, {"date": "2015-02-23", "event": 2}, {"date": "2016-02-23", "event": 3}, {"date": "2016-02-24", "event": 8}, {"date": "2016-02-24", "event": 4}], "state": "US", "state_id": 52, "bill_number": "HB644", "bill_type": "B", "bill_type_id": "1", "body": "H", "body_id": 114, "current_body": "S", "current_body_id": 115, "title": "America Gives More Act of 2015", "description": "America Gives More Act of 2015 TITLE I--TRADE FACILITATION AND TRADE ENFORCEMENT (Sec. 101) This bill directs the U.S. Customs and Border Protection (CBP) to ensure that CBP partnership programs, such as the Customs-Trade Partnership Against Terrorism, provide trade benefits to importers, exporters, and certain other private sector entities that meet program requirements. (Sec. 102) The Government Accountability Office (GAO) shall report to Congress on the effectiveness of CBP enforcement of U.S. customs and trade laws (trade enforcement). (Sec. 103) CBP shall establish priorities and performance standards to measure levels of achievement of customs modernization, the movement of merchandise into and out of the United States (trade facilitation), and trade enforcement functions and programs. (Sec. 104) The CBP and U.S. Immigration and Customs Enforcement (ICE) shall: establish educational seminars to improve CBP classification and appraisal of imported articles, trade enforcement, and facilitation of international trade; and develop biennially a joint strategic plan for improving trade enforcement and trade facilitation. (Sec. 106) This bill amends the Consolidated Omnibus Budget Reconciliation Act of 1985 (COBRA) to authorize appropriations for FY2016-FY2018 from the Customs Commercial and Homeland Security Automation Account to complete the development and implementation of the Automated Commercial Environment computer system. The CBP shall report to Congress on: its incorporation of all core trade processing capabilities into the Automated Commercial Environment computer system to conform with admissibility criteria of federal agencies participating in the International Trade Data System (ITDS); the components of the National Customs Automation Program that have not been implemented; and any additional Program components it has initiated to complete the development, establishment, and implementation of the computer system. The CBP must update the report as well as: evaluate the effectiveness of the implementation of the computer system, and detail monthly the percentage of trade processed in the Automated Commercial Environment since September 30, 2016. The GAO must report to Congress on: the progress of other federal agencies in accessing and utilizing the Automated Commercial Environment, and the potential cost savings to the government and importers and exporters and the potential benefits to trade enforcement if the identified elements are implemented. (Sec. 107) This bill amends the Tariff Act of 1930 to require the Department of the Treasury (Treasury) to work with the head of each agency participating in the ITDS and the Interagency Steering Committee to ensure that, among other duties, it: develops and maintains the necessary information technology infrastructure to support the operation of the ITDS, submits all data to the ITDS electronically, and arranges to share information between each agency and the CBP. (Sec. 108) It shall be a U.S. negotiating objective in any negotiation for a mutual recognition arrangement or similar agreement with a foreign country on partnership programs to seek to ensure the compatibility of that country's partnership programs with CBP partnership programs to enhance security, trade facilitation, and trade enforcement. The Department of Homeland Security (DHS) shall consult with specified congressional committees within 30 days before initiating negotiations and within 30 days before entering into an agreement. (Sec. 109) Treasury and DHS shall jointly establish a Commercial Customs Operations Advisory Committee. (Sec. 110) CBP shall develop and implement CBP-wide Centers of Excellence and Expertise to enhance the economic competitiveness of the United States. (Sec. 111) The National Targeting Center (established in the CBP Office of Field Operations under section 802 of this Act), in coordination with the CBP Office of Trade (established under that same section), shall conduct commercial risk assessment targeting and, when appropriate, issue Trade Alerts with respect to cargo destined for the United States. (Sec. 112) The Treasury Inspector General shall report biennially to Congress on oversight of revenue protection and enforcement measures. (Sec. 113) DHS and Treasury shall report jointly to Congress on security and revenue measures with respect to merchandise transported in bond. (Sec. 114) DHS shall establish a program to assign importer of record numbers. (Sec. 115) CBP shall establish an importer program that adjusts bond amounts for new importers and nonresident importers based on their assessed risk for the protection of federal revenue. (Sec. 116) The Tariff Act of 1930 is amended to direct Treasury to prescribe minimum standards to identify information that importers (including nonresident importers) are required to submit to customs brokers as well as reasonable procedures for such brokers to collect and verify the authenticity of such information. The CBP shall report to Congress recommendations for: determining the most timely and effective way to require foreign nationals to provide customs brokers with accurate information, comparable to that required of U.S. nationals, on the identity of foreign nationals seeking to import merchandise into the United States; and establishing a system for such brokers to review information maintained by relevant federal agencies to verify the identity of importers, including nonresident importers, seeking to import merchandise into the United States. (Sec. 117) The CBP shall establish specified priority trade issues and, when necessary, eliminate, consolidate, or modify them and establish new priority trade issues. The priority trade issues shall be: agriculture programs, antidumping (AD) and countervailing (CV) duties, import safety, intellectual property rights, revenue, textiles and wearing apparel, and trade agreements and preference programs. TITLE II--IMPORT HEALTH AND SAFETY (Sec. 201) The bill establishes an interagency Import Safety Working Group. (Sec. 202) DHS shall develop, and appropriately update, a joint import safety rapid response plan that sets forth protocols for the CBP to: coordinate federal responses to cargo entering the United States that poses a threat to the health or safety of U.S. consumers, and use in recovering from or mitigating the effects of actions and responses to such an incident. (Sec. 203) CBP shall ensure that CBP personnel assigned to U.S. ports of entry are effectively trained to ensure the safety and expeditious entry of merchandise into the United States. TITLE III--IMPORT-RELATED PROTECTION OF INTELLECTUAL PROPERTY RIGHTS (Sec. 302) The Tariff Act of 1930 is amended to declare that, upon suspicion that merchandise is being imported into the United States in violation of U.S. trademark or copyright infringement laws, the CBP shall provide the trademark or copyright owner any information appearing on the merchandise and its packaging and labels, including any unredacted images of them, if testing by the owner would assist in determining a violation. The CBP shall not provide such information if it would compromise an ongoing law enforcement investigation or national security. (Sec. 303) A technology, product, service, device, or its component that is imported into the United States to circumvent U.S. copyright laws may be seized by the CBP and forfeited. (Sec. 304) DHS shall authorize a process for the enforcement of a copyright of an owner who has applied for registration of merchandise with the U.S. Copyright Office to the same extent as if the copyright were registered with the Office, including by sharing information, images, samples of the suspected infringing merchandise. (Sec. 305) DHS shall establish within ICE a National Intellectual Property Rights Coordination Center to coordinate U.S. activities to prevent the import and export of goods that infringe intellectual property rights. (Sec. 306) The CBP and ICE shall: add specified information to the joint strategic plan for enforcement of intellectual property rights; and assign sufficient personnel throughout the CBP and ICE to prevent the importation of merchandise infringing intellectual property rights, including three full-time ICE employees to the National Intellectual Property Rights Coordination Center. (Sec. 308) The CBP shall ensure that CBP officers are trained effectively to detect and identify merchandise destined for the United States that infringes intellectual property rights, including through use of donated hardware, software, equipment, and similar technologies. (Sec. 309) DHS shall coordinate with competent law enforcement and customs authorities of foreign countries, particularly by information-sharing, to enhance their efforts and U.S. efforts to enforce intellectual property rights. (Sec. 310) The CBP and ICE shall report annually to Congress on intellectual property rights enforcement. (Sec. 311) DHS shall carry out an educational campaign to inform travelers entering or leaving the United States about the legal, economic, and public health and safety implications of acquiring merchandise that infringes intellectual property rights outside the United States and importing it into the United States in violation of U.S. law. TITLE IV--PREVENTION OF EVASION OF ANTIDUMPING AND COUNTERVAILING DUTY ORDERS Enforce and Protect Act of 2015 (Sec. 403) This title applies to goods from Mexico and Canada as well as goods from elsewhere. Subtitle A--Actions Relating to Enforcement of Trade Remedy Laws (Sec. 411) DHS shall establish within the CBP Office of Trade (established under section 802 of this Act) a Trade Remedy Law Enforcement Division (including a National Targeting and Analysis Group) to prevent and counter evasion of AD or CV duty orders with respect to covered merchandise entered into the United States. The Group shall establish targeted risk assessment methodologies and standards for: evaluating the risk that cargo destined for the United States may constitute evading covered merchandise, and issuing Trade Alerts to U.S. ports of entry directing further inspection of specific merchandise to ensure compliance with U.S. trade remedy laws. (Sec. 412) Treasury, acting through the CBP, shall exercise all authorities to collect information needed to determine whether merchandise is entered into the United States through evasion. In cases where a person who filed an allegation concerning covered merchandise, a person alleged to have entered covered merchandise into the United States through evasion, or a foreign producer or exporter of such merchandise has failed to comply with a request for information, Treasury shall make an inference adverse to the interests of that person when determining whether the merchandise has entered the United States through evasion. (Sec. 413) Proprietary information submitted to the administering authority or the CBP may be disclosed without the submitter's consent to any CBP officer or employee directly investigating negligence, gross negligence, or fraud (currently, only fraud) relating to customs duties. Treasury may give the Department of Commerce or the U.S. International Trade Commission (USITC) any information necessary to enable it to assist Treasury to identify, through risk assessment targeting or otherwise, covered merchandise entered into the U.S. customs territory through evasion. (Sec. 414) Treasury shall negotiate and enter into bilateral agreements with customs authorities of foreign countries to prevent evasion of U.S. and foreign trade remedy laws. (Sec. 415) The principal U.S. negotiating objectives shall include obtaining the objectives of such bilateral agreements for any trade agreements under negotiation as of the enactment of this Act or in the future. Subtitle B--Investigation of Evasion of Trade Remedy Laws (Sec. 421) The Tariff Act of 1930 is amended to prescribe procedures for the CBP to initiate an AD or CV duty investigation with respect to covered merchandise imported into the United States upon: the filing of an allegation of evasion by an interested party of covered merchandise entering into the customs territory of the United States; or referral by any other federal agency, including Commerce or the USITC. The CBP, in cases of an affirmative final determination, shall: suspend the liquidation of unliquidated entries of covered merchandise, and require posting of a cash deposit. Subtitle C--Other Matters (Sec. 431) The CBP shall employ sufficient personnel with expertise and adequate training in and responsibility for preventing and investigating the entry of covered merchandise into the United States through evasion. (Sec. 432) The CBP shall report annually to Congress on its efforts to prevent and investigate the evasion of AD and CV duty orders with respect to covered merchandise entered into the U.S. customs territory. (Sec. 433) The bill repeals the requirement that the administering authority direct the CBP to allow an importer to opt to post a bond or security in lieu of a cash deposit for each entry of merchandise exported into the United States until completion of the administering authority's review as to whether AD or CV duties shall be imposed on the merchandise. The weighted average dumping margin or individual CV duty rate determined for a new exporter (shipper) or producer of merchandise in a review shall be based solely on the bona fide U.S. sales made by the exporter or producer during the period of review. TITLE V--SMALL BUSINESS TRADE ISSUES AND STATE TRADE COORDINATION Small Business Trade Enhancement Act of 2015 or State Trade Coordination Act (Sec. 502) This bill amends the Small Business Act to require the Chief Counsel for Advocacy of the Small Business Administration (SBA) to convene an Interagency Working Group within 30 days after the President notifies Congress of the intention to enter into negotiations with foreign countries with respect to trade agreements for the reduction or elimination of tariff or nontariff barriers. The SBA Chief Counsel for Advocacy shall by certain deadlines after convening the Group: identify diverse groups of small businesses to provide to the Group the views of small businesses in the manufacturing, services, and agriculture industries on the potential economic effects of the agreements; and report to Congress on the economic impacts of such agreements on small businesses. (Sec. 503) The SBA's Office of International Trade shall establish the State Trade Expansion Program to make grants to states for trade expansion programs for eligible small business concerns. The Office may, in carrying out the program, make competitive grants to states to increase the number of small business concerns exploring significant new trade opportunities. Appropriations are authorized for FY2016-FY2020. (Sec. 504) This bill amends the Export Enhancement Act of 1988 to direct the President to establish a State and Federal Export Promotion Coordination Working Group as a subcommittee of the Trade Promotion Coordination Committee (TPCC) to develop a strategy for improving coordination of federal and state resources for small business export promotion and export financing activities. The Office of International Trade shall report to Congress on recommendations for improving the experience of the Export.gov (or a successor) website as a comprehensive export information resource and a single website for exporters to submit all federally required information on the exportation of articles from the United States. Commerce shall make available on the website state information on export promotion and export financing resources, including information on state export promotion and export financing agencies and district export councils and trade associations. (Sec. 505) The membership of the TPCC shall include one or more presidential appointees representing state trade promotion agencies. Acting through the TPCC and in coordination with representatives of state trade promotion agencies, Commerce shall develop a plan to integrate resources and strategies of state trade promotion agencies into the overall federal trade promotion program. Acting through the U.S. Foreign and Commercial Service, Commerce shall develop an annual federal-state export strategy for goods and services for each state that submits to Commerce its export strategy for the upcoming year. In coordination with representatives of state trade promotion agencies, Commerce shall develop a framework to share export success information, and develop a coordinated set of reporting metrics. The strategic plan for federal trade promotion efforts shall include an annual survey and analysis of the overall effectiveness of federal-state coordination and export promotion goals, as well as best practices, recommendations to better assist small businesses, and other relevant matters. TITLE VI--ADDITIONAL ENFORCEMENT PROVISIONS (Sec. 601) This bill amends the Trade Act of 1974 to revise requirements for the identification of U.S. trade expansion priorities. The United States Trade Representative (USTR) shall consult with Congress to prioritize, investigate, and resolve acts, policies, or practices of foreign countries that raise concerns with respect to obligations under the World Trade Organization (WTO) Agreements or any other trade agreement to which the United States is a party, or that otherwise creates barriers to U.S. goods, services, or investment. (Sec. 602) The USTR may take action to suspend concessions or other obligations under the Uruguay Round Agreements Act if: enforcement action has terminated that was taken by the USTR to protect U.S. rights under any trade agreement or to eliminate an act, policy, or practice of a foreign country that violates that agreement or burdens or restricts U.S. commerce; the petitioner or any representative of the domestic industry that would benefit from reinstatement of such action requests the USTR for reinstatement; and the USTR meets certain consultation requirements. (Sec. 603) The USITC shall make an import monitoring tool available on a website to allow public access to data on the volume and value of imported goods to assess whether that data has changed over time. (Sec. 604) The bill establishes within the Office of the USTR an Interagency Center on Trade Implementation, Monitoring, and Enforcement to investigate disputes under the WTO as well as bilateral and regional trade agreements to which the United States is a party. (Sec. 605) DHS shall deposit into a special account certain interest earned on amounts realized by CBP on AD or CV duties through payments received by CBP on or after October 1, 2014. The interest shall be included in any CBP duty distributions to affected domestic producers for qualifying expenses. (Sec. 606) CBP shall ensure that appropriate resources address concerns that honey as well as illicit cultural property, archaeological or ethnological materials, and fish, wildlife, and plants are being imported into the United States in violation of U.S. customs laws. (Sec. 607) The USTR may take certain discretionary trade action against foreign countries that engage in unreasonable acts, policies, or practices that fail to enforce their commitments under trade agreements with the United States, including with respect to trade in goods and services, agriculture, foreign investment, intellectual property, and the environment. (Sec. 608) The CBP shall direct appropriate personnel and the use of its resources, including a database of the individual characteristics of honey produced in foreign countries, to address concerns that honey is being imported into the United States in violation of U.S. customs and trade laws. The bill expresses the sense of Congress that the Food and Drug Administration should establish promptly a national standard of identity for honey for the CBP to use to ensure that imports of honey are: (1) classified accurately for purposes of assessing duties, and (2) denied entry into the United States if such imports pose a threat to the health or safety of U.S. consumers. (Sec. 609) The Office of the USTR shall now include one presidentially appointed Chief Innovation and Intellectual Property Negotiator, who shall conduct trade negotiations and enforce trade agreements with respect to U.S. intellectual property as well as take appropriate actions to address foreign acts, policies, and practices with a significant adverse impact on the value of U.S. innovation. (Sec. 610) The USTR shall develop, within 90 days after submission of the National Trade Estimate, an action plan of certain benchmarks for achieving adequate protection of intellectual property rights, including trade secrets, for each foreign country placed and remaining on a priority watch list for at least one year. Amounts from the Trade Enforcement Trust Fund (established under section 611 of this title) may be expended by the USTR, but only as provided by appropriations Acts, to provide assistance to any developing country on the priority watch list to comply with the benchmarks in the action plan. (Sec. 611) The bill establishes a Trade Enforcement Trust Fund for deposit of amounts equivalent to AD and CV duty receipts, which the USTR shall use to seek to enforce obligations under the WTO Agreements and free trade agreements, monitor and ensure foreign country implementation of similar obligations, investigate and respond to complaint petitions, and support U.S. capacity-building efforts pursuant to any free trade agreement to which the United States is a party. The GAO shall: analyze the trade enforcement expenditures of each federal agency with trade responsibilities, and recommend additional employees and resources each agency may need to enforce effectively free trade agreements to which the United States is a party. TITLE VII--ENGAGEMENT ON CURRENCY EXCHANGE RATE AND ECONOMIC POLICIES (Sec. 701) Treasury shall report to Congress on the macroeconomic and currency exchange rate policies of each major U.S. trading partner. The President, through Treasury, shall take specified remedial action against any such countries that fail to adopt policies to correct the undervaluation of their currency and trade surplus with the United States. The President may waive this requirement, however, if it would have an adverse impact on the U.S. economy or would cause serious harm to U.S. national security. (Sec. 702) The bill establishes an Advisory Committee on International Exchange Rate Policy to advise Treasury on the impact of international exchange rates and financial policies on the U.S. economy. Appropriations are authorized. TITLE VIII--MATTERS RELATING TO U.S. CUSTOMS AND BORDER PROTECTION Subtitle A--Establishment of U.S. Customs and Border Protection U.S. Customs and Border Protection Authorization Act (Sec. 802) This bill amends the Homeland Security Act of 2002 to establish formally, in DHS, the CBP (formerly the U.S. Customs Service), headed by the Commissioner of CBP. There is established in the CBP: a Deputy Commissioner; the U.S. Border Patrol; an Office of Air and Marine Operations, including an Air and Marine Operations Center; an Office of Field Operations, including a National Targeting Center; an Office of Intelligence ; an Office of International Affairs; and an Office of Professional Responsibility. The CBP shall establish, and update triennially, certain standard operating procedures for CBP personnel. The CBP shall report annually to Congress on whether use of unmanned aerial systems (drones) conforms to such procedures. The CBP shall require all CBP agents and officers to participate in a specified amount of continuing education to maintain an understanding of federal legal rulings, court decisions, and departmental policies, procedures, and guidelines. The CBP shall ensure that: adequate access to food and water is provided as soon as possible to individuals apprehended and detained at or between a U.S. port of entry, and detainee rights are provided at CBP processing centers. The CBP shall publish wait times for travelers entering at the 20 U.S. airports with the highest volume of international travel and make this information available to the public on the CBP website. The Transportation Security Administration (TSA) shall be maintained as a distinct entity within DHS. The Office for Domestic Preparedness is removed from within the Directorate of Border and Transportation Security and establishes it simply within DHS. The functions of the Under Secretary for Border and Transportation Security shall be transferred to the DHS Secretary. The DHS Secretary (currently, the Under Secretary) may impose disciplinary action on any employee of the U.S. Immigration and Customs Enforcement and CBP who willfully deceives Congress or agency leadership on any matter. The bill establishes in the CBP an Office of Trade. The CBP shall transfer all functions of the Office of International Trade to the Office of Trade. The Office of International Trade shall be abolished. The CBP shall report to Congress on: the CBP Business Transformation Initiative, and supervisor-approved personal searches conducted in the previous year by CBP personnel. The CBP shall assess CBP's physical infrastructure and technology needs at the 20 busiest land ports of entry. DHS shall not enter into or renew an agreement with a foreign country government for a CBP-administered trusted traveler program unless that government certifies that it: routinely submits information about lost and stolen passports of its citizens and nationals to INTERPOL's Stolen and Lost Travel Document database, or makes such information available to the United States through another comparable means of reporting. The DHS shall submit to Congress a plan to create an agricultural specialist career track within CBP. The bill expresses the sense of Congress that the Foreign Language Award Program incentivizes CBP officers to attain and maintain competency in a foreign language. Subtitle B--Preclearance Operations Preclearance Authorization Act of 2015 (Sec. 813) Provided there is a valid aviation security preclearance agreement, DHS may establish CBP preclearance operations in a foreign country to: prevent terrorists, instruments of terrorism, and other security threats from entering the United States; prevent inadmissible persons from entering the United States; ensure merchandise destined for the United States complies with applicable U.S. customs laws; and ensure the prompt processing of persons eligible to travel to the United States. (Sec. 814) At least 60 days before an agreement to establish CBP preclearance operations in a foreign country becomes valid, DHS shall provide Congress with a copy of the agreement as well as other information on CBP preclearance operations. The establishment of preclearance operations at an airport in a foreign country under an agreement shall be conditioned on the requirements that: at least one U.S. passenger carrier operates at the airport, and the access of all U.S. passenger carriers to those preclearance operations is the same as the access of any non-U.S. passenger carrier. The CBP shall report quarterly to Congress on: the number of CBP officers assigned from U.S. ports of entry to preclearance operations; and the number of positions at U.S. ports of entry vacated by CBP officers that have been filled by other hired, trained, and equipped CBP officers. At least 60 days after a determination that CBP processing times have significantly increased at U.S. ports of entry from which CBP officers were reassigned to preclearance operations, if the vacated positions have not been filled, the CBP shall submit to Congress an implementation plan for reducing processing times at such U.S. ports. (Sec. 815) The TSA shall rescreen in the United States passengers and their property before they are permitted into sterile areas of U.S. airports if they have come from an airport in a foreign country that has failed to maintain security and protocols comparable to those of the United States. (Sec. 816) DHS may not enter into an agreement with a foreign country to establish or maintain CBP preclearance operations at an airport in that country unless it certifies that the foreign government: routinely submits information about lost and stolen passports of its citizens and nationals to INTERPOL's Stolen and Lost Travel Document database, or makes such information available to the United States through another comparable means of reporting. (Sec. 817) The CBP may enter into cost-sharing agreements with airports in foreign countries where preclearance operations have been established if: an executive agreement establishing such operations has been signed but not yet entered into force; and CBP has incurred, or expects to incur, initial preclearance operations costs. (Sec. 818) The Immigration and Nationality Act is amended to authorize the Department of Justice to receive in advance reimbursement for the costs of immigration inspection services provided at an airport. The Farm Security and Rural Investment Act of 2002 is amended similarly to authorize the Department of Agriculture to collect in advance the costs for preclearance operations with respect to animals or articles entering into the United States. TITLE IX--MISCELLANEOUS PROVISIONS (Sec. 901) The bill expresses the sense of Congress that the USTR should encourage other countries to establish commercially meaningful de minimis values for express and postal shipments exempt from customs duties and taxes and from certain other entry documentation requirements. This bill amends the Tariff Act of 1930 to increase from $200 to $800 the general de minimis aggregate fair retail value in the country of shipment of duty-free articles imported by one person on one day. (Sec. 902) Specified deadlines shall now apply for DHS to trade and customs revenue consultation requirements of the Security and Accountability for Every Port Act of 2006. (Sec. 903) This bill also prescribes or revises requirements under the Tariff Act of 1930 and the Harmonized Tariff Schedule of the United States for: certain penalties for customs brokers convicted of an act of terrorism; duty-free treatment of certain federal property exported and reimported without an advance in value or improvement in condition; duties on warranty repairs or alterations of articles exported from and then returned to the United States; exemption from duty treatment of the residue of bulk cargo contained in instruments of international traffic previously exported from the United States; drawback (refund of paid customs duties) on eligible merchandise imported into the United States and later exported or destroyed; assignment of CBP employees to perform customs services for charter flight passengers and their baggage; country of origin marking of certain castings imported into the United States; and elimination of the consumptive demand exception to the prohibition on the importation of goods made with convict labor, forced labor, or indentured labor. (Sec. 906) The GAO shall report to Congress on the modernization of drawback and refunds. (Sec. 907) The CBP shall report to Congress within one year after entering into any agreement under: the program for entering into reimbursable fee agreements for the provision of CBP services, upon the request of any persons, at existing CBP-serviced facilities, at new facilities, and at land border facilities; the pilot program authorizing the CBP to enter into partnerships with private sector and government entities at ports of entry for certain services and to accept certain donations; the program where CBP collects a customs user fee at designated small airports and other facilities; or the program authorizing CBP to establish preclearance operations in foreign countries. (Sec. 909) The bill states certain trade policies regarding Israel, and principal U.S. trade negotiating objectives relating to Israel for proposed trade agreements with foreign countries regarding commercial partnerships. The President shall report to Congress on politically motivated boycotts of, divestment from, and sanctions against Israel. No federal or state court shall recognize or enforce any foreign judgment entered against a U.S. person that conducts business operations in Israel, or any Israel-controlled territory, if the court determines that the foreign judgment is based, in whole or in part, on a foreign court determination that the U.S. person's conducting business operations in Israel or any Israel-controlled territory or with Israeli entities constitutes a violation of law. (Sec. 912) The Harmonized Tariff Schedule of the United States is amended to prescribe the duty-free treatment of certain recreational performance outerwear as well as of certain protective active footwear. (The Trade Preferences Extension Act of 2015 is amended to repeal similar provisions with respect to such articles.) (Sec. 914) This bill amends the Bipartisan Congressional Trade Priorities and Accountability Act of 2015 to revise the overall U.S. negotiating objectives for trade agreements with foreign countries for the reduction or elimination of tariff and nontariff barriers to ensure that such agreements do not require changes to U.S. immigration laws nor obligate the United States to greenhouse gas emissions measures. A new principal U.S. trade negotiating objective shall be to obtain competitive opportunities for U.S. exports of fish, seafood, and shellfish products in foreign markets equivalent to those opportunities afforded those foreign export items in U.S. markets. The bill revises the prohibition against applying trade authorities (fast track) procedures to congressional implementing bills for trade agreements with foreign countries that fail to make significant efforts to comply with minimum standards for the elimination of human trafficking (\"tier 3\" country). The prohibition itself shall not apply, however, if the President submits to Congress a letter stating the country has taken concrete actions to implement the principal recommendations in the most recent annual report on trafficking in persons. (Sec. 915) The President may give preferential treatment to certain articles imported directly from Nepal into the U.S. customs territory if that country meets certain requirements under the African Growth and Opportunity Act, including a market-based economy and the rule of law, the protection of human rights and internationally-recognized worker rights, elimination of trade barriers to the United States, and non-engagement in activities that undermine U.S. national security or foreign policy interests or support acts of international terrorism. Nepal must also meet certain eligibility criteria for designation as a beneficiary developing country under the Trade Act of 1974. Certain leather articles (trunks, suitcases, vanity cases, attache cases, briefcases, school satchels and similar containers) and textile or apparel articles imported directly from Nepal may enter the U.S. customs territory duty-free if: the article is the growth, product, or manufacture of Nepal, or Nepal is a textile or apparel article's country of origin; the President determines, after receiving advice from the U.S. International Trade Commission, that the article is not import-sensitive; and the sum of the cost or value of the materials produced in, and the manufacturing costs performed in, Nepal or the U.S. customs territory is at least 35% of the appraised value of the article at the time it is entered. Limits to 15% of the appraised value of an article at the time it is entered the cost or value of the materials produced in, and the manufacturing costs performed in, the U.S. customs territory and attributed to the 35% requirement. The CBP must verify annually that textile and apparel articles imported duty-free into the United States from Nepal are not being unlawfully transshipped into the United States. The President shall establish a trade facilitation and capacity building program to assist Nepal in the export of goods. The extension of preferential treatment to Nepal shall terminate after December 31, 2025. (Sec. 916) The Bipartisan Congressional Trade Priorities and Accountability Act of 2015 is amended to authorize the President to implement an agreement by members of the Asia-Pacific Economic Cooperation to reduce any rate of duty on certain environmental goods only if Congress is notified of agreement negotiations as well as U.S. objectives in those negotiations. (Sec. 917) The Tariff Act of 1930 is amended to require country of origin marking of certain castings, including inlet frames, tree and trench grates, lampposts, lamppost bases, cast utility poles, bollards, hydrants, and utility boxes. (Sec. 918) When the President submits to the Senate, under the Trade Act of 1974, a nomination for appointment as a Deputy USTR, the submission shall include information on the country, regional offices, and functions of the Office of the USTR with respect to which that individual will have responsibility. (Sec. 919) The bill expresses the sense of Congress urging specified congressional committees to advance, as soon as possible, a regular and predictable legislative process for the temporary suspension and reduction of duties on goods imported into the United States. (Sec. 920) The COBRA is amended to extend through September 30, 2025, the authority for customs user fees for the processing of merchandise formally entered or released into the United States. The United States-Korea Free Trade Agreement Implementation Act is also amended to extend through September 30, 2025, the increase from 0.21% ad valorem to 0.3464% ad valorem in the customs user fees for the processing of merchandise formally entered or released into the United States which is scheduled to begin on December 1, 2015. (Sec. 921) The Internal Revenue Code is amended to increase from $135 to $205 the maximum civil penalty, adjusted annually for inflation, for failure to file a tax return within 60 days of the deadline, except for reasonable cause and not the willful neglect of the taxpayer. (Sec. 922) This bill amends the Internet Tax Freedom Act to make permanent the ban on state and local: (1) taxation of Internet access, and (2) multiple or discriminatory taxes on electronic commerce.", "pending_committee_id": 0, "committee": [], "referrals": [{"date": "2015-02-02", "committee_id": 2317, "chamber": "H", "chamber_id": 114, "name": "Ways And Means"}], "history": [{"date": "2015-02-02", "action": "Introduced in House", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2015-02-02", "action": "Referred to the House Committee on Ways and Means.", "chamber": "H", "chamber_id": 114, "importance": 1}, {"date": "2015-02-04", "action": "Ordered to be Reported (Amended) by the Yeas and Nays: 22 - 14.", "chamber": "H", "chamber_id": 114, "importance": 1}, {"date": "2015-02-09", "action": "Reported (Amended) by the Committee on Ways and Means. H. Rept. 114-18.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2015-02-09", "action": "Placed on the Union Calendar, Calendar No. 12.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2015-02-10", "action": "Rules Committee Resolution H. Res. 101 Reported to House. The resolution provides for consideration of both H.R. 644 and H.R. 636 under closed rules.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2015-02-12", "action": "Considered under the provisions of rule H. Res. 101. (consideration: CR H1001-1017)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2015-02-12", "action": "The resolution provides for consideration of both H.R. 644 and H.R. 636 under closed rules.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2015-02-12", "action": "DEBATE - The House proceeded with 90 minutes of debate on H.R. 644.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2015-02-12", "action": "The previous question was ordered pursuant to the rule. (consideration: CR H1014)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2015-02-12", "action": "Mr. Neal moved to recommit with instructions to the Committee on Ways and Means. (consideration: CR H1014-1015; text: CR H1014-1015)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2015-02-12", "action": "DEBATE - The House proceeded with 10 minutes of debate on the motion to recommit with instructions, pending the reservation of a point of order. The instructions contained in the motion seek to require the bill to be reported back to the House with an amendment that adds 3 new sections to the bill. The point of order was subsequently withdrawn.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2015-02-12", "action": "The previous question on the motion to recommit with instructions was ordered without objection. (consideration: CR H1015)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2015-02-12", "action": "On motion to recommit with instructions Failed by the Yeas and Nays: 168 - 245 (Roll no. 79). (consideration: CR H1016)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2015-02-12", "action": "On passage Passed by the Yeas and Nays: 279 - 137 (Roll no. 80). (text: CR H1002)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2015-02-12", "action": "Motion to reconsider laid on the table Agreed to without objection.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2015-02-23", "action": "Received in the Senate.", "chamber": "S", "chamber_id": 115, "importance": 1}, {"date": "2015-04-16", "action": "Read the first time. Placed on Senate Legislative Calendar under Read the First Time.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2015-04-20", "action": "Read the second time. Placed on Senate Legislative Calendar under General Orders. Calendar No. 56.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2015-05-14", "action": "Measure laid before Senate by unanimous consent. (consideration: CR S2899-2908, S2946)", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2015-05-14", "action": "S.Amdt.1224 Amendment SA 1224 proposed by Senator Hatch. (consideration: CR S2899)", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2015-05-14", "action": "S.Amdt.1224 Amendment SA 1224 agreed to in Senate by Unanimous Consent.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2015-05-14", "action": "Passed Senate, under the order of 5/13/15, having achieved 60 votes in the affirmative, with an amendment and an amendment to the Title by Yea-Nay Vote. 78 - 20. Record Vote Number: 179. (consideration: CR S2907)", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2015-05-14", "action": "S.Amdt.1241 Amendment SA 1241 proposed by Senator McConnell for Senator Hatch. (consideration: CR S2946; text: CR S2946)", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2015-05-14", "action": "S.Amdt.1241 Amendment SA 1241 agreed to in Senate by Unanimous Consent.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2015-05-14", "action": "Message on Senate action sent to the House.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2015-06-12", "action": "Mr. Tiberi moved that the House agree with an amendment to the Senate amendments. (consideration: CR H4271-4333, H4335; text of Senate amendment as received in House: CR H4271-4295)", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2015-06-12", "action": "DEBATE - Pursuant to the provisions of H.Res. 305, the House proceeded with one hour of debate on the Tiberi motion that the House concur in the Senate amendment to the title of H.R. 644 and concur in the Senate amendment to the text of H.R. 644 with the amendment printed in part A of the House Report 114-146 modified by the amendment printed in part B of the report.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2015-06-12", "action": "POSTPONED PROCEEDINGS - Pursuant to clause 1(c) of Rule 19, further proceedings on the Tiberi motion to concur in Senate amendment with an amendment to H.R. 644 were postponed.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2015-06-12", "action": "On motion that the House agree with an amendment to the Senate amendments Agreed to by recorded vote: 240 - 190 (Roll no. 363). (text of Senate amendment with an amendment: CR H4295-4321)", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2015-06-12", "action": "Motion to reconsider laid on the table Agreed to without objection.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2015-06-23", "action": "Message on House action received in Senate and at desk: House amendment to Senate amendment.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2015-06-23", "action": "Measure laid before Senate by unanimous consent. (consideration: CR S4523, S4554)", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2015-06-23", "action": "Motion to insist on Senate amendment to House bill, agree to request for conference, and authorize the Presiding Officer to appoint conferees made in Senate.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2015-06-23", "action": "Cloture motion on the motion to insist on Senate amendment to House bill, agree to request for conference, and authorize the Presiding Officer to appoint conferees presented in Senate. (consideration: CR S4523; text: CR S4523)", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2015-06-23", "action": "The language of the motion to insist on the Senate amendment to the House bill and the corresponding cloture motion was amended to request a conference with the House by Unanimous Consent.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2015-06-24", "action": "Considered by Senate. (consideration: CR S4584, S4608)", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2015-06-24", "action": "Cloture motion on the motion to insist on Senate amendment to House bill, request a conference, and authorize the Presiding Officer to appoint conferees withdrawn by unanimous consent in Senate. (consideration: CR S4584)", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2015-06-24", "action": "Motion to insist on Senate amendment to House bill, request a conference, and authorize the Presiding Officer to appoint conferees, agreed to by Voice Vote. (consideration: CR S4584)", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2015-06-24", "action": "Senate insists on its amendment, asks for a conference, appoints conferees Hatch; Cornyn; Thune; Isakson; Wyden; Schumer; Stabenow. (consideration: CR S4584, S4608)", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2015-06-24", "action": "Message on Senate action sent to the House.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2015-12-01", "action": "Mr. Brady (TX) moved that the House insist upon its amendment to the Senate amendment, and agree to a conference (consiideration: CR H8838-8839)", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2015-12-01", "action": "DEBATE - The House proceeded with one hour of debate on the motion to agree to a conference on H.R. 644.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2015-12-01", "action": "The previous question was ordered without objection. (consideration: CR H8838)", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2015-12-01", "action": "On motion that the House insist upon its amendment to the Senate amendment, and agree to a conference Agreed to by recorded vote: 252 - 170 (Roll no. 652). (consideration: CR H8838-8839)", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2015-12-01", "action": "Ms. Kuster moved that the House instruct conferees. (consideration: CR H8846-8849)", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2015-12-01", "action": "DEBATE - The House proceeded with one hour of debate on the Kuster motion to instruct conferees. The instructions contained in the motion seek to require the managers on the part of the House to agree to the provisions contained in subtitle A of title VII of the Senate amendment relating to currency manipulation.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2015-12-01", "action": "The previous question was ordered without objection. (consideration: CR H8849)", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2015-12-01", "action": "POSTPONED PROCEEDINGS - At the conclusion of debate on the Kuster motion to instruct conferees the Chair put the question on adoption of the motion and by voice vote, announced that the noes had prevailed. Ms. Kuster demanded the yeas and nays and the Chair postponed further proceedings on the question of adoption of the motion until a time to be announced.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2015-12-02", "action": "Considered as unfinished business. (consideration: CR H8884)", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2015-12-02", "action": "On motion that the House instruct conferees Failed by the Yeas and Nays: 193 - 232 (Roll no. 655). (consideration: CR H8884)", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2015-12-02", "action": "Motion to reconsider laid on the table Agreed to without objection.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2015-12-02", "action": "The Speaker appointed conferees: Brady of Texas, Reichert, Tiberi, Levin, and Linda T. Sánchez of California.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2015-12-07", "action": "Conference held.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2015-12-09", "action": "Conferees agreed to file conference report.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2015-12-09", "action": "Conference papers: Senate report and manager's statement held at the desk in Senate.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2015-12-09", "action": "Conference report H. Rept. 114-376 filed. (text of conference report: CR H9104-9173)", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2015-12-11", "action": "ORDER OF PROCEDURE - Mr. Brady (TX) asked unanimous consent that the question on adopting a motion to recommit on the conference report to accompany H.R. 644 may be subject to postponement as though under clause 8 of rule 20. Agreed to without objection.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2015-12-11", "action": "Mr. Brady (TX) brought up conference report H. Rept. 114-376 for consideration pursuant to H.Res. 560. (consideration: CR H9286-9295)", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2015-12-11", "action": "DEBATE - The House proceeded with one hour of debate on the conference report to accompany H.R. 644.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2015-12-11", "action": "The previous question was ordered pursuant to the rule. (consideration: CR H9295)", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2015-12-11", "action": "Mr. Doggett moved to recommit with instructions to the conference committee. (consideration: CR H9295; text: CR H9295)", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2015-12-11", "action": "The previous question on the motion to recommit with instructions to conference committee was ordered without objection. (consideration: CR H9295)", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2015-12-11", "action": "POSTPONED PROCEEDINGS - The instructions contained in the Doggett motion to recommit seek to require the managers on the part of the House to to 1) disagree to a provision that bars the inclusion of climate change provisions in fast track trade deals, 2) disagree to a provision that weakens provisions to combat human trafficking, and 3) insist on the currency manipulation provisions from the Senate version of the Customs bill. The Chair put the question on adoption of the motion to recommit the conference report with instructions (which was not debatable) and by voice vote, announced that the noes had prevailed. Mr. Doggett demanded the yeas and nays and pursuant to a previous order of the House, the roll call vote on the motion to recommit the conference report with instructions was postponed until a time to be announced.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2015-12-11", "action": "The House proceeded to consider the conference report H.Rept. 114-376 as unfinished business. (consideration: CR H9296-9297)", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2015-12-11", "action": "On motion to recommit with instructions to conference committee Failed by the Yeas and Nays: 172 - 239 (Roll no. 692). (consideration: CR H9296)", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2015-12-11", "action": "Motions to reconsider laid on the table Agreed to without objection.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2015-12-11", "action": "On agreeing to the conference report Agreed to by recorded vote: 256 - 158 (Roll no. 693). (consideration: CR H9296-9297)", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2015-12-14", "action": "Conference papers: message on House action held at the desk in Senate.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2016-02-09", "action": "Conference report considered in Senate. (consideration: CR S730)", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2016-02-09", "action": "Cloture motion on the conference report to accompany H.R. 644 presented in Senate. (consideration: CR S730; text: CR S730)", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2016-02-11", "action": "Conference report considered in Senate. (consideration: CR S836-846)", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2016-02-11", "action": "Cloture on the conference report invoked in Senate by Yea-Nay Vote. 73 - 22. Record Vote Number: 21. (consideration: CR S840; text: CR S840)", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2016-02-11", "action": "Senate agreed to conference report by Yea-Nay Vote. 75 - 20. Record Vote Number: 22. (consideration: CR S846)", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2016-02-11", "action": "Message on Senate action sent to the House.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2016-02-23", "action": "Presented to President.", "chamber": "S", "chamber_id": 115, "importance": 1}, {"date": "2016-02-24", "action": "Signed by President.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2016-02-24", "action": "Became Public Law No: 114-125. (TXT | PDF)", "chamber": "S", "chamber_id": 115, "importance": 1}], "sponsors": [{"people_id": 9630, "person_hash": "sibgm7xn", "party_id": "2", "state_id": 52, "party": "R", "role_id": 1, "role": "Rep", "name": "Tom Reed", "first_name": "Tom", "middle_name": "", "last_name": "Reed", "suffix": "II", "nickname": "", "district": "HD-NY-23", "ftm_eid": 17657549, "votesmart_id": 127046, "opensecrets_id": "N00030949", "knowwho_pid": 284901, "ballotpedia": "Tom_Reed_(New_York)", "sponsor_type_id": 1, "sponsor_order": 1, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 9332, "person_hash": "v8k1jqbe", "party_id": "2", "state_id": 52, "party": "R", "role_id": 1, "role": "Rep", "name": "Patrick Tiberi", "first_name": "Patrick", "middle_name": "J.", "last_name": "Tiberi", "suffix": "", "nickname": "", "district": "HD-OH-12", "ftm_eid": 2781461, "votesmart_id": 8404, "opensecrets_id": "N00009699", "knowwho_pid": 197859, "ballotpedia": "Patrick_Tiberi", "sponsor_type_id": 2, "sponsor_order": 2, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 9320, "person_hash": "5fr70taq", "party_id": "2", "state_id": 52, "party": "R", "role_id": 1, "role": "Rep", "name": "Aaron Schock", "first_name": "Aaron", "middle_name": "", "last_name": "Schock", "suffix": "", "nickname": "", "district": "HD-IL-18", "ftm_eid": 6656178, "votesmart_id": 33428, "opensecrets_id": "N00029273", "knowwho_pid": 228382, "ballotpedia": "Aaron_Schock", "sponsor_type_id": 2, "sponsor_order": 3, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 16456, "person_hash": "s28gl75q", "party_id": "2", "state_id": 52, "party": "R", "role_id": 1, "role": "Rep", "name": "Ryan Costello", "first_name": "Ryan", "middle_name": "A.", "last_name": "Costello", "suffix": "", "nickname": "", "district": "HD-PA-6", "ftm_eid": 23442796, "votesmart_id": 133557, "opensecrets_id": "N00031064", "knowwho_pid": 288232, "ballotpedia": "Ryan_Costello", "sponsor_type_id": 2, "sponsor_order": 4, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 11137, "person_hash": "3ixm419p", "party_id": "2", "state_id": 52, "party": "R", "role_id": 1, "role": "Rep", "name": "Mike Kelly", "first_name": "Mike", "middle_name": "", "last_name": "Kelly", "suffix": "", "nickname": "", "district": "HD-PA-3", "ftm_eid": 5007914, "votesmart_id": 119463, "opensecrets_id": "N00031647", "knowwho_pid": 286955, "ballotpedia": "Mike_Kelly_(Pennsylvania)", "sponsor_type_id": 2, "sponsor_order": 5, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 11130, "person_hash": "i3825b1v", "party_id": "2", "state_id": 52, "party": "R", "role_id": 1, "role": "Rep", "name": "Christopher Gibson", "first_name": "Christopher", "middle_name": "P.", "last_name": "Gibson", "suffix": "", "nickname": "", "district": "HD-NY-19", "ftm_eid": 4739823, "votesmart_id": 127042, "opensecrets_id": "N00031998", "knowwho_pid": 287304, "ballotpedia": "Chris_Gibson", "sponsor_type_id": 2, "sponsor_order": 6, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 9308, "person_hash": "f13hlhal", "party_id": "2", "state_id": 52, "party": "R", "role_id": 1, "role": "Rep", "name": "Erik Paulsen", "first_name": "Erik", "middle_name": "", "last_name": "Paulsen", "suffix": "", "nickname": "", "district": "HD-MN-3", "ftm_eid": 17658795, "votesmart_id": 3833, "opensecrets_id": "N00029391", "knowwho_pid": 195908, "ballotpedia": "Erik_Paulsen", "sponsor_type_id": 2, "sponsor_order": 7, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 9375, "person_hash": "0yi6llcq", "party_id": "2", "state_id": 52, "party": "R", "role_id": 1, "role": "Rep", "name": "Devin Nunes", "first_name": "Devin", "middle_name": "", "last_name": "Nunes", "suffix": "", "nickname": "", "district": "HD-CA-22", "ftm_eid": 2429326, "votesmart_id": 16725, "opensecrets_id": "N00007248", "knowwho_pid": 211691, "ballotpedia": "Devin_Nunes", "sponsor_type_id": 2, "sponsor_order": 8, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}], "sasts": [{"type_id": 8, "type": "Related", "sast_bill_number": "HR101", "sast_bill_id": 719443}, {"type_id": 8, "type": "Related", "sast_bill_number": "SB1269", "sast_bill_id": 778102}, {"type_id": 8, "type": "Related", "sast_bill_number": "SB1015", "sast_bill_id": 773301}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB2523", "sast_bill_id": 781591}, {"type_id": 8, "type": "Related", "sast_bill_number": "HR305", "sast_bill_id": 784957}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB1947", "sast_bill_id": 773659}, {"type_id": 8, "type": "Related", "sast_bill_number": "HR560", "sast_bill_id": 799678}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB2029", "sast_bill_id": 774335}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB4184", "sast_bill_id": 799004}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB1907", "sast_bill_id": 773298}], "subjects": [{"subject_id": 13396, "subject_name": "Alaska"}, {"subject_id": 81061, "subject_name": "Charitable contributions"}, {"subject_id": 13175, "subject_name": "Employee benefits and pensions"}, {"subject_id": 13187, "subject_name": "Financial services and investments"}, {"subject_id": 13190, "subject_name": "Food assistance and relief"}, {"subject_id": 13225, "subject_name": "Income tax deductions"}, {"subject_id": 13379, "subject_name": "Indian lands and resources rights"}, {"subject_id": 13425, "subject_name": "Land use and conservation"}, {"subject_id": 13316, "subject_name": "Sales and excise taxes"}, {"subject_id": 13280, "subject_name": "Social work, volunteer service, charitable organizations"}, {"subject_id": 13738, "subject_name": "Tax-exempt organizations"}, {"subject_id": 13126, "subject_name": "Administrative law and regulatory procedures"}, {"subject_id": 13384, "subject_name": "Administrative remedies"}, {"subject_id": 13127, "subject_name": "Advisory bodies"}, {"subject_id": 13612, "subject_name": "Agricultural trade"}, {"subject_id": 13754, "subject_name": "Arab-Israeli relations"}, {"subject_id": 13625, "subject_name": "Archaeology and anthropology"}, {"subject_id": 13135, "subject_name": "Aviation and airports"}, {"subject_id": 13742, "subject_name": "Canada"}, {"subject_id": 13452, "subject_name": "Competitiveness, trade promotion, trade deficits"}, {"subject_id": 13144, "subject_name": "Computers and information technology"}, {"subject_id": 13146, "subject_name": "Congressional oversight"}, {"subject_id": 13654, "subject_name": "Currency"}, {"subject_id": 20695, "subject_name": "Customs enforcement"}, {"subject_id": 13157, "subject_name": "Department of Homeland Security"}, {"subject_id": 13169, "subject_name": "Economic performance and conditions"}, {"subject_id": 13177, "subject_name": "Employment discrimination and employee rights"}, {"subject_id": 13641, "subject_name": "Environmental regulatory procedures"}, {"subject_id": 13184, "subject_name": "Executive agency funding and structure"}, {"subject_id": 13737, "subject_name": "Federal officials"}, {"subject_id": 13743, "subject_name": "Free trade and trade barriers"}, {"subject_id": 14018, "subject_name": "Gaza Strip"}, {"subject_id": 13198, "subject_name": "Government employee pay, benefits, personnel management"}, {"subject_id": 13200, "subject_name": "Government information and archives"}, {"subject_id": 22688, "subject_name": "Government studies and investigations"}, {"subject_id": 13203, "subject_name": "Government trust funds"}, {"subject_id": 13547, "subject_name": "Historical and cultural resources"}, {"subject_id": 13402, "subject_name": "Human rights"}, {"subject_id": 13614, "subject_name": "Intellectual property"}, {"subject_id": 13230, "subject_name": "Interest, dividends, interest rates"}, {"subject_id": 13685, "subject_name": "International monetary system and foreign exchange"}, {"subject_id": 13232, "subject_name": "International organizations and cooperation"}, {"subject_id": 13755, "subject_name": "Israel"}, {"subject_id": 13234, "subject_name": "Labor standards"}, {"subject_id": 13235, "subject_name": "Latin America"}, {"subject_id": 13591, "subject_name": "Legislative rules and procedure"}, {"subject_id": 13701, "subject_name": "Manufacturing"}, {"subject_id": 13243, "subject_name": "Mexico"}, {"subject_id": 13448, "subject_name": "Middle East"}, {"subject_id": 13744, "subject_name": "Office of the U.S. Trade Representative"}, {"subject_id": 20826, "subject_name": "Palestinians"}, {"subject_id": 13258, "subject_name": "Performance measurement"}, {"subject_id": 13640, "subject_name": "Product safety and quality"}, {"subject_id": 13611, "subject_name": "Sanctions"}, {"subject_id": 13317, "subject_name": "Smuggling and trafficking"}, {"subject_id": 13678, "subject_name": "Tariffs"}, {"subject_id": 13319, "subject_name": "Tax administration and collection, taxpayers"}, {"subject_id": 13694, "subject_name": "Trade agreements and negotiations"}, {"subject_id": 13416, "subject_name": "Trade restrictions"}, {"subject_id": 13533, "subject_name": "Travel and tourism"}, {"subject_id": 13861, "subject_name": "U.S. International Trade Commission"}, {"subject_id": 13648, "subject_name": "User charges and fees"}, {"subject_id": 13527, "subject_name": "Visas and passports"}, {"subject_id": 14046, "subject_name": "West Bank"}, {"subject_id": 13337, "subject_name": "Wildlife conservation and habitat protection"}, {"subject_id": 13303, "subject_name": "Youth employment and child labor"}, {"subject_id": 13276, "subject_name": "Small business"}, {"subject_id": 13548, "subject_name": "Horticulture and plants"}, {"subject_id": 13358, "subject_name": "Armed forces and national security"}, {"subject_id": 13511, "subject_name": "Food industry and services"}], "texts": [{"doc_id": 1106587, "date": "2015-02-04", "type": "Introduced", "type_id": 1, "mime": "application/pdf", "mime_id": 2, "url": "https://legiscan.com/US/text/HB644/id/1106587", "state_link": "https://www.congress.gov/114/bills/hr644/BILLS-114hr644ih.pdf", "text_size": 251972, "text_hash": "c92a14c59287882f153db040bc7ad855"}, {"doc_id": 1114485, "date": "2015-02-10", "type": "Introduced", "type_id": 1, "mime": "application/pdf", "mime_id": 2, "url": "https://legiscan.com/US/text/HB644/id/1114485", "state_link": "https://www.congress.gov/114/bills/hr644/BILLS-114hr644rh.pdf", "text_size": 257315, "text_hash": "ab9bf8ba23790463d3326f29e5a6f1a2"}, {"doc_id": 1125582, "date": "2015-02-13", "type": "Engrossed", "type_id": 4, "mime": "application/pdf", "mime_id": 2, "url": "https://legiscan.com/US/text/HB644/id/1125582", "state_link": "https://www.congress.gov/114/bills/hr644/BILLS-114hr644eh.pdf", "text_size": 125950, "text_hash": "d9b191f190021b1858293adf3d1958a6"}, {"doc_id": 1212031, "date": "2015-04-22", "type": "Introduced", "type_id": 1, "mime": "application/pdf", "mime_id": 2, "url": "https://legiscan.com/US/text/HB644/id/1212031", "state_link": "https://www.congress.gov/114/bills/hr644/BILLS-114hr644pcs.pdf", "text_size": 224303, "text_hash": "bfdc5310ba6c678b7f834eaf36e9d7af"}, {"doc_id": 1230571, "date": "2015-05-15", "type": "Amended", "type_id": 3, "mime": "application/pdf", "mime_id": 2, "url": "https://legiscan.com/US/text/HB644/id/1230571", "state_link": "https://www.congress.gov/114/bills/hr644/BILLS-114hr644eas.pdf", "text_size": 547639, "text_hash": "a23f6efec70a6cd8fc42b6f18d1e8526"}, {"doc_id": 1251375, "date": "2015-06-23", "type": "Amended", "type_id": 3, "mime": "application/pdf", "mime_id": 2, "url": "https://legiscan.com/US/text/HB644/id/1251375", "state_link": "https://www.congress.gov/114/bills/hr644/BILLS-114hr644eah.pdf", "text_size": 420300, "text_hash": "34224bdc4374ec2e63483309b7e69c49"}, {"doc_id": 1336568, "date": "2016-02-11", "type": "Enrolled", "type_id": 5, "mime": "application/pdf", "mime_id": 2, "url": "https://legiscan.com/US/text/HB644/id/1336568", "state_link": "https://www.congress.gov/114/bills/hr644/BILLS-114hr644enr.pdf", "text_size": 419736, "text_hash": "d99757fd6ed49a6d2f9ec5f4936407d5"}], "votes": [{"roll_call_id": 394551, "date": "2015-02-12", "desc": "On Motion to Recommit with Instructions", "yea": 168, "nay": 245, "nv": 19, "absent": 0, "total": 432, "passed": 0, "chamber": "H", "chamber_id": 114, "url": "https://legiscan.com/US/rollcall/HB644/id/394551", "state_link": "https://clerk.house.gov/Votes/201579"}, {"roll_call_id": 394552, "date": "2015-02-12", "desc": "On Passage", "yea": 279, "nay": 137, "nv": 16, "absent": 0, "total": 432, "passed": 1, "chamber": "H", "chamber_id": 114, "url": "https://legiscan.com/US/rollcall/HB644/id/394552", "state_link": "https://clerk.house.gov/Votes/201580"}, {"roll_call_id": 447105, "date": "2015-05-14", "desc": "On Passage of the Bill H.R. 644", "yea": 78, "nay": 20, "nv": 2, "absent": 0, "total": 100, "passed": 1, "chamber": "S", "chamber_id": 115, "url": "https://legiscan.com/US/rollcall/HB644/id/447105", "state_link": "https://www.senate.gov/legislative/LIS/roll_call_votes/vote1141/vote_114_1_00179.xml"}, {"roll_call_id": 459646, "date": "2015-06-12", "desc": "Concurring in Senate amendments with amendment", "yea": 240, "nay": 190, "nv": 4, "absent": 0, "total": 434, "passed": 1, "chamber": "H", "chamber_id": 114, "url": "https://legiscan.com/US/rollcall/HB644/id/459646", "state_link": "https://clerk.house.gov/Votes/2015363"}, {"roll_call_id": 481584, "date": "2015-12-01", "desc": "On Motion To Go To Conference", "yea": 252, "nay": 170, "nv": 11, "absent": 0, "total": 433, "passed": 1, "chamber": "H", "chamber_id": 114, "url": "https://legiscan.com/US/rollcall/HB644/id/481584", "state_link": "https://clerk.house.gov/Votes/2015652"}, {"roll_call_id": 481661, "date": "2015-12-02", "desc": "On Motion to Instruct Conferees", "yea": 193, "nay": 232, "nv": 8, "absent": 0, "total": 433, "passed": 0, "chamber": "H", "chamber_id": 114, "url": "https://legiscan.com/US/rollcall/HB644/id/481661", "state_link": "https://clerk.house.gov/Votes/2015655"}, {"roll_call_id": 482297, "date": "2015-12-11", "desc": "On Motion to Recommit Conference Report with Instructions", "yea": 172, "nay": 239, "nv": 22, "absent": 0, "total": 433, "passed": 0, "chamber": "H", "chamber_id": 114, "url": "https://legiscan.com/US/rollcall/HB644/id/482297", "state_link": "https://clerk.house.gov/Votes/2015692"}, {"roll_call_id": 482298, "date": "2015-12-11", "desc": "On Agreeing to the Conference Report", "yea": 256, "nay": 158, "nv": 19, "absent": 0, "total": 433, "passed": 1, "chamber": "H", "chamber_id": 114, "url": "https://legiscan.com/US/rollcall/HB644/id/482298", "state_link": "https://clerk.house.gov/Votes/2015693"}, {"roll_call_id": 495897, "date": "2016-02-11", "desc": "On the Cloture Motion H.R. 644", "yea": 73, "nay": 22, "nv": 5, "absent": 0, "total": 100, "passed": 1, "chamber": "S", "chamber_id": 115, "url": "https://legiscan.com/US/rollcall/HB644/id/495897", "state_link": "https://www.senate.gov/legislative/LIS/roll_call_votes/vote1142/vote_114_2_00021.xml"}, {"roll_call_id": 495898, "date": "2016-02-11", "desc": "On the Conference Report H.R. 644", "yea": 75, "nay": 20, "nv": 5, "absent": 0, "total": 100, "passed": 1, "chamber": "S", "chamber_id": 115, "url": "https://legiscan.com/US/rollcall/HB644/id/495898", "state_link": "https://www.senate.gov/legislative/LIS/roll_call_votes/vote1142/vote_114_2_00022.xml"}], "amendments": [], "supplements": [], "calendar": []}}