{"status": "OK", "bill": {"bill_id": 773298, "change_hash": "b8769a50f48614bc2ae39b153f9453e3", "session_id": 1156, "session": {"session_id": 1156, "state_id": 52, "year_start": 2015, "year_end": 2016, "prefile": 0, "sine_die": 1, "prior": 1, "special": 0, "session_tag": "Regular Session", "session_title": "2015-2016 Regular Session", "session_name": "114th Congress"}, "url": "https://legiscan.com/US/bill/HB1907/2015", "state_link": "https://www.congress.gov/bill/114th-congress/house-bill/1907/all-info", "completed": 0, "status": 1, "status_date": "2015-04-21", "progress": [{"date": "2015-04-21", "event": 1}, {"date": "2015-04-21", "event": 9}, {"date": "2015-04-21", "event": 9}, {"date": "2015-04-21", "event": 9}, {"date": "2015-04-21", "event": 9}, {"date": "2015-04-21", "event": 9}, {"date": "2015-04-21", "event": 9}, {"date": "2015-04-23", "event": 10}, {"date": "2015-04-23", "event": 9}, {"date": "2015-04-27", "event": 9}], "state": "US", "state_id": 52, "bill_number": "HB1907", "bill_type": "B", "bill_type_id": "1", "body": "H", "body_id": 114, "current_body": "H", "current_body_id": 114, "title": "Trade Facilitation and Trade Enforcement Act of 2015", "description": "Trade Facilitation and Trade Enforcement Act of 2015 TITLE I--TRADE FACILITATION AND TRADE ENFORCEMENT (Sec. 101) This bill directs the U.S. Customs and Border Protection (CBP) to ensure that CBP partnership programs, such as the Customs-Trade Partnership Against Terrorism, provide trade benefits to importers, exporters, and certain other private sector entities that meet program requirements. (Sec. 102) The Government Accountability Office (GAO) shall report to Congress on the effectiveness of CBP enforcement of U.S. customs and trade laws (trade enforcement). (Sec. 103) CBP shall establish priorities and performance standards to measure levels of achievement of customs modernization, the movement of merchandise into and out of the United States (trade facilitation), and trade enforcement functions and programs. (Sec. 104) CBP and U.S. Immigration and Customs Enforcement (ICE) shall: establish educational seminars to improve CBP classification and appraisal of imported articles, trade enforcement, and facilitation of international trade; and develop biennially a joint strategic plan for improving trade enforcement and trade facilitation. (Sec. 106) This bill amends the Consolidated Omnibus Budget Reconciliation Act of 1985 (COBRA) to authorize appropriations for FY2016-FY2018 from the Customs Commercial and Homeland Security Automation Account to complete the development and implementation of the Automated Commercial Environment computer system. The Customs Border Security Act of 2002 is amended to require CBP to report to Congress on: its incorporation of all core trade processing capabilities into the Automated Commercial Environment computer system to conform with admissibility criteria of federal agencies participating in the International Trade Data System (ITDS); the components of the National Customs Automation Program that have not been implemented; and any additional Program components it has initiated to complete the development, establishment, and implementation of the computer system. The CBP must update the report as well as: evaluate the effectiveness of the implementation of the computer system, and detail monthly the percentage of trade processed in the Automated Commercial Environment since September 30, 2016. The GAO must report to Congress on: the progress of other federal agencies in accessing and utilizing the Automated Commercial Environment, and the potential cost savings to the government and importers and exporters and the potential benefits to trade enforcement if the identified elements are implemented. (Sec. 107) This bill amends the Tariff Act of 1930 to require the Department of the Treasury (Treasury) to work with the head of each agency participating in the ITDS and the Interagency Steering Committee to ensure that, among other duties, it: develops and maintains the necessary information technology infrastructure to support the operation of the ITDS, submits all data to the ITDS electronically, and arranges to share information between each agency and the CBP. (Sec. 108) It shall be a U.S. negotiating objective in any negotiation for a mutual recognition arrangement with a foreign country on partnership programs to seek to ensure the compatibility of that country's partnership programs with CBP partnership programs to enhance trade facilitation and trade enforcement. The Department of Homeland Security (DHS) shall consult with specified congressional committees within 30 days before initiating negotiations and within 30 days before entering into an agreement. (Sec. 109) Treasury and DHS shall jointly establish a Commercial Customs Operations Advisory Committee. (Sec. 110) CBP shall develop and implement CBP-wide Centers of Excellence and Expertise to enhance the economic competitiveness of the United States. (Sec. 111) DHS shall establish within the CBP Office of International Trade a Commercial Targeting Division (including National Targeting and Analysis Groups) to conduct commercial risk assessment targeting and, when needed, issue trade alerts with respect to cargo destined for the United States. (Sec. 112) The Treasury Inspector General shall report biennially to Congress on oversight of revenue protection and enforcement measures. (Sec. 113) DHS and Treasury shall report jointly to Congress on security and revenue measures with respect to merchandise transported in bond. (Sec. 114) DHS shall establish a program to assign importer of record numbers. (Sec. 115) CBP shall establish a new importer program that adjusts bond amounts for new importers based on the level of risk assessed for protection of federal revenue. (Sec. 116) The Tariff Act of 1930 is amended to direct Treasury to prescribe minimum standards to require customs brokers to implement, and importers (including nonresident importers) to comply with, reasonable procedures for collecting information to identify U.S. and non-resident importers seeking to import merchandise into the United States. The CBP Commissioner shall report to Congress recommendations for: determining the most effective way to require foreign nationals to provide customs brokers with accurate information, comparable to that required of U.S. nationals, on the identity of foreign nationals seeking to import merchandise into the United States; and establishing a system for such brokers and agencies to review information maintained by relevant federal agencies to verify the identity of importers, including nonresident importers, seeking to import merchandise into the United States. (Sec. 117) CBP shall require non-resident importers that are not validated Tier 2 or Tier 3 participants in the Customs-Trade Partnership Against Terrorism program to designate a resident agent in the United States with a power of attorney to accept service of process against the non-resident importer in connection with the importation of merchandise. Civil and criminal penalties are prescribed for failure to make this designation. TITLE II--IMPORT HEALTH AND SAFETY (Sec. 201) An interagency Import Safety Working Group is established. (Sec. 202) DHS shall develop, and appropriately update, a joint import safety rapid response plan that sets forth protocols for the U.S. Customs and Border Protection (CBP) to: coordinate federal responses to cargo entering the United States that poses a threat to the health or safety of U.S. consumers, and use in recovering from or mitigating the effects of actions and responses to such an incident. (Sec. 203) CBP shall ensure that CBP personnel assigned to U.S. ports of entry are effectively trained to ensure the safety and expeditious entry of merchandise into the United States. TITLE III--IMPORT-RELATED PROTECTION OF INTELLECTUAL PROPERTY RIGHTS (Sec. 302) The Tariff Act of 1930 is amended to declare that, upon suspicion that merchandise is being imported into the United States in violation of U.S. trademark or copyright infringement laws, the CBP shall provide the trademark or copyright owner any information appearing on the merchandise and its packaging and labels, including any unredacted images of them, if testing by the owner would assist in determining a violation. The CBP shall not provide such information if it would compromise an ongoing law enforcement investigation or national security. (Sec. 303) A technology, product, service, device, or its component that is imported into the United States to circumvent U.S. copyright laws may be seized and forfeited by the CBP. (Sec. 304) DHS shall authorize a process for the enforcement of a copyright of an owner who has applied for registration of merchandise with the U.S. Copyright Office to the same extent as if the copyright were registered with the Office, including by sharing information, images, samples of the suspected infringing merchandise. (Sec. 305) DHS shall establish within ICE a National Intellectual Property Rights Coordination Center to coordinate U.S. activities to prevent the import and export of goods that infringe intellectual property rights. (Sec. 306) The CBP and ICE shall: add specified information to the joint strategic plan for enforcement of intellectual property rights; and assign sufficient personnel throughout the CBP and ICE to prevent the importation of merchandise infringing intellectual property rights, including three full-time ICE employees to the National Intellectual Property Rights Coordination Center. (Sec. 308) The CBP shall ensure that CBP officers are trained effectively to detect and identify merchandise destined for the United States that infringes intellectual property rights, including through use of donated hardware, software, equipment, and similar technologies. (Sec. 309) DHS shall coordinate with competent law enforcement and customs authorities of foreign countries, particularly by information-sharing, to enhance their efforts and U.S. efforts to enforce intellectual property rights. (Sec. 310) The CBP and ICE shall report annually to Congress on intellectual property rights enforcement. (Sec. 311) DHS shall carry out an educational campaign to inform travelers entering or leaving the United States about the legal, economic, and public health and safety implications of acquiring merchandise that infringes intellectual property rights outside the United States and importing it into the United States in violation of U.S. law. TITLE IV--PREVENTION OF EVASION OF ANTIDUMPING AND COUNTERVAILING DUTY ORDERS Preventing Recurring Trade Evasion and Circumvention Act or the PROTECT Act (Sec. 403) This title applies to goods from Mexico and Canada as well as goods from elsewhere. Subtitle A--Actions Relating to Enforcement of Trade Remedy Laws (Sec. 411) DHS shall establish within the CBP Office of International Trade a Trade Remedy Law Enforcement Division (including a National Targeting and Analysis Group) to prevent and counter evasion of antidumping or countervailing duty orders with respect to covered merchandise entered into the United States. The Group shall establish targeted risk assessment methodologies and standards for: evaluating the risk that cargo destined for the United States may constitute evading covered merchandise, and issuing Trade Alerts to U.S. ports of entry directing further inspection of specific merchandise to ensure compliance with U.S. trade remedy laws. (Sec. 412) Treasury, acting through the CBP, shall exercise all authorities to collect information needed to determine whether merchandise is entered into the United States through evasion. In cases where a person who filed an allegation concerning covered merchandise, a person alleged to have entered covered merchandise into the United States through evasion, or a foreign producer or exporter of such merchandise has failed to comply with a request for information, Treasury shall make an inference adverse to the interests of that person when determining whether the merchandise has entered the United States through evasion. (Sec. 414) Treasury shall negotiate and enter into bilateral agreements with customs authorities of foreign countries to prevent evasion of U.S. and foreign trade remedy laws. Subtitle B--Investigation of Evasion of Trade Remedy Laws (Sec. 421) This bill amends the Tariff Act of 1930 to prescribe procedures for the administering authority (the Department of Commerce, or any other U.S. officer responsible for carrying out the duties of the administering authority) to initiate an antidumping duty or countervailing duty investigation with respect to merchandise imported into the United States upon: its own initiation, or the filing of a petition by interested parties or referral by the CBP. The administering authority, in cases of an affirmative preliminary determination, shall instruct the CBP to: suspend liquidation of each entry of the merchandise, and require the posting of a cash deposit. The administering authority, in cases of an affirmative final determination, shall instruct the CBP to: assess duties on the covered merchandise, reliquidate each entry of the merchandise, and reassess the importer's bond or other security. (Sec. 422) The GAO shall assess for Congress, after two years, the effectiveness of this Act and the actions taken and procedures developed to prevent evasion of antidumping and countervailing duty orders. Subtitle C--Other Matters (Sec. 431) The CBP shall employ sufficient personnel with expertise and adequate training in and responsibility for preventing and investigating the entry of covered merchandise into the United States through evasion. (Sec. 432) The CBP shall report annually to Congress on its efforts to prevent and investigate the evasion of antidumping duty and countervailing duty orders with respect to covered merchandise entered into the United States. (Sec. 433) The administering authority shall no longer be required to direct the CBP to allow an importer to opt to post a bond or security in lieu of a cash deposit for each entry of merchandise exported into the United States until completion of the administering authority's review as to whether antidumping or countervailing duties shall be imposed on the merchandise. The weighted average dumping margin or individual countervailing duty rate determined for a new exporter (shipper) or producer of merchandise in a review shall be based solely on the bona fide U.S. sales made by the exporter or producer during the period of review. TITLE V--ADDITIONAL ENFORCEMENT PROVISIONS (Sec. 501) The Trade Act of 1974 is amended to revise requirements for the identification of U.S. trade expansion priorities. The United States Trade Representative (USTR) shall consult with Congress to prioritize, investigate, and resolve acts, policies, or practices of foreign countries that raise concerns with respect to obligations under the World Trade Organization Agreements or any other trade agreement to which the United States is a party, or that otherwise creates barriers to U.S. goods, services, or investment. (Sec. 502) The USTR may take action to suspend concessions or other obligations under the Uruguay Round Agreements Act if: enforcement action has terminated that was taken by the USTR to protect U.S. rights under any trade agreement or to eliminate an act, policy, or practice of a foreign country that violates that agreement or burdens or restricts U.S. commerce; the petitioner or any representative of the domestic industry that would benefit from reinstatement of such action requests the USTR for reinstatement; and the USTR meets certain consultation requirements. (Sec. 503) The U.S. International Trade Commission shall make an import monitoring tool available on a website to allow public access to data on the volume and value of imported goods to assess whether such data has changed over time. TITLE VI--MISCELLANEOUS PROVISIONS (Sec. 601) The general de minimis aggregate fair retail value in the country of shipment of duty-free articles imported by one person on one day increases from $200 to $800. (Sec. 602) Deadlines are prescribed for mandatory DHS consultation on trade and customs revenue functions with representatives of the business community involved in international trade and with Congress. (Sec. 603) This bill also prescribes or revises requirements under the Tariff Act of 1930 and the Harmonized Tariff Schedules of the United States for: certain penalties for customs brokers convicted of an act of terrorism, duty-free treatment of certain federal property exported and reimported without having been advanced in value or improved in condition while abroad, duties on warranty repairs or alterations of articles exported from and then returned to the United States, exemption from duty treatment of the residue of bulk cargo contained in instruments of international traffic previously exported from the United States, drawback (refund of paid customs duties) on eligible merchandise imported into the United States and later exported or destroyed, and elimination of the consumptive demand exception to the prohibition on the importation of goods made with convict labor, forced labor, or indentured labor. (Sec. 607) The President's annual report to Congress on the trade agreements program and the national trade policy agenda shall address the operation of all USTR-led interagency programs during the preceding year and for the year in which the report is submitted as well as pertinent additional matters. Directs the USTR to develop annual and quadrennial resource management and staffing plans. (Sec. 608) Certain trade policies regarding Israel are declared. (Sec. 609) The \"consumptive demand\" exception to the prohibition against importing merchandise made by convict, forced, or indentured labor under penal sanctions is repealed. This \"consumptive demand\" exception covers all goods, wares, articles, or merchandise mined, produced, or manufactured by such labor which are not mined, produced, or manufactured in such quantities in the United States as to meet U.S. consumptive demands. (Sec. 610) Consolidated Omnibus Budget Reconciliation Act of 1985 is amended to allow, between July 8 and July 28, 2025, specified customs user fees for the processing of merchandise formally entered or released into the United States. The United States-Korea Free Trade Agreement Implementation Act is also amended to increase from 0.21% ad valorem to 0.3464% ad valorem, for the period between July 1 and July 14, 2025, the customs user fees for the processing of merchandise formally entered or released into the United States. (Sec. 611) The CBP Commissioner shall report to Congress within one year after entering into any agreement under: the program for entering into reimbursable fee agreements for the provision of CBP services, upon the request of any persons, at existing CBP-serviced facilities, at new facilities, and at land border facilities; or the pilot program authorizing the CBP to enter into partnerships with private sector and government entities at ports of entry for certain services and to accept certain donations. (Sec. 612) The CBP shall include in specified distributions to affected domestic producers of collected antidumping and countervailing duties any interest earned on such duties which is, or was, realized through application of any payment received by the CBP on or after October 1, 2014, under, or in connection with, any customs bond pursuant to a court order or judgment, or any settlement for any such bond. The distributions specified are all those made on or after the date of enactment of this Act of collected duties assessed on or after October 1, 2000, on entries made through September 30, 2007.", "pending_committee_id": 0, "committee": [], "referrals": [{"date": "2015-04-21", "committee_id": 2317, "chamber": "H", "chamber_id": 114, "name": "Ways And Means"}, {"date": "2015-04-23", "committee_id": 2629, "chamber": "H", "chamber_id": 114, "name": "Subcommittee on Trade"}, {"date": "2015-04-27", "committee_id": 2544, "chamber": "H", "chamber_id": 114, "name": "Subcommittee on Border and Maritime Security"}], "history": [{"date": "2015-04-21", "action": "Introduced in House", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2015-04-21", "action": "Referred to the Committee on Ways and Means, and in addition to the Committees on Homeland Security, Foreign Affairs, Financial Services, and the Judiciary, for a period to be subsequently determined by the Speaker, in each case for consideration of such provisions as fall within the jurisdiction of the committee concerned.", "chamber": "H", "chamber_id": 114, "importance": 1}, {"date": "2015-04-21", "action": "Referred to House Ways and Means", "chamber": "H", "chamber_id": 114, "importance": 1}, {"date": "2015-04-21", "action": "Referred to House Homeland Security", "chamber": "H", "chamber_id": 114, "importance": 1}, {"date": "2015-04-21", "action": "Referred to House Foreign Affairs", "chamber": "H", "chamber_id": 114, "importance": 1}, {"date": "2015-04-21", "action": "Referred to House Financial Services", "chamber": "H", "chamber_id": 114, "importance": 1}, {"date": "2015-04-21", "action": "Referred to House Judiciary", "chamber": "H", "chamber_id": 114, "importance": 1}, {"date": "2015-04-23", "action": "Committee Consideration and Mark-up Session Held.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2015-04-23", "action": "Ordered to be Reported (Amended).", "chamber": "H", "chamber_id": 114, "importance": 1}, {"date": "2015-04-23", "action": "Referred to the Subcommittee on Trade.", "chamber": "H", "chamber_id": 114, "importance": 1}, {"date": "2015-04-27", "action": "Referred to the Subcommittee on Border and Maritime Security.", "chamber": "H", "chamber_id": 114, "importance": 1}, {"date": "2015-05-14", "action": "Reported (Amended) by the Committee on Ways and Means. H. Rept. 114-114, Part I.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2015-05-14", "action": "Committee on Homeland Security discharged.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2015-05-14", "action": "Committee on Foreign Affairs discharged.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2015-05-14", "action": "Committee on Financial Services discharged.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2015-05-14", "action": "Committee on the Judiciary discharged.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2015-05-14", "action": "Placed on the Union Calendar, Calendar No. 80.", "chamber": "H", "chamber_id": 114, "importance": 0}], "sponsors": [{"people_id": 9332, "person_hash": "v8k1jqbe", "party_id": "2", "state_id": 52, "party": "R", "role_id": 1, "role": "Rep", "name": "Patrick Tiberi", "first_name": "Patrick", "middle_name": "J.", "last_name": "Tiberi", "suffix": "", "nickname": "", "district": "HD-OH-12", "ftm_eid": 2781461, "votesmart_id": 8404, "opensecrets_id": "N00009699", "knowwho_pid": 197859, "ballotpedia": "Patrick_Tiberi", "sponsor_type_id": 1, "sponsor_order": 1, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 9173, "person_hash": "wb8x9wzo", "party_id": "2", "state_id": 52, "party": "R", "role_id": 1, "role": "Rep", "name": "Kevin Brady", "first_name": "Kevin", "middle_name": "", "last_name": "Brady", "suffix": "", "nickname": "", "district": "HD-TX-8", "ftm_eid": 11362722, "votesmart_id": 361, "opensecrets_id": "N00005883", "knowwho_pid": 159078, "ballotpedia": "Kevin_Brady_(Texas)", "sponsor_type_id": 2, "sponsor_order": 2, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 9247, "person_hash": "omjjpile", "party_id": "2", "state_id": 52, "party": "R", "role_id": 1, "role": "Rep", "name": "Charles Boustany", "first_name": "Charles", "middle_name": "W.", "last_name": "Boustany", "suffix": "Jr.", "nickname": "", "district": "HD-LA-3", "ftm_eid": 422681, "votesmart_id": 35514, "opensecrets_id": "N00026595", "knowwho_pid": 228684, "ballotpedia": "Charles_Boustany_Jr.", "sponsor_type_id": 2, "sponsor_order": 3, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}], "sasts": [{"type_id": 8, "type": "Related", "sast_bill_number": "HB825", "sast_bill_id": 719423}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB1773", "sast_bill_id": 769397}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB1903", "sast_bill_id": 773317}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB1916", "sast_bill_id": 773320}, {"type_id": 8, "type": "Related", "sast_bill_number": "SB989", "sast_bill_id": 772405}, {"type_id": 8, "type": "Related", "sast_bill_number": "SB1015", "sast_bill_id": 773301}, {"type_id": 8, "type": "Related", "sast_bill_number": "SB1269", "sast_bill_id": 778102}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB644", "sast_bill_id": 709361}], "subjects": [{"subject_id": 13126, "subject_name": "Administrative law and regulatory procedures"}, {"subject_id": 13127, "subject_name": "Advisory bodies"}, {"subject_id": 13754, "subject_name": "Arab-Israeli relations"}, {"subject_id": 13413, "subject_name": "Business records"}, {"subject_id": 13742, "subject_name": "Canada"}, {"subject_id": 13322, "subject_name": "Civil actions and liability"}, {"subject_id": 13452, "subject_name": "Competitiveness, trade promotion, trade deficits"}, {"subject_id": 13144, "subject_name": "Computers and information technology"}, {"subject_id": 13146, "subject_name": "Congressional oversight"}, {"subject_id": 13373, "subject_name": "Criminal investigation, prosecution, interrogation"}, {"subject_id": 20695, "subject_name": "Customs enforcement"}, {"subject_id": 13157, "subject_name": "Department of Homeland Security"}, {"subject_id": 13165, "subject_name": "Department of the Treasury"}, {"subject_id": 13177, "subject_name": "Employment discrimination and employee rights"}, {"subject_id": 13184, "subject_name": "Executive agency funding and structure"}, {"subject_id": 13365, "subject_name": "Foreign and international corporations"}, {"subject_id": 13743, "subject_name": "Free trade and trade barriers"}, {"subject_id": 14018, "subject_name": "Gaza Strip"}, {"subject_id": 13198, "subject_name": "Government employee pay, benefits, personnel management"}, {"subject_id": 13200, "subject_name": "Government information and archives"}, {"subject_id": 22688, "subject_name": "Government studies and investigations"}, {"subject_id": 13402, "subject_name": "Human rights"}, {"subject_id": 13614, "subject_name": "Intellectual property"}, {"subject_id": 13230, "subject_name": "Interest, dividends, interest rates"}, {"subject_id": 13424, "subject_name": "International law and treaties"}, {"subject_id": 13232, "subject_name": "International organizations and cooperation"}, {"subject_id": 13755, "subject_name": "Israel"}, {"subject_id": 13606, "subject_name": "Judicial procedure and administration"}, {"subject_id": 13235, "subject_name": "Latin America"}, {"subject_id": 13701, "subject_name": "Manufacturing"}, {"subject_id": 13243, "subject_name": "Mexico"}, {"subject_id": 13448, "subject_name": "Middle East"}, {"subject_id": 13744, "subject_name": "Office of the U.S. Trade Representative"}, {"subject_id": 20826, "subject_name": "Palestinians"}, {"subject_id": 13258, "subject_name": "Performance measurement"}, {"subject_id": 13640, "subject_name": "Product safety and quality"}, {"subject_id": 13260, "subject_name": "Public contracts and procurement"}, {"subject_id": 13671, "subject_name": "Public-private cooperation"}, {"subject_id": 13611, "subject_name": "Sanctions"}, {"subject_id": 13273, "subject_name": "Securities"}, {"subject_id": 13285, "subject_name": "State and local government operations"}, {"subject_id": 13678, "subject_name": "Tariffs"}, {"subject_id": 13694, "subject_name": "Trade agreements and negotiations"}, {"subject_id": 13416, "subject_name": "Trade restrictions"}, {"subject_id": 13616, "subject_name": "U.S. and foreign investments"}, {"subject_id": 13648, "subject_name": "User charges and fees"}, {"subject_id": 14046, "subject_name": "West Bank"}, {"subject_id": 13468, "subject_name": "Worker safety and health"}, {"subject_id": 13276, "subject_name": "Small business"}, {"subject_id": 13731, "subject_name": "Foreign trade and international finance"}], "texts": [{"doc_id": 1212256, "date": "2015-04-22", "type": "Introduced", "type_id": 1, "mime": "application/pdf", "mime_id": 2, "url": "https://legiscan.com/US/text/HB1907/id/1212256", "state_link": "https://www.congress.gov/114/bills/hr1907/BILLS-114hr1907ih.pdf", "text_size": 536653, "text_hash": "dc497ddbdb9ef2ff1b735c9c9870bc36"}, {"doc_id": 1230032, "date": "2015-05-15", "type": "Introduced", "type_id": 1, "mime": "application/pdf", "mime_id": 2, "url": "https://legiscan.com/US/text/HB1907/id/1230032", "state_link": "https://www.congress.gov/114/bills/hr1907/BILLS-114hr1907rh.pdf", "text_size": 542133, "text_hash": "bce45cd017ba6f3d3cfe45fb0055d89e"}], "votes": [], "amendments": [], "supplements": [], "calendar": []}}