{"status": "OK", "bill": {"bill_id": 777205, "change_hash": "cad5dc2fd442ce99c804f21ba42ee00d", "session_id": 1156, "session": {"session_id": 1156, "state_id": 52, "year_start": 2015, "year_end": 2016, "prefile": 0, "sine_die": 1, "prior": 1, "special": 0, "session_tag": "Regular Session", "session_title": "2015-2016 Regular Session", "session_name": "114th Congress"}, "url": "https://legiscan.com/US/bill/SB1202/2015", "state_link": "https://www.congress.gov/bill/114th-congress/senate-bill/1202/all-info", "completed": 0, "status": 1, "status_date": "2015-05-06", "progress": [{"date": "2015-05-06", "event": 1}, {"date": "2015-05-06", "event": 9}], "state": "US", "state_id": 52, "bill_number": "SB1202", "bill_type": "B", "bill_type_id": "1", "body": "S", "body_id": 115, "current_body": "S", "current_body_id": 115, "title": "HEAT Act Heat Efficiency through Applied Technology Act", "description": "HEAT Act Heat Efficiency through Applied Technology Act This bill amends the Public Utility Regulatory Policies Act of 1978, with respect to electric utilities ratemaking standards, to direct the Department of Energy (DOE) to establish: guidance for technical interconnection standards that ensure interoperability with federal rules for interconnection between electric utilities and electric consumers; model interconnection procedures, including appropriate fast track procedures; and model rules for determining and assigning interconnection costs. Such standards must reflect current best practices to encourage the use of distributed generation (such as combined heat and power technology and waste heat to power technology) while ensuring the safety and reliability of the interconnected units and the distribution and transmission networks to which the units connect. Combined heat and power technology is the generation of electric energy and heat in a single, integrated system meeting specified efficiency criteria under which heat that is conventionally rejected is recovered and used to meet thermal energy requirements. Qualified waste heat resource does not include a heat resource from a process whose primary purpose is electricity generation using a fossil fuel, but does mean: exhaust heat or flared gas from any industrial process; waste gas or industrial tail gas that would otherwise be flared, incinerated, or vented; a pressure drop in any gas for an industrial or commercial process; or any other form of waste heat resource as the Secretary may determine. Waste heat to power technology is any system generating electricity through the recovery of a qualified waste heat resource. State regulatory authorities and each nonregulated electric utility must: (1) complete consideration of these model standards within two years after DOE has completed them, (2) determine whether or not it is appropriate to implement each standard, and (3) report updated plans for interconnection procedures and tariff schedules that reflect best practices to encourage the use of distributed generation. Specified prior state actions shall shield a technical interconnection standard in the case of any electric utility in a state from certain statutory time limitations and administrative consequences of noncompliance. DOE must establish model rules and procedures for determining fees or rates for supplementary power, backup or standby power, maintenance power, and interruptible power supplied to facilities that operate combined heat and power technology and waste heat to power technology that appropriately allow for adequate cost recovery by an electric utility but are not excessive. Each state regulatory authority and each nonregulated electric utility must update their plans for supplemental, backup, and standby power fees within certain time limitations, and subject to certain administrative consequences for failure to comply, unless specified prior state actions have been undertaken. The Administrator of the Environmental Protection Agency must establish a grant program to: (1) update any applicable state or local air permitting regulations to incorporate environmental regulations relating to output-based emissions, or (2) expedite the processing of relevant power generation permit applications if the state has already the permitting regulations to incorporate those output-based emissions environmental regulations.", "pending_committee_id": 0, "committee": [], "referrals": [{"date": "2015-05-06", "committee_id": 2324, "chamber": "S", "chamber_id": 115, "name": "Energy And Natural Resources"}], "history": [{"date": "2015-05-06", "action": "Read twice and referred to the Committee on Energy and Natural Resources.", "chamber": "S", "chamber_id": 115, "importance": 1}, {"date": "2015-05-14", "action": "Committee on Energy and Natural Resources. Hearings held.", "chamber": "S", "chamber_id": 115, "importance": 0}], "sponsors": [{"people_id": 9422, "person_hash": "cleoh36j", "party_id": "1", "state_id": 52, "party": "D", "role_id": 2, "role": "Sen", "name": "Jeanne Shaheen", "first_name": "Jeanne", "middle_name": "", "last_name": "Shaheen", "suffix": "", "nickname": "", "district": "SD-NH", "ftm_eid": 2227644, "votesmart_id": 1663, "opensecrets_id": "N00024790", "knowwho_pid": 209675, "ballotpedia": "Jeanne_Shaheen", "sponsor_type_id": 1, "sponsor_order": 1, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}], "sasts": [], "subjects": [{"subject_id": 13126, "subject_name": "Administrative law and regulatory procedures"}, {"subject_id": 13131, "subject_name": "Air quality"}, {"subject_id": 13132, "subject_name": "Alternative and renewable resources"}, {"subject_id": 13173, "subject_name": "Electric power generation and transmission"}, {"subject_id": 13180, "subject_name": "Energy efficiency and conservation"}, {"subject_id": 13641, "subject_name": "Environmental regulatory procedures"}, {"subject_id": 13312, "subject_name": "Licensing and registrations"}, {"subject_id": 13586, "subject_name": "Lighting and heating"}, {"subject_id": 13474, "subject_name": "Public utilities and utility rates"}, {"subject_id": 13285, "subject_name": "State and local government operations"}, {"subject_id": 13399, "subject_name": "Energy"}], "texts": [{"doc_id": 1231792, "date": "2015-05-18", "type": "Introduced", "type_id": 1, "mime": "application/pdf", "mime_id": 2, "url": "https://legiscan.com/US/text/SB1202/id/1231792", "state_link": "https://www.congress.gov/114/bills/s1202/BILLS-114s1202is.pdf", "text_size": 271858, "text_hash": "99326b9776d98f25eb4b646a2833db85"}], "votes": [], "amendments": [], "supplements": [], "calendar": []}}