{"status": "OK", "bill": {"bill_id": 778083, "change_hash": "c3fefc307fab7a26757a9c0fb086abe5", "session_id": 1156, "session": {"session_id": 1156, "state_id": 52, "year_start": 2015, "year_end": 2016, "prefile": 0, "sine_die": 1, "prior": 1, "special": 0, "session_tag": "Regular Session", "session_title": "2015-2016 Regular Session", "session_name": "114th Congress"}, "url": "https://legiscan.com/US/bill/SB1267/2015", "state_link": "https://www.congress.gov/bill/114th-congress/senate-bill/1267/all-info", "completed": 0, "status": 1, "status_date": "2015-05-11", "progress": [{"date": "2015-05-11", "event": 1}], "state": "US", "state_id": 52, "bill_number": "SB1267", "bill_type": "B", "bill_type_id": "1", "body": "S", "body_id": 115, "current_body": "S", "current_body_id": 115, "title": "Trade Preferences Extension Act of 2015", "description": "Trade Preferences Extension Act of 2015 TITLE I--EXTENSION OF AFRICAN GROWTH AND OPPORTUNITY ACT AGOA Extension and Enhancement Act of 2015 (Sec. 103) This bill amends the Trade Act of 1974 and the African Growth and Opportunity Act (AGOA) to extend through FY2025 the duty-free treatment of the products of beneficiary sub-Saharan African countries under those Acts. The extended period also applies to: the preferential treatment of apparel articles wholly assembled, or components knit-to-shape and wholly assembled, in one or more beneficiary sub-Saharan African countries from yarns originating in the United States or one or more beneficiary sub-Saharan African countries or former beneficiary sub-Saharan African countries, or both; and the third-country fabric program granting duty-free treatment of apparel articles wholly assembled, or knit-to-shape and wholly assembled, or both, in one or more lesser developed beneficiary sub-Saharan African countries, regardless of the country of origin of the fabric or the yarn used to make such articles. (Sec. 104) This bill amends the Generalized System of Preferences (GSP) to revise rules of origin for duty-free treatment of articles of beneficiary sub-Saharan African countries. (Sec. 105) The President must not terminate the designation of a country as a beneficiary sub-Saharan African country unless, at least 60 days before termination, the President notifies Congress and the country of that intention. The President, instead of terminating the designation, may withdraw, suspend, or limit the duty-free treatment for any article that is the growth, product, or manufacture of a beneficiary sub-Saharan African country if that would be more effective in promoting the country's compliance with certain requirements, including a market-based economy and the rule of law, the protection of human rights and internationally-recognized worker rights, elimination of trade barriers to the United States, and non-engagement in activities that undermine U.S. national security or foreign policy interests or support acts of international terrorism. The President may not withdraw, suspend, or limit the duty-free treatment before notifying Congress and the country in question of that intention at least 60 days in advance. The President shall: publish annually in the Federal Register a notice of review and request for public comments on whether beneficiary sub-Saharan African countries are meeting the eligibility requirements for preferential treatment under AGOA and the Trade Act of 1974, and establish a process for interested persons to file a petition with the United States Trade Representative (USTR) regarding the compliance of sub-Saharan African countries with such requirements. The President may also, at any time, initiate an out-of-cycle review of whether a beneficiary sub-Saharan African country is making continual progress in meeting preferential treatment eligibility requirements. (Sec. 106) To be eligible for preferential treatment a sub-Saharan African country must make progress toward establishing a market-based economy that protects the private property rights of women as well as those of men. (Sec. 107) It is the sense of Congress that beneficiary sub-Saharan African countries should develop strategies biennially for more effective utilization of AGOA trade benefits. It is further the sense of Congress that the biennial AGOA utilization strategies should: review potential exports under AGOA and identify opportunities and obstacles to increased trade and investment and enhanced poverty reduction, set out a strategy to promote small business, eliminate obstacles to regional trade and promote greater utilization of AGOA trade benefits and establish a plan to fully implement the Agreement on Trade Facilitation of the World Trade Organization, and be published on the appropriate websites of each sub-Saharan African country and the USTR. (Sec. 108) It is U.S. policy to continue to seek to deepen and expand trade and investment ties between sub-Saharan Africa and the United States through specified actions. (Sec. 109) This bill amends the AGOA Acceleration Act of 2004 to direct the President, now through the Department of Agriculture, to identify any eligible sub-Saharan African country (currently only 10) having the greatest potential to increase marketable exports of agricultural products to the United States and the greatest need for agricultural technical assistance, particularly with respect to developing food safety standards. The President must also assign 30 (currently 20) fulltime personnel to provide this assistance to these countries to ensure that their exports of agricultural products, particularly from businesses and sectors that engage women farmers and entrepreneurs, meet U.S. requirements. The President shall take any measures necessary to ensure adequate coordination of federal agencies relating to agricultural technical assistance for sub-Saharan Africa. (Sec. 110) The President shall report biennially to Congress, starting not later than one year after enactment of this Act, on trade and investment between the United States and sub-Saharan African countries and implementation of this Act. The USTR shall report every five years to Congress, starting not later than one year after enactment of this Act, on sub-Saharan African countries that have expressed an interest in entering into a free trade agreement with the United States. TITLE II--EXTENSION OF GENERALIZED SYSTEM OF PREFERENCES (Sec. 201) Duty-free treatment under the GSP is extended under the Trade Act of 1974 through December 31, 2017. Requires the liquidation or reliquidation (refund of duties) on duty-free articles that entered into the United States after July 31, 2013, and before the 30th day after enactment of this Act. (Sec. 202) The President may designate certain cotton articles as eligible for duty-free treatment only for least-developed beneficiary developing countries. (Sec. 203) The competitive need limitation and waiver requirements under the GSP shall apply to certain import-sensitive articles exported (directly or indirectly) from beneficiary developing countries to the United States during calendar 2014. (Sec. 204) The President may now designate handbags, luggage, and flat goods as eligible articles from all beneficiary developing countries. TITLE III--EXTENSION OF PREFERENTIAL DUTY TREATMENT PROGRAM FOR HAITI (Sec. 301) This bill amends the Caribbean Basin Economic Recovery Act to extend through December 19, 2025, the duty-free entry of apparel articles, including woven articles and certain knit articles, assembled in Haiti and imported from Haiti or the Dominican Republic to the United States. The special duty-free rules for Haiti shall now extend through September 30, 2025. TITLE IV--TARIFF CLASSIFICATION OF CERTAIN ARTICLES (Sec. 401) This bill amends the Harmonized Tariff Schedule of the United States to provide for the duty-free treatment of certain recreational performance outerwear as well as of certain specialized athletic footwear. TITLE V--MISCELLANEOUS PROVISIONS (Sec. 501) The President shall report to Congress on the contribution of U.S. trade preference programs to reducing poverty and eliminating hunger. TITLE VI--OFFSETS (Sec. 601) This bill amends the Consolidated Omnibus Budget Reconciliation Act of 1958 to extend customs user fees for certain customs services performed through July 7, 2025. The United States-Korea Free Trade Agreement Implementation Act is also amended to extend through June 30, 2025, the increase from 0.21% ad valorem to 0.3464% ad valorem in the customs user fees for the processing of merchandise formally entered or released into the United States which is scheduled to begin on December 1, 2015. (Sec. 602) The required installment of corporate estimated tax payments for a corporation with assets of at least $1 billion which is otherwise due in the third quarter of 2020 shall be increased by 5.25%. (Sec. 603) This bill amends the Internal Revenue Code to eliminate the requirement that every person who makes or receives interest payments aggregating $10 or more report it on his or her income tax return, and so requires the report of any interest paid or received, no matter how small. Every person holding a reportable deposit (non-interest bearing deposit) during any calendar year must make a tax return about it.", "pending_committee_id": 0, "committee": [], "referrals": [], "history": [{"date": "2015-05-11", "action": "Committee on Finance. Original measure reported to Senate by Senator Hatch. Without written report.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2015-05-11", "action": "Placed on Senate Legislative Calendar under General Orders. Calendar No. 74.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2015-05-12", "action": "By Senator Hatch from Committee on Finance filed written report. Report No. 114-43.", "chamber": "S", "chamber_id": 115, "importance": 0}], "sponsors": [{"people_id": 9489, "person_hash": "y03u5uak", "party_id": "2", "state_id": 52, "party": "R", "role_id": 2, "role": "Sen", "name": "Orrin Hatch", "first_name": "Orrin", "middle_name": "G.", "last_name": "Hatch", "suffix": "", "nickname": "", "district": "SD-UT", "ftm_eid": 1673075, "votesmart_id": 53352, "opensecrets_id": "N00009869", "knowwho_pid": 165279, "ballotpedia": "Orrin_Hatch", "sponsor_type_id": 1, "sponsor_order": 1, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}], "sasts": [{"type_id": 8, "type": "Related", "sast_bill_number": "HB1891", "sast_bill_id": 772684}, {"type_id": 8, "type": "Related", "sast_bill_number": "SB952", "sast_bill_id": 771289}, {"type_id": 8, "type": "Related", "sast_bill_number": "SB1009", "sast_bill_id": 773345}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB1295", "sast_bill_id": 745187}], "subjects": [{"subject_id": 13126, "subject_name": "Administrative law and regulatory procedures"}, {"subject_id": 13384, "subject_name": "Administrative remedies"}, {"subject_id": 13682, "subject_name": "Africa"}, {"subject_id": 13612, "subject_name": "Agricultural trade"}, {"subject_id": 13489, "subject_name": "Caribbean area"}, {"subject_id": 13146, "subject_name": "Congressional oversight"}, {"subject_id": 13148, "subject_name": "Corporate finance and management"}, {"subject_id": 20695, "subject_name": "Customs enforcement"}, {"subject_id": 13168, "subject_name": "Economic development"}, {"subject_id": 13190, "subject_name": "Food assistance and relief"}, {"subject_id": 13456, "subject_name": "Foreign aid and international relief"}, {"subject_id": 13200, "subject_name": "Government information and archives"}, {"subject_id": 13532, "subject_name": "Haiti"}, {"subject_id": 13235, "subject_name": "Latin America"}, {"subject_id": 13678, "subject_name": "Tariffs"}, {"subject_id": 13319, "subject_name": "Tax administration and collection, taxpayers"}, {"subject_id": 13694, "subject_name": "Trade agreements and negotiations"}, {"subject_id": 13616, "subject_name": "U.S. and foreign investments"}, {"subject_id": 13648, "subject_name": "User charges and fees"}, {"subject_id": 13703, "subject_name": "Women in business"}, {"subject_id": 13581, "subject_name": "Women's rights"}, {"subject_id": 13569, "subject_name": "Outdoor recreation"}, {"subject_id": 13327, "subject_name": "Women's employment"}, {"subject_id": 13731, "subject_name": "Foreign trade and international finance"}], "texts": [{"doc_id": 1228106, "date": "2015-05-12", "type": "Introduced", "type_id": 1, "mime": "application/pdf", "mime_id": 2, "url": "https://legiscan.com/US/text/SB1267/id/1228106", "state_link": "https://www.congress.gov/114/bills/s1267/BILLS-114s1267pcs.pdf", "text_size": 338011, "text_hash": "7e1b052275f3d1b2d84a2eb528f2376a"}], "votes": [], "amendments": [], "supplements": [], "calendar": []}}