{"votes": {"No": [["Lois  Wolk", "29062", "Democratic", "CA", "3"], ["Samuel 'Sam'  Aanestad", "16523", "Republican", "CA", "4"], ["Jeffrey 'Jeff'  Denham", "28769", "Republican", "CA", "12"], ["David 'Dave'  Cogdill", "28568", "Republican", "CA", "14"], ["Dean  R.  Florez", "16459", "Democratic", "CA", "16"], ["George  C.  Runner\n                  Jr.", "9706", "Republican", "CA", "17"], ["Roy  Ashburn", "9694", "Republican", "CA", "18"], ["William 'Bill'  Emmerson", "29356", "Republican", "CA", "23"], ["Gloria  Romero", "16626", "Democratic", "CA", "24"], ["Curren  De Mille  Price\n                  Jr.", "28973", "Democratic", "CA", "26"], ["Robert  S. 'Bob'  Huff", "16575", "Republican", "CA", "29"], ["Ronald  S. 'Ron'  Calderon", "28545", "Democratic", "CA", "30"], ["Robert  D. 'Bob'  Dutton", "28838", "Republican", "CA", "31"], ["Gloria  Negrete McLeod", "16492", "Democratic", "CA", "32"], ["Jose  Luis 'Lou'  Correa", "9732", "Democratic", "CA", "34"], ["Roderick 'Rod'  Wright", "9775", "Democratic", "CA", "35"], ["Thomas 'Tom'  Harman", "28890", "Republican", "CA", "35"], ["Dennis  Hollingsworth", "28802", "Republican", "CA", "36"], ["Mimi  Walters", "29346", "Republican", "CA", "37"], ["Mark  Wyland", "29603", "Republican", "CA", "38"], ["Denise  Moreno  Ducheny", "8169", "Democratic", "CA", "40"]], "Yes": [["Darrell  S.  Steinberg", "16861", "Democratic", "CA", "6"], ["Mark  J.  DeSaulnier", "69477", "Democratic", "CA", "7"], ["Leland  Yee", "28969", "Democratic", "CA", "8"], ["Loni  Hancock", "29419", "Democratic", "CA", "9"], ["Ellen  M.  Corbett", "16726", "Democratic", "CA", "10"], ["Mark  R.  Leno", "28596", "Democratic", "CA", "11"], ["Joe 'Joe'  Simitian", "28606", "Democratic", "CA", "11"], ["Elaine  Kontominas  Alquist", "9671", "Democratic", "CA", "13"], ["Alex  Padilla", "59742", "Democratic", "CA", "20"], ["Gilbert  A. 'Gil'  Cedillo", "1462", "Democratic", "CA", "22"], ["Carol  Liu", "29060", "Democratic", "CA", "25"], ["Alan  S.  Lowenthal", "16469", "Democratic", "CA", "27"], ["Fran  J.  Pavley", "29336", "Democratic", "CA", "27"], ["Christine  T.  Kehoe", "16466", "Democratic", "CA", "39"]], "Did Not Vote": [["Patricia  A. 'Pat'  Wiggins", "16682", "Democratic", "CA", "2"], ["Sam  Blakeslee", "28759", "Republican", "CA", "15"], ["Anthony 'Tony'  Strickland", "16765", "Republican", "CA", "19"], ["Jenny  Oropeza", "29092", "Democratic", "CA", "28"]], "NA": []}, "synopsis": "Vote to pass a bill that bans the provision of single-use carryout bags in specified stores and enacts additional requirements on carryout bags.", "link": "https://justfacts.votesmart.org/bill/11490/31389/ban-of-single-use-carryout-bags-in-certain-stores", "name": "AB 1998 - Ban of Single-Use Carryout Bags in Certain Stores - California Key Vote", "pg": "Highlights: Sets the following deadlines for different aspects of the bag ban and additional bag requirements that apply to full-line, self-service retail stores with gross annual sales of $2 million or more that sell a line of dry grocery, canned goods, or nonfood items and some perishable items and stores that have over 10,000 square feet of retail space that generate specified sales or use tax and have a licensed pharmacy (Sec. 1): Beginning January 1, 2012, a store may not provide single-use carryout bags to a customer at the point of sale, with some exceptions; Beginning January 1, 2012 and until June 30, 2013, a store shall only provide a reusable grocery bag that is either made of cloth or other machine washable fabric and has handles or is a durable plastic bag with handles that is at least 2.25 mills thick and specifically designed for multiple reuses; Beginning on July 1, 2013, a store shall only provide a reusable grocery bag that meets the following requirements: It is designed and manufactured to withstand at least 100 uses; -It is made from a material that can be cleaned and disinfected; It has a printed or attached tag with manufacturing related information; -It does not contain lead, cadmium, or any other heavy metal in toxic amounts; and If it is claimed to be recyclable, the producer demonstrates compliance with the regulations adopted by the Federal Trade Commission; Through the end of 2012, a store shall make reusable bags available for purchase by a customer, and it may do so at no cost, but thereafter it can only do so at no cost during a time-limited store promotional program; Beginning January 1, 2012, a store shall charge a consumer if the consumer requests an available recycled paper bag, and the cost shall be the actual average cost of the recycled paper bag rounded to the nearest penny; and Beginning on July 1, 2014, a reusable grocery bag made from plastic shall be made from a minimum of 20 percent postconsumer recycled material, unless a bag producer demonstrates an inability to find a sufficient amount of such material. Specifies that beginning on July 1, 2013, the ban and additional bag requirements shall apply in the same manner as outlined above to convenience food stores, foodmarts, or other entities engaged in the retail sale of a limited line of goods that generally includes milk, bread, soda, and snack foods with a Type 20 or 21 license issued by the Department of Alcoholic Beverage Control (Sec. 1). Provides an exception for customers participating in the California Special Supplemental Food Program for Women, Infants, and Children or the Supplemental Food Program, so that they may be provided with a reusable bag or a recycled paper bag at no cost on and after July 1, 2013 (Sec. 1). Allows a city, a county, a city and county, or the state to impose civil liability in an amount of $500 for a first violation of this bill, $1,000 for a second violation, and $2,000 for a third or subsequent violation (Sec. 1)."}