{"votes": {"No": [["James  Wiley 'Jim'  Nielsen", "104331", "Republican", "CA", "4"], ["Andreas  Borgeas", "111778", "Republican", "CA", "8"], ["Shannon  L.  Grove", "120204", "Republican", "CA", "16"], ["Mike  Morrell", "29706", "Republican", "CA", "23"], ["Jeff  Stone", "82828", "Republican", "CA", "28"], ["Patricia  C. 'Pat'  Bates", "16585", "Republican", "CA", "36"], ["John  M. W.  Moorlach", "82725", "Republican", "CA", "37"], ["Brian  W.  Jones", "70781", "Republican", "CA", "38"]], "Yes": [["Mike  McGuire", "129749", "Democratic", "CA", "2"], ["Bill  Dodd", "82641", "Democratic", "CA", "3"], ["Cathleen  Galgiani", "57629", "Democratic", "CA", "5"], ["Steve  Glazer", "151749", "Democratic", "CA", "7"], ["Nancy  Skinner", "104350", "Democratic", "CA", "9"], ["Robert  A. 'Bob'  Wieckowski", "71025", "Democratic", "CA", "10"], ["Scott  Wiener", "129655", "Democratic", "CA", "11"], ["Anna  M.  Caballero", "58583", "Democratic", "CA", "12"], ["Gerald  A. 'Jerry'  Hill", "81552", "Democratic", "CA", "13"], ["Melissa  Hurtado", "179956", "Democratic", "CA", "14"], ["James  T. 'Jim'  Beall\n                  Jr.", "58229", "Democratic", "CA", "15"], ["William  W. 'Bill'  Monning", "104370", "Democratic", "CA", "17"], ["Robert 'Bob'  Hertzberg", "9756", "Democratic", "CA", "18"], ["Hannah-Beth  Jackson", "16826", "Democratic", "CA", "19"], ["Connie  M.  Leyva", "151805", "Democratic", "CA", "20"], ["Scott  Thomas  Wilk", "138539", "Republican", "CA", "21"], ["Maria  Elena  Durazo", "179971", "Democratic", "CA", "24"], ["Anthony  J.  Portantino\n                  Jr.", "69513", "Democratic", "CA", "25"], ["Benjamin 'Ben'  Allen", "151677", "Democratic", "CA", "26"], ["Henry  Stern", "169182", "Democratic", "CA", "27"], ["Ling-Ling  Chang", "129527", "Republican", "CA", "29"], ["Holly  J.  Mitchell", "120230", "Democratic", "CA", "30"], ["Richard  D.  Roth", "138416", "Democratic", "CA", "31"], ["Bob  J.  Archuleta", "71279", "Democratic", "CA", "32"], ["Thomas 'Tom'  Umberg", "29299", "Democratic", "CA", "34"], ["Steven  Craig  Bradford", "56752", "Democratic", "CA", "35"], ["Toni  G.  Atkins", "70372", "Democratic", "CA", "39"], ["Ben  Hueso", "70366", "Democratic", "CA", "40"]], "Did Not Vote": [["Richard  Pan", "120159", "Democratic", "CA", "6"], ["Susan  Rubio", "129493", "Democratic", "CA", "22"]], "NA": [["Brian  Dahle", "82387", "Republican", "CA", "1"], ["Andy  Vidak", "120067", "Republican", "CA", "14"], ["Lena  Gonzalez", "157372", "Democratic", "CA", "33"]]}, "synopsis": "Vote to pass a bill that requires all single-use plastics be made of recycled material.", "link": "https://justfacts.votesmart.org/bill/26838/68639/requires-single-use-plastics-be-made-from-recyclable-materials", "name": "SB 54 - Requires Single-Use Plastics be made from Recyclable Materials - California Key Vote", "pg": "Highlights: Specifies that it is the policy goal of the state to not have less than 75 percent of solid waste generated within the state sourced, reduced, recycled, or composted by the year 2020 (Sec. 1). Requires a covered entity to meet the following recycling rates as a condition of sale for single-use plastic packaging and products (Sec. 1): 20 percent rate by January 1, 2024; 40 percent rate by January 1, 2028; and 75 percent rate by January 1, 2030. Defines “covered entity” as a person or company that manufactures the single-use packaging and single-use products that are sold or distributed within California (Sec. 1). Requires the Department of Resources Recycling and Recovery, by January 1, 2024, to adopt and develop the following single-use plastics regulations, including, but not limited to (Sec. 1): Requiring covered entities to source reduce single-use packaging to the maximum extent feasible; Requiring covered entities to ensure all single-use packaging in the California market is recyclable or compostable by 2030; Developing incentives and policies to maximize and encourage in-state recycled material manufacturing; Developing economic mechanisms to reduce distribution of single-use packaging and single-use plastic products; Discouraging the litter, export, or improper disposal of single-use plastic products and other materials likely to harm the environment; Requiring individuals and entities exporting unprocessed plastic for recycling to notify the Department prior to the exportation; and Establishing labeling requirements regarding the recyclability or compostability of single-use plastic packaging and products. Requires the notification report made by a covered entity that is responsible for manufacturing single-use plastics, to document all of the following, including, but not limited to (Sec. 1): The quantity, weight, volume, and type of single-use plastic product materials sold or distributed; The quantity, weight, volume, and type of material source reduced by the covered entity annually; and Any other data the department deemed necessary to establish a baseline for waste generation and subsequent source reduction by a covered entity. Prohibits the department from establishing source reduction measures that incentivize substitutions that may have a more substantial negative impact on the environment (Sec. 1). Requires the department to develop criteria to determine which types of single-use packaging and products are reusable, recyclable, or compostable (Sec. 1). Defines “packaging” as the material used for the containment, protection, handling, delivery, or presentation of goods by the producer, including (Sec. 1): Sales or primary packaging; Grouped or secondary packaging; or Transport or tertiary packaging. Defines “single-use packaging” as the packaging of a product when the packaging is routinely disposed of after its contents have been unpacked, and does not include the following (Sec. 1): Packaging that is durable or washable, and routinely used for its original purpose multiple times before disposal; or Packaging that contains toxic or hazardous products regulated by the Federal insecticide, Fungicide, and Rodenticide Act."}