{"votes": {"No": [["James  Wiley 'Jim'  Nielsen", "104331", "Republican", "CA", "4"], ["Andreas  Borgeas", "111778", "Republican", "CA", "8"], ["Shannon  L.  Grove", "120204", "Republican", "CA", "16"], ["Scott  Thomas  Wilk", "138539", "Republican", "CA", "21"], ["Mike  Morrell", "29706", "Republican", "CA", "23"], ["Jeff  Stone", "82828", "Republican", "CA", "28"], ["Ling-Ling  Chang", "129527", "Republican", "CA", "29"], ["Patricia  C. 'Pat'  Bates", "16585", "Republican", "CA", "36"], ["John  M. W.  Moorlach", "82725", "Republican", "CA", "37"], ["Brian  W.  Jones", "70781", "Republican", "CA", "38"]], "Yes": [["Mike  McGuire", "129749", "Democratic", "CA", "2"], ["Bill  Dodd", "82641", "Democratic", "CA", "3"], ["Cathleen  Galgiani", "57629", "Democratic", "CA", "5"], ["Richard  Pan", "120159", "Democratic", "CA", "6"], ["Steve  Glazer", "151749", "Democratic", "CA", "7"], ["Nancy  Skinner", "104350", "Democratic", "CA", "9"], ["Robert  A. 'Bob'  Wieckowski", "71025", "Democratic", "CA", "10"], ["Scott  Wiener", "129655", "Democratic", "CA", "11"], ["Anna  M.  Caballero", "58583", "Democratic", "CA", "12"], ["Gerald  A. 'Jerry'  Hill", "81552", "Democratic", "CA", "13"], ["Melissa  Hurtado", "179956", "Democratic", "CA", "14"], ["James  T. 'Jim'  Beall\n                  Jr.", "58229", "Democratic", "CA", "15"], ["William  W. 'Bill'  Monning", "104370", "Democratic", "CA", "17"], ["Robert 'Bob'  Hertzberg", "9756", "Democratic", "CA", "18"], ["Hannah-Beth  Jackson", "16826", "Democratic", "CA", "19"], ["Connie  M.  Leyva", "151805", "Democratic", "CA", "20"], ["Susan  Rubio", "129493", "Democratic", "CA", "22"], ["Maria  Elena  Durazo", "179971", "Democratic", "CA", "24"], ["Anthony  J.  Portantino\n                  Jr.", "69513", "Democratic", "CA", "25"], ["Benjamin 'Ben'  Allen", "151677", "Democratic", "CA", "26"], ["Henry  Stern", "169182", "Democratic", "CA", "27"], ["Holly  J.  Mitchell", "120230", "Democratic", "CA", "30"], ["Richard  D.  Roth", "138416", "Democratic", "CA", "31"], ["Bob  J.  Archuleta", "71279", "Democratic", "CA", "32"], ["Thomas 'Tom'  Umberg", "29299", "Democratic", "CA", "34"], ["Steven  Craig  Bradford", "56752", "Democratic", "CA", "35"], ["Toni  G.  Atkins", "70372", "Democratic", "CA", "39"], ["Ben  Hueso", "70366", "Democratic", "CA", "40"]], "Did Not Vote": [], "NA": [["Lena  Gonzalez", "157372", "Democratic", "CA", "33"]]}, "synopsis": "Vote to pass a bill that rescinds the federal freeze of environmental regulations.", "link": "https://justfacts.votesmart.org/bill/26839/68642/rescinds-federal-freeze-of-environmental-deregulations", "name": "SB 1 - Rescinds Federal Freeze of Environmental Deregulations - California Key Vote", "pg": "Highlights: Prohibits a person from transporting, selling, receiving, acquiring, or purchasing any fish, wildlife, or plant that was taken, possessed, transported, or sold in violation of any law, treaty, or regulation of the United States in effect on January 19, 2017, any law or regulation of any other state in effect on January 1, 2020, or any foreign law in effect on January 1, 2020 (Sec. 1). Defines “baseline federal standards” as federal standards in effect as of January 1, 2017, that were not otherwise permanently enjoined by a federal court as of that date (Sec. 2). Requires the State Air Resources Board, at least quarterly, to publish on its website and in the California Regulatory Notice Register, a list of changes made to the federal standards and to provide an assessment on whether a change to the federal standards is protective of public health and safety, the environment, natural resources, or worker health and safety compared to the baseline federal standards (Sec. 2). Authorizes the State Air Resources Board to adopt the baseline federal standards as a measure in order to maintain the state’s protection be at least as stringent as the baseline federal standards (Sec. 2). Authorizes an action that is in the public interest exclusively to be brought forward by an individual to enforce baseline federal standards adopted as a measure pursuant to specified sections of this act (Sec. 2). Requires regional water quality control boards, at least quarterly, to publish on its website and in the California Regulatory Notice Register, a list of changes made to the federal standards and to provide an assessment on whether a change to the federal standards is protective of public health and safety, the environment, natural resources, or worker health and safety compared to the baseline federal standards (Sec. 2). Authorizes regional water quality control boards to adopt the baseline federal standards as a measure in order to maintain the state’s protection be at least as stringent as the baseline federal standards (Sec. 2). Specifies that an individual can bring an action that is in the public interest to enforce baseline federal standards pursuant to specified sections of the Health and Safety Code and the Water Code, state standards under the Porter-Cologne Water Quality Control Act or other waste discharge requirements, or state standards under the California Safe Drinking Water Act or other permit conditions (Sec. 2). Authorizes the Fish and Game Commission to determine whether to list a species, subspecies, or distinct population segment under the California Endangered Species Act in the event of either of the following (Sec. 2): The federal delisting of the species, subspecies, or distinct population that is eligible for protections under the California Endangered Species Act, and that is listed as endangered or threatened under the federal Endangered Species Act of 1973, as of January 19, 2019; or A change in the legally protected status of the species, subspecies, or distinct population segment, including a change in listing from endangered to threatened, the adoption of a rule of the federal Endangered Species Act, or any amendment to the federal baseline standard. Requires the Occupational Safety and Health Standards Board and the Department of Industrial Relations, at least quarterly, to publish on its website and in the California Regulatory Notice Register, a list of changes made to the federal standards, and to provide an assessment on whether a change made to the federal standards is still protective of worker health and safety compared to the baseline federal standards (Sec. 2). Authorizes the Occupational Safety and Health Standards Board or the Department of Industrial Relations to adopt the baseline federal standards as a measure in order to ensure that the state’s protections are as stringent as the baseline federal standards mentioned above (Sec. 2)."}