{"votes": {"No": [["James  Gallagher", "114778", "Republican", "CA", "3"], ["Frank  Bigelow", "82440", "Republican", "CA", "5"], ["Kevin  Kiley", "169303", "Republican", "CA", "6"], ["Ken  Cooley", "71245", "Democratic", "CA", "8"], ["Heath  Flora", "169309", "Republican", "CA", "12"], ["Adam  C.  Gray", "138552", "Democratic", "CA", "21"], ["Jim  Patterson", "28881", "Republican", "CA", "23"], ["Devon  John  Mathis", "151908", "Republican", "CA", "26"], ["Joaquin  Arambula", "169272", "Democratic", "CA", "31"], ["Rudy  Salas\n                  Jr.", "129492", "Democratic", "CA", "32"], ["Jay  Obernolte", "151831", "Republican", "CA", "33"], ["Vince  Fong", "169357", "Republican", "CA", "34"], ["Jordan  Cunningham", "169360", "Republican", "CA", "35"], ["Tom  Lackey", "71099", "Republican", "CA", "36"], ["Chad  Mayes", "151815", "Republican", "CA", "42"], ["Phillip  Chen", "151715", "Republican", "CA", "55"], ["Melissa  A.  Melendez", "111859", "Republican", "CA", "67"], ["Steven  S. 'Steve'  Choi", "70192", "Republican", "CA", "68"], ["Randy  Voepel", "70784", "Republican", "CA", "71"], ["Tyler  Diep", "157326", "Republican", "CA", "72"], ["William  P. 'Bill'  Brough", "129522", "Republican", "CA", "73"], ["Marie  Waldron", "57320", "Republican", "CA", "75"]], "Yes": [["Jim  Wood", "71013", "Democratic", "CA", "2"], ["Cecilia  M.  Aguiar-Curry", "169297", "Democratic", "CA", "4"], ["Kevin  McCarty", "70260", "Democratic", "CA", "7"], ["Marc  Levine", "126593", "Democratic", "CA", "10"], ["Jim  Frazier", "113539", "Democratic", "CA", "11"], ["Susan  Talamantes  Eggman", "70866", "Democratic", "CA", "13"], ["Tim  Grayson", "129519", "Democratic", "CA", "14"], ["Buffy  Wicks", "180048", "Democratic", "CA", "15"], ["Rebecca  Bauer-Kahan", "180050", "Democratic", "CA", "16"], ["David  Chiu", "112071", "Democratic", "CA", "17"], ["Rob  Bonta", "129483", "Democratic", "CA", "18"], ["Philip 'Phil'  Ting", "138545", "Democratic", "CA", "19"], ["Bill  Quirk", "109721", "Democratic", "CA", "20"], ["Kevin  Mullin", "105586", "Democratic", "CA", "22"], ["Marc  Berman", "146412", "Democratic", "CA", "24"], ["Kansen  Chu", "88289", "Democratic", "CA", "25"], ["Ash  Kalra", "112088", "Democratic", "CA", "27"], ["Evan  Low", "70415", "Democratic", "CA", "28"], ["Mark  W.  Stone", "81650", "Democratic", "CA", "29"], ["Monique  Limón", "169364", "Democratic", "CA", "37"], ["Christy  Smith", "169367", "Democratic", "CA", "38"], ["Luz  Maria  Rivas", "178070", "Democratic", "CA", "39"], ["Chris  Holden", "71235", "Democratic", "CA", "41"], ["Laura  Friedman", "111792", "Democratic", "CA", "43"], ["Jacqui  V.  Irwin", "70919", "Democratic", "CA", "44"], ["Jesse  Gabriel", "178075", "Democratic", "CA", "45"], ["Eloise  Gomez  Reyes", "169395", "Democratic", "CA", "47"], ["Edwin 'Ed'  Chau", "104286", "Democratic", "CA", "49"], ["Richard  Bloom", "70734", "Democratic", "CA", "50"], ["Wendy  Carrillo", "176116", "Democratic", "CA", "51"], ["Miguel  Santiago", "151853", "Democratic", "CA", "53"], ["Sydney  K.  Kamlager", "178079", "Democratic", "CA", "54"], ["Ian  Charles  Calderon", "140248", "Democratic", "CA", "57"], ["Cristina  Garcia", "140262", "Democratic", "CA", "58"], ["Reginald  Byron 'Reggie'  Jones-Sawyer\n                  Sr.", "120229", "Democratic", "CA", "59"], ["Sabrina  Cervantes", "169409", "Democratic", "CA", "60"], ["Jose  Medina", "29082", "Democratic", "CA", "61"], ["Autumn  R.  Burke", "151700", "Democratic", "CA", "62"], ["Anthony  Rendon", "138445", "Democratic", "CA", "63"], ["Mike  Anthony  Gipson", "70443", "Democratic", "CA", "64"], ["Sharon  Quirk-Silva", "71051", "Democratic", "CA", "65"], ["Al  Muratsuchi", "138450", "Democratic", "CA", "66"], ["Cottie  Petrie-Norris", "180141", "Democratic", "CA", "74"], ["Tasha  Boerner Horvath", "180144", "Democratic", "CA", "76"], ["Brian  Maienschein", "70360", "Democratic", "CA", "77"], ["Todd  Gloria", "112061", "Democratic", "CA", "78"], ["Shirley  N.  Weber", "138421", "Democratic", "CA", "79"], ["Lorena  Gonzalez", "144488", "Democratic", "CA", "80"]], "Did Not Vote": [], "NA": []}, "synopsis": "Vote to pass with amendment a bill that rescinds the federal freeze of environmental regulations.", "link": "https://justfacts.votesmart.org/bill/26839/70667/rescinds-federal-freeze-of-environmental-deregulations", "name": "SB 1 - Rescinds Federal Freeze of Environmental Deregulations - California Key Vote", "pg": "Highlights: Prohibits a person from transporting, selling, receiving, acquiring, or purchasing any fish, wildlife, or plant that was taken, possessed, transported, or sold in violation of any law, treaty, regulation, policy, or finding of the United States with regard to international trade of fish, wildlife, or plants in effect on January 19, 2017 (Sec. 1). Specifies that section 1 of this act will become inoperative on January 20, 2025, and as of January 1, 2026 will be repealed (Sec. 1). Authorizes the commission to consider adopting a regulation that adds a species to the list of endangered species or threatened species as an emergency regulation if the commission determines that a federal action subsequent to January 19, 2017, under the federal Endangered Species Act of 1973 decreases protection for that species (Sec. 3). Defines “baseline federal standards” as federal standards in effect as of January 19, 2017, that were not otherwise permanently enjoined by a federal court as of that date (Sec. 3). Requires the State Air Resources Board, once every six months, to publish on its website and in the California Regulatory Notice Register, a list of changes made to the baseline federal standards that could affect the achievement and maintenance of any federal ambient air quality standard, hazardous air pollutant standard, or greenhouse gas emission reduction applicable to the state that are subject to the jurisdiction of the state board (Sec. 4). Authorizes the State Air Resources Board to adopt a measure or use a nonregulatory option in order to maintain the state’s protections to be at least as protective as the baseline federal standards mentioned above (Sec. 4). Authorizes an individual to bring an action that is in the public interest against the owner or operator of a source in violation of any measure adopted under this article by the state board (Sec. 4). Specifies that civil penalties for a violation of this article may reach up to $25,000 for each day of the violation (Sec. 4). Specifies that an individual can bring an action that is in the public interest to enforce baseline federal standards pursuant to specified sections of the Health and Safety Code and the Water Code, state standards under the Porter-Cologne Water Quality Control Act or other waste discharge requirements, or state standards under the California Safe Drinking Water Act or other permit conditions, for which a cause of action was available and in effect on or before January 19, 2017 (Sec. 4). Specifies that civil penalties imposed for a lack of enforcement of the above include those that would have been available under the Federal Water Pollution Control Act or the federal Safe Drinking Water Act and their implementing regulations in effect on January 19, 2017 (Sec. 4). Requires the Occupational Safety and Health Standards Board, at least quarterly, to publish on its website and in the California Regulatory Notice Register, a list of changes made to the federal standards and provide an assessment on whether a change made to the federal standards is still protective of worker health and safety compared to the baseline federal standards (Sec. 4). Authorizes the Occupational Safety and Health Standards Board or the Department of Industrial Relations to adopt the baseline federal standards as a measure in order to ensure that the state’s protections are as stringent compared to the baseline federal standards mentioned above (Sec. 4). Requires the state board to adopt a primary drinking water standard at least as stringent as the national primary drinking water standard that was in effect on January 19, 2017 (Sec. 5). Classifies the violation of the discharging of waste, after such violation has been called to the individual’s attention in writing by the regional board, as a misdemeanor (Sec. 7). Specifies that an individual will be liable civilly if they (Sec. 8): Violate a cease and desist order, cleanup and abatement order, waste discharge requirement, waiver condition, certification, or other order or prohibition issued, reissued, or amended by a regional board or the state board; Cause or permit any oil or any residuary product of petroleum to be deposited in or on any of the waters of the state, except in accordance with waste discharge requirements; or Cause or permit any hazardous substance to be deposited in or on any of the waters of the state, except in accordance with waste discharge requirements."}