{"votes": {"No": [["Brian  Dahle", "82387", "Republican", "CA", "1"], ["James  Wiley 'Jim'  Nielsen", "104331", "Republican", "CA", "4"], ["Andreas  Borgeas", "111778", "Republican", "CA", "8"], ["Shannon  L.  Grove", "120204", "Republican", "CA", "16"], ["Mike  Morrell", "29706", "Republican", "CA", "23"], ["Jeff  Stone", "82828", "Republican", "CA", "28"], ["Brian  W.  Jones", "70781", "Republican", "CA", "38"]], "Yes": [["Mike  McGuire", "129749", "Democratic", "CA", "2"], ["Bill  Dodd", "82641", "Democratic", "CA", "3"], ["Cathleen  Galgiani", "57629", "Democratic", "CA", "5"], ["Richard  Pan", "120159", "Democratic", "CA", "6"], ["Steve  Glazer", "151749", "Democratic", "CA", "7"], ["Nancy  Skinner", "104350", "Democratic", "CA", "9"], ["Robert  A. 'Bob'  Wieckowski", "71025", "Democratic", "CA", "10"], ["Scott  Wiener", "129655", "Democratic", "CA", "11"], ["Anna  M.  Caballero", "58583", "Democratic", "CA", "12"], ["Gerald  A. 'Jerry'  Hill", "81552", "Democratic", "CA", "13"], ["James  T. 'Jim'  Beall\n                  Jr.", "58229", "Democratic", "CA", "15"], ["William  W. 'Bill'  Monning", "104370", "Democratic", "CA", "17"], ["Robert 'Bob'  Hertzberg", "9756", "Democratic", "CA", "18"], ["Hannah-Beth  Jackson", "16826", "Democratic", "CA", "19"], ["Connie  M.  Leyva", "151805", "Democratic", "CA", "20"], ["Scott  Thomas  Wilk", "138539", "Republican", "CA", "21"], ["Susan  Rubio", "129493", "Democratic", "CA", "22"], ["Maria  Elena  Durazo", "179971", "Democratic", "CA", "24"], ["Anthony  J.  Portantino\n                  Jr.", "69513", "Democratic", "CA", "25"], ["Benjamin 'Ben'  Allen", "151677", "Democratic", "CA", "26"], ["Henry  Stern", "169182", "Democratic", "CA", "27"], ["Ling-Ling  Chang", "129527", "Republican", "CA", "29"], ["Holly  J.  Mitchell", "120230", "Democratic", "CA", "30"], ["Richard  D.  Roth", "138416", "Democratic", "CA", "31"], ["Bob  J.  Archuleta", "71279", "Democratic", "CA", "32"], ["Lena  Gonzalez", "157372", "Democratic", "CA", "33"], ["Thomas 'Tom'  Umberg", "29299", "Democratic", "CA", "34"], ["Steven  Craig  Bradford", "56752", "Democratic", "CA", "35"], ["Patricia  C. 'Pat'  Bates", "16585", "Republican", "CA", "36"], ["Toni  G.  Atkins", "70372", "Democratic", "CA", "39"], ["Ben  Hueso", "70366", "Democratic", "CA", "40"]], "Did Not Vote": [], "NA": []}, "synopsis": "Vote to pass with amendment a bill that amends environmental protections relating to heavy crude oil spills and emergency response planning.", "link": "https://justfacts.votesmart.org/bill/26828/70712/amends-environmental-protections-relating-to-heavy-crude-oils", "name": "AB 936 - Amends Environmental Protections Relating to Heavy Crude Oils - California Key Vote", "pg": "Highlights: Requires the administrator to submit to the governor and legislature an amended California oil spill contingency plan that addresses marine and inland oil spills every 3 years (Sec. 2). Requires the administrator to include in the revised plan due on or before January 1, 2023, provisions addressing non-floating oil (Sec. 2). Requires an owner or operator of a facility, small marine fueling facility, or mobile transfer unit, or an owner or operator of a tank vessel, non-tank vessel, or vessel carrying oil as secondary cargo, while operating in the waters of the state or where a spill could impact waters of the state, to have an oil contingency plan that has been submitted to and approved by the administrator (Sec. 5). Requires that an oil spill contingency plan ensure the undertaking of a prompt response and removal action in the case of a spill, and must be consistent with the California oil spill contingency plan, and cannot conflict with the National Oil and Hazardous Substances Pollution Contingency Plan (Sec. 5). Requires that an oil spill contingency plan meets all of the following requirements, though more might be required (Sec. 5): Be a written document, reviewed for feasibility and executability, and signed by the owner or operator, or their designee; Provide for the use of a recognized incident command system to be used during a spill; Provide procedures for reporting oil spills to local, state, and federal agencies, and include a list of contacts to call in the event of a drill, exercise, threatened spill, or spill; Describe the strategies for the protection of environmentally sensitive areas; Beginning January 1, 2022, if non-floating oil is present, the contingency plan must identify at least one Oil Spill Removal Organization (OSRO) capable of oil spill response activities related to that non-floating oil; Identify at least one certified spill management team that is capable of managing a spill of the reasonable worst case spill volume identified in the plan. Defines “non-floating oil” as a Group V oil as defined in Section 155.1020 of Title 33 of the Code of Federal Regulations, including any Group V oil that is diluted for transport (Sec. 3). Authorizes the administrator to define additional types of oil as non-floating oil upon a finding that those types of oil are more likely to sink rapidly due to their composition (Sec. 3). Requires that the administrator, on or before January 1, 2022, hold a technology workshop that must include the topic of technology for addressing non-floating oil spills (Sec. 4). Require the administrator to consider information gained from technology workshops, as well as available scientific and technical literature concerning non-floating oil spill response technology, in determining best achievable protection an in fulfilling the administrator’s duties (Sec. 4). Defines “administrator” as the administrator for an oil spill response appointed by the Governor (Sec. 3). Defines “OSRO” or “oil spill response organization” as an individual, organization, association, cooperative, or other entity that provides equipment, personnel, supplies, or other services directly related to oil spill containment, cleanup or removal activities (Sec. 3). Requires the administrator to revise criteria for rating OSROs determined by the administrator to be capable of addressing non-floating oil spills so that criteria are at least as protective as the non-floating oil classification in the United States Coast Guard’s OSRO Guidelines, as those guidelines read on January 1, 2019 (Sec. 6). Requires that those OSROS are required to be capable of providing equipment on the scene of an oil spill within an amount of time determined by the administrator to be consistent with the achievement of best achievable protection for non-floating oil (Sec. 6). Requires the commission to request, from destination facilities, the following information regarding oil transported to or within California via rail car or marine vessel (Sec. 8): The route of transport within California; The marketable crude oil name; The name and location of the loading facility; The name and location of the destination facility; and Whether the crude oil is a non-floating oil."}