{"votes": {"No": [["Brian  Dahle", "82387", "Republican", "CA", "1"], ["Andreas  Borgeas", "111778", "Republican", "CA", "8"], ["Scott  Thomas  Wilk", "138539", "Republican", "CA", "21"], ["Rosilicie  Ochoa Bogh", "188758", "Republican", "CA", "23"], ["Melissa  A.  Melendez", "111859", "Republican", "CA", "28"], ["Patricia  C. 'Pat'  Bates", "16585", "Republican", "CA", "36"], ["Brian  W.  Jones", "70781", "Republican", "CA", "38"], ["Ben  Hueso", "70366", "Democratic", "CA", "40"]], "Yes": [["Mike  McGuire", "129749", "Democratic", "CA", "2"], ["Bill  Dodd", "82641", "Democratic", "CA", "3"], ["James  Wiley 'Jim'  Nielsen", "104331", "Republican", "CA", "4"], ["Susan  Talamantes  Eggman", "70866", "Democratic", "CA", "5"], ["Nancy  Skinner", "104350", "Democratic", "CA", "9"], ["Robert  A. 'Bob'  Wieckowski", "71025", "Democratic", "CA", "10"], ["Scott  Wiener", "129655", "Democratic", "CA", "11"], ["Josh  Becker", "120184", "Democratic", "CA", "13"], ["Melissa  Hurtado", "179956", "Democratic", "CA", "14"], ["Dave  Cortese", "114701", "Democratic", "CA", "15"], ["John  S.  Laird", "29614", "Democratic", "CA", "17"], ["Robert 'Bob'  Hertzberg", "9756", "Democratic", "CA", "18"], ["Monique  Limón", "169364", "Democratic", "CA", "19"], ["Connie  M.  Leyva", "151805", "Democratic", "CA", "20"], ["Benjamin 'Ben'  Allen", "151677", "Democratic", "CA", "26"], ["Henry  Stern", "169182", "Democratic", "CA", "27"], ["Richard  D.  Roth", "138416", "Democratic", "CA", "31"], ["Bob  J.  Archuleta", "71279", "Democratic", "CA", "32"], ["Lena  Gonzalez", "157372", "Democratic", "CA", "33"], ["Thomas 'Tom'  Umberg", "29299", "Democratic", "CA", "34"], ["Steven  Craig  Bradford", "56752", "Democratic", "CA", "35"], ["Dave  Min", "179392", "Democratic", "CA", "37"], ["Toni  G.  Atkins", "70372", "Democratic", "CA", "39"]], "Did Not Vote": [["Richard  Pan", "120159", "Democratic", "CA", "6"], ["Steve  Glazer", "151749", "Democratic", "CA", "7"], ["Anna  M.  Caballero", "58583", "Democratic", "CA", "12"], ["Shannon  L.  Grove", "120204", "Republican", "CA", "16"], ["Susan  Rubio", "129493", "Democratic", "CA", "22"], ["Maria  Elena  Durazo", "179971", "Democratic", "CA", "24"], ["Anthony  J.  Portantino\n                  Jr.", "69513", "Democratic", "CA", "25"], ["Josh  Newman", "169187", "Democratic", "CA", "29"], ["Sydney  K.  Kamlager", "178079", "Democratic", "CA", "30"]], "NA": []}, "synopsis": "Vote to pass a bill that requires the beverage industry to create an accessible recycling and redemption system for bottles and cans by making distributors of beverage containers in the state form a beverage container stewardship organization.", "link": "https://justfacts.votesmart.org/bill/30900/80083/requires-the-beverage-industry-to-create-an-accessible-recycling-and-redemption-system", "name": "SB 38 - Requires the Beverage Industry to Create an Accessible Recycling and Redemption System - California Key Vote", "pg": "Highlights: Prohibits beverage dealers from charging a redemption payment that is larger than what is outlined in Section 14560 of the Public Resources Code (Sec. 2). Establishes an infraction punishable by a $100 fine if the overcharge is $1 or less (Sec. 2). Prohibits beer importers from purchasing any beer not manufactured in the state or causing beer to be transported into the state for in-state purchase, unless the out-of-state vendor has a certificate of compliance issued by the department (Sec. 6). Authorizes the Department of Resources Recycling and Recovery to establish, implement, and maintain a recycling plan for the Legislature which shall include any materials at the discretion of the Department of Resources Recycling and Recovery (Sec. 12). Authorizes the Department of Resources Recycling and Recovery to provide and train participating locations with education and training on properly separating and collecting recyclable materials (Sec. 12). Requires the beverage container stewardship organization to certify redemption centers that were in good standing with the state beverage recycling program as of December 31, 2021 (Sec. 17). Requires the beverage container stewardship organization to adopt procedures, standards, and requirements for certifying redemption centers (Ch. 3.5). Requires redemption centers seeking an application or renewal of certification to complete precertification training (Ch. 3.5). Requires the beverage container stewardship organization to certify processors (Ch. 3.5). Requires the beverage container stewardship organization to review whether an application for certification is complete and approve or deny the application no later than 60 days after the application was deemed complete (Ch. 3.5). Requires beverage manufacturers to register all of their products and labels with the beverage container stewardship organization (Ch. 3.5). Requires the beverage container stewardship organization to certify dropoff and collection programs while meeting the following conditions (Ch. 3.5): The dropoff or collection program demonstrates that it will operate under this division; and The dropoff or collection program notifies the beverage container stewardship organization of any material change in its operation process that conflicts with the certification application. Requires processors to report the number of empty beverage containers each month to the department by material type and weight of the container (Ch. 4). Requires a beverage container offered for sale with a capacity under 24 fluid ounces to have a refund of $0.05 and a beverage container with a capacity of more than 24 fluid ounces to have a refund of $0.10 (Ch. 5). Requires beverage manufacturers to clearly label all beverage containers sold or offered for sale with “CA Redemption Value” or any other similar printing embossed on the beverage container, except if it is a refillable beverage container (Ch. 5). Requires redemption centers to accept empty beverage containers from consumers, drop off, or collection programs and pay them the refund value of the beverage container (Ch. 5). Requires all fees received by the department to be deposited into the Beverage Container Recycling Program Fund, created in the State Treasury (Ch. 7). Requires the beverage container stewardship organization to approve and submit a proposed beverage container stewardship program budget for the following calendar year that includes all of the following (Ch. 20.5): Anticipated revenues and costs of implementing the program; A recommended funding level sufficient to cover expenses to operate the beverage container stewardship program; The amount of the beverage container stewardship fee that was established and an itemization of the costs that the fee covers; and An amount that would give the beverage container stewardship organization a prudent reserve. Requires the department to approve or disapprove a final beverage container stewardship organization budget on or before October 1, 2023, and on or before October 1 annually thereafter (Ch. 20.5). Requires the beverage container stewardship organization to submit a revised budget addressing the concerns written by the department within 30 days if the budget is not approved (Ch. 20.5). Requires the department to post on its internal website a list of distributors in the state that comply or do not comply with these provisions (Ch. 20.5)."}