{"votes": {"No": [["Brian  Dahle", "82387", "Republican", "CA", "1"], ["Bill  Dodd", "82641", "Democratic", "CA", "3"], ["James  Wiley 'Jim'  Nielsen", "104331", "Republican", "CA", "4"], ["Andreas  Borgeas", "111778", "Republican", "CA", "8"], ["Anna  M.  Caballero", "58583", "Democratic", "CA", "12"], ["Melissa  Hurtado", "179956", "Democratic", "CA", "14"], ["Shannon  L.  Grove", "120204", "Republican", "CA", "16"], ["Scott  Thomas  Wilk", "138539", "Republican", "CA", "21"], ["Rosilicie  Ochoa Bogh", "188758", "Republican", "CA", "23"], ["Melissa  A.  Melendez", "111859", "Republican", "CA", "28"], ["Patricia  C. 'Pat'  Bates", "16585", "Republican", "CA", "36"], ["Brian  W.  Jones", "70781", "Republican", "CA", "38"]], "Yes": [["Mike  McGuire", "129749", "Democratic", "CA", "2"], ["Nancy  Skinner", "104350", "Democratic", "CA", "9"], ["Robert  A. 'Bob'  Wieckowski", "71025", "Democratic", "CA", "10"], ["Scott  Wiener", "129655", "Democratic", "CA", "11"], ["Josh  Becker", "120184", "Democratic", "CA", "13"], ["John  S.  Laird", "29614", "Democratic", "CA", "17"], ["Monique  Limón", "169364", "Democratic", "CA", "19"], ["Connie  M.  Leyva", "151805", "Democratic", "CA", "20"], ["Anthony  J.  Portantino\n                  Jr.", "69513", "Democratic", "CA", "25"], ["Benjamin 'Ben'  Allen", "151677", "Democratic", "CA", "26"], ["Sydney  K.  Kamlager", "178079", "Democratic", "CA", "30"], ["Lena  Gonzalez", "157372", "Democratic", "CA", "33"], ["Dave  Min", "179392", "Democratic", "CA", "37"], ["Toni  G.  Atkins", "70372", "Democratic", "CA", "39"]], "Did Not Vote": [["Susan  Talamantes  Eggman", "70866", "Democratic", "CA", "5"], ["Richard  Pan", "120159", "Democratic", "CA", "6"], ["Steve  Glazer", "151749", "Democratic", "CA", "7"], ["Dave  Cortese", "114701", "Democratic", "CA", "15"], ["Robert 'Bob'  Hertzberg", "9756", "Democratic", "CA", "18"], ["Susan  Rubio", "129493", "Democratic", "CA", "22"], ["Maria  Elena  Durazo", "179971", "Democratic", "CA", "24"], ["Henry  Stern", "169182", "Democratic", "CA", "27"], ["Josh  Newman", "169187", "Democratic", "CA", "29"], ["Richard  D.  Roth", "138416", "Democratic", "CA", "31"], ["Bob  J.  Archuleta", "71279", "Democratic", "CA", "32"], ["Thomas 'Tom'  Umberg", "29299", "Democratic", "CA", "34"], ["Steven  Craig  Bradford", "56752", "Democratic", "CA", "35"], ["Ben  Hueso", "70366", "Democratic", "CA", "40"]], "NA": []}, "synopsis": "Vote to pass a bill that requires the state to maintain net negative greenhouse gas emissions after achieving net-zero.", "link": "https://justfacts.votesmart.org/bill/31714/82665/requires-california-to-maintain-net-negative-greenhouse-gas-emissions-after-achieving-net-zero", "name": "AB 1395 - Requires California to Maintain Net Negative Greenhouse Gas Emissions After Achieving Net-Zero - California Key Vote", "pg": "Highlights: Requires California to achieve net-zero greenhouse gas emissions as soon as possible, but no later than 2045, and to achieve and maintain net negative greenhouse gas emissions thereafter. This goal is in addition to and does not replace or supersede, the statewide greenhouse gas emissions reduction targets (Sec. 1). Establishes by 2045, statewide anthropogenic greenhouse gas emissions will be reduced to at least 90% below the statewide greenhouse gas emissions limit (Sec. 3). Requires the state board to work with relevant state agencies to do all of the following (Sec. 3): Ensure that updates to the scoping plan identify and recommend measures to achieve the policy goals; Identify a variety of policies and strategies that support carbon dioxide removal solutions and carbon capture and storage technologies in California to complement emissions reductions and nature-based climate solutions and achieve durable greenhouse gas emissions reductions or carbon removals; and Identify a variety of policies and strategies that support nature-based climate solutions in California so its natural and working lands can be a healthy net sink of carbon dioxide and achieve durable greenhouse gas emissions reductions or carbon removals. Requires the state board to identify interim 5-year greenhouse gas emission reduction goals that begin on January 1, 2025, to achieve the policy goals stated (Sec.3). Establishes that by December 31, 2035, the state board will evaluate the feasibility and tradeoffs of achieving the policy goal (Sec. 3). Specifies greenhouse gas emission reductions and carbon removals are permanent and quantifiable by accounting for risk factors and contingencies in the event of a release or reversal to ensure accurate accounting of net greenhouse gas emissions from the use of carbon dioxide removal technologies and carbon capture and storage technologies (Sec. 3). Requires the state board to include robust monitoring, accounting, and annual reporting by the project owner. Reports must describe environmental safeguards, account for uncertainty in any measurements, be verified by a state board-approved third-party verifier, and be made publicly available (Sec. 3). Requires compliance with all applicable local, regional, state, and national mandates on environmental impact assessments or reports and all applicable local, regional, state, and national environmental health and safety laws and regulations, including any requirements regarding transparent documentation with verification and grievance mechanism processes (Sec. 3)."}