{"votes": {"No": [["James  Wiley 'Jim'  Nielsen", "104331", "Republican", "CA", "4"], ["Shannon  L.  Grove", "120204", "Republican", "CA", "16"], ["Scott  Thomas  Wilk", "138539", "Republican", "CA", "21"], ["Rosilicie  Ochoa Bogh", "188758", "Republican", "CA", "23"], ["Melissa  A.  Melendez", "111859", "Republican", "CA", "28"], ["Patricia  C. 'Pat'  Bates", "16585", "Republican", "CA", "36"], ["Brian  W.  Jones", "70781", "Republican", "CA", "38"]], "Yes": [["Mike  McGuire", "129749", "Democratic", "CA", "2"], ["Bill  Dodd", "82641", "Democratic", "CA", "3"], ["Richard  Pan", "120159", "Democratic", "CA", "6"], ["Steve  Glazer", "151749", "Democratic", "CA", "7"], ["Nancy  Skinner", "104350", "Democratic", "CA", "9"], ["Robert  A. 'Bob'  Wieckowski", "71025", "Democratic", "CA", "10"], ["Scott  Wiener", "129655", "Democratic", "CA", "11"], ["Anna  M.  Caballero", "58583", "Democratic", "CA", "12"], ["Josh  Becker", "120184", "Democratic", "CA", "13"], ["Melissa  Hurtado", "179956", "Democratic", "CA", "14"], ["Dave  Cortese", "114701", "Democratic", "CA", "15"], ["John  S.  Laird", "29614", "Democratic", "CA", "17"], ["Robert 'Bob'  Hertzberg", "9756", "Democratic", "CA", "18"], ["Monique  Limón", "169364", "Democratic", "CA", "19"], ["Connie  M.  Leyva", "151805", "Democratic", "CA", "20"], ["Susan  Rubio", "129493", "Democratic", "CA", "22"], ["Maria  Elena  Durazo", "179971", "Democratic", "CA", "24"], ["Anthony  J.  Portantino\n                  Jr.", "69513", "Democratic", "CA", "25"], ["Benjamin 'Ben'  Allen", "151677", "Democratic", "CA", "26"], ["Josh  Newman", "169187", "Democratic", "CA", "29"], ["Sydney  K.  Kamlager", "178079", "Democratic", "CA", "30"], ["Richard  D.  Roth", "138416", "Democratic", "CA", "31"], ["Bob  J.  Archuleta", "71279", "Democratic", "CA", "32"], ["Lena  Gonzalez", "157372", "Democratic", "CA", "33"], ["Thomas 'Tom'  Umberg", "29299", "Democratic", "CA", "34"], ["Steven  Craig  Bradford", "56752", "Democratic", "CA", "35"], ["Dave  Min", "179392", "Democratic", "CA", "37"], ["Toni  G.  Atkins", "70372", "Democratic", "CA", "39"], ["Ben  Hueso", "70366", "Democratic", "CA", "40"]], "Did Not Vote": [["Brian  Dahle", "82387", "Republican", "CA", "1"], ["Susan  Talamantes  Eggman", "70866", "Democratic", "CA", "5"], ["Andreas  Borgeas", "111778", "Republican", "CA", "8"], ["Henry  Stern", "169182", "Democratic", "CA", "27"]], "NA": []}, "synopsis": "Vote to concur with House amendments and pass a bill that establishes additional labeling requirements for recyclable materials.", "link": "https://justfacts.votesmart.org/bill/31747/82855/establishes-additional-labeling-requirements-for-recyclable-materials", "name": "SB 343 - Establishes Additional Labeling Requirements for Recyclable Materials - California Key Vote", "pg": "Highlights: Establishes that any person who represents in advertising or on the label of a consumer good that the consumer good that it manufactures or distributes is not harmful to, or is beneficial to, the natural environment, through the use of such terms as “environmental choice,” “ecologically friendly,” “earth-friendly,” “environmentally friendly,” “ecologically sound,” “environmentally sound,” “environmentally safe,” “ecologically safe,” “environmentally lite,” “green product,” and the manufacturer must have documentation of the following (Sec. 1.a): Any significant adverse environmental impacts directly associated with the production, distribution, use, and disposal of the consumer good; Any measures that are taken by the person to reduce the environmental impacts directly associated with the production, distribution, and disposal of the consumer good; Violations of any federal, state, or local permits directly associated with the production or distribution of the consumer good; and Whether, if applicable, the consumer good conforms with the uniform standards contained in the Federal Trade Commission Guidelines for Environmental Marketing Claims for the use of the terms “recycled,” “recyclable,” “biodegradable,” “photodegradable,” or “ozone-friendly.” Requires the direction to the consumer to accurately instruct the consumer to dispose of the consumer good through participation in, and consistent with, one of the programs as that program applies to the consumer good (Sec. 1-2). Establishes it is unlawful for a person to make an untruthful, deceptive, or misleading environmental marketing claim, whether explicit or implied (Sec. 2.a). Requires all rigid plastic bottles and rigid plastic containers sold in the state shall be labeled with a code that indicates the resin used to produce the rigid plastic bottle or rigid plastic container. Rigid plastic bottles or rigid plastic containers with labels and base cups of a different material shall be coded by their basic material. The code will consist of a number placed inside a triangle, and letters placed below the triangle (Sec. 3.a). Alleges the Legislature finds that it is the public policy of the state that environmental marketing claims, whether explicit or implied, should be substantiated by competent and reliable evidence to prevent deceiving or misleading consumers about the environmental impact of plastic products (Sec. 4.a). Prohibits a product or packaging from being considered recyclable in the state unless the product or packaging meets all of the following criteria, as applicable (Sec. 5-3): For plastic packaging, the plastic packaging is designed to not include any components, inks, adhesives, or labels that prevent the recyclability of the packaging according to the APR Design® Guide published by the Association of Plastic Recyclers; For plastic products and non-plastic products and packaging, the product or packaging is designed to ensure recyclability and does not include any components, inks, adhesives, or labels that prevent the recyclability of the product or packaging; The product or packaging does not contain an intentionally added chemical identified; and The product or packaging is not made from plastic or fiber that contains perfluoroalkyl or polyfluoroalkyl substances or PFAS that meets either of the following criteria: PFAS that a manufacturer has intentionally added to a product or packaging and that have a functional or technical effect in the product or packaging, including the PFAS components of intentionally added chemicals and PFAS that are intentional breakdown products of an added chemical that also have a functional or technical effect in the product; and The presence of PFAS in a product or product component or packaging or packaging component at or above 100 parts per million, as measured in total organic fluorine."}