{"votes": {"No": [["Bradlee  Thomas  Farrin", "151396", "Republican", "ME", "3"], ["Paul  T.  Davis\n                  Sr.", "19594", "Republican", "ME", "4"], ["Stacey  K.  Guerin", "120954", "Republican", "ME", "10"], ["Dana  L.  Dow", "36789", "Republican", "ME", "13"], ["Matthew  G. 'Matt'  Pouliot", "142890", "Republican", "ME", "15"], ["Scott  W.  Cyrway", "155345", "Republican", "ME", "16"], ["Russell  J.  Black", "121044", "Republican", "ME", "17"], ["James  Michael 'Jim'  Hamper", "37238", "Republican", "ME", "19"], ["Jeffrey  L. 'Jeff'  Timberlake", "121048", "Republican", "ME", "22"], ["David  Woodsome", "155021", "Republican", "ME", "33"], ["Robert  A. 'Bob'  Foley", "151401", "Republican", "ME", "34"]], "Yes": [["Troy  Dale  Jackson", "36809", "Democratic", "ME", "1"], ["Michael  E. 'Mike'  Carpenter", "137220", "Democratic", "ME", "2"], ["James  F. 'Jim'  Dill", "120946", "Democratic", "ME", "5"], ["Marianne  Moore", "170470", "Republican", "ME", "6"], ["Louis  Joseph 'Louie'  Luchini", "120977", "Democratic", "ME", "7"], ["Kimberley  C. 'Kim'  Rosen", "37040", "Republican", "ME", "8"], ["Geoffrey  M. 'Geoff'  Gratwick", "75503", "Democratic", "ME", "9"], ["Erin  D.  Herbig", "120985", "Democratic", "ME", "11"], ["David  R. 'Dave'  Miramant", "36796", "Democratic", "ME", "12"], ["Shenna  Bellows", "151344", "Democratic", "ME", "14"], ["Lisa  M.  Keim", "137323", "Republican", "ME", "18"], ["Edmund 'Ned'  Claxton\n                  Jr.", "181145", "Democratic", "ME", "20"], ["Nathan  L. 'Nate'  Libby", "137301", "Democratic", "ME", "21"], ["Eloise  A.  Vitelli", "144905", "Democratic", "ME", "23"], ["Everett  C. 'Brownie'  Carson", "170057", "Democratic", "ME", "24"], ["Catherine  E. 'Cathy'  Breen", "149587", "Democratic", "ME", "25"], ["G.  William 'Bill'  Diamond", "36723", "Democratic", "ME", "26"], ["Benjamin  M. 'Ben'  Chipman", "127853", "Democratic", "ME", "27"], ["Heather  B.  Sanborn", "170119", "Democratic", "ME", "28"], ["Rebecca  J.  Millett", "137189", "Democratic", "ME", "29"], ["Linda  F.  Sanborn", "103639", "Democratic", "ME", "30"], ["Justin  Mark  Chenette", "137374", "Democratic", "ME", "31"], ["Susan  A.  Deschambault", "169212", "Democratic", "ME", "32"], ["Mark  W.  Lawrence", "1711", "Democratic", "ME", "35"]], "Did Not Vote": [], "NA": []}, "synopsis": "Vote to pass a bill that prohibits single-use plastic bags.", "link": "https://justfacts.votesmart.org/bill/26787/68332/prohibits-single-use-plastic-bags", "name": "LD 1532 - Prohibits Single-Use Plastic Bags - Maine Key Vote", "pg": "Highlights: Prohibits a retail establishment from providing a single-use carry-out bag to a customer at the point of sale, or otherwise make single-use bags available to customers (Sec. 2). Exempts the following from the above prohibition (Sec. 2): Bags provided by a pharmacy to a customer for transporting a prescription medication away from the store; Bags without handles used to protect items from being damaged or from damaging or contaminating other purchased items placed in a recycled paper bag or reusable container; Bags used by customers inside a retail establishment to package loose items such as fruits, vegetables, coffee, nuts, bakery goods, etc; Laundry, dry cleaning or garment bags, including bags provided by a hotel to guests to contain wet or dirty clothing, or bags provided to protect large garments like suits or dresses; Newspaper bags; Bags sold in packages containing multiple bags intended to contain garbage or waste; Bags used to contain live animals, such as fish or insects, sold in pet stores; Bags used for vehicle tires; Bags used to transport chemical pesticides, drain cleaning chemicals, or other chemicals sold at a retail establishment. Bags used by a hunger relief organization to distribute food directly to the consumer at no charge; and Bags that customers bring to the retail establishment for their own use. Authorizes a retail establishment to use a recycled paper bag or a reusable bag made of plastic to bag products at the point of sale, provided the establishment charges a fee of at least 5 cents per bag (Sec. 3). Exempts the following retail establishments from the 5 cent charge requirement stated above, but specifies the establishment can charge a recycled bag or reusable bag fee (Sec. 3): Stores at which less than 2 percent of retail sales are attributed to the sale of food and that have less than 10,000 square feet of retail area; Restaurants; and Hunger relief organizations engaged in distributing food directly to consumers at no charge. Defines “retail establishment” as a store, restaurant, or temporary business (Sec. 1). Defines “recyclable paper bag” as a paper bag that is 100 percent recyclable and contains at least 20 percent post-consumer recycled material if it has a capacity to hold at least 8 pounds (Sec. 1). Defines “single use carry-out bag” as a bag that is made out of plastic, paper, or other material provided by a retail establishment at the point of sale for the purpose of transporting merchandise away from the retail establishment and that is not a recycled paper or reusable bag (Sec. 1). Defines “reusable bag” as a bag with handles that is designed and manufactured to withstand a minimum of 75 repeated uses, is machine washable, is made from plastic at least 4 mils thick, and has the capacity of carrying a minimum of 18 pounds (Sec. 1). Specifies that a local government may not adopt an ordinance regulating single-use carry-out bags at retail establishments, and any ordinance in effect beginning April 22, 2020 will become void and have no force or effect (Sec. 5)."}