{"votes": {"No": [["Harold  L. 'Trey'  Stewart\n                  III", "170489", "Republican", "ME", "2"], ["Bradlee  Thomas  Farrin", "151396", "Republican", "ME", "3"], ["Paul  T.  Davis\n                  Sr.", "19594", "Republican", "ME", "4"], ["Marianne  Moore", "170470", "Republican", "ME", "6"], ["Kimberley  C. 'Kim'  Rosen", "37040", "Republican", "ME", "8"], ["Stacey  K.  Guerin", "120954", "Republican", "ME", "10"], ["Matthew  G. 'Matt'  Pouliot", "142890", "Republican", "ME", "15"], ["Scott  W.  Cyrway", "155345", "Republican", "ME", "16"], ["Russell  J.  Black", "121044", "Republican", "ME", "17"], ["Lisa  M.  Keim", "137323", "Republican", "ME", "18"], ["Jeffrey  L. 'Jeff'  Timberlake", "121048", "Republican", "ME", "22"], ["David  Woodsome", "155021", "Republican", "ME", "33"]], "Yes": [["Troy  Dale  Jackson", "36809", "Democratic", "ME", "1"], ["James  F. 'Jim'  Dill", "120946", "Democratic", "ME", "5"], ["Louis  Joseph 'Louie'  Luchini", "120977", "Democratic", "ME", "7"], ["Joseph  M.  Baldacci", "22174", "Democratic", "ME", "9"], ["Glenn  E. 'Chip'  Curry", "137202", "Democratic", "ME", "11"], ["David  R. 'Dave'  Miramant", "36796", "Democratic", "ME", "12"], ["Chloe  S.  Maxmin", "181243", "Democratic", "ME", "13"], ["Craig  V.  Hickman", "121034", "Democratic", "ME", "14"], ["Richard  A. 'Rick'  Bennett", "10747", "Republican", "ME", "19"], ["Edmund 'Ned'  Claxton\n                  Jr.", "181145", "Democratic", "ME", "20"], ["Nathan  L. 'Nate'  Libby", "137301", "Democratic", "ME", "21"], ["Eloise  A.  Vitelli", "144905", "Democratic", "ME", "23"], ["Matthea  Elisabeth 'Mattie'  Daughtry", "142892", "Democratic", "ME", "24"], ["Catherine  E. 'Cathy'  Breen", "149587", "Democratic", "ME", "25"], ["G.  William 'Bill'  Diamond", "36723", "Democratic", "ME", "26"], ["Benjamin  M. 'Ben'  Chipman", "127853", "Democratic", "ME", "27"], ["Anne  M.  Carney", "181179", "Democratic", "ME", "29"], ["Stacy  Fielding  Brenner", "192722", "Democratic", "ME", "30"], ["Donna  A.  Bailey", "170078", "Democratic", "ME", "31"], ["Susan  A.  Deschambault", "169212", "Democratic", "ME", "32"], ["Joseph  E.  Rafferty\n                  Jr.", "192719", "Democratic", "ME", "34"], ["Mark  W.  Lawrence", "1711", "Democratic", "ME", "35"]], "Did Not Vote": [["Heather  B.  Sanborn", "170119", "Democratic", "ME", "28"]], "NA": []}, "synopsis": "Vote to amend and pass a bill that amends recycling laws to shift the cost of disposing packaging materials away from Maine communities and onto the companies that create them.", "link": "https://justfacts.votesmart.org/bill/31372/81411/amends-recycling-laws-to-shift-the-cost-of-disposing-packaging-materials-to-companies", "name": "LD 1541 - Amends Recycling Laws to Shift the Cost of Disposing Packaging Materials to Companies - Maine Key Vote", "pg": "Highlights: Defines \"alternative collection program\" as a program for the management of packaging material that is operated by an individual producer or group of producers and that has been approved by the department (Sec. 1-1.A). Exempts a producer from the requirements and prohibitions of this law in any calendar year in which (Sec. 1-2): The producer realized less than $2 million in total gross revenue during the prior calendar year; The producer sold, offered for sale or distributed for sale in or into the State during the prior calendar year products contained, protected, delivered, presented or distributed in or using less than one ton of packaging material in total; or The producer realized more than 50 percent of its total gross revenue in the prior calendar year from the sale of goods it acquired through insurance salvages, closeouts, bankruptcies and liquidations. Prohibits a producer or retailer from doing the following (Sec. 4.A): A producer may not sell, offer for sale or distribute for sale in or into the State a product contained, protected, delivered, presented or distributed in or using packaging material for which the producer has not complied with all applicable requirements of this section; and A retailer may not sell, offer for sale or distribute for sale in or into the State a product contained, protected, delivered, presented or distributed in or using packaging material if, based on the information made available by the department, the product is contained, protected, delivered, presented or distributed in or using packaging material for which its producer has not complied with all applicable requirements of this law. Specifies if the department determines that an approved alternative collection program is not operating in a manner consistent with the proposal approved under this law or the provisions of this subsection, the department shall provide written notice to the producer or producers operating the alternative collection program regarding the nature of the deficiency, the actions necessary to correct the deficiency and the time by which such actions must be implemented (Sec. 8.E). Establishes to be eligible for reimbursement of costs under subsection 10 as a participating municipality, a municipality must, at a minimum (Sec. 9): Provide for the collection and recycling of packaging material that is generated in the municipality and is readily recyclable; and Annually report to the stewardship organization, on a form provided and approved by the department, all information necessary for the stewardship organization to determine the municipality's incurred costs associated with its collection, processing, transportation and recycling or disposal of recyclable material and of municipal solid waste. Requires the stewardship organization to annually disburse to participating municipalities from the packaging stewardship fund reimbursement payments for the median per-ton cost of managing packaging material that is readily recyclable, reimbursement payments for the median per-ton cost of managing packaging material that is not readily recyclable and per capita payments associated with packaging material disposed of by participating municipalities (Sec. 10). Establishes a producer or stewardship organization, including a producer's or stewardship organization's officers, members, employees and agents that organize a packaging stewardship program or an alternative collection program under this law, is immune from liability for the producer's or stewardship organization's conduct under state laws relating to antitrust, restraint of trade, unfair trade practices and other regulation of trade or commerce (Sec. 14)."}