{"votes": {"No": [["Bart  Hester", "136734", "Republican", "AR", "1"], ["James Paul 'Jim'  Hendren", "24611", "Independent", "AR", "2"], ["Cecile  H.  Bledsoe", "16239", "Republican", "AR", "3"], ["Gregory  Awen 'Greg'  Leding", "119190", "Democratic", "AR", "4"], ["Jimmy  Hickey\n                  Jr.", "136738", "Republican", "AR", "11"], ["Bill  Sample", "27839", "Republican", "AR", "14"], ["James  Marvin  Sturch", "150287", "Republican", "AR", "19"], ["Keith  M.  Ingram", "103780", "Democratic", "AR", "24"], ["Stephanie  A.  Flowers", "27988", "Democratic", "AR", "25"], ["Linda  Pondexter  Chesterfield", "27981", "Democratic", "AR", "30"], ["Joyce  Ann  Elliott", "27771", "Democratic", "AR", "31"], ["Clarke  Tucker", "150292", "Democratic", "AR", "32"]], "Yes": [["Bob  Ballinger", "136731", "Republican", "AR", "5"], ["Gary  Don  Stubblefield", "119162", "Republican", "AR", "6"], ["Mathew  W. 'Mat'  Pitsch", "136708", "Republican", "AR", "8"], ["Terry  Rice", "103785", "Republican", "AR", "9"], ["Larry  R.  Teague", "10953", "Democratic", "AR", "10"], ["Charles  Beckham", "187874", "Republican", "AR", "12"], ["Alan  Clark", "136739", "Republican", "AR", "13"], ["Mark  Johnson", "178604", "Republican", "AR", "15"], ["Breanne  Davis", "177599", "Republican", "AR", "16"], ["Scott  Flippo", "150244", "Republican", "AR", "17"], ["Missy  Thomas  Irvin", "119194", "Republican", "AR", "18"], ["Lowell  Blake  Johnson", "136741", "Republican", "AR", "20"], ["Dan  Sullivan", "145172", "Republican", "AR", "21"], ["David 'Dave'  Wallace", "150294", "Republican", "AR", "22"], ["Ronald  Caldwell", "143534", "Republican", "AR", "23"], ["Lewis  Ben  Gilmore", "187880", "Republican", "AR", "26"], ["Trent  C.  Garner", "166181", "Republican", "AR", "27"], ["Jonathan  Dismang", "103777", "Republican", "AR", "28"], ["Ricky  Hill", "177602", "Republican", "AR", "29"], ["Kim  Davin  Hammer", "60226", "Republican", "AR", "33"], ["Stanley  Jason  Rapert", "119197", "Republican", "AR", "35"]], "Did Not Vote": [["Lance  Eads", "141580", "Republican", "AR", "7"], ["Elizabeth  Jane  English", "103760", "Republican", "AR", "34"]], "NA": []}, "synopsis": "Vote to override a veto of a bill that classifies federal gun restrictions instituted after January 1st 2021 as invalid in the state.", "link": "https://justfacts.votesmart.org/bill/30671/79155/classifies-federal-gun-restrictions-as-invalid", "name": "SB 298 - Classifies Federal Gun Restrictions as Invalid - Arkansas Key Vote", "pg": "Highlights: Alleges the courts and law enforcement agencies of this state must protect the rights of law-abiding citizens to keep and bear arms within the borders of this state from the infringements described (Sec. 1-6-103.c). Prohibits the following persons from enforcing or assisting federal agencies or officers in the enforcement of any federal statute, executive order, or federal agency directive that conflicts with Arkansas Constitution, or any Arkansas law (Sec. 1-6-103.d): A public officer or employee of this state; A law enforcement officer; or A representative, agent, or employee of a municipality, a county, or the state, acting under the color of law, with all the rights, grants, and assignments of a law enforcement officer in the state. Establishes a person who knowingly assists or provides support or information to federal agents or agencies in the enforcement of federal law, an executive order, or a federal agency directive that conflicts with Arkansas Constitution, Article 2, § 5, or other Arkansas law is upon conviction guilty of an unclassified misdemeanor (Sec. 1-6-103.e-1). Establishes a supervisory officer or elected official who knowingly directs any law enforcement officer to assist a federal law enforcement agency is violating the rights of a person as described under subsection (d) of this section is upon conviction guilty of an unclassified misdemeanor (Sec. 1-6-103.f-1). Establishes a person described under subsection (d) of this section who knowingly attempts to enforce any of the infringements on the right to keep and bear arms described under subsection (b) of this section forfeits all immunity otherwise provided to him or her under the laws of this state (Sec. 1-6-103.g). Specifies penalties for violating this law range between $500 to $1,000 depending on if the penalty violated the rights of Arkansas citizens or whether a supervisory officer is involved (Sec. 1-6-104). Establishes all federal acts, laws, orders, rules, and regulations, whether past, present, or future, that infringe on the following enumerated rights found in the Arkansas Constitution are invalid in this state, shall not be recognized by this state, are specifically rejected by this state, and shall be considered null and void and of no effect in this state (Sec. 1-6-104.a): The right to peacefully assemble; The right to enjoy freedom of speech and the press; The right to remain free from self-incrimination and have a right to due process; The right to be free from excessive bail, cruel and unusual punishment, and unreasonable detention; The right to be free from unreasonable searches and seizures; The right to be free from ex post facto laws; The right not to be taken, imprisoned, disseized of his or her estate, freehold, liberties or privileges, outlawed, or in any manner destroyed, or deprived of his or her life, liberty or property, except by the judgment of his or her peers; and The right to worship."}