{"votes": {"No": [["Scott  Sifton", "39723", "Democratic", "MO", "1"], ["Joseph 'Joe'  Keaveny", "121419", "Democratic", "MO", "4"], ["Jason  R.  Holsman", "66124", "Democratic", "MO", "7"], ["Jolie  L.  Justus", "65438", "Democratic", "MO", "10"], ["Regina  M. 'Gina'  Walsh", "39101", "Democratic", "MO", "13"], ["Eric  Schmitt", "104474", "Republican", "MO", "15"], ["Wayne  Wallingford", "104651", "Republican", "MO", "27"]], "Yes": [["Gary  Romine", "39164", "Republican", "MO", "3"], ["Jamilah  Nasheed", "65451", "Democratic", "MO", "5"], ["Mike  Kehoe", "123458", "Republican", "MO", "6"], ["Will  Kraus", "39267", "Republican", "MO", "8"], ["Shalonn 'KiKi'  Curls", "66122", "Democratic", "MO", "9"], ["Paul  V.  LeVota", "11555", "Democratic", "MO", "11"], ["Brad  Lager", "39903", "Republican", "MO", "12"], ["Dan  W.  Brown", "104645", "Republican", "MO", "16"], ["Ryan  Silvey", "39391", "Republican", "MO", "17"], ["Brian  Munzlinger", "39333", "Republican", "MO", "18"], ["Kurt  Schaefer", "104477", "Republican", "MO", "19"], ["Jay  Wasson", "39627", "Republican", "MO", "20"], ["David  Pearce", "39265", "Republican", "MO", "21"], ["Thomas  D. 'Tom'  Dempsey", "39096", "Republican", "MO", "23"], ["John  T.  Lamping", "123501", "Republican", "MO", "24"], ["Doug  Libla", "139128", "Republican", "MO", "25"], ["Brian  D.  Nieves", "39098", "Republican", "MO", "26"], ["Michael  L. 'Mike'  Parson", "39119", "Republican", "MO", "28"], ["David  Sater", "39236", "Republican", "MO", "29"], ["Bob  Dixon", "39880", "Republican", "MO", "30"], ["Edgar  G. H. 'Ed'  Emery", "39735", "Republican", "MO", "31"], ["Ronald  F. 'Ron'  Richard", "20443", "Republican", "MO", "32"], ["Mike  Cunningham", "39190", "Republican", "MO", "33"], ["Robert 'Rob'  Schaaf", "39541", "Republican", "MO", "34"]], "Did Not Vote": [["Maria  N.  Chappelle-Nadal", "39328", "Democratic", "MO", "14"]], "NA": []}, "synopsis": "Vote to override a veto of a bill that expands certain responsibilities of the Department of Agriculture.", "link": "https://justfacts.votesmart.org/bill/18670/50132/expands-and-establishes-certain-agricultural-programs", "name": "SB 506 - Expands and Establishes Certain Agricultural Programs - Missouri Key Vote", "pg": "Highlights: Expands the definition of “livestock” to include “captive cervids” (Sec. A). Prohibits certain foreign businesses from acquiring agricultural land in this state if the total foreign agricultural acreage exceeds 1 percent of the agricultural acreage in Missouri (Sec. A). Establishes a “Dairy Producer Margin Insurance Premium Assistance Program” for the purposes of assisting dairy producers who participate in the “Federal Margin Protection Program For Dairy Producers” under the federal Agriculture Act of 2014 (Sec. A). Requires participating dairy producers in the “Dairy Producer Margin Insurance Assistance Program” to have a portion of their premium insurance payment reimbursed under the following conditions (Sec. A): The participating dairy producers have paid their annual federal premium payment in accordance with the federal Agricultural Act of 2014; and The participating dairy producers have provided proof of payment to the Missouri Agricultural and Small Business Development Authority. Establishes the “Missouri Dairy Scholars Program” to provide up to 80 annual scholarships in the amount of $5,000 to “eligible students” (Sec. A). Defines “eligible student” as an individual who meets certain requirements including, but not limited to, the following requirements (Sec. A): The student is currently pursuing or has attained an agriculture-related degree at a 2-year or 4-year college or university in Missouri; The student signs an agreement to work in the Missouri agricultural industry for at least 2 years for each year the student received the scholarship; and The student works on a dairy farm or has a dairy-related internship for at least 3 months of each year the student receives the scholarship. Establishes the “Missouri Dairy Industry Revitalization Fund” which provides funding for certain programs including, but not limited to, the following programs (Sec. A): The “Dairy Producer Margin Insurance Premium Assistance Program”; and The “Missouri Dairy Scholars Program”. Requires the University of Missouri Commercial Agriculture Program to conduct an annual study of the dairy industry and develop a dairy-specific plan for how to grow the dairy industry in Missouri (Sec. A). Requires liability to be waived for certain individuals including, but not limited to, the following individuals in the case of an injury or death resulting from the inherent risks of equine or livestock activities (Sec. A): A livestock activity sponsor; A livestock owner; A livestock facility; A livestock auction market; or Any employee thereof. Requires the total gross weight of any vehicle or combination of vehicles carrying livestock to be no greater than 85,500 lbs. on certain Missouri highways (Sec. A). Prohibits certified commercial applicators of pesticides from being required to furnish evidence of financial responsibility for the purposes of license renewal (Sec. A). Prohibits states fees from being collected on beef if a national referendum among beef producers passes and a federal assessment on beef producers is adopted (Sec. A). Establishes the “Veterinary Student Loan Payment Fund” to be used solely for the administration of the Large Animal Veterinary Student Loan Program, a student loan forgiveness program for approved veterinary students who practice in areas of defined need (Sec. A)."}