{"votes": {"No": [["Kurt  Fevella", "109624", "Republican", "HI", "19"], ["Gerald  M. 'Mike'  Gabbard", "67633", "Democratic", "HI", "20"]], "Yes": [["Kaiali'i 'Kai'  Kahele", "167669", "Democratic", "HI", "1"], ["Russell  E.  Ruderman", "140504", "Democratic", "HI", "2"], ["Dru  Mamo  Kanuha", "157781", "Democratic", "HI", "3"], ["Lorraine  Rodero  Inouye", "17855", "Democratic", "HI", "4"], ["Gilbert  SC 'Gil'  Keith-Agaran", "110947", "Democratic", "HI", "5"], ["Rosalyn  H. 'Roz'  Baker", "3401", "Democratic", "HI", "6"], ["Jamie  Kalani  English", "54061", "Democratic", "HI", "7"], ["Ronald  D.  Kouchi", "85011", "Democratic", "HI", "8"], ["Stanley  Chang", "129305", "Democratic", "HI", "9"], ["Les  S.  Ihara\n                  Jr.", "3392", "Democratic", "HI", "10"], ["Brian  T.  Taniguchi", "3416", "Democratic", "HI", "11"], ["Sharon  Y.  Moriwaki", "183622", "Democratic", "HI", "12"], ["Karl  A.  Rhoads", "68516", "Democratic", "HI", "13"], ["Donna  Mercado  Kim", "54119", "Democratic", "HI", "14"], ["Glenn  S.  Wakai", "32272", "Democratic", "HI", "15"], ["Clarence  K.  Nishihara", "32180", "Democratic", "HI", "17"], ["Michelle  Kidani", "109575", "Democratic", "HI", "18"], ["Maile  S. L.  Shimabukuro", "32249", "Democratic", "HI", "21"], ["Donovan  M.  Dela Cruz", "72213", "Democratic", "HI", "22"], ["Gil  Riviere", "109627", "Democratic", "HI", "23"], ["Jarrett  K.  Keohokalole", "153435", "Democratic", "HI", "24"], ["Laura  H.  Thielen", "101360", "Democratic", "HI", "25"]], "Did Not Vote": [["Breene  Harimoto", "129307", "Democratic", "HI", "16"]], "NA": []}, "synopsis": "A vote to pass a bill that establishes a extreme risk protection orders.", "link": "https://justfacts.votesmart.org/bill/26116/66411/establishes-extreme-risk-protection-orders", "name": "SB 1466 - Establishes Extreme Risk Protection Orders - Hawaii Key Vote", "pg": "Highlights: Prohibits individuals who have been restrained due to contacting, threatening, or physically abusing another individual, from possessing, controlling, or transferring the ownership of a firearm or ammunition as long as the protective order or restraining order is in effect, unless good cause is shown (Sec. 3). Requires that the protective order shall specifically include a statement that the possession, control, or transfer of firearm ownership by the individual named in the order, is prohibited (Sec. 3). Requires the individual to relinquish possession and control of any firearm or ammunition to the police department for the duration of the proteccion order (Sec. 3). Authorizes police officers to take custody of any and all firearms and ammunition discovered during a consensual search and voluntarily surrendered at the time the protective order or restraining order is issued (Sec. 3). Specifies that if the individual knows the location of a registered firearm not in sight and refuses to surrender or disclose the location of the firearm, the individual shall be guilty of a misdemeanor (Sec. 3). Specifies that the police officer shall then apply for a search warrant to seize the registered firearm and ammunition (Sec. 3). Specifies that a “good clause consideration” may be considered if the individual is required to carry a firearm for their employment. This consideration may include the protection and safety of the person to whom a restraining order is granted (Sec. 3). Requires individuals who have been disqualified from ownership, possession, or control of firearms to surrender or dispose of firearms and ammunition within 48 hours from the date of disqualification (Sec. 4). Defines “disposure” as selling firearms to a licensed firearm dealer, transferring ownership to individuals who meet the necessary requirements, or surrendering firearms to the local chief of police (Sec. 4)."}