{"status": "OK", "bill": {"bill_id": 196588, "change_hash": "7f6c09ec850bb8b3cde9f5cd6f7edc65", "session_id": 77, "session": {"session_id": 77, "state_id": 52, "year_start": 2009, "year_end": 2010, "prefile": 0, "sine_die": 1, "prior": 1, "special": 0, "session_tag": "Regular Session", "session_title": "2009-2010 Regular Session", "session_name": "111th Congress"}, "url": "https://legiscan.com/US/bill/HB2221/2009", "state_link": "https://www.congress.gov/bill/111th-congress/house-bill/2221/all-info", "completed": 0, "status": 2, "status_date": "2009-12-09", "progress": [{"date": "2009-04-30", "event": 1}, {"date": "2009-04-30", "event": 9}, {"date": "2009-05-01", "event": 9}, {"date": "2009-09-30", "event": 10}, {"date": "2009-12-09", "event": 2}], "state": "US", "state_id": 52, "bill_number": "HB2221", "bill_type": "B", "bill_type_id": "1", "body": "H", "body_id": 114, "current_body": "S", "current_body_id": 115, "title": "Data Accountability and Trust Act", "description": "Data Accountability and Trust Act - (Sec. 2) Requires the Federal Trade Commission (FTC) to promulgate regulations requiring each person engaged in interstate commerce owning or possessing electronic data containing personal information, or contracting with a third party to maintain such data, to establish security policies and procedures. Requires such policies and procedures to provide for: (1) a security policy with respect to the use, sale, dissemination, and maintenance of data; (2) an officer responsible for information security oversight; (3) vulnerability testing of security programs; and (4) a process for disposing of obsolete electronic and non-electronic data containing personal information. Deems an information broker to be in compliance with the appropriate provisions of this Act if such broker is in compliance with: (1) any other federal information security statutes which provide similar or greater protections than those required under this Act; or (2) relevant provisions of the Fair Credit Reporting Act (FCRA).  Requires information brokers to submit their security policies to the FTC in conjunction with a security breach notification or on FTC request. Authorizes the FTC to conduct audits of the information security practices of such information broker, or require independent audits of their practices.  Requires information brokers to: (1) establish procedures to verify the accuracy of collected information that specifically identifies individuals; (2) provide annually, and without cost, to individuals whose personal information it maintains a means to review it; (3) place a notice on the Internet instructing individuals how to request access to such information; (4) correct inaccurate information upon request; and (5) in the case of information brokers that do use data for marketing purposes, allow individuals to decide if their information can be used. Sets forth limitations to such access rights and website notice requirements.  Directs the FTC to require information brokers to establish measures which facilitate the auditing or retracing of access to, or transmissions of, electronic data containing personal information.  Prohibits information brokers from obtaining or disclosing, or soliciting to obtain, personal information by false pretenses (pretexting). Exempts from the provisions of this section a service provider serving only as the conduit for the transmission, routing, or transient storage of information. (Sec. 3) Requires any person engaged in interstate commerce owning or possessing data in electronic form to notify, within 60 days following the discovery of a security breach: (1) the FTC; and (2) each individual whose personal information was acquired or accessed. Requires a third party agent maintaining or processing personal information in electronic form to notify the person owning or possessing the data in the event of a security breach. Requires a service provider transmitting, routing, or providing transient routing of personal information owned or possessed by another person to notify the person who initiated the connection or transmission in the event of a security breach. Requires a person required to provide notification to more than 5,000 individuals to notify the major credit reporting agencies of the timing and distribution of the notices.  Sets forth notification provisions, including: (1) notification timeliness and content; (2) notification delay for law enforcement or national security purposes when notification would threaten law enforcement or national security; and (3) substitute notification. Requires a person providing notice to individuals to provide consumer credit reports or a credit monitoring service that enables consumers to detect misuse of their personal information.  Exempts a person from such notification requirements if following a security breach a person determines that there is no reasonable risk of identity theft, fraud, or other unlawful conduct. Establishes a presumption that there is no reasonable risk of identity theft, fraud, or other unlawful conduct if the personal information in electronic form subject to a security breach is unusable, unreadable, or indecipherable to an unauthorized third party. Directs the FTC to issue rules identifying security methodologies or technologies which render data unusable, unreadable, or indecipherable for the purpose of establishing such presumption. Directs the FTC to: (1) place a security breach notice on its website if in the public interest; and (2) study the practicality and cost effectiveness of providing notice in languages in addition to English. (Sec. 4) Limits the application of sections 2 and 3 of this Act to persons, partnerships, or corporations over which the FTC has authority pursuant to its authority to prevent unfair methods of competition and unfair or deceptive acts or practices in or affecting commerce. States that a violation of section 2 or 3 shall be treated as an unfair and deceptive act or practice. Prohibits the FTC, when promulgating rules under this Act, from requiring the deployment or use of any specific products or technologies.  Provides for civil action enforcement by the attorney general of a state, or an official or agency of a state, for violations of section 2 and 3. Sets forth: (1) methods for calculating civil penalties; and (2) limitations and obligations on state actions. Establishes as an affirmative defense to certain enforcement or civil actions under this section that all of the personal information compromised in a particular security breach is lawfully acquired public record information. (Sec. 5) Defines \"information broker\" as: (1) a commercial entity (or its contractor or subcontractor) whose business is to collect, assemble, or maintain personal information concerning individuals who are not current or former customers of such entity in order to sell or provide access to such information to any nonaffiliated third party. States that such definition does not include a commercial entity to the extent that such entity processes information collected by or on behalf of and received from or on behalf of a nonaffiliated third party concerning individuals who are current or former customers or employees of such third party to enable such third party to provide benefits for its employees or transact business with its customers. Defines \"personal information\" as an individual's first name or initial and last name, address, or phone number, in combination with any one or more of the following data elements: (1) social security number; (2) driver's license number, passport number, military identification number, or other government-issued identity document; and (3) financial account number or credit or debit card number and any related security access code or password. Defines \"service provider\" as a person providing electronic data transmission, routing, intermediate and transient storage, or connections to its system, where the person providing such services does not select or modify the content of the electronic data, is not the sender or the intended recipient of the data, and such person transmits, routes, stores, or provides connections for personal information in a manner that personal information is undifferentiated from other types of data. (Sec. 6) Preempts any provision of a state law to the extent that the state law requires: (1) information security practices and treatment of data containing personal information similar to any of those required under section 2 of this Act; and (2) notification to individuals of a security breach resulting in unauthorized access to or acquisition of electronic data containing personal information.  Prohibits any person other than a person specified in section 4 of this Act from bringing a civil action under state law if such action is premised upon the defendant violating any provisions of this Act. (States that this provision shall not be construed to limit the enforcement of any state consumer protection law by an attorney general of a state.) States that this Act shall not be construed to: (1) limit FTC authority; or (2) preempt state trespass, contract, tort, or fraud law.  (Sec. 7) Makes this Act effective one year after its enactment. (Sec. 8) Authorizes FY2010-FY2015 appropriations to carry out this Act.", "pending_committee_id": 0, "committee": [], "referrals": [{"date": "2009-04-30", "committee_id": 2302, "chamber": "H", "chamber_id": 114, "name": "Energy And Commerce"}, {"date": "2009-12-09", "committee_id": 2323, "chamber": "S", "chamber_id": 115, "name": "Commerce, Science, And Transportation"}], "history": [{"date": "2009-04-30", "action": "Referred to the House Committee on Energy and Commerce.", "chamber": "", "chamber_id": 0, "importance": 1}, {"date": "2009-05-01", "action": "Referred to the Subcommittee on Commerce, Trade and Consumer Protection.", "chamber": "", "chamber_id": 0, "importance": 1}, {"date": "2009-05-05", "action": "Subcommittee Hearings Held.", "chamber": "", "chamber_id": 0, "importance": 0}, {"date": "2009-06-03", "action": "Subcommittee Consideration and Mark-up Session Held.", "chamber": "", "chamber_id": 0, "importance": 0}, {"date": "2009-06-03", "action": "Forwarded by Subcommittee to Full Committee (Amended) by Voice Vote .", "chamber": "", "chamber_id": 0, "importance": 0}, {"date": "2009-09-30", "action": "Committee Consideration and Mark-up Session Held.", "chamber": "", "chamber_id": 0, "importance": 0}, {"date": "2009-09-30", "action": "Ordered to be Reported (Amended) by Voice Vote.", "chamber": "", "chamber_id": 0, "importance": 1}, {"date": "2009-12-08", "action": "Reported (Amended) by the Committee on Energy and Commerce. H. Rept. 111-362.", "chamber": "", "chamber_id": 0, "importance": 0}, {"date": "2009-12-08", "action": "Placed on the Union Calendar, Calendar No. 214.", "chamber": "", "chamber_id": 0, "importance": 0}, {"date": "2009-12-08", "action": "Mr. Rush moved to suspend the rules and pass the bill, as amended.", "chamber": "", "chamber_id": 0, "importance": 0}, {"date": "2009-12-08", "action": "Considered under suspension of the rules. (consideration: CR H13586-13591)", "chamber": "", "chamber_id": 0, "importance": 0}, {"date": "2009-12-08", "action": "DEBATE - The House proceeded with forty minutes of debate on H.R. 2221.", "chamber": "", "chamber_id": 0, "importance": 0}, {"date": "2009-12-08", "action": "On motion to suspend the rules and pass the bill, as amended Agreed to by voice vote. (text: CR H13586-13590)", "chamber": "", "chamber_id": 0, "importance": 0}, {"date": "2009-12-08", "action": "Motion to reconsider laid on the table Agreed to without objection.", "chamber": "", "chamber_id": 0, "importance": 0}, {"date": "2009-12-08", "action": "The title of the measure was amended. Agreed to without objection.", "chamber": "", "chamber_id": 0, "importance": 0}, {"date": "2009-12-09", "action": "Received in the Senate and Read twice and referred to the Committee on Commerce, Science, and Transportation.", "chamber": "", "chamber_id": 0, "importance": 1}], "sponsors": [{"people_id": 8988, "person_hash": "2vo8uaxr", "party_id": "1", "state_id": 52, "party": "D", "role_id": 1, "role": "Rep", "name": "Janice Schakowsky", "first_name": "Janice", "middle_name": "D.", "last_name": "Schakowsky", "suffix": "", "nickname": "", "district": "HD-IL-9", "ftm_eid": 6419995, "votesmart_id": 6387, "opensecrets_id": "N00004724", "knowwho_pid": 158836, "ballotpedia": "Jan_Schakowsky", "sponsor_type_id": 0, "sponsor_order": 0, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 9119, "person_hash": "te6etur1", "party_id": "1", "state_id": 52, "party": "D", "role_id": 1, "role": "Rep", "name": "Bobby Rush", "first_name": "Bobby", "middle_name": "L.", "last_name": "Rush", "suffix": "", "nickname": "", "district": "HD-IL-1", "ftm_eid": 17657928, "votesmart_id": 26831, "opensecrets_id": "N00004887", "knowwho_pid": 158828, "ballotpedia": "Bobby_Rush", "sponsor_type_id": 0, "sponsor_order": 0, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 9171, "person_hash": "vq82u420", "party_id": "2", "state_id": 52, "party": "R", "role_id": 1, "role": "Rep", "name": "Joe Barton", "first_name": "Joe", "middle_name": "", "last_name": "Barton", "suffix": "", "nickname": "", "district": "HD-TX-6", "ftm_eid": 11211974, "votesmart_id": 27082, "opensecrets_id": "N00005656", "knowwho_pid": 159076, "ballotpedia": "Joe_Barton", "sponsor_type_id": 0, "sponsor_order": 0, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 9203, "person_hash": "vs5ywl4m", "party_id": "2", "state_id": 52, "party": "R", "role_id": 1, "role": "Rep", "name": "Cliff Stearns", "first_name": "Cliff", "middle_name": "", "last_name": "Stearns", "suffix": "", "nickname": "", "district": "HD-FL-6", "ftm_eid": 17658768, "votesmart_id": 26803, "opensecrets_id": "N00002782", "knowwho_pid": 158789, "ballotpedia": "Cliff_Stearns", "sponsor_type_id": 0, "sponsor_order": 0, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 9380, "person_hash": "ds8t6g4h", "party_id": "2", "state_id": 52, "party": "R", "role_id": 1, "role": "Rep", "name": "George Radanovich", "first_name": "George", "middle_name": "", "last_name": "Radanovich", "suffix": "", "nickname": "", "district": "HD-CA-19", "ftm_eid": 0, "votesmart_id": 21911, "opensecrets_id": "N00007507", "knowwho_pid": 158736, "ballotpedia": "George_Radanovich", "sponsor_type_id": 0, "sponsor_order": 0, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}], "sasts": [{"type_id": 8, "type": "Related", "sast_bill_number": "SB3742", "sast_bill_id": 209128}], "subjects": [{"subject_id": 13637, "subject_name": "Commerce"}, {"subject_id": 13126, "subject_name": "Administrative law and regulatory procedures"}, {"subject_id": 13413, "subject_name": "Business records"}, {"subject_id": 13144, "subject_name": "Computers and information technology"}, {"subject_id": 13147, "subject_name": "Consumer affairs"}, {"subject_id": 13514, "subject_name": "Federal Trade Commission (FTC)"}, {"subject_id": 13185, "subject_name": "Federal preemption"}, {"subject_id": 13210, "subject_name": "Health information and medical records"}, {"subject_id": 13233, "subject_name": "Internet and video services"}, {"subject_id": 13270, "subject_name": "Right of privacy"}, {"subject_id": 13289, "subject_name": "Telephone and wireless communication"}, {"subject_id": 13322, "subject_name": "Civil actions and liability"}, {"subject_id": 13524, "subject_name": "Consumer credit"}, {"subject_id": 13309, "subject_name": "Fraud offenses and financial crimes"}, {"subject_id": 13201, "subject_name": "Government investigations"}, {"subject_id": 13639, "subject_name": "Marketing and advertising"}, {"subject_id": 20565, "subject_name": "Computer security and identity theft"}], "texts": [{"doc_id": 411653, "date": "2010-11-26", "type": "Introduced", "type_id": 1, "mime": "application/pdf", "mime_id": 2, "url": "https://legiscan.com/US/text/HB2221/id/411653", "state_link": "https://www.congress.gov/111/bills/hr2221/BILLS-111hr2221ih.pdf", "text_size": 173499, "text_hash": "4a51bd35e7ca87491e92dc87a31e344d"}, {"doc_id": 411655, "date": "2010-11-27", "type": "Introduced", "type_id": 1, "mime": "application/pdf", "mime_id": 2, "url": "https://legiscan.com/US/text/HB2221/id/411655", "state_link": "https://www.congress.gov/111/bills/hr2221/BILLS-111hr2221rh.pdf", "text_size": 191086, "text_hash": "9040dcaa230b345b3e21baf75e8a5b78"}, {"doc_id": 411656, "date": "2010-11-25", "type": "Engrossed", "type_id": 4, "mime": "application/pdf", "mime_id": 2, "url": "https://legiscan.com/US/text/HB2221/id/411656", "state_link": "https://www.congress.gov/111/bills/hr2221/BILLS-111hr2221eh.pdf", "text_size": 178118, "text_hash": "a89c746f1977da9baf834ce7f80f660e"}], "votes": [], "amendments": [], "supplements": [], "calendar": []}}