{"status": "OK", "bill": {"bill_id": 773667, "change_hash": "e84fb1f783f929731c849c7ff3c77852", "session_id": 1156, "session": {"session_id": 1156, "state_id": 52, "year_start": 2015, "year_end": 2016, "prefile": 0, "sine_die": 1, "prior": 1, "special": 0, "session_tag": "Regular Session", "session_title": "2015-2016 Regular Session", "session_name": "114th Congress"}, "url": "https://legiscan.com/US/bill/HB1927/2015", "state_link": "https://www.congress.gov/bill/114th-congress/house-bill/1927/all-info", "completed": 0, "status": 2, "status_date": "2016-01-11", "progress": [{"date": "2015-04-22", "event": 1}, {"date": "2015-04-22", "event": 9}, {"date": "2015-04-23", "event": 9}, {"date": "2015-06-24", "event": 10}, {"date": "2016-01-11", "event": 2}], "state": "US", "state_id": 52, "bill_number": "HB1927", "bill_type": "B", "bill_type_id": "1", "body": "H", "body_id": 114, "current_body": "S", "current_body_id": 115, "title": "Fairness in Class Action Litigation and Furthering Asbestos Claim Transparency Act of 2016", "description": "Fairness in Class Action Litigation and Furthering Asbestos Claim Transparency Act of 2016 (Sec. 2) This bill amends the federal judicial code to prohibit federal courts from certifying any proposed class seeking monetary relief for personal injury or economic loss unless the party seeking to maintain such a class action affirmatively demonstrates that each proposed class member suffered an injury of the same type and scope as the injury of the named class representatives. A court's certification of such a class must include a determination, based on a rigorous analysis of the evidence presented, that the requirements of this Act have been satisfied. (Sec. 3) The bill also amends federal bankruptcy law concerning a trust formed under a reorganization plan following the discharge in bankruptcy of a debtor corporation in order to assume the debtor's liability with respect to claims seeking recovery for personal injury, wrongful death, or property damage allegedly caused by the presence of, or exposure to, asbestos or asbestos-containing products. Such a trust shall file with the bankruptcy court quarterly reports, available on the public docket, which describe each demand the trust has received from a claimant and the basis for any payment made to that claimant (excluding any confidential medical record or the claimant's full Social Security number). Upon written request, and subject to payment (demanded at the option of the trust) for any reasonable cost incurred by the trust to comply with such request, such a trust shall provide any information related to payment from, and demands for payment from, the trust to any party to any action in law or equity concerning liability for asbestos exposure.", "pending_committee_id": 2330, "committee": {"committee_id": 2330, "chamber": "S", "chamber_id": 115, "name": "Judiciary"}, "referrals": [{"date": "2015-04-22", "committee_id": 2309, "chamber": "H", "chamber_id": 114, "name": "Judiciary"}, {"date": "2015-04-23", "committee_id": 2851, "chamber": "H", "chamber_id": 114, "name": "Subcommittee on the Constitution And Civil Justice"}, {"date": "2016-01-11", "committee_id": 2330, "chamber": "S", "chamber_id": 115, "name": "Judiciary"}], "history": [{"date": "2015-04-22", "action": "Introduced in House", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2015-04-22", "action": "Referred to the House Committee on the Judiciary.", "chamber": "H", "chamber_id": 114, "importance": 1}, {"date": "2015-04-23", "action": "Referred to the Subcommittee on the Constitution and Civil Justice.", "chamber": "H", "chamber_id": 114, "importance": 1}, {"date": "2015-04-29", "action": "Subcommittee Hearings Held.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2015-06-24", "action": "Committee Consideration and Mark-up Session Held.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2015-06-24", "action": "Ordered to be Reported (Amended) by the Yeas and Nays: 15 - 10.", "chamber": "H", "chamber_id": 114, "importance": 1}, {"date": "2015-11-05", "action": "Reported (Amended) by the Committee on Judiciary. H. Rept. 114-328.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2015-11-05", "action": "Placed on the Union Calendar, Calendar No. 249.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-01-06", "action": "Rules Committee Resolution H. Res. 581 Reported to House. Rule provides for consideration of H.R. 1927 with 1 hour of general debate. Motion to recommit with or without instructions allowed. The resolution makes in order as original text for the purpose of amendment an amendment in the nature of a substitute consisting of the text of Rules Committee Print 114-38.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-01-07", "action": "Rule H. Res. 581 passed House.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-01-08", "action": "Considered under the provisions of rule H. Res. 581. (consideration: CR H181-200, H200-210)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-01-08", "action": "Rule provides for consideration of H.R. 1927 with 1 hour of general debate. Motion to recommit with or without instructions allowed. The resolution makes in order as original text for the purpose of amendment an amendment in the nature of a substitute consisting of the text of Rules Committee Print 114-38.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-01-08", "action": "House resolved itself into the Committee of the Whole House on the state of the Union pursuant to H. Res. 581 and Rule XVIII.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-01-08", "action": "The Speaker designated the Honorable Rodney Davis to act as Chairman of the Committee.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-01-08", "action": "GENERAL DEBATE - The Committee of the Whole proceeded with one hour of general debate on H.R. 1927.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-01-08", "action": "H.Amdt.895 Amendment (A001) offered by Mr. Cohen. (consideration: CR H190-191, H201-202; text: CR H190)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-01-08", "action": "DEBATE - Pursuant to the provisions of H.Res. 581, the Committee of the Whole proceeded with 10 minutes of debate on the Cohen amendment No. 1.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-01-08", "action": "POSTPONED PROCEEDINGS - At the conclusion of debate on the Cohen amendment, the Chair put the question on adoption of the amendment and by voice vote announced that the noes had prevailed. Mr. Cohen demanded a recorded voted and the Chair postponed further proceedings on the question of adoption of the amendment until later in the legislative day.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-01-08", "action": "H.Amdt.896 Amendment (A002) offered by Mr. Cohen. (consideration: CR H191; text: CR H191)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-01-08", "action": "DEBATE - Pursuant to the provisions of H. Res. 581, the Committee of the Whole proceeded with 10 minutes of debate on the Cohen amendment No. 2.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-01-08", "action": "H.Amdt.896 By unanimous consent, the Cohen amendment was withdrawn. (consideration: CR H191)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-01-08", "action": "H.Amdt.897 Amendment (A003) offered by Mr. Conyers. (consideration: CR H191-192, H202; text: CR H191)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-01-08", "action": "DEBATE - Pursuant to the provisions of H. Res. 581, the Committee of the Whole proceeded with 10 minutes of debate on the Conyers amendment No. 3.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-01-08", "action": "POSTPONED PROCEEDINGS - At the conclusion of debate on the Conyers amendment, the Chair put the question on adoption of the amendment and by voice vote announced that the noes had prevailed. Mr. Conyers demanded a recorded voted and the Chair postponed further proceedings on the question of adoption of the amendment until later in the legislative day.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-01-08", "action": "H.Amdt.898 Amendment (A004) offered by Mr. Deutch. (consideration: CR H192-193, H202-203; text: CR H192)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-01-08", "action": "DEBATE - Pursuant to the provisions of H. Res. 581, the Committee of the Whole proceeded with 10 minutes of debate on the Deutch amendment No. 4.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-01-08", "action": "POSTPONED PROCEEDINGS - At the conclusion of debate on the Deutch amendment, the Chair put the question on adoption of the amendment and by voice vote announced that the noes had prevailed. Mr. Deutch demanded a recorded voted and the Chair postponed further proceedings on the question of adoption of the amendment until later in the legislative day.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-01-08", "action": "H.Amdt.899 Amendment (A005) offered by Ms. Moore. (consideration: CR H193, H203-204; text: CR H193)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-01-08", "action": "DEBATE - Pursuant to the provisions of H. Res. 581, the Committee of the Whole proceeded with 10 minutes of debate on the Moore amendment No. 5.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-01-08", "action": "POSTPONED PROCEEDINGS - At the conclusion of debate on the Moore amendment, the Chair put the question on adoption of the amendment and by voice vote announced that the noes had prevailed. Ms. Moore demanded a recorded voted and the Chair postponed further proceedings on the question of adoption of the amendment until later in the legislative day.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-01-08", "action": "H.Amdt.900 Amendment (A006) offered by Ms. Moore. (consideration: CR H193-194, H204; text: CR H193)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-01-08", "action": "DEBATE - Pursuant to the provisions of H. Res. 581, the Committee of the Whole proceeded with 10 minutes of debate on the Moore amendment No. 6.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-01-08", "action": "POSTPONED PROCEEDINGS - At the conclusion of debate on the Moore amendment, the Chair put the question on adoption of the amendment and by voice vote announced that the noes had prevailed. Ms. Moore demanded a recorded voted and the Chair postponed further proceedings on the question of adoption of the amendment until later in the legislative day.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-01-08", "action": "H.Amdt.901 Amendment (A007) offered by Ms. Waters, Maxine. (consideration: CR H194-195, H204-205; text: CR H194)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-01-08", "action": "DEBATE - Pursuant to the provisions of H. Res. 581, the Committee of the Whole proceeded with 10 minutes of debate on the Waters, Maxine amendment No. 7.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-01-08", "action": "POSTPONED PROCEEDINGS - At the conclusion of debate on the Waters amendment, the Chair put the question on adoption of the amendment and by voice vote announced that the noes had prevailed. Ms. Waters demanded a recorded voted and the Chair postponed further proceedings on the question of adoption of the amendment until later in the legislative day.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-01-08", "action": "H.Amdt.902 Amendment (A008) offered by Mr. Johnson (GA). (consideration: CR H195-196, H205-206; text: CR H195)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-01-08", "action": "DEBATE - Pursuant to the provisions of H. Res. 581, the Committee of the Whole proceeded with 10 minutes of debate on the Johnson (GA) amendment No. 8.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-01-08", "action": "POSTPONED PROCEEDINGS - At the conclusion of debate on the Johnson (GA) amendment, the Chair put the question on adoption of the amendment and by voice vote announced that the noes had prevailed. Mr. Johnson (GA) demanded a recorded voted and the Chair postponed further proceedings on the question of adoption of the amendment until later in the legislative day.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-01-08", "action": "H.Amdt.903 Amendment (A009) offered by Ms. Jackson Lee. (consideration: CR H196-200, H206; text: CR H196)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-01-08", "action": "DEBATE - Pursuant to the provisions of H. Res. 581, the Committee of the Whole proceeded with 10 minutes of debate on the Jackson Lee amendment No. 9.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-01-08", "action": "POSTPONED PROCEEDINGS - At the conclusion of debate on the Jackson Lee amendment, the Chair put the question on adoption of the amendment and by voice vote announced that the noes had prevailed. Ms. Jackson Lee demanded a recorded voted and the Chair postponed further proceedings on the question of adoption of the amendment until later in the legislative day.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-01-08", "action": "RISING INFORMALLY - The Committee of the Whole rose informally to receive a message from the President.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-01-08", "action": "The Committee of the Whole resumed its sitting.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-01-08", "action": "H.Amdt.904 Amendment (A010) offered by Mr. Nadler. (consideration: CR H200-201, H206-207; text: CR H200)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-01-08", "action": "DEBATE - Pursuant to the provisions of H. Res. 581, the Committee of the Whole proceeded with 10 minutes of debate on the Nadler amendment No. 10.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-01-08", "action": "POSTPONED PROCEEDINGS - At the conclusion of debate on the Nadler amendment, the Chair put the question on adoption of the amendment and by voice vote announced that the noes had prevailed. Mr. Nadler demanded a recorded voted and the Chair postponed further proceedings on the question of adoption of the amendment until later in the legislative day.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-01-08", "action": "UNFINISHED BUSINESS - The Chair announced that the unfinished business was the question of adoption of amendments which had been debated earlier and on which further proceedings had been postponed.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-01-08", "action": "H.Amdt.895 On agreeing to the Cohen amendment (A001) Failed by recorded vote: 158 - 211 (Roll no. 23).", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-01-08", "action": "H.Amdt.897 On agreeing to the Conyers amendment (A003) Failed by recorded vote: 163 - 221 (Roll no. 24).", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-01-08", "action": "H.Amdt.898 On agreeing to the Deutch amendment (A004) Failed by recorded vote: 163 - 232 (Roll no. 25).", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-01-08", "action": "H.Amdt.899 On agreeing to the Moore amendment (A005) Failed by recorded vote: 172 - 229 (Roll no. 26).", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-01-08", "action": "H.Amdt.900 On agreeing to the Moore amendment (A006) Failed by recorded vote: 177 - 224 (Roll no. 27).", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-01-08", "action": "H.Amdt.901 On agreeing to the Waters, Maxine amendment (A007) Failed by recorded vote: 177 - 223 (Roll no. 28).", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-01-08", "action": "H.Amdt.902 On agreeing to the Johnson (GA) amendment (A008) Failed by recorded vote: 177 - 223, 1 Present (Roll no. 29).", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-01-08", "action": "H.Amdt.903 On agreeing to the Jackson Lee amendment (A009) Failed by recorded vote: 174 - 228 (Roll no. 30).", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-01-08", "action": "H.Amdt.904 On agreeing to the Nadler amendment (A010) Failed by recorded vote: 179 - 222 (Roll no. 31).", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-01-08", "action": "The House rose from the Committee of the Whole House on the state of the Union to report H.R. 1927.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-01-08", "action": "The previous question was ordered pursuant to the rule. (consideration: CR H207)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-01-08", "action": "The House adopted the amendment in the nature of a substitute as agreed to by the Committee of the Whole House on the state of the Union. (text of amendment in the nature of a substitute: CR H189-190)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-01-08", "action": "Ms. McCollum moved to recommit with instructions to the Committee on the Judiciary. (consideration: CR H207-209; text of motion: CR H207)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-01-08", "action": "DEBATE - The House proceeded with 10 minutes of debate on the McCollum motion to recommit with instructions. The instructions contained in the motion seek to require the bill to be reported back to the House with an amendment to ensure that the bill's asbestos trust provision would not apply to a claimant whose claim is filed by or on behalf of an individual exposed to asbestos as a child in a school environment.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-01-08", "action": "The previous question on the motion to recommit with instructions was ordered without objection. (consideration: CR H208)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-01-08", "action": "On motion to recommit with instructions Failed by recorded vote: 173 - 227 (Roll no. 32).", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-01-08", "action": "Motion to reconsider laid on the table Agreed to without objection.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-01-08", "action": "On passage Passed by recorded vote: 211 - 188, 1 Present (Roll no. 33).", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2016-01-11", "action": "Received in the Senate and Read twice and referred to the Committee on the Judiciary.", "chamber": "S", "chamber_id": 115, "importance": 1}], "sponsors": [{"people_id": 9362, "person_hash": "pa98l4t4", "party_id": "2", "state_id": 52, "party": "R", "role_id": 1, "role": "Rep", "name": "Bob Goodlatte", "first_name": "Bob", "middle_name": "", "last_name": "Goodlatte", "suffix": "", "nickname": "", "district": "HD-VA-6", "ftm_eid": 17658523, "votesmart_id": 27116, "opensecrets_id": "N00009154", "knowwho_pid": 159109, "ballotpedia": "Bob_Goodlatte", "sponsor_type_id": 1, "sponsor_order": 1, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 9359, "person_hash": "nb21e5ki", "party_id": "2", "state_id": 52, "party": "R", "role_id": 1, "role": "Rep", "name": "Trent Franks", "first_name": "Trent", "middle_name": "", "last_name": "Franks", "suffix": "", "nickname": "", "district": "HD-AZ-8", "ftm_eid": 1448924, "votesmart_id": 28399, "opensecrets_id": "N00006423", "knowwho_pid": 211720, "ballotpedia": "Trent_Franks", "sponsor_type_id": 2, "sponsor_order": 2, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}], "sasts": [{"type_id": 8, "type": "Related", "sast_bill_number": "HR581", "sast_bill_id": 809063}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB526", "sast_bill_id": 699825}, {"type_id": 8, "type": "Related", "sast_bill_number": "SB357", "sast_bill_id": 712561}], "subjects": [{"subject_id": 13322, "subject_name": "Civil actions and liability"}, {"subject_id": 13467, "subject_name": "Evidence and witnesses"}, {"subject_id": 13606, "subject_name": "Judicial procedure and administration"}, {"subject_id": 13404, "subject_name": "Law"}], "texts": [{"doc_id": 1220277, "date": "2015-05-01", "type": "Introduced", "type_id": 1, "mime": "application/pdf", "mime_id": 2, "url": "https://legiscan.com/US/text/HB1927/id/1220277", "state_link": "https://www.congress.gov/114/bills/hr1927/BILLS-114hr1927ih.pdf", "text_size": 247039, "text_hash": "8e72c649ed6570eab3d297757a9010c6"}, {"doc_id": 1273513, "date": "2015-11-06", "type": "Introduced", "type_id": 1, "mime": "application/pdf", "mime_id": 2, "url": "https://legiscan.com/US/text/HB1927/id/1273513", "state_link": "https://www.congress.gov/114/bills/hr1927/BILLS-114hr1927rh.pdf", "text_size": 249746, "text_hash": "3e38164757c91e67ffc470e85ba4b783"}, {"doc_id": 1290029, "date": "2016-01-09", "type": "Engrossed", "type_id": 4, "mime": "application/pdf", "mime_id": 2, "url": "https://legiscan.com/US/text/HB1927/id/1290029", "state_link": "https://www.congress.gov/114/bills/hr1927/BILLS-114hr1927eh.pdf", "text_size": 116134, "text_hash": "19df9458f447953808d53d0aed024e62"}], "votes": [{"roll_call_id": 484089, "date": "2016-01-08", "desc": "On Agreeing to the Amendment", "yea": 158, "nay": 211, "nv": 64, "absent": 0, "total": 433, "passed": 0, "chamber": "H", "chamber_id": 114, "url": "https://legiscan.com/US/rollcall/HB1927/id/484089", "state_link": "https://clerk.house.gov/Votes/201623"}, {"roll_call_id": 484090, "date": "2016-01-08", "desc": "On Agreeing to the Amendment", "yea": 163, "nay": 221, "nv": 49, "absent": 0, "total": 433, "passed": 0, "chamber": "H", "chamber_id": 114, "url": "https://legiscan.com/US/rollcall/HB1927/id/484090", "state_link": "https://clerk.house.gov/Votes/201624"}, {"roll_call_id": 484091, "date": "2016-01-08", "desc": "On Agreeing to the Amendment", "yea": 163, "nay": 232, "nv": 38, "absent": 0, "total": 433, "passed": 0, "chamber": "H", "chamber_id": 114, "url": "https://legiscan.com/US/rollcall/HB1927/id/484091", "state_link": "https://clerk.house.gov/Votes/201625"}, {"roll_call_id": 484092, "date": "2016-01-08", "desc": "On Agreeing to the Amendment", "yea": 172, "nay": 229, "nv": 32, "absent": 0, "total": 433, "passed": 0, "chamber": "H", "chamber_id": 114, "url": "https://legiscan.com/US/rollcall/HB1927/id/484092", "state_link": "https://clerk.house.gov/Votes/201626"}, {"roll_call_id": 484093, "date": "2016-01-08", "desc": "On Agreeing to the Amendment", "yea": 177, "nay": 224, "nv": 32, "absent": 0, "total": 433, "passed": 0, "chamber": "H", "chamber_id": 114, "url": "https://legiscan.com/US/rollcall/HB1927/id/484093", "state_link": "https://clerk.house.gov/Votes/201627"}, {"roll_call_id": 484094, "date": "2016-01-08", "desc": "On Agreeing to the Amendment", "yea": 177, "nay": 223, "nv": 33, "absent": 0, "total": 433, "passed": 0, "chamber": "H", "chamber_id": 114, "url": "https://legiscan.com/US/rollcall/HB1927/id/484094", "state_link": "https://clerk.house.gov/Votes/201628"}, {"roll_call_id": 484095, "date": "2016-01-08", "desc": "On Agreeing to the Amendment", "yea": 177, "nay": 223, "nv": 33, "absent": 0, "total": 433, "passed": 0, "chamber": "H", "chamber_id": 114, "url": "https://legiscan.com/US/rollcall/HB1927/id/484095", "state_link": "https://clerk.house.gov/Votes/201629"}, {"roll_call_id": 484096, "date": "2016-01-08", "desc": "On Agreeing to the Amendment", "yea": 174, "nay": 228, "nv": 31, "absent": 0, "total": 433, "passed": 0, "chamber": "H", "chamber_id": 114, "url": "https://legiscan.com/US/rollcall/HB1927/id/484096", "state_link": "https://clerk.house.gov/Votes/201630"}, {"roll_call_id": 484097, "date": "2016-01-08", "desc": "On Agreeing to the Amendment", "yea": 179, "nay": 222, "nv": 32, "absent": 0, "total": 433, "passed": 0, "chamber": "H", "chamber_id": 114, "url": "https://legiscan.com/US/rollcall/HB1927/id/484097", "state_link": "https://clerk.house.gov/Votes/201631"}, {"roll_call_id": 484098, "date": "2016-01-08", "desc": "On Motion to Recommit with Instructions", "yea": 173, "nay": 227, "nv": 33, "absent": 0, "total": 433, "passed": 0, "chamber": "H", "chamber_id": 114, "url": "https://legiscan.com/US/rollcall/HB1927/id/484098", "state_link": "https://clerk.house.gov/Votes/201632"}, {"roll_call_id": 484099, "date": "2016-01-08", "desc": "On Passage", "yea": 211, "nay": 188, "nv": 34, "absent": 0, "total": 433, "passed": 1, "chamber": "H", "chamber_id": 114, "url": "https://legiscan.com/US/rollcall/HB1927/id/484099", "state_link": "https://clerk.house.gov/Votes/201633"}, {"roll_call_id": 557273, "date": "0000-00-00", "desc": "On Agreeing to the Resolution", "yea": 234, "nay": 176, "nv": 23, "absent": 0, "total": 433, "passed": 1, "chamber": "H", "chamber_id": 114, "url": "https://legiscan.com/US/rollcall/HB1927/id/557273", "state_link": "https://clerk.house.gov/Votes/201622"}], "amendments": [], "supplements": [], "calendar": []}}