{"votes": {"No": [["Thomas  A. 'Tom'  Roberts", "180972", "Republican", "NV", "13"], ["Christopher  Thomas 'Chris'  Edwards", "135889", "Republican", "NV", "19"], ["Melissa  Hardy", "180981", "Republican", "NV", "22"], ["Glen  Kaimi  Leavitt", "180983", "Republican", "NV", "23"], ["Jill  Tolles", "169675", "Republican", "NV", "25"], ["Lisa  Krasner", "155017", "Republican", "NV", "26"], ["Richard 'Skip'  Daly", "121904", "Democratic", "NV", "31"], ["Alexis  M.  Hansen", "180994", "Republican", "NV", "32"], ["John  Clifton  Ellison", "90566", "Republican", "NV", "33"], ["Gregory  T.  Hafen\n                  II", "186122", "Republican", "NV", "36"], ["Robin  Lee  Titus", "151015", "Republican", "NV", "38"], ["James  Floyd 'Jim'  Wheeler\n                  III", "121918", "Republican", "NV", "39"], ["Alvin  P. 'Al'  Kramer", "169411", "Republican", "NV", "40"]], "Yes": [["Daniele  Monroe-Moreno", "169498", "Democratic", "NV", "1"], ["Selena  Elizabeth  Torres", "180952", "Democratic", "NV", "3"], ["Connie  S.  Munk", "180954", "Democratic", "NV", "4"], ["Brittney  Marie  Miller", "169513", "Democratic", "NV", "5"], ["William  ONeil  McCurdy\n                  II", "169523", "Democratic", "NV", "6"], ["Dina  A.  Neal", "121828", "Democratic", "NV", "7"], ["Jason  Matthew  Frierson", "121835", "Democratic", "NV", "8"], ["Steven  James 'Steve'  Yeager", "152786", "Democratic", "NV", "9"], ["Rochelle  Thuy  Nguyen", "186123", "Democratic", "NV", "10"], ["Beatrice  Angela 'Bea'  Duran", "186121", "Democratic", "NV", "11"], ["Susan 'Susie'  Martinez", "180968", "Democratic", "NV", "12"], ["Margaret  Ann 'Maggie'  Carlton", "22822", "Democratic", "NV", "14"], ["Howard  Watts\n                  III", "180976", "Democratic", "NV", "15"], ["Heidi  Ann  Swank", "137744", "Democratic", "NV", "16"], ["Odis 'Tyrone'  Thompson", "144607", "Democratic", "NV", "17"], ["Richard  Andrew  Carrillo", "121863", "Democratic", "NV", "18"], ["Ellen  Beth Barre  Spiegel", "107017", "Democratic", "NV", "20"], ["Osvaldo 'Ozzie'  Fumo\n                  Jr.", "169551", "Democratic", "NV", "21"], ["Sarah  C.  Peters", "180988", "Democratic", "NV", "24"], ["Teresa  Benitez-Thompson", "121895", "Democratic", "NV", "27"], ["Edgar  R.  Flores", "152832", "Democratic", "NV", "28"], ["Lesley  Elizabeth  Cohen", "144671", "Democratic", "NV", "29"], ["Greg  Smith", "186372", "Democratic", "NV", "30"], ["Shannon  Mary  Bilbray-Axelrod", "169567", "Democratic", "NV", "34"], ["Michelle  Suzanne  Gorelow", "121851", "Democratic", "NV", "35"], ["Shea  Backus", "181004", "Democratic", "NV", "37"], ["Sandra  Jauregui", "169582", "Democratic", "NV", "41"], ["Alexander  Assefa", "181011", "Democratic", "NV", "42"]], "Did Not Vote": [["John  Cameron  Hambrick", "106877", "Republican", "NV", "2"]], "NA": []}, "synopsis": "Vote to pass a bill that prohibits establishes various provisions to increase public safety, including banning bump stocks, lowering the legal blood alcohol level for carrying a firearm, and creating a \"red flag\" law.", "link": "https://justfacts.votesmart.org/bill/26984/69105/establishes-various-provisions-to-increase-gun-safety", "name": "AB 291 - Establishes Various Provisions to Increase Gun Safety - Nevada Key Vote", "pg": "Highlights: Defines “adverse party” as a natural person who is named in an application for an order of protection against high risk behavior (Sec. 1). Defines “high risk behavior” as when an individual (Sec. 10): Uses, attempts to use or threatens the use of physical force against another individual; Communicates a threat of imminent violence towards themselves or against another individual; Commits an act of violence directed against themselves or another individual; Engages in a pattern of threats of violence or acts of violence against themselves of another individual; Exhibits conduct with a law enforcement officer reasonably determines would present a serious and imminent threat to the safety of the public; Engages in conduct which presents a danger to themselves or another individual while in possession, custody, or control of a firearm, or purchasing or otherwise acquiring a firearm a firearm; Abuses a controlled substance or alcohol while engaging in high risk behavior as detailed in this section; or Acquires a firearm or other deadly weapon within the immediately preceding 6 months before the individual otherwise engages in high risk behavior. Specifies that individuals will be considered to engage in high risk behavior if they have been previously convicted of violating a temporary or extended protection against domestic violence or sexual assault, or a crime of violence (Sec. 10). Authorizes law enforcement officers and family or household members to file a verified application for an ex parte or extended order if they believe that an individual poses a risk of causing personal injury to themselves or another individual by possessing or having under their custody or control or by purchasing or otherwise acquiring any firearm (Sec. 11). Specifies that the court might need the applicant or the adverse party to appear before the court before determining whether to issue an ex parte order (Sec. 12). Specifies that the hearing should be held on the day the ex parte order is filed or the judicial day immediately after the application is filed, although the hearing can take place any day within 7 calendar days after the application date (Sec. 12). Authorizes the court to hold a hearing on an ex parte order by telephone if the application is filed by a law enforcement officer (Sec. 12). Requires a law enforcement agency to return any surrender or seized firearm to the adverse party if the ex parte or extended order is dissolved or no longer in effect as soon as practicable but no more than 14 days after the order is dissolved (Sec. 15). Requires a clerk of the court or other individual designated by the court to help any individual in completing and filing the application, affidavit, and any other paper or pleading needed to begin or respond to an application for an ex parte or extended order (Sec. 16). Specifies that an ex parte order expires within a time frame not to exceed 7 days and that an extended order expires within a time frame not to exceed 1 year (Sec. 19). Classifies the intentional violation of an ex parte or extended order as a misdemeanor, unless a more severe penalty is prescribed by law for the action involved in the violation (Sec. 22). Prohibits an individual from importing, selling, manufacturing, transferring, receiving, or possessing (Sec. 25): Any manual, power driven or electronic device designed to work without the operator of a semiautomatic firearm making a separate movement for each individual function of the trigger, and to materially increase the rate of fire of the semiautomatic firearm or approximate the action or rate of fire of a machine gun; Any part or combination of parts designed to work without the operator of a semiautomatic firearm making a separate movement for each individual function of the trigger, and to materially increase the rate of fire of the semiautomatic firearm or approximate the action or rate of fire of a machine gun; or Any semi automatic firearm modified to work without the operator of a semiautomatic firearm making a separate movement for each individual function of the trigger, and to materially increase the rate of fire of the semiautomatic firearm or approximate the action or rate of fire of a machine gun. Classifies a violation of the aforementioned highlight as a category D felony, with exceptions made for employees of federal, state, or local law enforcement and members of the Armed Forces carrying out official duties (Sec. 25). Defines “machine gun” as any weapon which shoots, is designed to shoot or can be readily restored to shoot more than one shot, without manual reloading, by a single function of the trigger (Sec. 26). Defines “semiautomatic firearm” as any firearm that (Sec. 26): Uses a portion of the energy of a firing cartridge to extract the fired cartridge case and chamber the next shell or round; Requires a separate function of the trigger to fire each cartridge; and Is not a machine gun. Amends the legal alcohol concentration limit in an individual’s blood or breath when physically possessing a firearm to 0.08 (Sec. 27). Classifies anyone who negligently stores or leaves a firearm in reach of a child under 14 years as having committed a misdemeanor, unless a greater penalty is provided by law (Sec. 28). Establishes that sections 1 through 24, and 29 and 30 of this act become effective January 1, 2020 (Sec. 32). Establishes that this section and sections 25 through 28, and 31 of this act become effective upon passage (Sec. 32)."}