{"votes": {"No": [["Heidi  Wathne  Kasama", "191090", "Republican", "NV", "2"], ["Richard  McArthur", "44008", "Republican", "NV", "4"], ["Thomas  A. 'Tom'  Roberts", "180972", "Republican", "NV", "13"], ["Ann  Marie 'Annie'  Black", "121815", "Republican", "NV", "19"], ["Melissa  Hardy", "180981", "Republican", "NV", "22"], ["Glen  Kaimi  Leavitt", "180983", "Republican", "NV", "23"], ["Jill  Tolles", "169675", "Republican", "NV", "25"], ["Lisa  Krasner", "155017", "Republican", "NV", "26"], ["Jill  Dickman", "152682", "Republican", "NV", "31"], ["Alexis  M.  Hansen", "180994", "Republican", "NV", "32"], ["John  Clifton  Ellison", "90566", "Republican", "NV", "33"], ["Gregory  T.  Hafen\n                  II", "186122", "Republican", "NV", "36"], ["Andrew  Thomas 'Andy'  Matthews", "166263", "Republican", "NV", "37"], ["Robin  Lee  Titus", "151015", "Republican", "NV", "38"], ["James  Floyd 'Jim'  Wheeler\n                  III", "121918", "Republican", "NV", "39"], ["Philip 'PK'  O'Neill", "151021", "Republican", "NV", "40"]], "Yes": [["Daniele  Monroe-Moreno", "169498", "Democratic", "NV", "1"], ["Selena  Elizabeth  Torres", "180952", "Democratic", "NV", "3"], ["Brittney  Marie  Miller", "169513", "Democratic", "NV", "5"], ["Shondra  Summers-Armstrong", "191102", "Democratic", "NV", "6"], ["Cameron 'C.H.'  Miller", "191103", "Democratic", "NV", "7"], ["Jason  Matthew  Frierson", "121835", "Democratic", "NV", "8"], ["Steven  James 'Steve'  Yeager", "152786", "Democratic", "NV", "9"], ["Rochelle  Thuy  Nguyen", "186123", "Democratic", "NV", "10"], ["Beatrice  Angela 'Bea'  Duran", "186121", "Democratic", "NV", "11"], ["Susan 'Susie'  Martinez", "180968", "Democratic", "NV", "12"], ["Margaret  Ann 'Maggie'  Carlton", "22822", "Democratic", "NV", "14"], ["Howard  Watts\n                  III", "180976", "Democratic", "NV", "15"], ["Cecelia  Lorraine  Gonzalez", "191131", "Democratic", "NV", "16"], ["Clara  Inez 'Claire'  Thomas", "191136", "Democratic", "NV", "17"], ["Venicia  Considine", "107008", "Democratic", "NV", "18"], ["David  Orentlicher", "33994", "Democratic", "NV", "20"], ["Elaine  Henriques  Marzola", "191161", "Democratic", "NV", "21"], ["Sarah  C.  Peters", "180988", "Democratic", "NV", "24"], ["Teresa  Benitez-Thompson", "121895", "Democratic", "NV", "27"], ["Edgar  R.  Flores", "152832", "Democratic", "NV", "28"], ["Lesley  Elizabeth  Cohen", "144671", "Democratic", "NV", "29"], ["Natha  C.  Anderson", "191357", "Democratic", "NV", "30"], ["Shannon  Mary  Bilbray-Axelrod", "169567", "Democratic", "NV", "34"], ["Michelle  Suzanne  Gorelow", "121851", "Democratic", "NV", "35"], ["Sandra  Jauregui", "169582", "Democratic", "NV", "41"], ["Tracy  Brown-May", "195813", "Democratic", "NV", "42"]], "Did Not Vote": [], "NA": []}, "synopsis": "Vote to pass a bill that prohibits production, distribution, and sale of ghost guns.", "link": "https://justfacts.votesmart.org/bill/30740/79374/prohibits-production-and-sale-of-ghost-guns", "name": "AB 286 - Prohibits Production and Sale of Ghost Guns - Nevada Key Vote", "pg": "Highlights: Defines “unfinished frame or receiver” as a blank, a casting or a machined body that is intended to be turned into the frame or lower receiver of a firearm with additional machining and which has been formed or machined to the point at which most of the major machining operations have been completed to turn the blank, casting or machined body into a frame or lower receiver of a firearm even if the fire-control cavity area of the blank, casting or machined body is still completely solid and unmachined (Sec. 6-9). Prohibits a person from possessing, purchasing, transporting or receiving an unfinished frame or receiver unless (Sec. 3-1): The person is a firearms importer or manufacturer; or The unfinished frame or receiver is required by federal law to be imprinted with a serial number issued by a firearms importer or manufacturer and the unfinished frame or receiver has been imprinted with the serial number. Prohibits a person from manufacturing or causing to be manufactured or assembled or cause to be assembled a firearm that is not imprinted with a serial number issued by a firearms importer or manufacturer in accordance with federal law and any regulations adopted thereunder unless the firearm (Sec. 4-1): Has been rendered permanently inoperable; Is an antique firearm; or Has been determined to be a collector’s item or a curio or relic. Prohibits a person from possessing, selling, offering to sell, transfering, purchasing, transporting or receiving a firearm that is not imprinted with a serial number issued by a firearms importer or manufacturer in accordance with federal law and any regulations adopted thereunder unless (Sec. 5-1): The person is: A law enforcement agency; or A firearms importer or manufacturer; or The firearm: Has been rendered permanently inoperable; Is an antique firearm; or Has been determined to be a collector’s item or a curio or relic. Specifies this does not apply for the sale or transfer of a firearm between immediate family members, which for the purposes of this section means spouses and domestic partners and any of the following relations, whether by whole or half blood, adoption, or step-relation: parents, children, siblings, grandparents, grandchildren, aunts, uncles, nieces and nephews (Sec. 7-3). Specifies this does not apply for a temporary transfer of a firearm to a person who is not prohibited from buying or possessing firearms under state or federal law if such transfer (Sec. 7-5): Is necessary to prevent imminent death or great bodily harm; and Lasts only as long as immediately necessary to prevent such imminent death or great bodily harm. Specifies this applies for a temporary transfer of a firearm if (Sec. 7-6): The transferor has no reason to believe that the transferee is prohibited from buying or possessing firearms under state or federal law; The transferor has no reason to believe that the transferee will use or intends to use the firearm in the commission of a crime; and Such transfer occurs and the transferee’s possession of the firearm following the transfer is exclusively: At an established shooting range authorized by the governing body of the jurisdiction in which such range is located; At a lawful organized competition involving the use of a firearm; While participating in or practicing for a performance by an organized group that uses firearms as a part of the public performance; While hunting or trapping if the hunting or trapping is legal in all places where the transferee possesses the firearm and the transferee holds all licenses or permits required for such hunting or trapping; or While in the presence of the transferor."}