{"status": "OK", "bill": {"bill_id": 1151729, "change_hash": "80db33c2328b1fb875397d3da9481299", "session_id": 1631, "session": {"session_id": 1631, "state_id": 14, "year_start": 2019, "year_end": 2019, "prefile": 0, "sine_die": 1, "prior": 1, "special": 0, "session_tag": "Regular Session", "session_title": "2019 Regular Session", "session_name": "2019 Regular Session"}, "url": "https://legiscan.com/IN/bill/HB1427/2019", "state_link": "http://iga.in.gov/legislative/2019/bills/house/1427/", "completed": 1, "status": 4, "status_date": "2019-05-05", "progress": [{"date": "2019-01-15", "event": 1}, {"date": "2019-01-15", "event": 9}, {"date": "2019-02-14", "event": 10}, {"date": "2019-02-20", "event": 2}, {"date": "2019-02-27", "event": 9}, {"date": "2019-04-09", "event": 10}, {"date": "2019-04-17", "event": 3}, {"date": "2019-05-05", "event": 4}, {"date": "2019-05-05", "event": 8}, {"date": "2019-05-05", "event": 4}], "state": "IN", "state_id": 14, "bill_number": "HB1427", "bill_type": "B", "bill_type_id": "1", "body": "H", "body_id": 37, "current_body": "H", "current_body_id": 37, "title": "Local government matters. Provides that, if a political subdivision publishes or submits to the department of local government finance's (DLGF) computer gateway a notice that contains an error or omission that inaccurately reflects the tax rate, tax levy, or budget actually proposed or fixed by the political subdivision by an amount that is less than 0.1%, the notice is a valid notice and the DLGF shall correct the error or omission. Provides that the state board of accounts, instead of the budget agency, is to approve audits for regional development authorities and allows for private examiners to perform audits. Excludes political subdivisions that do not have the power to impose property taxes from the requirement to upload a digital copy of certain contracts on the Indiana transparency Internet web site. Specifies the deadlines for county auditors to submit property tax settlement and distribution information to the DLGF. Repeals the electronic digital signature act. Specifies the calculation of the acquisition cost of depreciable personal property acquired in like kind exchange for personal property tax purposes. Removes the provision in current law that requires the DLGF to be a party to any contract in which a county assessor employs professional appraisers as technical advisers for assessments. Provides that the standard contract to employ professional appraisers is void if: (1) the appraiser is not certified at the time the contract is executed; or (2) the DLGF subsequently revokes the appraiser's certification. Eliminates the permissive written demand to a county resident who is delinquent in the payment of personal property taxes during the period from May 10 to October 31. Changes the time period from at least 21 to 30 days for the county treasurer's notice of the sale of a mobile home. Makes the filing deadlines for property tax deductions applicable to mobile homes and manufactured homes that are not assessed as real property the same as the filing deadlines for property tax deductions applicable to real property. Amends the definition of \"owner\" (for purposes of the property tax statutes) to delete the provision specifying that an owner of tangible property includes the holder of a tenancy for a term of years. Requires county auditors to submit data on deductions applicable to the current tax year to the homestead property data base on or before March 15 of each year, in a manner prescribed by the DLGF. Specifies that if a penalty is imposed on a taxpayer for failing to declare on the taxpayer's tax return that the taxpayer is entitled to the exemption for business personal property, the county shall include the penalty on a property tax bill associated with the tax district in which the majority value of the taxpayer's business personal property within the county is located. Eliminates (effective retroactive to July 1, 2017) several property tax deduction and credit reapplication requirements that were added by HEA 1450-2017 concerning unmarried taxpayers who married, married taxpayers who divorced, and taxpayers who came to own their property jointly or as tenants in common with another individual. Provides that a person seeking a property tax exemption for property used for a charitable purpose may file an exemption application up to 30 days following the statutory deadline for the exemption application if the person pays a late filing fee. Makes changes to the time frame for the board of tax review to conduct a hearing and issue a determination. Requires that the budget notice that political subdivisions must publish on the DLGF's computer gateway must also include information concerning the percentage change between the current and proposed tax levies of each fund. Specifies that a political subdivision shall file the budget adopted by the political subdivision with the DLGF not later than five business days after the budget is adopted. Authorizes the DLGF to adopt rules for procedures related to local government budgeting. Specifies that the adoption, amendment, or repeal of such a rule by the DLGF may not take effect before March 1 or after July 31 of a particular year. Requires a political subdivision to adopt the needed changes to its budget, tax levy, or rate in a public meeting if the political subdivision's tax levy is increased by the DLGF to an amount that exceeds the amount originally advertised or adopted by the political subdivision. Provides for an extension of time to submit a city's budget in the case of a veto after October 1. Provides that Highland Township in Greene County may increase its maximum township property tax levy for 2020 and thereafter. Provides that Taylor Township in Greene County may increase its maximum township property tax levy and its maximum fire protection and emergency services property tax levy for 2020 and thereafter. Allows Green Township in Hancock County to increase its maximum levy for the township's general fund to offset the reduction in the maximum levy that occurred beginning in 2003 that was based on the township's actual levy (levy banked amount). Requires the DLGF to increase the North Harrison fire protection territory provider unit's maximum permissible ad valorem property tax levy for purposes of IC 36-8-19 for property taxes due and payable in 2020 if a petition requesting an increase is filed. Provides that a civil taxing unit may not request permission to impose a property tax on account of revenue shortfalls, if the revenue shortfall preceded the most recent certified budget for the civil taxing unit by more than five years. Requires a statement in the county treasurer's notice of intention to sell mobile homes that the county treasurer will apply for a court judgment against the mobile homes for an amount that is set by the county executive and that includes collection expenses. Provides that whenever no bid is received on a mobile home, the taxpayer who is delinquent in the payment of taxes causing the tax sale maintains ownership of the mobile home and liability for the delinquent taxes. Repeals the statute providing for a county board of tax adjustment. Repeals provisions related to the county board of tax adjustment and the local budgeting process. Specifies that: (1) rules adopted by the DLGF for the appraisal of real property may not apply to any appraisal contemporaneously being conducted under a county's reassessment plan; and (2) rules adopted by the DLGF may first apply to the reassessment phase beginning in the following calendar year under a county's reassessment plan. Requires a county that enters into a contract for computer software and with a software provider to upload the contract to the Indiana transparency Internet web site. Specifies that for purposes of attributing the amount of a property tax deduction or exemption to the gross assessed value of a property: (1) a deduction or exemption that is specific to an improvement shall be applied only to the assessed value allocation pertaining to that improvement; and (2) to the extent that a deduction or exemption is not specific to an improvement, the deduction or exemption shall be applied in the order that will maximize the benefit of the deduction or exemption to the taxpayer. Provides that the county executive (instead of the DLGF) may cancel any property taxes assessed against real property owned by a county, township, city, town, or body corporate and politic under certain circumstances. Removes local income tax economic development allocations from the adjustment to Clark County's economic development revenue allocation. Extends the maximum time period from 20 to 22 years for the allocation of local income taxes for correctional and rehabilitation facilities. Limits to 20% the amount of revenue that may be used for operating expenses for correctional facilities and rehabilitation facilities in the county if the ordinance to impose the tax rate is adopted after June 30, 2019. Changes the timeline for providing local income tax distribution numbers to local units. Allows the board governing a: (1) municipal water or sewer provider; (2) municipal department of sanitation; or (3) sewage disposal plant service provider; to fix the time within which service charges become delinquent and service may be discontinued due to nonpayment of charges. (Currently these time periods are provided by statute.) Provides a formula for determination of a county's required appropriation amount for the operation of community mental health centers (other than in Marion County for calendar years 2019 through 2021) based on the increase, if any, in the certified levy for funding over the previous two years after application of the tax caps. Revises a statute concerning the investment of proceeds from the sale of the Montgomery County hospital. Provides that certain parties may elect to be represented by the office of the attorney general under a written agreement between the party and the office of the attorney general. Provides that certain statutes relating to the lease of real property by a political subdivision do not apply to a lease if the total annual cost of the lease is less than $250,000. Validates a lease entered into by a political subdivision before January 1, 2019, with an annual cost of less than $250,000 if the political subdivision's leasing agent did not comply with these statutes when the lease was entered into. Specifies that all members or employees of a volunteer fire department who also serve on the fiscal body of a local government unit must abstain from voting on the unit's budget. Authorizes a county fiscal body to establish a salary schedule that includes greater compensation for the presiding officer or secretary of the county fiscal body or county executive if certain conditions are satisfied. Increases, from $5 to $10, the amount of the county fee that a county auditor shall charge for endorsing a real estate conveyance document and provides that the fee revenue must be used for developing or maintaining plat books, in traditional or electronic format. Provides that money in the county elected officials training fund may be used to provide: (1) travel, lodging, and related expenses associated with any training paid for from the fund; and (2) training of one or more designees of a county elected official if sufficient funds are appropriated by the county fiscal body. Provides that money in the county elected officials training fund may be used for the newly elected official training course expenses. Provides that the failure of an individual to complete the required training does not prevent the individual from taking an office to which the individual was elected. Provides that an individual elected to certain county offices must take a newly elected official training course before the individual first takes office. Provides that the newly elected official training course counts toward the individual's other elected official training requirements. Requires the clerk and fiscal officer of all cities and towns to complete at least: (1) 14 hours of training courses within one year; and (2) 36 hours of training courses within three years. Provides that a training course that an individual completes after being elected or appointed as clerk or fiscal officer of a city or town and before the individual begins serving in office applies toward the training requirements. Requires all city and town clerks and fiscal officers to fulfill the training requirements for each term the clerk or fiscal officer serves in office. Provides, in the case of a city or town that reorganizes, that the individual who performs the functions of clerk or fiscal officer for the reorganizing city or town shall comply with the training requirements for the reorganized political subdivision. Provides that a redevelopment commission may issue bonds or enter into leases with a term of up to 35 years to finance a project that includes, as part of the project, the use and repurposing of two or more buildings and structures that are: (1) at least 75 years old; and (2) located at a site at which manufacturing previously occurred over a period of at least 75 years. Specifies that in the case of an allocation area for such a project, the expiration date of the allocation provision may not be more than 35 years after the date on which the allocation provision is established. Provides that a redevelopment commission or other entity that creates a tax increment financing area shall file the resolution and supporting documents that create the tax increment financing area with both the county auditor in which the tax increment financing area is located and the DLGF within 30 days after the redevelopment commission or other entity takes final action on the resolution. Provides that if a redevelopment commission or other entity that creates a tax increment financing area files the resolution and supporting documents with either the county auditor and the DLGF after the first anniversary of the effective date of the tax increment financing area, the county auditor shall compute the base assessed value of the tax increment financing area using the assessment date immediately preceding the later of the date on which the documents were filed with the county auditor or the date on which the documents were filed with the DLGF. Extends a pilot program in Lake County concerning disposal of certain real property. Removes the appointment of members to the Fort Harrison reuse authority by the Indianapolis mayor and by Marion County. Provides that a city or town may contract for fire protection services and requires that a contract for fire protection services be in writing and for a fixed term. Voids an annexation remonstrance waiver (waiver) executed before July 1, 2003. Voids a waiver executed after June 30, 2003, and before July 1, 2019, unless the waiver was recorded in the county where the property is located before January 1, 2020. Voids a waiver executed after June 30, 2019, unless the waiver was recorded in the county where the property is located within 30 business days after the date the waiver was executed. Provides that a waiver executed after June 30, 2003, that was properly recorded expires 15 years after the date the waiver was executed. Provides that waivers voided under the bill do not invalidate annexations that were effective before July 1, 2019. Urges the legislative council to assign to an appropriate interim study committee, for study during the 2019 interim of the general assembly, the topic of local income taxes, including revenue allocations and uses. Urges the study of the advisability of eliminating the mortgage property tax deduction and the advisability of increasing the homestead standard deduction. Urges the study of automatic enrollment of employees in a political subdivision's deferred compensation plan. Urges the study of allowing municipalities to make deposits of a certain amount to a vendor or service provider for certain transactions. Makes technical conforming changes.", "description": "Local government matters. Provides that, if a political subdivision publishes or submits to the department of local government finance's (DLGF) computer gateway a notice that contains an error or omission that inaccurately reflects the tax rate, tax levy, or budget actually proposed or fixed by the political subdivision by an amount that is less than 0.1%, the notice is a valid notice and the DLGF shall correct the error or omission. Provides that the state board of accounts, instead of the budget agency, is to approve audits for regional development authorities and allows for private examiners to perform audits. Excludes political subdivisions that do not have the power to impose property taxes from the requirement to upload a digital copy of certain contracts on the Indiana transparency Internet web site. Specifies the deadlines for county auditors to submit property tax settlement and distribution information to the DLGF. Repeals the electronic digital signature act. Specifies the calculation of the acquisition cost of depreciable personal property acquired in like kind exchange for personal property tax purposes. Removes the provision in current law that requires the DLGF to be a party to any contract in which a county assessor employs professional appraisers as technical advisers for assessments. Provides that the standard contract to employ professional appraisers is void if: (1) the appraiser is not certified at the time the contract is executed; or (2) the DLGF subsequently revokes the appraiser's certification. Eliminates the permissive written demand to a county resident who is delinquent in the payment of personal property taxes during the period from May 10 to October 31. Changes the time period from at least 21 to 30 days for the county treasurer's notice of the sale of a mobile home. Makes the filing deadlines for property tax deductions applicable to mobile homes and manufactured homes that are not assessed as real property the same as the filing deadlines for property tax deductions applicable to real property. Amends the definition of \"owner\" (for purposes of the property tax statutes) to delete the provision specifying that an owner of tangible property includes the holder of a tenancy for a term of years. Requires county auditors to submit data on deductions applicable to the current tax year to the homestead property data base on or before March 15 of each year, in a manner prescribed by the DLGF. Specifies that if a penalty is imposed on a taxpayer for failing to declare on the taxpayer's tax return that the taxpayer is entitled to the exemption for business personal property, the county shall include the penalty on a property tax bill associated with the tax district in which the majority value of the taxpayer's business personal property within the county is located. Eliminates (effective retroactive to July 1, 2017) several property tax deduction and credit reapplication requirements that were added by HEA 1450-2017 concerning unmarried taxpayers who married, married taxpayers who divorced, and taxpayers who came to own their property jointly or as tenants in common with another individual. Provides that a person seeking a property tax exemption for property used for a charitable purpose may file an exemption application up to 30 days following the statutory deadline for the exemption application if the person pays a late filing fee. Makes changes to the time frame for the board of tax review to conduct a hearing and issue a determination. Requires that the budget notice that political subdivisions must publish on the DLGF's computer gateway must also include information concerning the percentage change between the current and proposed tax levies of each fund. Specifies that a political subdivision shall file the budget adopted by the political subdivision with the DLGF not later than five business days after the budget is adopted. Authorizes the DLGF to adopt rules for procedures related to local government budgeting. Specifies that the adoption, amendment, or repeal of such a rule by the DLGF may not take effect before March 1 or after July 31 of a particular year. Requires a political subdivision to adopt the needed changes to its budget, tax levy, or rate in a public meeting if the political subdivision's tax levy is increased by the DLGF to an amount that exceeds the amount originally advertised or adopted by the political subdivision. Provides for an extension of time to submit a city's budget in the case of a veto after October 1. Provides that Highland Township in Greene County may increase its maximum township property tax levy for 2020 and thereafter. Provides that Taylor Township in Greene County may increase its maximum township property tax levy and its maximum fire protection and emergency services property tax levy for 2020 and thereafter. Allows Green Township in Hancock County to increase its maximum levy for the township's general fund to offset the reduction in the maximum levy that occurred beginning in 2003 that was based on the township's actual levy (levy banked amount). Requires the DLGF to increase the North Harrison fire protection territory provider unit's maximum permissible ad valorem property tax levy for purposes of IC 36-8-19 for property taxes due and payable in 2020 if a petition requesting an increase is filed. Provides that a civil taxing unit may not request permission to impose a property tax on account of revenue shortfalls, if the revenue shortfall preceded the most recent certified budget for the civil taxing unit by more than five years. Requires a statement in the county treasurer's notice of intention to sell mobile homes that the county treasurer will apply for a court judgment against the mobile homes for an amount that is set by the county executive and that includes collection expenses. Provides that whenever no bid is received on a mobile home, the taxpayer who is delinquent in the payment of taxes causing the tax sale maintains ownership of the mobile home and liability for the delinquent taxes. Repeals the statute providing for a county board of tax adjustment. Repeals provisions related to the county board of tax adjustment and the local budgeting process. Specifies that: (1) rules adopted by the DLGF for the appraisal of real property may not apply to any appraisal contemporaneously being conducted under a county's reassessment plan; and (2) rules adopted by the DLGF may first apply to the reassessment phase beginning in the following calendar year under a county's reassessment plan. Requires a county that enters into a contract for computer software and with a software provider to upload the contract to the Indiana transparency Internet web site. Specifies that for purposes of attributing the amount of a property tax deduction or exemption to the gross assessed value of a property: (1) a deduction or exemption that is specific to an improvement shall be applied only to the assessed value allocation pertaining to that improvement; and (2) to the extent that a deduction or exemption is not specific to an improvement, the deduction or exemption shall be applied in the order that will maximize the benefit of the deduction or exemption to the taxpayer. Provides that the county executive (instead of the DLGF) may cancel any property taxes assessed against real property owned by a county, township, city, town, or body corporate and politic under certain circumstances. Removes local income tax economic development allocations from the adjustment to Clark County's economic development revenue allocation. Extends the maximum time period from 20 to 22 years for the allocation of local income taxes for correctional and rehabilitation facilities. Limits to 20% the amount of revenue that may be used for operating expenses for correctional facilities and rehabilitation facilities in the county if the ordinance to impose the tax rate is adopted after June 30, 2019. Changes the timeline for providing local income tax distribution numbers to local units. Allows the board governing a: (1) municipal water or sewer provider; (2) municipal department of sanitation; or (3) sewage disposal plant service provider; to fix the time within which service charges become delinquent and service may be discontinued due to nonpayment of charges. (Currently these time periods are provided by statute.) Provides a formula for determination of a county's required appropriation amount for the operation of community mental health centers (other than in Marion County for calendar years 2019 through 2021) based on the increase, if any, in the certified levy for funding over the previous two years after application of the tax caps. Revises a statute concerning the investment of proceeds from the sale of the Montgomery County hospital. Provides that certain parties may elect to be represented by the office of the attorney general under a written agreement between the party and the office of the attorney general. Provides that certain statutes relating to the lease of real property by a political subdivision do not apply to a lease if the total annual cost of the lease is less than $250,000. Validates a lease entered into by a political subdivision before January 1, 2019, with an annual cost of less than $250,000 if the political subdivision's leasing agent did not comply with these statutes when the lease was entered into. Specifies that all members or employees of a volunteer fire department who also serve on the fiscal body of a local government unit must abstain from voting on the unit's budget. Authorizes a county fiscal body to establish a salary schedule that includes greater compensation for the presiding officer or secretary of the county fiscal body or county executive if certain conditions are satisfied. Increases, from $5 to $10, the amount of the county fee that a county auditor shall charge for endorsing a real estate conveyance document and provides that the fee revenue must be used for developing or maintaining plat books, in traditional or electronic format. Provides that money in the county elected officials training fund may be used to provide: (1) travel, lodging, and related expenses associated with any training paid for from the fund; and (2) training of one or more designees of a county elected official if sufficient funds are appropriated by the county fiscal body. Provides that money in the county elected officials training fund may be used for the newly elected official training course expenses. Provides that the failure of an individual to complete the required training does not prevent the individual from taking an office to which the individual was elected. Provides that an individual elected to certain county offices must take a newly elected official training course before the individual first takes office. Provides that the newly elected official training course counts toward the individual's other elected official training requirements. Requires the clerk and fiscal officer of all cities and towns to complete at least: (1) 14 hours of training courses within one year; and (2) 36 hours of training courses within three years. Provides that a training course that an individual completes after being elected or appointed as clerk or fiscal officer of a city or town and before the individual begins serving in office applies toward the training requirements. Requires all city and town clerks and fiscal officers to fulfill the training requirements for each term the clerk or fiscal officer serves in office. Provides, in the case of a city or town that reorganizes, that the individual who performs the functions of clerk or fiscal officer for the reorganizing city or town shall comply with the training requirements for the reorganized political subdivision. Provides that a redevelopment commission may issue bonds or enter into leases with a term of up to 35 years to finance a project that includes, as part of the project, the use and repurposing of two or more buildings and structures that are: (1) at least 75 years old; and (2) located at a site at which manufacturing previously occurred over a period of at least 75 years. Specifies that in the case of an allocation area for such a project, the expiration date of the allocation provision may not be more than 35 years after the date on which the allocation provision is established. Provides that a redevelopment commission or other entity that creates a tax increment financing area shall file the resolution and supporting documents that create the tax increment financing area with both the county auditor in which the tax increment financing area is located and the DLGF within 30 days after the redevelopment commission or other entity takes final action on the resolution. Provides that if a redevelopment commission or other entity that creates a tax increment financing area files the resolution and supporting documents with either the county auditor and the DLGF after the first anniversary of the effective date of the tax increment financing area, the county auditor shall compute the base assessed value of the tax increment financing area using the assessment date immediately preceding the later of the date on which the documents were filed with the county auditor or the date on which the documents were filed with the DLGF. Extends a pilot program in Lake County concerning disposal of certain real property. Removes the appointment of members to the Fort Harrison reuse authority by the Indianapolis mayor and by Marion County. Provides that a city or town may contract for fire protection services and requires that a contract for fire protection services be in writing and for a fixed term. Voids an annexation remonstrance waiver (waiver) executed before July 1, 2003. Voids a waiver executed after June 30, 2003, and before July 1, 2019, unless the waiver was recorded in the county where the property is located before January 1, 2020. Voids a waiver executed after June 30, 2019, unless the waiver was recorded in the county where the property is located within 30 business days after the date the waiver was executed. Provides that a waiver executed after June 30, 2003, that was properly recorded expires 15 years after the date the waiver was executed. Provides that waivers voided under the bill do not invalidate annexations that were effective before July 1, 2019. Urges the legislative council to assign to an appropriate interim study committee, for study during the 2019 interim of the general assembly, the topic of local income taxes, including revenue allocations and uses. Urges the study of the advisability of eliminating the mortgage property tax deduction and the advisability of increasing the homestead standard deduction. Urges the study of automatic enrollment of employees in a political subdivision's deferred compensation plan. Urges the study of allowing municipalities to make deposits of a certain amount to a vendor or service provider for certain transactions. Makes technical conforming changes.", "pending_committee_id": 0, "committee": [], "referrals": [{"date": "2019-01-15", "committee_id": 1307, "chamber": "H", "chamber_id": 37, "name": "Ways and Means"}, {"date": "2019-02-27", "committee_id": 1335, "chamber": "S", "chamber_id": 38, "name": "Tax and Fiscal Policy"}], "history": [{"date": "2019-01-15", "action": "Authored by Representative Leonard", "chamber": "H", "chamber_id": 37, "importance": 0}, {"date": "2019-01-15", "action": "First reading: referred to Committee on Ways and Means", "chamber": "H", "chamber_id": 37, "importance": 1}, {"date": "2019-01-28", "action": "Representatives GiaQuinta and Pryor added as coauthors", "chamber": "H", "chamber_id": 37, "importance": 0}, {"date": "2019-02-14", "action": "Committee report: amend do pass, adopted", "chamber": "H", "chamber_id": 37, "importance": 1}, {"date": "2019-02-18", "action": "Second reading: ordered engrossed", "chamber": "H", "chamber_id": 37, "importance": 0}, {"date": "2019-02-18", "action": "Amendment #1 (Torr) failed; voice vote", "chamber": "H", "chamber_id": 37, "importance": 0}, {"date": "2019-02-19", "action": "Third reading: passed; Roll Call 235: yeas 93, nays 0", "chamber": "H", "chamber_id": 37, "importance": 0}, {"date": "2019-02-19", "action": "Senate sponsor: Senator Bassler", "chamber": "H", "chamber_id": 37, "importance": 0}, {"date": "2019-02-20", "action": "Referred to the Senate", "chamber": "H", "chamber_id": 37, "importance": 1}, {"date": "2019-02-27", "action": "First reading: referred to Committee on Tax and Fiscal Policy", "chamber": "S", "chamber_id": 38, "importance": 1}, {"date": "2019-03-07", "action": "Senator Buchanan added as second sponsor", "chamber": "S", "chamber_id": 38, "importance": 0}, {"date": "2019-04-09", "action": "Committee report: amend do pass, adopted", "chamber": "S", "chamber_id": 38, "importance": 1}, {"date": "2019-04-11", "action": "Second reading: ordered engrossed", "chamber": "S", "chamber_id": 38, "importance": 0}, {"date": "2019-04-16", "action": "Third reading: passed; Roll Call 490: yeas 40, nays 8", "chamber": "S", "chamber_id": 38, "importance": 0}, {"date": "2019-04-17", "action": "Returned to the House with amendments", "chamber": "S", "chamber_id": 38, "importance": 1}, {"date": "2019-04-18", "action": "Motion to dissent filed", "chamber": "H", "chamber_id": 37, "importance": 0}, {"date": "2019-04-18", "action": "House dissented from Senate amendments", "chamber": "H", "chamber_id": 37, "importance": 0}, {"date": "2019-04-18", "action": "House conferees appointed: Leonard and Pryor", "chamber": "H", "chamber_id": 37, "importance": 0}, {"date": "2019-04-18", "action": "House advisors appointed: Schaibley, Fleming and GiaQuinta", "chamber": "H", "chamber_id": 37, "importance": 0}, {"date": "2019-04-22", "action": "Senate conferees appointed: Bassler and Taylor G", "chamber": "S", "chamber_id": 38, "importance": 0}, {"date": "2019-04-22", "action": "Senate advisors appointed: Buchanan and Ford J.D.", "chamber": "S", "chamber_id": 38, "importance": 0}, {"date": "2019-04-22", "action": "Senator Spartz added as advisor", "chamber": "S", "chamber_id": 38, "importance": 0}, {"date": "2019-04-24", "action": "Senator Taylor G removed as conferee", "chamber": "S", "chamber_id": 38, "importance": 0}, {"date": "2019-04-24", "action": "Senator Head added as conferee", "chamber": "S", "chamber_id": 38, "importance": 0}, {"date": "2019-04-24", "action": "CCR # 1 filed in the House", "chamber": "H", "chamber_id": 37, "importance": 0}, {"date": "2019-04-24", "action": "CCR # 1 filed in the Senate", "chamber": "S", "chamber_id": 38, "importance": 0}, {"date": "2019-04-24", "action": "Rules Suspended. Conference Committee Report 1: adopted by the Senate; Roll Call 622: yeas 45, nays 4", "chamber": "S", "chamber_id": 38, "importance": 0}, {"date": "2019-04-24", "action": "Rules Suspended. Conference Committee Report 1: adopted by the House; Roll Call 656: yeas 91, nays 6", "chamber": "H", "chamber_id": 37, "importance": 0}, {"date": "2019-04-29", "action": "Signed by the Speaker", "chamber": "H", "chamber_id": 37, "importance": 0}, {"date": "2019-04-29", "action": "Signed by the President Pro Tempore", "chamber": "S", "chamber_id": 38, "importance": 0}, {"date": "2019-04-30", "action": "Signed by the President of the Senate", "chamber": "S", "chamber_id": 38, "importance": 0}, {"date": "2019-05-05", "action": "Signed by the Governor", "chamber": "H", "chamber_id": 37, "importance": 1}, {"date": "2019-05-05", "action": "Public Law 257", "chamber": "H", "chamber_id": 37, "importance": 1}], "sponsors": [{"people_id": 5510, "person_hash": "flk3byg5", "party_id": "2", "state_id": 14, "party": "R", "role_id": 1, "role": "Rep", "name": "Daniel Leonard", "first_name": "Daniel", "middle_name": "J.", "last_name": "Leonard", "suffix": "", "nickname": "Dan", "district": "HD-050", "ftm_eid": 13000362, "votesmart_id": 34335, "opensecrets_id": "", "knowwho_pid": 212327, "ballotpedia": "Daniel_Leonard_(Indiana)", "sponsor_type_id": 1, "sponsor_order": 1, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 5569, "person_hash": "hq2pneab", "party_id": "1", "state_id": 14, "party": "D", "role_id": 1, "role": "Rep", "name": "Philip GiaQuinta", "first_name": "Philip", "middle_name": "", "last_name": "GiaQuinta", "suffix": "", "nickname": "", "district": "HD-080", "ftm_eid": 13000429, "votesmart_id": 58738, "opensecrets_id": "", "knowwho_pid": 258099, "ballotpedia": "Phil_GiaQuinta", "sponsor_type_id": 2, "sponsor_order": 2, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 5543, "person_hash": "1bb9qtmc", "party_id": "1", "state_id": 14, "party": "D", "role_id": 1, "role": "Rep", "name": "Cherrish Pryor", "first_name": "Cherrish", "middle_name": "S.", "last_name": "Pryor", "suffix": "", "nickname": "", "district": "HD-094", "ftm_eid": 6488685, "votesmart_id": 72993, "opensecrets_id": "", "knowwho_pid": 201620, "ballotpedia": "Cherrish_Pryor", "sponsor_type_id": 2, "sponsor_order": 3, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 16531, "person_hash": "lj553xa0", "party_id": "2", "state_id": 14, "party": "R", "role_id": 2, "role": "Sen", "name": "Eric Bassler", "first_name": "Eric", "middle_name": "S.", "last_name": "Bassler", "suffix": "", "nickname": "", "district": "SD-039", "ftm_eid": 12177943, "votesmart_id": 148215, "opensecrets_id": "", "knowwho_pid": 486666, "ballotpedia": "Eric_Bassler", "sponsor_type_id": 1, "sponsor_order": 4, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 19570, "person_hash": "pqq44mt4", "party_id": "2", "state_id": 14, "party": "R", "role_id": 2, "role": "Sen", "name": "Brian Buchanan", "first_name": "Brian", "middle_name": "", "last_name": "Buchanan", "suffix": "", "nickname": "", "district": "SD-007", "ftm_eid": 48871372, "votesmart_id": 175299, "opensecrets_id": "", "knowwho_pid": 654471, "ballotpedia": "Brian_Buchanan", "sponsor_type_id": 1, "sponsor_order": 5, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}], "sasts": [], "subjects": [], "texts": [{"doc_id": 1849633, "date": "2019-01-15", "type": "Introduced", "type_id": 1, "mime": "application/pdf", "mime_id": 2, "url": "https://legiscan.com/IN/text/HB1427/id/1849633", "state_link": "http://iga.in.gov/static-documents/3/c/0/7/3c078420/HB1427.01.INTR.pdf", "text_size": 1948637, "text_hash": "fedae955e6655b6a6e74877055a32703"}, {"doc_id": 1911869, "date": "2019-02-14", "type": "Introduced", "type_id": 1, "mime": "application/pdf", "mime_id": 2, "url": "https://legiscan.com/IN/text/HB1427/id/1911869", "state_link": "http://iga.in.gov/static-documents/b/1/2/f/b12f3a48/HB1427.01.INTR.pdf", "text_size": 1948636, "text_hash": "7af4aa26d33f384e3932ab3f459e2b0b"}, {"doc_id": 1911870, "date": "2019-02-14", "type": "Amended", "type_id": 3, "mime": "application/pdf", "mime_id": 2, "url": "https://legiscan.com/IN/text/HB1427/id/1911870", "state_link": "http://iga.in.gov/static-documents/1/0/9/e/109e4e0e/HB1427.02.COMH.pdf", "text_size": 2658144, "text_hash": "437ef937283b41d356b50f522b3a819c"}, {"doc_id": 1988221, "date": "2019-04-09", "type": "Amended", "type_id": 3, "mime": "application/pdf", "mime_id": 2, "url": "https://legiscan.com/IN/text/HB1427/id/1988221", "state_link": "http://iga.in.gov/static-documents/9/c/6/d/9c6d9e61/HB1427.02.COMH.pdf", "text_size": 2658144, "text_hash": "61b5174d1c77adc20e55583d73178e53"}, {"doc_id": 1988222, "date": "2019-04-09", "type": "Amended", "type_id": 3, "mime": "application/pdf", "mime_id": 2, "url": "https://legiscan.com/IN/text/HB1427/id/1988222", "state_link": "http://iga.in.gov/static-documents/f/f/4/7/ff47ddfc/HB1427.03.COMS.pdf", "text_size": 3210171, "text_hash": "e525ade843cdb733e68b0dc318667ef4"}, {"doc_id": 2001908, "date": "2019-04-24", "type": "Amended", "type_id": 3, "mime": "application/pdf", "mime_id": 2, "url": "https://legiscan.com/IN/text/HB1427/id/2001908", "state_link": "http://iga.in.gov/static-documents/c/8/c/f/c8cfedd3/HB1427.03.COMS.pdf", "text_size": 3210169, "text_hash": "0b4b3ae81a8804e1af2a15caae685d72"}, {"doc_id": 2001909, "date": "2019-04-24", "type": "Enrolled", "type_id": 5, "mime": "application/pdf", "mime_id": 2, "url": "https://legiscan.com/IN/text/HB1427/id/2001909", "state_link": "http://iga.in.gov/static-documents/c/5/3/e/c53e264c/HB1427.04.ENRS.pdf", "text_size": 3224228, "text_hash": "a028f633daf9bd210254f6d8572d7116"}], "votes": [{"roll_call_id": 800095, "date": "2019-02-13", "desc": "House - Committee Vote", "yea": 16, "nay": 7, "nv": 0, "absent": 1, "total": 24, "passed": 1, "chamber": "H", "chamber_id": 37, "url": "https://legiscan.com/IN/rollcall/HB1427/id/800095", "state_link": "http://iga.in.gov/static-documents/8/4/0/3/84039740/HB1427.01.INTR.00.pdf"}, {"roll_call_id": 803783, "date": "2019-02-19", "desc": "Third reading", "yea": 92, "nay": 0, "nv": 5, "absent": 3, "total": 100, "passed": 1, "chamber": "H", "chamber_id": 37, "url": "https://legiscan.com/IN/rollcall/HB1427/id/803783", "state_link": "http://iga.in.gov/static-documents/d/d/a/2/dda2b58a/HB1427.235.pdf"}, {"roll_call_id": 839257, "date": "2019-04-09", "desc": "Senate - Committee Vote", "yea": 12, "nay": 0, "nv": 0, "absent": 0, "total": 12, "passed": 1, "chamber": "S", "chamber_id": 38, "url": "https://legiscan.com/IN/rollcall/HB1427/id/839257", "state_link": "http://iga.in.gov/static-documents/d/a/c/9/dac9c9ea/HB1427.02.COMH.00.pdf"}, {"roll_call_id": 844937, "date": "2019-04-16", "desc": "Senate - Third reading", "yea": 40, "nay": 8, "nv": 1, "absent": 1, "total": 50, "passed": 1, "chamber": "S", "chamber_id": 38, "url": "https://legiscan.com/IN/rollcall/HB1427/id/844937", "state_link": "http://iga.in.gov/static-documents/c/0/2/0/c020c784/HB1427.490.pdf"}, {"roll_call_id": 851457, "date": "2019-04-24", "desc": "Senate - Rules Suspended. Conference Committee Report 1", "yea": 45, "nay": 4, "nv": 0, "absent": 1, "total": 50, "passed": 1, "chamber": "S", "chamber_id": 38, "url": "https://legiscan.com/IN/rollcall/HB1427/id/851457", "state_link": "http://iga.in.gov/static-documents/b/3/3/8/b3383815/HB1427.622.pdf"}, {"roll_call_id": 851458, "date": "2019-04-24", "desc": "House - Rules Suspended. Conference Committee Report 1", "yea": 91, "nay": 6, "nv": 1, "absent": 2, "total": 100, "passed": 1, "chamber": "H", "chamber_id": 37, "url": "https://legiscan.com/IN/rollcall/HB1427/id/851458", "state_link": "http://iga.in.gov/static-documents/d/3/1/8/d318dfa2/HB1427.656.pdf"}], "amendments": [], "supplements": [], "calendar": [{"type_id": 1, "type": "Hearing", "date": "2019-02-13", "time": "13:30", "location": "Room 404", "description": "House Ways and Means Hearing"}, {"type_id": 1, "type": "Hearing", "date": "2019-04-02", "time": "10:00", "location": "Room 431", "description": "Senate Tax and Fiscal Policy Hearing"}, {"type_id": 1, "type": "Hearing", "date": "2019-04-09", "time": "09:00", "location": "Room 431", "description": "Senate Tax and Fiscal Policy Hearing"}]}}