{"status": "OK", "bill": {"bill_id": 1269551, "change_hash": "8b5c97a9a278762414ee379467f1f42b", "session_id": 1658, "session": {"session_id": 1658, "state_id": 52, "year_start": 2019, "year_end": 2020, "prefile": 0, "sine_die": 1, "prior": 1, "special": 0, "session_tag": "Regular Session", "session_title": "2019-2020 Regular Session", "session_name": "116th Congress"}, "url": "https://legiscan.com/US/bill/HB3351/2019", "state_link": "https://www.congress.gov/bill/116th-congress/house-bill/3351/all-info", "completed": 0, "status": 2, "status_date": "2019-06-27", "progress": [{"date": "2019-06-19", "event": 1}, {"date": "2019-06-27", "event": 2}], "state": "US", "state_id": 52, "bill_number": "HB3351", "bill_type": "B", "bill_type_id": "1", "body": "H", "body_id": 114, "current_body": "S", "current_body_id": 115, "title": "Financial Services and General Government Appropriations Act, 2020", "description": "Provides FY2020 appropriations for several federal departments and agencies, including the Department of the Treasury, the Executive Office of the President, the judiciary, the District of Columbia, and several independent agencies. The independent agencies funded in the bill include the Administrative Conference of the United States, the Consumer Product Safety Commission, the Election Assistance Commission, the Federal Communications Commission, the Federal Deposit Insurance Corporation, the Federal Election Commission, the Federal Labor Relations Authority, the Federal Trade Commission, the General Services Administration, the Harry S. Truman Scholarship Foundation, the Merit Systems Protection Board, the Morris K. Udall and Stewart L. Udall Foundation, the National Archives and Records Administration, the National Credit Union Administration, the Office of Government Ethics, the Office Personnel Management, the Office of Special Counsel, the Postal Regulatory Commission, the Privacy and Civil Liberties Oversight Board, the Securities and Exchange Commission, the Selective Service System, the Small Business Administration, the U.S. Postal Service, and the U.S. Tax Court. The bill also sets forth requirements and restrictions for using funds provided by this and other appropriations Acts.", "pending_committee_id": 2319, "committee": {"committee_id": 2319, "chamber": "S", "chamber_id": 115, "name": "Appropriations"}, "referrals": [{"date": "2019-06-27", "committee_id": 2319, "chamber": "S", "chamber_id": 115, "name": "Appropriations"}], "history": [{"date": "2019-06-19", "action": "The House Committee on Appropriations reported an original measure, H. Rept. 116-122, by Mr. Quigley.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2019-06-19", "action": "Placed on the Union Calendar, Calendar No. 90.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2019-06-24", "action": "Rules Committee Resolution H. Res. 460 Reported to House. Rule provides for consideration of H.R. 2722 and H.R. 3351. The resolution provides for consideration of H.R. 2722 under a closed rule with one hour of general debate. Also, the resolution provides for consideration of H.R. 3351 under a structured rule with one hour of general debate.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2019-06-25", "action": "Rule H. Res. 460 passed House.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2019-06-25", "action": "Considered under the provisions of rule H. Res. 460. (consideration: CR H5104-5108)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2019-06-25", "action": "Rule provides for consideration of H.R. 2722 and H.R. 3351. The resolution provides for consideration of H.R. 2722 under a closed rule with one hour of general debate. Also, the resolution provides for consideration of H.R. 3351 under a structured rule with one hour of general debate.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2019-06-25", "action": "House resolved itself into the Committee of the Whole House on the state of the Union pursuant to H. Res. 460 and Rule XVIII.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2019-06-25", "action": "The Speaker designated the Honorable William R. Keating to act as Chairman of the Committee.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2019-06-25", "action": "GENERAL DEBATE - The Committee of the Whole proceeded with one hour of general debate on H.R. 3351.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2019-06-25", "action": "Mr. Quigley moved that the Committee rise.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2019-06-25", "action": "On motion that the Committee rise Agreed to by voice vote.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2019-06-25", "action": "Committee of the Whole House on the state of the Union rises leaving H.R. 3351 as unfinished business.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2019-06-25", "action": "Considered as unfinished business. (consideration: CR H5108-5138)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2019-06-25", "action": "The House resolved into Committee of the Whole House on the state of the Union for further consideration.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2019-06-25", "action": "GENERAL DEBATE - The Committee of the Whole proceeded with further debate on H.R. 3351.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2019-06-25", "action": "H.Amdt.483 Amendment (A001) offered by Mr. Pocan. (consideration: CR H5130-5131; text: CR H5130)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2019-06-25", "action": "DEBATE - Pursuant to the provisions of H.Res. 460, the Committee of the Whole proceeded with 10 minutes of debate on the Pocan amendment No. 1.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2019-06-25", "action": "H.Amdt.483 On agreeing to the Pocan amendment (A001) Agreed to by voice vote.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2019-06-25", "action": "H.Amdt.484 Amendment (A002) offered by Mr. King (IA). (consideration: CR H5131-5132, H5159-5160; text: CR H5131)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2019-06-25", "action": "DEBATE - Pursuant to the provisions of H. Res. 460, the Committee of the Whole proceeded with 10 minutes of debate on the King (IA) amendment No. 3.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2019-06-25", "action": "POSTPONED PROCEEDINGS - At the conclusion of debate on the King (IA) amendment, the Chair put the question on the amendment and by voice vote, announced that the noes had prevailed. Mr. King (IA) demanded a recorded vote and the Chair postponed further proceedings on agreeing to the amendment until a time to be announced.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2019-06-25", "action": "H.Amdt.485 Amendment (A003) offered by Ms. Norton. (consideration: CR H5132-5133, H5160-5161; text: CR H5132)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2019-06-25", "action": "DEBATE - Pursuant to the provisions of H. Res. 460, the Committee of the Whole proceeded with 10 minutes of debate on the Norton amendment No. 4.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2019-06-25", "action": "POSTPONED PROCEEDINGS - At the conclusion of debate on the Norton amendment, the Chair put the question on the amendment and by voice vote, announced that the ayes had prevailed. Mr. Graves (GA) demanded a recorded vote and the Chair postponed further proceedings on agreeing to the amendment until a time to be announced.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2019-06-25", "action": "H.Amdt.486 Amendment (A004) offered by Mr. Huizenga. (consideration: CR H5133-5134; text: CR H5133)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2019-06-25", "action": "DEBATE - Pursuant to the provisions of H. Res. 460, the Committee of the Whole proceeded with 10 minutes of debate on the Huizenga amendment No. 5.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2019-06-25", "action": "H.Amdt.486 On agreeing to the Huizenga amendment (A004) Failed by voice vote.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2019-06-25", "action": "H.Amdt.487 Amendment (A005) offered by Ms. Velazquez. (consideration: CR H5134; text: CR H5134)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2019-06-25", "action": "DEBATE - Pursuant to the provisions of H. Res. 460, the Committee of the Whole proceeded with 10 minutes of debate on the Velázquez amendment No. 6.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2019-06-25", "action": "H.Amdt.487 On agreeing to the Velazquez amendment (A005) Agreed to by voice vote.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2019-06-25", "action": "H.Amdt.488 Amendment (A006) offered by Mr. Hill (AR). (consideration: CR H5134-5135; text: CR H5134)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2019-06-25", "action": "DEBATE - Pursuant to the provisions of H. Res. 460, the Committee of the Whole proceeded with 10 minutes of debate on the Hill (AR) amendment No. 7.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2019-06-25", "action": "H.Amdt.488 On agreeing to the Hill (AR) amendment (A006) Agreed to by voice vote.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2019-06-25", "action": "H.Amdt.489 Amendment (A007) offered by Ms. Lee (CA). (consideration: CR H5135; text: CR H5135)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2019-06-25", "action": "DEBATE - Pursuant to the provisions of H. Res. 460, the Committee of the Whole proceeded with 10 minutes of debate on the Lee (CA) amendment No. 8.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2019-06-25", "action": "H.Amdt.489 On agreeing to the Lee (CA) amendment (A007) Agreed to by voice vote.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2019-06-25", "action": "H.Amdt.490 Amendment (A008) offered by Mr. Courtney. (consideration: CR H5135-5136; text: CR H5135)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2019-06-25", "action": "DEBATE - Pursuant to the provisions of H. Res. 460, the Committee of the Whole proceeded with 10 minutes of debate on the Courtney amendment No. 9.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2019-06-25", "action": "H.Amdt.490 On agreeing to the Courtney amendment (A008) Agreed to by voice vote.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2019-06-25", "action": "H.Amdt.491 Amendment (A009) offered by Mr. Pascrell. (consideration: CR H5136-5138; text: CR H5136)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2019-06-25", "action": "DEBATE - Pursuant to the provisions of H. Res. 460, the Committee of the Whole proceeded with 10 minutes of debate on the Pascrell amendment No. 10.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2019-06-25", "action": "H.Amdt.491 On agreeing to the Pascrell amendment (A009) Agreed to by voice vote.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2019-06-25", "action": "Mr. Quigley moved that the Committee rise.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2019-06-25", "action": "On motion that the Committee rise Agreed to by voice vote.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2019-06-25", "action": "Committee of the Whole House on the state of the Union rises leaving H.R. 3351 as unfinished business.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2019-06-25", "action": "Considered as unfinished business. (consideration: CR H5159-5161)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2019-06-25", "action": "The House resolved into Committee of the Whole House on the state of the Union for further consideration.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2019-06-25", "action": "H.Amdt.484 On agreeing to the King (IA) amendment (A002) Failed by recorded vote: 191 - 226 (Roll no. 411).", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2019-06-25", "action": "H.Amdt.485 On agreeing to the Norton amendment (A003) Agreed to by recorded vote: 226 - 198 (Roll no. 412).", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2019-06-25", "action": "Ms. Kaptur moved that the committee rise.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2019-06-25", "action": "On motion that the committee rise Agreed to by voice vote.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2019-06-25", "action": "Committee of the Whole House on the state of the Union rises leaving H.R. 3351 as unfinished business.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2019-06-26", "action": "Considered as unfinished business. (consideration: CR H5177-5197)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2019-06-26", "action": "The House resolved into Committee of the Whole House on the state of the Union for further consideration.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2019-06-26", "action": "H.Amdt.493 Amendments en bloc (A010) offered by Mr. Quigley. (consideration: CR H5177-5179; text: CR H5177)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2019-06-26", "action": "DEBATE - Pursuant to the provisions of H. Res. 460, the Committee of the Whole proceeded with 20 minutes of debate on the Quigley amendment en bloc No. 1.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2019-06-26", "action": "H.Amdt.493 On agreeing to the Quigley amendments (A010) Agreed to by voice vote.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2019-06-26", "action": "H.Amdt.494 Amendment (A011) offered by Mr. Grothman. (consideration: CR H5179-5180, H5189; text: CR H5179)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2019-06-26", "action": "DEBATE - Pursuant to the provisions of H. Res. 460, the Committee of the Whole proceeded with 10 minutes of debate on the Grothman amendment No. 13.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2019-06-26", "action": "POSTPONED PROCEEDINGS - At the conclusion of debate on the Grothman amendment, the Chair put the question on the amendment and by voice vote, announced that the noes had prevailed. Mr. Grothman demanded a recorded vote and the Chair postponed further proceedings on agreeing to the amendment until a time to be announced.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2019-06-26", "action": "H.Amdt.495 Amendments en bloc (A012) offered by Mr. Quigley. (consideration: CR H5180-5184, H5189-5190; text: CR H5180-5183)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2019-06-26", "action": "DEBATE - Pursuant to the provisions of H. Res. 460, the Committee of the Whole proceeded with 20 minutes of debate on the Quigley amendment en bloc No. 2.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2019-06-26", "action": "POSTPONED PROCEEDINGS - At the conclusion of debate on the Quigley amendment en bloc No. 2, the Chair put the question on the amendment and by voice vote, announced that the ayes had prevailed. Mr. Graves (GA) demanded a recorded vote and the Chair postponed further proceedings on agreeing to the amendment until a time to be announced.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2019-06-26", "action": "H.Amdt.496 Amendment (A013) offered by Mr. Connolly. (consideration: CR H5184-5185; text: CR H5184)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2019-06-26", "action": "DEBATE - Pursuant to the provisions of H. Res. 460, the Committee of the Whole proceeded with 10 minutes of debate on the Connolly amendment No. 18", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2019-06-26", "action": "H.Amdt.496 On agreeing to the Connolly amendment (A013) Agreed to by voice vote.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2019-06-26", "action": "H.Amdt.497 Amendment (A014) offered by Mr. Banks. (consideration: CR H5185-5186, H5190-5191; text: CR H5185)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2019-06-26", "action": "DEBATE - Pursuant to the provisions of H. Res. 460, the Committee of the Whole proceeded with 10 minutes of debate on the Banks amendment No. 19.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2019-06-26", "action": "POSTPONED PROCEEDINGS - At the conclusion of debate on the Banks amendment, the Chair put the question on the amendment and by voice vote, announced that the ayes had prevailed. Mr. Quigley demanded a recorded vote and the Chair postponed further proceedings on agreeing to the amendment until a time to be announced.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2019-06-26", "action": "H.Amdt.498 Amendment (A015) offered by Mr. Suozzi. (consideration: CR H5186, H5191; text: CR H5186)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2019-06-26", "action": "DEBATE - Pursuant to the provisions of H. Res. 460, the Committee of the Whole proceeded with 10 minutes of debate on the Suozzi amendment No. 26.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2019-06-26", "action": "POSTPONED PROCEEDINGS - At the conclusion of debate on the Suozzi amendment, the Chair put the question on the amendment and by voice vote, announced that the ayes had prevailed. Mr. Suozzi demanded a recorded vote and the Chair postponed further proceedings on agreeing to the amendment until a time to be announced.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2019-06-26", "action": "H.Amdt.499 Amendment (A016) offered by Mrs. Lee (NV). (consideration: CR H5186-5187, H5191-5192; text: CR H5187)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2019-06-26", "action": "DEBATE - Pursuant to the provisions of H. Res. 460, the Committee of the Whole proceeded with 10 minutes of debate on the Lee (NV) amendment No. 27.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2019-06-26", "action": "POSTPONED PROCEEDINGS - At the conclusion of debate on the Lee (NV) amendment, the Chair put the question on the amendment and by voice vote, announced that the ayes had prevailed. Mr. Quigley demanded a recorded vote and the Chair postponed further proceedings on agreeing to the amendment until a time to be announced.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2019-06-26", "action": "H.Amdt.500 Amendment (A017) offered by Ms. Dean. (consideration: CR H5187-5188, H5192-5193; text: CR H5187)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2019-06-26", "action": "DEBATE - Pursuant to the provisions of H. Res. 460, the Committee of the Whole proceeded with 10 minutes of debate on the Dean amendment No. 32.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2019-06-26", "action": "POSTPONED PROCEEDINGS - At the conclusion of debate on the Dean amendment, the Chair put the question on the amendment and by voice vote, announced that the ayes had prevailed. Ms. Dean demanded a recorded vote and the Chair postponed further proceedings on agreeing to the amendment until a time to be announced.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2019-06-26", "action": "H.Amdt.501 Amendment (A018) offered by Mr. Kim. (consideration: CR H5188, H5193; text: CR H5188)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2019-06-26", "action": "DEBATE - Pursuant to the provisions of H. Res. 460, the Committee of the Whole proceeded with 10 minutes of debate on the Kim amendment No. 35.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2019-06-26", "action": "POSTPONED PROCEEDINGS - At the conclusion of debate on the Kim amendment, the Chair put the question on the amendment and by voice vote, announced that the ayes had prevailed. Mr. Kim demanded a recorded vote and the Chair postponed further proceedings on agreeing to the amendment until a time to be announced.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2019-06-26", "action": "H.Amdt.502 Amendment (A019) offered by Mr. Malinowski. (consideration: CR H5188, H5193-5194; text: CR H5188)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2019-06-26", "action": "DEBATE - Pursuant to the provisions of H. Res. 460, the Committee of the Whole proceeded with 10 minutes of debate on the Malinowski amendment No. 40.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2019-06-26", "action": "POSTPONED PROCEEDINGS - At the conclusion of debate on the Malinowski amendment, the Chair put the question on the amendment and by voice vote, announced that the ayes had prevailed. Mr. Malinowski demanded a recorded vote and the Chair postponed further proceedings on agreeing to the amendment until a time to be announced.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2019-06-26", "action": "H.Amdt.494 On agreeing to the Grothman amendment (A011) Failed by recorded vote: 151 - 274 (Roll no. 415).", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2019-06-26", "action": "H.Amdt.495 On agreeing to the Quigley amendments (A012) Agreed to by recorded vote: 227 - 200 (Roll no. 416).", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2019-06-26", "action": "H.Amdt.497 On agreeing to the Banks amendment (A014) Failed by recorded vote: 141 - 285 (Roll no. 417).", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2019-06-26", "action": "H.Amdt.498 On agreeing to the Suozzi amendment (A015) Agreed to by recorded vote: 406 - 19 (Roll no. 418).", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2019-06-26", "action": "H.Amdt.499 On agreeing to the Lee (NV) amendment (A016) Agreed to by recorded vote: 400 - 27 (Roll no. 419).", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2019-06-26", "action": "H.Amdt.500 On agreeing to the Dean amendment (A017) Agreed to by recorded vote: 373 - 51 (Roll no. 420).", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2019-06-26", "action": "H.Amdt.501 On agreeing to the Kim amendment (A018) Agreed to by recorded vote: 408 - 17 (Roll no. 421).", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2019-06-26", "action": "H.Amdt.502 On agreeing to the Malinowski amendment (A019) Agreed to by recorded vote: 362 - 65 (Roll no. 422).", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2019-06-26", "action": "The House rose from the Committee of the Whole House on the state of the Union to report H.R. 3351.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2019-06-26", "action": "The previous question was ordered pursuant to the rule.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2019-06-26", "action": "The House adopted the amendments en gross as agreed to by the Committee of the Whole House on the state of the Union.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2019-06-26", "action": "Mr. Graves (GA) moved to recommit with instructions to the Committee on Appropriations. (text: CR H5194)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2019-06-26", "action": "DEBATE - The House proceeded with 10 minutes of debate on the Graves (GA) motion to recommit with instructions. The instructions contained in the motion seek to require the bill to be reported back to the House with an amendment to increase funding for the Office of Terrorism and Financial Intelligence account by $10 million and decrease funding for the General Services Administration account by a similar amount.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2019-06-26", "action": "The previous question on the motion to recommit with instructions was ordered without objection.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2019-06-26", "action": "On motion to recommit with instructions Agreed to by recorded vote: 226 - 195 (Roll no. 423).", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2019-06-26", "action": "H.Amdt.503 Amendment (A020) offered by Mr. Quigley. (consideration: CR H5196; text: CR H5196)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2019-06-26", "action": "H.Amdt.503 On agreeing to the Quigley amendment (A020) Agreed to by voice vote.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2019-06-26", "action": "On passage Passed by the Yeas and Nays: 224 - 196 (Roll no. 424). (text: CR 6/25/2019 H5110-5130)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2019-06-26", "action": "Motion to reconsider laid on the table Agreed to without objection.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2019-06-27", "action": "Received in the Senate and Read twice and referred to the Committee on Appropriations.", "chamber": "S", "chamber_id": 115, "importance": 1}], "sponsors": [{"people_id": 9312, "person_hash": "pf1tkip8", "party_id": "1", "state_id": 52, "party": "D", "role_id": 1, "role": "Rep", "name": "Mike Quigley", "first_name": "Mike", "middle_name": "", "last_name": "Quigley", "suffix": "", "nickname": "", "district": "HD-IL-5", "ftm_eid": 8785226, "votesmart_id": 83310, "opensecrets_id": "N00030581", "knowwho_pid": 277349, "ballotpedia": "Mike_Quigley", "sponsor_type_id": 1, "sponsor_order": 1, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}], "sasts": [{"type_id": 8, "type": "Related", "sast_bill_number": "HR460", "sast_bill_id": 1270003}, {"type_id": 8, "type": "Related", "sast_bill_number": "SB2524", "sast_bill_id": 1275125}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB1158", "sast_bill_id": 1203269}], "subjects": [{"subject_id": 13124, "subject_name": "Economics and public finance"}], "texts": [{"doc_id": 2041396, "date": "2019-06-20", "type": "Introduced", "type_id": 1, "mime": "application/pdf", "mime_id": 2, "url": "https://legiscan.com/US/text/HB3351/id/2041396", "state_link": "https://www.congress.gov/116/bills/hr3351/BILLS-116hr3351rh.pdf", "text_size": 502850, "text_hash": "bcfde9c90b05691ff85ec83c2345b9a6"}, {"doc_id": 2043620, "date": "2019-06-26", "type": "Engrossed", "type_id": 4, "mime": "application/pdf", "mime_id": 2, "url": "https://legiscan.com/US/text/HB3351/id/2043620", "state_link": "https://www.congress.gov/116/bills/hr3351/BILLS-116hr3351eh.pdf", "text_size": 506838, "text_hash": "f30b403858eab321259794e86ff2c57e"}], "votes": [{"roll_call_id": 887593, "date": "2019-06-25", "desc": "On agreeing to the King (IA) amendment (A002) H.Amdt.484 RC# 411", "yea": 191, "nay": 226, "nv": 21, "absent": 0, "total": 438, "passed": 0, "chamber": "H", "chamber_id": 114, "url": "https://legiscan.com/US/rollcall/HB3351/id/887593", "state_link": "https://clerk.house.gov/Votes/2019411"}, {"roll_call_id": 887594, "date": "2019-06-25", "desc": "On agreeing to the Norton amendment (A003) H.Amdt.485 RC# 412", "yea": 226, "nay": 198, "nv": 14, "absent": 0, "total": 438, "passed": 1, "chamber": "H", "chamber_id": 114, "url": "https://legiscan.com/US/rollcall/HB3351/id/887594", "state_link": "https://clerk.house.gov/Votes/2019412"}, {"roll_call_id": 888202, "date": "2019-06-26", "desc": "On agreeing to the Banks amendment (A014) H.Amdt.497 RC# 417", "yea": 141, "nay": 285, "nv": 12, "absent": 0, "total": 438, "passed": 0, "chamber": "H", "chamber_id": 114, "url": "https://legiscan.com/US/rollcall/HB3351/id/888202", "state_link": "https://clerk.house.gov/Votes/2019417"}, {"roll_call_id": 888203, "date": "2019-06-26", "desc": "On agreeing to the Quigley amendments (A012) H.Amdt.495 RC# 416", "yea": 227, "nay": 200, "nv": 11, "absent": 0, "total": 438, "passed": 1, "chamber": "H", "chamber_id": 114, "url": "https://legiscan.com/US/rollcall/HB3351/id/888203", "state_link": "https://clerk.house.gov/Votes/2019416"}, {"roll_call_id": 888204, "date": "2019-06-26", "desc": "On agreeing to the Grothman amendment (A011) H.Amdt.494 RC# 415", "yea": 151, "nay": 274, "nv": 13, "absent": 0, "total": 438, "passed": 0, "chamber": "H", "chamber_id": 114, "url": "https://legiscan.com/US/rollcall/HB3351/id/888204", "state_link": "https://clerk.house.gov/Votes/2019415"}, {"roll_call_id": 888205, "date": "2019-06-26", "desc": "On agreeing to the Suozzi amendment (A015) H.Amdt.498 RC# 418", "yea": 406, "nay": 19, "nv": 13, "absent": 0, "total": 438, "passed": 1, "chamber": "H", "chamber_id": 114, "url": "https://legiscan.com/US/rollcall/HB3351/id/888205", "state_link": "https://clerk.house.gov/Votes/2019418"}, {"roll_call_id": 888206, "date": "2019-06-26", "desc": "On agreeing to the Lee (NV) amendment (A016) H.Amdt.499 RC# 419", "yea": 400, "nay": 27, "nv": 11, "absent": 0, "total": 438, "passed": 1, "chamber": "H", "chamber_id": 114, "url": "https://legiscan.com/US/rollcall/HB3351/id/888206", "state_link": "https://clerk.house.gov/Votes/2019419"}, {"roll_call_id": 888207, "date": "2019-06-26", "desc": "On motion to recommit with instructions RC# 423", "yea": 226, "nay": 195, "nv": 11, "absent": 0, "total": 432, "passed": 1, "chamber": "H", "chamber_id": 114, "url": "https://legiscan.com/US/rollcall/HB3351/id/888207", "state_link": "https://clerk.house.gov/Votes/2019423"}, {"roll_call_id": 888208, "date": "2019-06-26", "desc": "On agreeing to the Malinowski amendment (A019) H.Amdt.502 RC# 422", "yea": 362, "nay": 65, "nv": 11, "absent": 0, "total": 438, "passed": 1, "chamber": "H", "chamber_id": 114, "url": "https://legiscan.com/US/rollcall/HB3351/id/888208", "state_link": "https://clerk.house.gov/Votes/2019422"}, {"roll_call_id": 888209, "date": "2019-06-26", "desc": "On agreeing to the Kim amendment (A018) H.Amdt.501 RC# 421", "yea": 408, "nay": 17, "nv": 13, "absent": 0, "total": 438, "passed": 1, "chamber": "H", "chamber_id": 114, "url": "https://legiscan.com/US/rollcall/HB3351/id/888209", "state_link": "https://clerk.house.gov/Votes/2019421"}, {"roll_call_id": 888210, "date": "2019-06-26", "desc": "On agreeing to the Dean amendment (A017) H.Amdt.500 RC# 420", "yea": 373, "nay": 51, "nv": 14, "absent": 0, "total": 438, "passed": 1, "chamber": "H", "chamber_id": 114, "url": "https://legiscan.com/US/rollcall/HB3351/id/888210", "state_link": "https://clerk.house.gov/Votes/2019420"}, {"roll_call_id": 888211, "date": "2019-06-26", "desc": "On passage RC# 424", "yea": 224, "nay": 196, "nv": 12, "absent": 0, "total": 432, "passed": 1, "chamber": "H", "chamber_id": 114, "url": "https://legiscan.com/US/rollcall/HB3351/id/888211", "state_link": "https://clerk.house.gov/Votes/2019424"}], "amendments": [], "supplements": [], "calendar": [{"type_id": 1, "type": "Hearing", "date": "2019-06-24", "time": "17:00", "location": "H-313 CAPITOL", "description": "House Committee on Rules Hearing"}, {"type_id": 1, "type": "Hearing", "date": "2019-06-25", "time": "11:00", "location": "H-313 CAPITOL", "description": "House Committee on Rules Hearing"}, {"type_id": 1, "type": "Hearing", "date": "2019-06-25", "time": "17:30", "location": "H-313 CAPITOL", "description": "House Committee on Rules Hearing"}]}}