{"status": "OK", "bill": {"bill_id": 1298726, "change_hash": "f20fe0595f066237963a7398e8d3e22f", "session_id": 1718, "session": {"session_id": 1718, "state_id": 46, "year_start": 2020, "year_end": 2020, "prefile": 0, "sine_die": 1, "prior": 1, "special": 0, "session_tag": "Regular Session", "session_title": "2020 Regular Session", "session_name": "2020 Regular Session"}, "url": "https://legiscan.com/VA/bill/HB1459/2020", "state_link": "https://lis.virginia.gov/cgi-bin/legp604.exe?201+sum+HB1459", "completed": 0, "status": 1, "status_date": "2020-01-08", "progress": [{"date": "2020-01-08", "event": 1}, {"date": "2020-01-08", "event": 9}], "state": "VA", "state_id": 46, "bill_number": "HB1459", "bill_type": "B", "bill_type_id": "1", "body": "H", "body_id": 7, "current_body": "H", "current_body_id": 7, "title": "Pharmacy benefits managers; managers to register with the Commissioner of the Bureau of Insurance.", "description": "Pharmacy benefits managers. Requires pharmacy benefits managers to register with the Commissioner of the Bureau of Insurance. The measure prohibits a carrier on its own or through its contracted pharmacy benefits manager or representative of a pharmacy benefits manager from (i) causing or knowingly permitting the use of any advertisement, promotion, solicitation, representation, proposal, or offer that is untrue, deceptive, or misleading; (ii) charge a pharmacist or pharmacy a fee related to the adjudication of a claim; (iii) engaging, with the express intent or purpose of driving out competition or financially injuring competitors, in a pattern or practice of reimbursing retail community pharmacies or pharmacists in the Commonwealth consistently less than the amount that the pharmacy benefits manager reimburses a pharmacy benefits manager affiliate for providing the same pharmacist services; (iv) collecting or requiring a pharmacy or pharmacist to collect from an insured a copayment for a prescription drug at the point of sale in an amount that exceeds the lesser of the contracted copayment amount, the amount an individual would pay for a prescription drug if that individual was paying cash, or the contracted amount for the drug; (v) reimbursing a pharmacy or pharmacist an amount less than the amount that the pharmacy benefits manager reimburses a pharmacy benefits manager affiliate for providing the same pharmacist services, calculated on a per-unit basis using the same generic product identifier or generic code number and reflecting all drug manufacturer's rebates, direct and indirect administrative fees, and costs and any remuneration; (vi) penalize or give an inducement to a covered individual for the purpose of having the covered individual use a specific retail community pharmacy, mail order pharmacy, or another network pharmacy provider that is a pharmacy benefits manager affiliate; (vii) prohibiting a pharmacist or pharmacy from offering and providing direct and limited delivery services including incidental mailing services, to an insured as an ancillary service of the pharmacy; (viii) charging a fee related to the adjudication of a claim without providing the cause for each adjustment or fee; (ix) steer a covered individual to a pharmacy in which the pharmacy benefit manager maintains an ownership interest or control without making a written disclosure to and receiving acknowledgment from the covered individual; or (x) penalizing or retaliating against a pharmacist or pharmacy for exercising rights provided by this measure. The measure also prohibits a carrier from (a) imposing provider accreditation standards or certification requirements inconsistent with, more stringent than, or in addition to requirements of the Virginia Board of Pharmacy or other state or federal entity; (b) including any mail order pharmacy or pharmacy benefits manager affiliate in calculating or determining network adequacy; or (c) conducting spread pricing in the Commonwealth. The measure requires each carrier to ensure that, before a particular drug is placed or continues to be placed on a Maximum Allowable Cost List, the drug meets certain standards, is available for purchase in the Commonwealth, and is not obsolete. The measure establishes requirements allowing network pharmacy providers to readily access the maximum allowable cost specific to that provider and requires Maximum Allowable Cost Lists to be updated every seven days. The measure requires the establishment of reasonable appeal procedures. The measure also imposes recordkeeping and reporting requirements and provides that information or data acquired therefrom is considered proprietary and confidential and is not subject to the Virginia Freedom of Information Act.", "pending_committee_id": 0, "committee": [], "referrals": [{"date": "2020-01-08", "committee_id": 4178, "chamber": "H", "chamber_id": 7, "name": "Labor and Commerce"}, {"date": "2020-01-16", "committee_id": 4182, "chamber": "H", "chamber_id": 7, "name": "Labor and Commerce: Subcommittee #2"}], "history": [{"date": "2020-01-08", "action": "Prefiled and ordered printed; offered 01/08/20 20104516D", "chamber": "H", "chamber_id": 7, "importance": 0}, {"date": "2020-01-08", "action": "Referred to Committee on Labor and Commerce", "chamber": "H", "chamber_id": 7, "importance": 1}, {"date": "2020-01-16", "action": "Assigned L & C sub: Subcommittee #2", "chamber": "H", "chamber_id": 7, "importance": 0}, {"date": "2020-01-30", "action": "Subcommittee recommends incorporating (HB1290-Hodges) by voice vote", "chamber": "H", "chamber_id": 7, "importance": 0}, {"date": "2020-02-04", "action": "Incorporated by Labor and Commerce ", "chamber": "H", "chamber_id": 7, "importance": 0}], "sponsors": [{"people_id": 13746, "person_hash": "n5f6aafj", "party_id": "2", "state_id": 46, "party": "R", "role_id": 1, "role": "Rep", "name": "Israel O'Quinn", "first_name": "Israel", "middle_name": "D.", "last_name": "O'Quinn", "suffix": "", "nickname": "", "district": "HD-005", "ftm_eid": 5705237, "votesmart_id": 134667, "opensecrets_id": "", "knowwho_pid": 361740, "ballotpedia": "Israel_O%27Quinn", "sponsor_type_id": 1, "sponsor_order": 1, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 1464, "person_hash": "asp0cakv", "party_id": "2", "state_id": 46, "party": "R", "role_id": 1, "role": "Rep", "name": "James Edmunds", "first_name": "James", "middle_name": "E.", "last_name": "Edmunds", "suffix": "II", "nickname": "", "district": "HD-060", "ftm_eid": 5820872, "votesmart_id": 93372, "opensecrets_id": "", "knowwho_pid": 282971, "ballotpedia": "James_Edmunds_II", "sponsor_type_id": 2, "sponsor_order": 2, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}], "sasts": [{"type_id": 2, "type": "Similar To", "sast_bill_number": "HB1290", "sast_bill_id": 1297670}], "subjects": [], "texts": [{"doc_id": 2087271, "date": "2020-01-08", "type": "Prefiled", "type_id": 11, "mime": "text/html", "mime_id": 1, "url": "https://legiscan.com/VA/text/HB1459/id/2087271", "state_link": "https://lis.virginia.gov/cgi-bin/legp604.exe?201+ful+HB1459+hil", "text_size": 21411, "text_hash": "b9cbd42a7fd73faab67b0e0e4cdb60ed"}], "votes": [], "amendments": [], "supplements": [], "calendar": [{"type_id": 1, "type": "Hearing", "date": "2020-01-23", "time": "00:00", "location": "House Committee Room", "description": "House Labor and Commerce - Subcommittee #2 Committee Hearing"}, {"type_id": 1, "type": "Hearing", "date": "2020-01-30", "time": "00:00", "location": "House Committee Room", "description": "House Labor and Commerce - Subcommittee #2 Committee Hearing"}, {"type_id": 1, "type": "Hearing", "date": "2020-02-04", "time": "00:00", "location": "House Committee Room", "description": "House Labor and Commerce Committee Hearing"}]}}