{"status": "OK", "bill": {"bill_id": 1309405, "change_hash": "3ad828ad4402f1add3a894304f0e3180", "session_id": 1719, "session": {"session_id": 1719, "state_id": 14, "year_start": 2020, "year_end": 2020, "prefile": 0, "sine_die": 1, "prior": 1, "special": 0, "session_tag": "Regular Session", "session_title": "2020 Regular Session", "session_name": "2020 Regular Session"}, "url": "https://legiscan.com/IN/bill/HB1054/2020", "state_link": "http://iga.in.gov/legislative/2020/bills/house/1054/", "completed": 0, "status": 1, "status_date": "2020-01-16", "progress": [{"date": "2020-01-16", "event": 1}, {"date": "2020-01-16", "event": 9}], "state": "IN", "state_id": 14, "bill_number": "HB1054", "bill_type": "B", "bill_type_id": "1", "body": "H", "body_id": 37, "current_body": "H", "current_body_id": 37, "title": "Political subdivision controlled projects and debt.", "description": "Political subdivision controlled projects and debt. Adds back the following deductions in calculating the basis for taxation of property for purposes of a referendum tax levy that is approved after June 30, 2020: (1) The homestead standard deduction. (2) The supplemental homestead deduction. (3) The mortgage deduction. Modifies the threshold amounts used for determining whether a political subdivision's project is a controlled project and whether the petition and remonstrance process or the referendum process applies. Bases these threshold amounts on gross assessed value. Provides that for a road, street, or designated bridge project, only the costs paid from property taxes are considered when applying these threshold amounts. Provides that, for purposes of the petition and remonstrance process, a controlled project includes any project: (1) that is not otherwise a controlled project; but (2) the cost of which, when added to the outstanding principal balance of all other projects adopted by the political subdivision in the preceding five years: (A) exceeds 1.5% of the political subdivision's gross assessed value but does not exceed 3% of the political subdivision's gross assessed value, in the case of a political subdivision whose total gross assessed value is not more than $1,000,000,000; or (B) in the case of a political subdivision whose total gross assessed value is more than $1,000,000,000, exceeds $15,000,000 plus 0.1% of the political subdivision's gross assessed value that exceeds $1,000,000,000 but does not exceed $30,000,000 plus 0.1% of the political subdivision's gross assessed value that exceeds $1,000,000,000. Provides that, for purposes of the referendum process, a controlled project includes any project: (1) that is not otherwise a controlled project; but (2) the cost of which, when added to the outstanding principal balance of all other projects adopted by the political subdivision in the preceding five years: (A) exceeds 3% of the political subdivision's gross assessed value, in the case of a political subdivision whose total gross assessed value is not more than $1,000,000,000; or (B) in the case of a political subdivision whose total gross assessed value is more than $1,000,000,000, exceeds $30,000,000 plus 0.1% of the political subdivision's gross assessed value that exceeds $1,000,000,000. Provides that the public question for a controlled project referendum or a school referendum levy must include a statement that if approved, the tax rate approved by referendum would represent a stated percentage increase (calculated by the department of local government finance) of the political subdivision's or school corporation's total tax rate as of the time of the referendum. Provides that if the estimated increase in a political subdivision's property tax levy for debt service for a proposed controlled project will be offset in whole or in part because of the retirement of existing debt of the political subdivision, the proper officers of the political subdivision may adopt a resolution that includes certain information and statements. Provides that if a political subdivision experiences a decrease in net assessed value it may be stated as an exception to a political subdivision's statement about maintaining its property tax rate to fund a new controlled project because of the retirement of debt. Specifies the ballot language for the referendum on such a proposed controlled project. Provides that the restrictions on supporting a position on a controlled project apply to any political subdivision that has assessed value within the same taxing district as the political subdivision proposing the project.", "pending_committee_id": 1307, "committee": {"committee_id": 1307, "chamber": "H", "chamber_id": 37, "name": "Ways and Means"}, "referrals": [{"date": "2020-01-16", "committee_id": 1307, "chamber": "H", "chamber_id": 37, "name": "Ways and Means"}], "history": [{"date": "2020-01-16", "action": "Authored by Representative Thompson", "chamber": "H", "chamber_id": 37, "importance": 0}, {"date": "2020-01-16", "action": "First reading: referred to Committee on Ways and Means", "chamber": "H", "chamber_id": 37, "importance": 1}], "sponsors": [{"people_id": 5560, "person_hash": "ayqpu3b3", "party_id": "2", "state_id": 14, "party": "R", "role_id": 1, "role": "Rep", "name": "Jeffrey Thompson", "first_name": "Jeffrey", "middle_name": "A.", "last_name": "Thompson", "suffix": "", "nickname": "", "district": "HD-028", "ftm_eid": 6592184, "votesmart_id": 18500, "opensecrets_id": "", "knowwho_pid": 194480, "ballotpedia": "Jeffrey_Thompson_(Indiana)", "sponsor_type_id": 1, "sponsor_order": 1, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}], "sasts": [], "subjects": [], "texts": [{"doc_id": 2098515, "date": "2020-01-15", "type": "Introduced", "type_id": 1, "mime": "application/pdf", "mime_id": 2, "url": "https://legiscan.com/IN/text/HB1054/id/2098515", "state_link": "http://iga.in.gov/static-documents/d/e/4/1/de41fd12/HB1054.01.INTR.pdf", "text_size": 611169, "text_hash": "02ee9e6f115f9926472bf04e717de8fb"}], "votes": [], "amendments": [], "supplements": [], "calendar": []}}