{"status": "OK", "bill": {"bill_id": 1407552, "change_hash": "cfe9cd6535d4c66d91fb64c54c80aa55", "session_id": 1802, "session": {"session_id": 1802, "state_id": 14, "year_start": 2021, "year_end": 2021, "prefile": 0, "sine_die": 1, "prior": 1, "special": 0, "session_tag": "Regular Session", "session_title": "2021 Regular Session", "session_name": "2021 Regular Session"}, "url": "https://legiscan.com/IN/bill/SB0402/2021", "state_link": "http://iga.in.gov/legislative/2021/bills/senate/402/", "completed": 0, "status": 1, "status_date": "2021-01-14", "progress": [{"date": "2021-01-14", "event": 1}, {"date": "2021-01-14", "event": 9}], "state": "IN", "state_id": 14, "bill_number": "SB0402", "bill_type": "B", "bill_type_id": "1", "body": "S", "body_id": 38, "current_body": "S", "current_body_id": 38, "title": "Various elections matters.", "description": "Various elections matters. Provides that the polls close at 7 p.m. (Under current law, the polls must close at 6 p.m.) Provides that an application to obtain or renew a motor vehicle driver's license or permit or an identification card serves as a voter registration application unless the applicant expressly declines on the application to register to vote. Provides that a voter becomes registered to vote when: (1) the county voter registration office determines the voter appears to be eligible to vote at the address on the voter's voter registration application; and (2) the voter receives notice of this determination. Requires a county voter registration office to note that a voter is in inactive status if the notice of voter registration is returned by the United States Postal Service due to an unknown or insufficient address. Eliminates the seven day period during which a voter's voter registration application is considered pending. Permits a voter to register at the polls by completing a voter registration form and an affirmation that the person has not voted elsewhere in the election and by providing proof of residence. Permits a voter who is qualified to vote in person to vote by absentee ballot. Removes all other qualifications for a voter to vote by absentee ballot except for a voter with disabilities who is unable to make a voting mark on the ballot or sign the absentee ballot secrecy envelope. (Such a disabled voter is currently required to vote before an absentee voter board.) Requires each absentee ballot mailed to a voter to be assigned a unique tracking number as prescribed by the election division using IMb Tracing. Requires the election division to incorporate a feature in the computerized list that enables county election officials and a voter to use IMb Tracing to track the voter's absentee ballot from the time the absentee ballot was mailed to the voter until the time the absentee ballot was received by the county election officials. Permits a county election board to authorize nonpartisan election observers for educational purposes to be present at the polls. Permits a county election board to authorize a public health safety officer to be present at the polls to monitor the public health. Requires each county to establish one satellite office for absentee voting in addition to absentee voting provided in the circuit court clerk's office. Requires each county to establish an additional satellite office for each 25,000 or fraction of 25,000 active voters in the county. Requires that in a township with at least 25,000 active voters, a satellite office must be established for each 25,000 active voters in the township. Provides that a voter may return a completed absentee ballot sealed in an absentee ballot envelope to the county election board by depositing the absentee ballot envelope in an absentee ballot drop box. Provides that absentee ballots may be scanned, but not tabulated, before election day. Provides that a person who knowingly does any electioneering in an area within 100 feet of an absentee ballot drop box commits a Class A misdemeanor. Repeals a provision that requires the rejection of an absentee ballot marked and forwarded by a voter who subsequently dies before election day. Repeals obsolete statutes relating to counting absentee ballots in precincts. Makes conforming changes.", "pending_committee_id": 1317, "committee": {"committee_id": 1317, "chamber": "S", "chamber_id": 38, "name": "Elections"}, "referrals": [{"date": "2021-01-14", "committee_id": 1317, "chamber": "S", "chamber_id": 38, "name": "Elections"}], "history": [{"date": "2021-01-14", "action": "Authored by Senator Ford J.D.", "chamber": "S", "chamber_id": 38, "importance": 0}, {"date": "2021-01-14", "action": "First reading: referred to Committee on Elections", "chamber": "S", "chamber_id": 38, "importance": 1}], "sponsors": [{"people_id": 19709, "person_hash": "1h70mo1k", "party_id": "1", "state_id": 14, "party": "D", "role_id": 2, "role": "Sen", "name": "J.D. Ford", "first_name": "J.D.", "middle_name": "", "last_name": "Ford", "suffix": "", "nickname": "", "district": "SD-029", "ftm_eid": 44857990, "votesmart_id": 178147, "opensecrets_id": "", "knowwho_pid": 484114, "ballotpedia": "J.D._Ford", "sponsor_type_id": 1, "sponsor_order": 1, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}], "sasts": [], "subjects": [], "texts": [{"doc_id": 2242780, "date": "2021-01-14", "type": "Introduced", "type_id": 1, "mime": "application/pdf", "mime_id": 2, "url": "https://legiscan.com/IN/text/SB0402/id/2242780", "state_link": "http://iga.in.gov/static-documents/1/3/e/c/13ec40ed/SB0402.01.INTR.pdf", "text_size": 667202, "text_hash": "05a1290d1ee225219515b873390e781e"}], "votes": [], "amendments": [], "supplements": [{"supplement_id": 130223, "date": "2021-01-14", "type": "Fiscal Note", "type_id": 1, "title": "Fiscal Note", "description": "Fiscal Note #1: Introduced Senate Bill (S)", "mime": "application/pdf", "mime_id": 2, "url": "https://legiscan.com/IN/supplement/SB0402/id/130223", "state_link": "http://iga.in.gov/static-documents/d/e/f/e/defe8405/SB0402.01.INTR.FN001.pdf", "supplement_size": 86979, "supplement_hash": "7ac0b1302bbcaab533c2d8c33d3f025a"}], "calendar": []}}