{"status": "OK", "bill": {"bill_id": 1544303, "change_hash": "ffa78d06ff555855a989942c1778b2bc", "session_id": 1955, "session": {"session_id": 1955, "state_id": 14, "year_start": 2022, "year_end": 2022, "prefile": 0, "sine_die": 1, "prior": 0, "special": 0, "session_tag": "Regular Session", "session_title": "2022 Regular Session", "session_name": "2022 Regular Session"}, "url": "https://legiscan.com/IN/bill/HB1083/2022", "state_link": "http://iga.in.gov/legislative/2022/bills/house/1083/", "completed": 0, "status": 1, "status_date": "2022-01-04", "progress": [{"date": "2022-01-04", "event": 1}, {"date": "2022-01-04", "event": 9}], "state": "IN", "state_id": 14, "bill_number": "HB1083", "bill_type": "B", "bill_type_id": "1", "body": "H", "body_id": 37, "current_body": "H", "current_body_id": 37, "title": "Tax and fiscal matters.", "description": "Tax and fiscal matters. Provides that beginning in 2024, a maximum levy growth quotient is determined individually for each civil taxing unit. Provides that the maximum levy growth quotient for a civil taxing unit is determined by a formula that is based on: (1) the average growth in the taxing unit's net assessed value; and (2) the average circuit breaker losses experienced by a civil taxing unit. Eliminates Indiana nonfarm personal income as a factor in computing a maximum levy growth quotient for a civil taxing unit. Modifies the threshold amounts used for determining whether a school's or political subdivision's project is a controlled project and whether the petition and remonstrance process or the referendum process applies. Adds back the following deductions in calculating the basis for taxation of property for purposes of a referendum tax levy: (1) The homestead standard deduction. (2) The supplemental homestead deduction. (3) The mortgage deduction. Extends the state sales tax to all services beginning January 1, 2024, except for: (1) educational services; and (2) health care services. Defines \"service\" as any activity engaged in for another person, if the person purchases the service as the end user of the service for consideration. Specifies that the term does not include a service rendered by an employee. Excludes the wholesale sale of services that are performed by a business and rendered to another business for the use or consumption in the production of tangible personal property or the delivery of other services that are for sale (business to business transactions). Decreases the state sales and use tax rate from 7% to 6%. Extends current sales tax exemptions for various types of tangible personal property to include services. Decreases the individual adjusted gross income tax rate from 3.23% to 3% beginning January 1, 2024. Eliminates the imposition of local income tax (LIT) on individuals who maintain a principal place of business or employment in a county with a LIT but do not reside in the county. Establishes, beginning in 2024, a new allocation factor and distribution formula for LIT expenditure rate revenue for civil taxing units that is based on the taxing unit's residential assessed value. Eliminates provisions that provide for a distribution of LIT expenditure rate revenue to schools and civil taxing units in counties that imposed a rate under the prior county adjusted gross income tax (CAGIT). Increases, beginning in 2024, the maximum LIT expenditure rate for a county, other than Marion County, from 2.5% in current law to 3%. Expires the authority to impose a property tax relief rate under the LIT. Provides that an ordinance adopted to impose a LIT property tax relief rate shall expire on December 31, 2023. Provides that, in order to continue to impose an expenditure tax rate after 2023, each county must adopt a new ordinance in 2023 (before October 1, 2023) to impose the rate. Provides that, for counties that fail to adopt an ordinance to renew an existing expenditure tax rate in 2023, the expenditure tax rate for the county in 2024 shall be the greater of: (1) zero; or (2) the minimum tax rate necessary for existing debt service. Specifies that this does not prevent the county from renewing, imposing, or modifying an expenditure tax rate in subsequent years. Authorizes a city or town to impose a municipal LIT rate beginning in 2024. Provides that the municipal tax rate may not exceed: (1) the remainder of: (A) 3%; minus (B) the expenditure tax rate imposed by the county; or (2) 3%, if the municipality is in a county that does not impose an expenditure tax rate. Allows a municipality to use tax revenue from a municipal LIT for any of the purposes of the municipality. Eliminates local income tax councils beginning July 1, 2023, and instead provides that the county fiscal body is the adopting body in all counties for purposes of the LIT. Provides that, after December 31, 2023, a civil taxing unit may not pledge LIT revenue to the payment of new bonds or to new lease payments. Establishes the school operations fund (fund). Requires the auditor of state, beginning after December 31, 2023, to transfer to the fund the distribution amounts of: (1) the financial institutions tax; (2) the commercial vehicle excise tax; and (3) the motor vehicle excise tax; that would otherwise be distributed to school corporations. Caps the operations fund maximum levy for school corporations and ensures that each school receives a specified amount of funding by providing for a distribution from the fund, if needed, to achieve the targeted funding amount. Includes property taxes imposed by a school corporation for its operations fund under the provisions that apply to the allocation of protected taxes to a fund. Provides that the governing body of a school corporation may not adopt a resolution to: (1) place a referendum on the ballot for an operating referendum tax levy; or (2) extend an operating referendum tax levy; that would impose a property tax rate for an assessment date after December 31, 2023 (does not affect a resolution adopted before January 1, 2024, or an operating referendum tax levy approved or extended before January 1, 2024). Authorizes the fiscal body of certain small cities and towns to adopt a resolution to place an operating referendum tax levy on the ballot. Requires the money received from the levy to be deposited in an operating referendum tax levy fund to be used to pay the general operating, administrative, or capital expenses of the city or town. Makes conforming changes.", "pending_committee_id": 1307, "committee": {"committee_id": 1307, "chamber": "H", "chamber_id": 37, "name": "Ways and Means"}, "referrals": [{"date": "2022-01-04", "committee_id": 1307, "chamber": "H", "chamber_id": 37, "name": "Ways and Means"}], "history": [{"date": "2022-01-04", "action": "Authored by Representative Thompson", "chamber": "H", "chamber_id": 37, "importance": 0}, {"date": "2022-01-04", "action": "First reading: referred to Committee on Ways and Means", "chamber": "H", "chamber_id": 37, "importance": 1}], "sponsors": [{"people_id": 5560, "person_hash": "ayqpu3b3", "party_id": "2", "state_id": 14, "party": "R", "role_id": 1, "role": "Rep", "name": "Jeffrey Thompson", "first_name": "Jeffrey", "middle_name": "A.", "last_name": "Thompson", "suffix": "", "nickname": "", "district": "HD-028", "ftm_eid": 6592184, "votesmart_id": 18500, "opensecrets_id": "", "knowwho_pid": 194480, "ballotpedia": "Jeffrey_Thompson_(Indiana)", "sponsor_type_id": 1, "sponsor_order": 1, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}], "sasts": [], "subjects": [], "texts": [{"doc_id": 2463069, "date": "2022-01-03", "type": "Introduced", "type_id": 1, "mime": "application/pdf", "mime_id": 2, "url": "https://legiscan.com/IN/text/HB1083/id/2463069", "state_link": "http://iga.in.gov/static-documents/d/6/e/5/d6e54ccb/HB1083.01.INTR.pdf", "text_size": 2155475, "text_hash": "9b34d65507bcac31f327d727e43bb7d2"}], "votes": [], "amendments": [], "supplements": [{"supplement_id": 219653, "date": "2022-01-03", "type": "Fiscal Note", "type_id": 1, "title": "Fiscal Note", "description": "Fiscal Note #1: Introduced House Bill (H)", "mime": "application/pdf", "mime_id": 2, "url": "https://legiscan.com/IN/supplement/HB1083/id/219653", "state_link": "http://iga.in.gov/static-documents/d/d/8/b/dd8b7975/HB1083.01.INTR.FN001.pdf", "supplement_size": 179800, "supplement_hash": "c36083b5c0b8307ede04c5765cb24092"}], "calendar": []}}