{"status": "OK", "bill": {"bill_id": 199062, "change_hash": "ca3282727204059658e8fa5cf16cdc86", "session_id": 77, "session": {"session_id": 77, "state_id": 52, "year_start": 2009, "year_end": 2010, "prefile": 0, "sine_die": 1, "prior": 1, "special": 0, "session_tag": "Regular Session", "session_title": "2009-2010 Regular Session", "session_name": "111th Congress"}, "url": "https://legiscan.com/US/bill/HB4983/2009", "state_link": "https://www.congress.gov/bill/111th-congress/house-bill/4983/all-info", "completed": 0, "status": 1, "status_date": "2010-03-25", "progress": [{"date": "2010-03-25", "event": 1}, {"date": "2010-03-25", "event": 9}, {"date": "2010-03-25", "event": 9}, {"date": "2010-03-25", "event": 9}, {"date": "2010-03-25", "event": 9}, {"date": "2010-03-25", "event": 9}, {"date": "2010-03-25", "event": 9}, {"date": "2010-06-15", "event": 9}], "state": "US", "state_id": 52, "bill_number": "HB4983", "bill_type": "B", "bill_type_id": "1", "body": "H", "body_id": 114, "current_body": "H", "current_body_id": 114, "title": "Transparency in Government Act of 2010", "description": "Transparency in Government Act of 2010 - Amends the Ethics in Government Act of 1978 to revise or prescribe requirements for greater disclosure and electronic filing of personal financial information by Members of Congress and congressional officers and employees. Amends Rule XXVI (Financial Disclosure) of the Rules of the House of Representatives to require the Clerk of the House and the Secretary of the Senate to make each financial quarterly report filed by a Member, congressional officer, or employee available within 48 hours after its receipt on the Clerk's or Secretary's website. Amends Rule X (Organization of Committees) to require reports filed on foreign travel with the chair of a committee to be posted on the committee's Internet site within 48 hours after their receipt. Amends Rule XXV (Limitations on Outside Earned Income and Acceptance of Gifts) to require all advance authorizations, certifications, and gift reports filed with the Clerk to be posted publicly on the Clerk's Internet site within 48 hours after their receipt. Amends Rule XXIII (Code of Official Conduct) to require any Member who requests a congressional earmark, a limited tax benefit, or a limited tariff benefit to post on his or her public website, within 24 hours after making such request, and for the remainder of the Congress: (1) the name and address of the intended recipient; (2) whether the recipient is a for-profit or not-for-profit entity; (3) the requested congressional earmark amount; and (4) an explanation of the request, including the purpose, and why it is a valuable use of taxpayer funds. Amends Rule XI (Procedures of Committees and Unfinished Business) to require any committee that accepts a Member's request for a congressional earmark or a limited tax or tariff benefit to maintain a public website with an earmark disclosure webpage that contains specified earmark information.  Requires the Clerk, the Secretary, and the chairs of specified congressional committees to create one centralized database where all requests for earmarks and limited tax and tariff benefits are publicly available on the Internet. Amends Rule XI to require each committee to post on its Internet website: (1) each of its recorded votes within 24 hours; and (2) its public hearings and markup schedules, as well as those of its subcommittees, at the same time that information is made available to members of the committee. Requires a committee or subcommittee to post on its Internet website, within 24 hours after ordering any bill or resolution to be reported, all amendments agreed to, except technical or conforming amendments. Amends Rule II (Other Officers and Officials) to direct the Clerk to require the House to provide a list of all committee and subcommittee public hearings and markup schedules, including links to committee websites. Amends Rule XIII (Calendar and Committee Reports) to make it out of order to consider any legislation until 72 hours (excluding Saturdays, Sundays and holidays except when the House is in session on such a day) after it has been made publicly available to Members and the general public. Amends Rule XXII (House and Senate Relations) to make it similarly out of order to consider a conference report and its accompanying joint statement or amendment until 72 hours after they have been made available to Members and the general public. Prescribes requirements for protection of classified information and increased transparency of recorded votes. Requires the Clerk to make the following Congressional Research Service (CRS) information publicly available on the Internet: (1) CRS Issue Briefs; (2) CRS Reports that are available to Members through the CRS website; and (3) CRS Authorization of Appropriations and Appropriations Products. Exempts from this requirement information deemed confidential by the Director of CRS or the head of the federal department or agency that provided such information and confidential research requests made by an individual, office, or committee.   Requires the Comptroller General to study and report to Congress on whether certain individuals are complying with the registration and reporting requirements of the Lobbying Disclosure Act of 1995 (LDA). Amends the LDA to revise or prescribe requirements for: (1) expedited online registration of lobbyists; (2) LDA exemptions; (3) disclosure of additional information by lobbyists; and (4) disclosure of political contributions. Amends the Federal Funding Accountability and Transparency Act of 2006 to provide transparency in federal contracting by revising the application programming interface and data elements of the federal funding website established by the Office of Management and Budget (OMB). Requires the OMB Director to ensure that: (1) a simple method for the public to report errors on the website is available; and (2) the unique identifier used to link information on the website about the award recipient is also used to link information about that recipient on the Federal Awardee Performance Integrity Information System. Amends the Duncan Hunter National Defense Authorization Act of Fiscal Year 2009 to revise or prescribe requirements for the System's database. Revises OMB collection and reporting requirements with respect to subaward data on federal contracts. Prescribes requirements for: (1) disclosure of federal sponsorship of all federal advertising or other communications paid for by an executive agency, either directly or through a contract awarded by such agency; and (2) digital access to completed responses to the Freedom of Information Act. Establishes a Commission on Freedom of Information Act Processing Delays.", "pending_committee_id": 0, "committee": [], "referrals": [{"date": "2010-03-25", "committee_id": 2311, "chamber": "H", "chamber_id": 114, "name": "Oversight And Government Reform"}, {"date": "2010-06-15", "committee_id": 4143, "chamber": "H", "chamber_id": 114, "name": "Subcommittee on the Constitution, Civil Rights, and Civil Liberties"}], "history": [{"date": "2010-03-25", "action": "Referred to the Committee on Oversight and Government Reform, and in addition to the Committees on Rules, House Administration, the Judiciary, and Standards of Official Conduct, for a period to be subsequently determined by the Speaker, in each case for consideration of such provisions as fall within the jurisdiction of the committee concerned.", "chamber": "", "chamber_id": 0, "importance": 1}, {"date": "2010-03-25", "action": "Referred to House Oversight and Government Reform", "chamber": "", "chamber_id": 0, "importance": 1}, {"date": "2010-03-25", "action": "Referred to House Rules", "chamber": "", "chamber_id": 0, "importance": 1}, {"date": "2010-03-25", "action": "Referred to House House Administration", "chamber": "", "chamber_id": 0, "importance": 1}, {"date": "2010-03-25", "action": "Referred to House Judiciary", "chamber": "", "chamber_id": 0, "importance": 1}, {"date": "2010-03-25", "action": "Referred to House Standards of Official Conduct", "chamber": "", "chamber_id": 0, "importance": 1}, {"date": "2010-06-15", "action": "Referred to the Subcommittee on the Constitution, Civil Rights, and Civil Liberties.", "chamber": "", "chamber_id": 0, "importance": 1}], "sponsors": [{"people_id": 9134, "person_hash": "g4z5eqp7", "party_id": "1", "state_id": 52, "party": "D", "role_id": 1, "role": "Rep", "name": "Jackie Speier", "first_name": "Jackie", "middle_name": "", "last_name": "Speier", "suffix": "", "nickname": "", "district": "HD-CA-14", "ftm_eid": 12997061, "votesmart_id": 8425, "opensecrets_id": "N00029649", "knowwho_pid": 192997, "ballotpedia": "Jackie_Speier", "sponsor_type_id": 0, "sponsor_order": 0, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 9312, "person_hash": "pf1tkip8", "party_id": "1", "state_id": 52, "party": "D", "role_id": 1, "role": "Rep", "name": "Mike Quigley", "first_name": "Mike", "middle_name": "", "last_name": "Quigley", "suffix": "", "nickname": "", "district": "HD-IL-5", "ftm_eid": 8785226, "votesmart_id": 83310, "opensecrets_id": "N00030581", "knowwho_pid": 277349, "ballotpedia": "Mike_Quigley", "sponsor_type_id": 0, "sponsor_order": 0, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}], "sasts": [], "subjects": [{"subject_id": 13525, "subject_name": "Congress"}, {"subject_id": 13127, "subject_name": "Advisory bodies"}, {"subject_id": 13134, "subject_name": "Appropriations"}, {"subject_id": 13826, "subject_name": "Congressional Research Service (CRS)"}, {"subject_id": 13145, "subject_name": "Congressional agencies"}, {"subject_id": 13677, "subject_name": "Congressional committees"}, {"subject_id": 13585, "subject_name": "Congressional officers and employees"}, {"subject_id": 13146, "subject_name": "Congressional oversight"}, {"subject_id": 13494, "subject_name": "Elections, voting, political campaign regulation"}, {"subject_id": 13880, "subject_name": "Freedom of information"}, {"subject_id": 13199, "subject_name": "Government ethics and transparency, public corruption"}, {"subject_id": 13200, "subject_name": "Government information and archives"}, {"subject_id": 13201, "subject_name": "Government investigations"}, {"subject_id": 13224, "subject_name": "Income tax credits"}, {"subject_id": 13225, "subject_name": "Income tax deductions"}, {"subject_id": 13226, "subject_name": "Income tax exclusion"}, {"subject_id": 13500, "subject_name": "Intelligence activities, surveillance, classified information"}, {"subject_id": 13233, "subject_name": "Internet and video services"}, {"subject_id": 13591, "subject_name": "Legislative rules and procedure"}, {"subject_id": 13389, "subject_name": "Libraries and archives"}, {"subject_id": 13760, "subject_name": "Library of Congress"}, {"subject_id": 13312, "subject_name": "Licensing and registrations"}, {"subject_id": 13588, "subject_name": "Members of Congress"}, {"subject_id": 13515, "subject_name": "Political advertising"}, {"subject_id": 13260, "subject_name": "Public contracts and procurement"}, {"subject_id": 13652, "subject_name": "Public participation and lobbying"}, {"subject_id": 13678, "subject_name": "Tariffs"}, {"subject_id": 13533, "subject_name": "Travel and tourism"}], "texts": [{"doc_id": 464937, "date": "2010-11-26", "type": "Introduced", "type_id": 1, "mime": "application/pdf", "mime_id": 2, "url": "https://legiscan.com/US/text/HB4983/id/464937", "state_link": "https://www.congress.gov/111/bills/hr4983/BILLS-111hr4983ih.pdf", "text_size": 191324, "text_hash": "48baa45bf8026477e735324aca01100c"}], "votes": [], "amendments": [], "supplements": [], "calendar": []}}