{"status": "OK", "bill": {"bill_id": 206013, "change_hash": "21f64f1ad70af89736e9afede1cc64a9", "session_id": 50, "session": {"session_id": 50, "state_id": 8, "year_start": 2009, "year_end": 2010, "prefile": 0, "sine_die": 1, "prior": 1, "special": 0, "session_tag": "Regular Session", "session_title": "2009-2010 Regular Session", "session_name": "145th General Assembly"}, "url": "https://legiscan.com/DE/bill/HB431/2009", "state_link": "http://legis.delaware.gov/LIS/lis145.nsf/2bede841c6272c888025698400433a04/b7433c41ed5de8108525771b006a31a0?OpenDocument", "completed": 1, "status": 4, "status_date": "2010-07-28", "progress": [{"date": "2010-06-02", "event": 1}, {"date": "2010-06-02", "event": 9}, {"date": "2010-06-15", "event": 2}, {"date": "2010-06-17", "event": 9}, {"date": "2010-06-29", "event": 3}, {"date": "2010-06-29", "event": 3}, {"date": "2010-06-30", "event": 3}, {"date": "2010-07-28", "event": 4}], "state": "DE", "state_id": 8, "bill_number": "HB431", "bill_type": "B", "bill_type_id": "1", "body": "H", "body_id": 25, "current_body": "S", "current_body_id": 26, "title": "An Act To Amend Chapter 189, Volume 43, Laws Of Delaware, As Amended, Relating To The Charter Of The Town Of Wyoming.", "description": "This bill repeals the current Town of Wyoming Charter and adopts a new Town of Wyoming Charter. This bill carries over without significant changes many sections and subsections of the former charter to the new charter and such sections are not mentioned in the synopsis. SECTION 3. STRUCTURE OF GOVERNMENT; QUALIFICATIONS FOR TOWN COUNCIL; COMPENSATION. Crimes that disqualify an individual for running for Mayor or Council in section 3.2 are expanded to include any felony, crime of moral turpitude, crime of dishonesty, or crime involving fraud, bribery or embezzlement (the only original limitation was being convicted of “a felony of any crime involving moral turpitude”). The age requirement to run for mayor is clarified as being 21 years of age “by the date of the election”. (The former charter made no mention of when a candidate must be 21.) The mayoral term of office in section 3.3 is expanded from 2 to 3 years. SECTION 4. MANNER OF HOLDING ELECTIONS AND MAKING NOMINATIONS. The election provisions governing Wyoming elections are heavily revised to be consistent with 15 Del C. Ch. 75 (“Municipal Elections”), and no inconsistencies are intended. The Town is required to post or publish notices of elections 20 days prior to the election date in five public places and in 2 newspapers. Pursuant to the Municipal Elections law, notice must be posted in the required manner, the Town must follow certain procedures to solicit candidates for elections, and candidates are required to make appropriate filings with the state. The right to vote is restricted to U.S. citizens, 18 years of age or older, who are domiciled in the Town at least 30 days prior to the election, who have not been adjudged mentally incompetent, and who have not been disenfranchised under the Delaware Constitution. “Domiciled” is defined and the Charter requires voters to present photo identification and proof of residency at the time of voting pursuant to the Municipal Elections law. The Town may either enact an ordinance regarding voter registration or adopt the Kent County voter registration list. The conduct of the elections and absentee voting must be in accordance with the Municipal Elections law, and pursuant to the same law, voting machines must be used. Recounts and contests of elections must be done pursuant to the Municipal Elections law. The Election Board may consist of either 3 or 5 members, none of whom may be close relatives of any council members or candidates for office. The Election Board’s powers are set forth, including the right to break a tie vote in a municipal election by the toss of a coin. The period of time the Election Board must keep ballots after an election is increased from 10 days to 30 days (or if the election is contested or an appeal is filed, until the reviewing body or court decides otherwise). SECTION 5. ORGANIZATION AND ANNUAL MEETING OF COUNCIL. The list of individuals who may “swear in” a Town official under section 5 is expanded to include state and county officials presently in office. SECTION 10. FORFEITURE OF OFFICE. The reasons a council member must forfeit office are changed from just being convicted of “any felony or crime involving moral turpitude” to being convicted of “a felony, of any crime involving moral turpitude, of any crime of dishonesty, or of any crime involving fraud, bribery, or embezzlement.” The former charter required forfeiture if three consecutive council meetings are missed without being excused by Council, but forfeiture is now required if three council meetings are missed in a 12-month period without being excused by Council. SECTION 11. FILLING VACANCIES. This section is new to the Charter. Pursuant to section 11, if a vacancy occurs on council more than four months prior to the next annual election, Council has 45 days to fill the vacancy by a majority vote. If two candidates for a vacant seat receive equal number of council votes, the tie shall be broken by a toss of a coin. All vacant seats are only filled temporarily until the next regular election at which time the voters will elect an individual to fill the seat for the remainder of the original term. SECTION 12. CONTRACTS WITH THE TOWN. The ability of Council to approve contracts with council members through unanimous is eliminated, and the Charter now outlines that all contracts and conflicts of interest are governed by 29 Del.C. Ch. 58 (“Laws Regulating the Conduct of Officers and Employees of the State”), and any contracts that would otherwise violate this statute must be brought before the State Public Integrity Commission. SECTION 13. REGULAR MEETINGS OF COUNCIL. The Town must post notice of temporary changes of meeting locations in five places in Town (the former charter does not specify the number of locations where such notice must be posted). SECTION 14 OFFICERS. In section 14.1, the Town Collector of Taxes is changed from being the Town Clerk to the Town Finance Clerk. Section 14.4 amends the powers of the Mayor to include the authorization to act in cases of sudden emergency without prior Council approval, provided that Council may cancel or further implement the Mayor’s actions at a meeting within 15 days of the Mayor’s actions. In section 14.6 and 14.7, the bonding requirement for the Town Treasurer and Collector of Taxes is increased from $2,000 and $1,000 respectively, to $30,000. However, bonding shall not be required for either position if the Town maintains a general public employee bond that covers both. The age requirement for the Finance Clerk is increased from 18 to 21. The requirement that the Council select a Town Solicitor for a one-year term in section 14.9 is eliminated, leaving undefined the term for which the solicitor may be elected. The powers of police officers originally found in two places in the Charter are combined in one place in 14.10. Unnecessary language regarding the procedures whereby individuals are sentenced or imprisoned is deleted, and language in the current Charter granting the police authority to act 1 mile beyond the Town limits is also deleted. SECTION 15. ASSESSMENT OF TAXES. References to the Town Board of Assessment are eliminated, and section 15 requires the Town to adopt the Kent County assessment lists. The Town shall not have authority to hear assessment appeals except with regards to additions made to tax bills by the Town for other charges owed to the town. The posting date of the assessment list is changed from April 15 to June 1, and the locations where public notice must be posted are expanded from two public places to five public places. The Town’s taxing authority is expanded to include telephone facilities, television facilities, and gas facilities. The authority to tax farmland and to exempt farmland from taxation is simplified and clarified. The Town’s authority to exceed the $600,000 limit of revenue it can annually raise through taxes via a referendum is eliminated from the Charter. SECTION 17. COLLECTION OF TAXES AND OTHER CHARGES. A provision is added to Section 17 allowing courts to award the Town its costs and attorneys fees associated with bring actions to enforce Town ordinances or to collect amounts due to the Town when the Town is the prevailing party; provided that the Town shall have made written demand for payment or compliance, including notice that the Town may be entitled to collect its costs and reasonable attorneys fees if it is the prevailing party, to the responsible party prior to the filing of such legal action or proceeding. SECTION 18. ENUMERATION OF SPECIFIC POWERS OF COUNCIL. The transfer tax that may be charged by the Town is increased from 1 percent to 1  percent. Language stating that the Levy Court shall appropriate funds to the Town is deleted, as is language stating that the Town may regulate the operation of public utilities. The requirement that building setbacks be no more than 10 feet is eliminated (setbacks are to be governed by the Town’s zoning ordinance). The limit of fines for violating ordinances in 18.21 is increased from $500 to $1000, but imprisonment as a penalty is restricted to only civil contempt charges (under the existing charter, imprisonment could be a penalty for any ordinance violation). The Town is authorized to enact civil penalties for ordinance violations and establish voluntary assessment procedures. A detailed list of businesses that may be licensed or taxed by the Town is removed, and the Town is granted general authority to license and tax businesses. SECTION 19. USE OF TOWN MONEY. Section 19 no longer includes the requirement that all Town bills be approved by Council and that all proposed uses of money be recorded in the minutes. SECTION 20. FISCAL YEAR, ANNUAL STATEMENT. The Town’s annual statement of the receipts and disbursements of Town moneys shall be posted in 5 public places, but unlike under the former charter, such posting need not occur 10 days prior to the annual Town election (statements are not ready at that time). SECTION 21. POWER TO BORROW MONEY AND USE BONDS. The Town’s current borrowing procedures are eliminated and replaced with new borrowing procedures. The short term borrowing limit for the Town (to be repaid within five years) is $125,000 (accumulated outstanding principle) with at least four members of council voting in favor. (Previously, Council could borrow $125,000 per fiscal year with a majority vote of council.) The total borrowing limit of the Town is reduced from 10% (in the former Charter) to 5% of the assessed value of real property in Town. In order to borrow in excess of $125,000, notice, hearing, and a public election are required. At such an election, any entity or person owning property in Town is entitled to one vote and all Town residents are entitled to one vote. Section 21 defines the municipal purposes for which borrowing may occur, and it authorizes the Town to refinance bonds without public hearing and public election. To pay off bonds, the Town may tax all real estate or only real estate directly benefited by the borrowing. Section 21 authorizes the Town to prescribe the form of bond and protects council members from being personally liable for repaying the bond. Section 21 also authorizes the Town to sell bonds at public or private sale, and it creates a statute of limitations of 60 days (from the date notice is published in a newspaper) after which the issuance of bonds cannot be contested. SECTION 23. STREETS AND ALLEYS. This section is new to the Charter. To alter streets under these new procedures, the Town must adopt a resolution setting forth the details of a hearing whereat the matter will be discussed. Property owners affected by the proposed change must be notified. Section 23 dictates, in accordance with state law, compensation for property that is condemned or acquired; this section also outlines how abandoned or vacated streets may be disposed of by the Town. SECTION 32. FINES. The limit on fines that may be imposed by the Town is reduced from $5,000 to $1,000. SECTION 33. SUBDIVISION AND LAND DEVELOPMENT. The Town is expressly authorized to regulate subdivision and land development. The Town may regulate combining and partitioning land, as well as subdivision and site plans, and it may require impact fees, dedication of land, or money in lieu of land in order to pay for municipal and public improvements having a rational nexus to the proposed development. The Town may adopt procedures to insure compliance with ordinances and to secure financial guarantees for the completion of improvements, and the Town may require all plans, plots, and plats be approved by the Town before being recorded at the office of the Recorder of Deeds in and for Kent County. SECTION 34. ANNEXATION OF TERRITORY. The annexation procedures are altered to require that notice of the annexation be published in 4 public places and on each parcel proposed for annexation (the former charter authorized posting in a newspaper or on property in both the Town and annexation area). The annexation procedures are clarified to require a special election where all the owners of record of the territory proposed for annexation did not request annexation (in the former charter, a special election was only required if five or more property owners, but not all of the property owners, requested annexation). For annexations where special elections are required (i.e. where all of the record owners have not requested annexation), an annexation shall only be approved pursuant to a majority vote of the Town residents and a majority vote of the residents of the territory proposed for annexation. SECTION 36. ACTIONS OR SUITS. No one may bring suit against the Town, its officers, employees, or agents, without first notifying the Town in writing, within one year of the incident resulting in the injury, of the time, place, cause, character, and extent of the injury or damages suffered. SECTION 37. SURVIVAL OF POWERS AND VALIDATING SECTION. This section clarifies that outstanding bonds shall not be affected by adopting a new Charter. This Charter deletes provisions in the existing charter which authorized the Town to operate its own water system or sewer system and to have a board of health.", "pending_committee_id": 0, "committee": [], "referrals": [{"date": "2010-06-02", "committee_id": 1655, "chamber": "H", "chamber_id": 25, "name": "Administration"}, {"date": "2010-06-17", "committee_id": 1676, "chamber": "S", "chamber_id": 26, "name": "Community/County Affairs"}], "history": [{"date": "2010-06-02", "action": "Introduced and Assigned to House Administration Committee in House", "chamber": "", "chamber_id": 0, "importance": 1}, {"date": "2010-06-09", "action": "Reported Out of Committee (HOUSE ADMINISTRATION) in House with 4 On Its Merits", "chamber": "", "chamber_id": 0, "importance": 0}, {"date": "2010-06-15", "action": "Amendment HA 1 - Introduced in House", "chamber": "", "chamber_id": 0, "importance": 0}, {"date": "2010-06-15", "action": "Amendment HA 1 to HA 1 - Introduced in House", "chamber": "", "chamber_id": 0, "importance": 0}, {"date": "2010-06-15", "action": "Amendment HA 1 to HA 1 - Passed in House by Voice Vote", "chamber": "", "chamber_id": 0, "importance": 0}, {"date": "2010-06-15", "action": "Amendment HA 1 - Passed in House by Voice Vote", "chamber": "", "chamber_id": 0, "importance": 0}, {"date": "2010-06-15", "action": "Passed by House of Representatives. Votes: Passed 39 YES 0 NO 0 NOT VOTING 2 ABSENT 0 VACANT", "chamber": "", "chamber_id": 0, "importance": 1}, {"date": "2010-06-17", "action": "Assigned to Community/County Affairs Committee in Senate", "chamber": "", "chamber_id": 0, "importance": 1}, {"date": "2010-06-24", "action": "Reported Out of Committee (COMMUNITY/COUNTY AFFAIRS) in Senate with 3 On Its Merits", "chamber": "", "chamber_id": 0, "importance": 0}, {"date": "2010-06-29", "action": "Amendment SA 1 - Introduced in Senate", "chamber": "", "chamber_id": 0, "importance": 0}, {"date": "2010-06-29", "action": "Amendment SA 1 - Passed by Senate. Votes: Passed 18 YES 1 NO 0 NOT VOTING 2 ABSENT 0 VACANT", "chamber": "", "chamber_id": 0, "importance": 1}, {"date": "2010-06-29", "action": "Passed by Senate. Votes: Passed 19 YES 0 NO 0 NOT VOTING 2 ABSENT 0 VACANT", "chamber": "", "chamber_id": 0, "importance": 1}, {"date": "2010-06-30", "action": "Passed by House of Representatives. Votes: Passed 39 YES 0 NO 0 NOT VOTING 2 ABSENT 0 VACANT", "chamber": "", "chamber_id": 0, "importance": 1}, {"date": "2010-07-28", "action": "Signed by Governor", "chamber": "", "chamber_id": 0, "importance": 1}], "sponsors": [{"people_id": 4443, "person_hash": "s7xfz0dp", "party_id": "1", "state_id": 8, "party": "D", "role_id": 2, "role": "Sen", "name": "Brian Bushweller", "first_name": "Brian", "middle_name": "J.", "last_name": "Bushweller", "suffix": "", "nickname": "", "district": "SD-017", "ftm_eid": 6461253, "votesmart_id": 30672, "opensecrets_id": "", "knowwho_pid": 207923, "ballotpedia": "Brian_Bushweller", "sponsor_type_id": 0, "sponsor_order": 0, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 4458, "person_hash": "ybszmwn2", "party_id": "2", "state_id": 8, "party": "R", "role_id": 1, "role": "Rep", "name": "Donald Blakey", "first_name": "Donald", "middle_name": "A.", "last_name": "Blakey", "suffix": "", "nickname": "", "district": "HD-034", "ftm_eid": 6672117, "votesmart_id": 66233, "opensecrets_id": "", "knowwho_pid": 249247, "ballotpedia": "Donald_Blakey", "sponsor_type_id": 0, "sponsor_order": 0, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}], "sasts": [], "subjects": [], "texts": [{"doc_id": 503308, "date": "2010-10-05", "type": "Draft", "type_id": 9, "mime": "text/html", "mime_id": 1, "url": "https://legiscan.com/DE/text/HB431/id/503308", "state_link": "http://legis.delaware.gov/LIS/lis145.nsf/vwLegislation/HB+431/$file/legis.html?open", "text_size": 204786, "text_hash": "a0b3e12540d87aa199307798bb98731d"}], "votes": [{"roll_call_id": 129410, "date": "2010-06-15", "desc": "House Third Reading", "yea": 39, "nay": 0, "nv": 0, "absent": 2, "total": 41, "passed": 1, "chamber": "H", "chamber_id": 25, "url": "https://legiscan.com/DE/rollcall/HB431/id/129410", "state_link": "http://legis.delaware.gov/LIS/lis145.nsf/7712cf7cc0e9227a852568470077336f/0a7b7c3a92aed6fb85257743007eb722?OpenDocument"}, {"roll_call_id": 129412, "date": "2010-06-29", "desc": "Senate Third Reading", "yea": 19, "nay": 0, "nv": 0, "absent": 2, "total": 21, "passed": 1, "chamber": "S", "chamber_id": 26, "url": "https://legiscan.com/DE/rollcall/HB431/id/129412", "state_link": "http://legis.delaware.gov/LIS/lis145.nsf/7712cf7cc0e9227a852568470077336f/1dd26334b8d9263e85257751007dfd33?OpenDocument"}, {"roll_call_id": 129413, "date": "2010-06-30", "desc": "House Third Reading", "yea": 39, "nay": 0, "nv": 0, "absent": 2, "total": 41, "passed": 1, "chamber": "H", "chamber_id": 25, "url": "https://legiscan.com/DE/rollcall/HB431/id/129413", "state_link": "http://legis.delaware.gov/LIS/lis145.nsf/7712cf7cc0e9227a852568470077336f/2de6e22f59572ec9852577520081be6a?OpenDocument"}], "amendments": [], "supplements": [], "calendar": []}}