{"status": "OK", "bill": {"bill_id": 269348, "change_hash": "9cbfbbbfd8032a5041068c658a3ecc7e", "session_id": 116, "session": {"session_id": 116, "state_id": 48, "year_start": 2011, "year_end": 2011, "prefile": 0, "sine_die": 1, "prior": 1, "special": 0, "session_tag": "Regular Session", "session_title": "2011 Regular Session", "session_name": "2011 Regular Session"}, "url": "https://legiscan.com/WV/bill/HB3125/2011", "state_link": "http://www.legis.state.wv.us/Bill_Status/Bills_history.cfm?input=3125&year=2011&sessiontype=RS&btype=bill", "completed": 0, "status": 1, "status_date": "2011-02-14", "progress": [{"date": "2011-02-14", "event": 1}, {"date": "2011-02-14", "event": 9}], "state": "WV", "state_id": 48, "bill_number": "HB3125", "bill_type": "B", "bill_type_id": "1", "body": "H", "body_id": 1, "current_body": "H", "current_body_id": 1, "title": "Relating to the regulation of firearms and other deadly weapons", "description": "The purpose of this bill is to regulate firearms and other deadly weapons. The bill attempts to deal with this issue in every provision of the Code where firearms and carrying or exhibiting a deadly or dangerous weapon is mentioned. This bill is to be known as \"The West Virginia Gun Owners' Protection Act of 2011\".   Otherwise, the bill regulates firearms and other deadly weapons; it provides uniform statutory definition of \"business days\" for purposes of computation of time; it provides that the rights of local conservators of the peace and reserve deputy sheriffs to keep and bear arms as private citizens are neither enlarged nor diminished by virtue of their positions. The bill clarifies various grants of authority to certain state officers and agents to carry firearms and concealed weapons while on duty. It codifies common law arrest powers of prosecuting attorneys and assistant prosecuting attorneys and repeals special fees for fingerprinting services for applicants for federal firearm licenses. The bill repeals the authority of municipalities to prohibit the carrying of certain weapons and limits access to records pertaining to licenses to carry concealed weapons, qualified retired law-enforcement officers qualified to carry concealed firearms pursuant to the federal Law Enforcement Officers Safety Act of 2004 and licensed hunters, trappers and fishermen. The bill requires qualifying law-enforcement officers employed by a West Virginia law-enforcement agency to receive certification to carry a concealed firearm nationwide as provided in the federal Law Enforcement Officers Safety Act of 2004 and establishes a procedure for a retired or medically discharged member of the State Police to appeal a denial of a letter of authorization to carry concealed handguns; it provides that certain methods of authorization for retired or medically discharged members of the State Police to carry concealed handguns are cumulative, that a letter of authorization for a retired or medically discharged member of the State Police to carry concealed weapons shall be considered a West Virginia license to carry concealed weapons for the purpose of participating in reciprocity with other states; that law-enforcement agencies are neither prohibited from nor required to permit an officer to carry his or her service weapon off-duty; and requires West Virginia law-enforcement agencies to offer access to training and certification for honorably retired officers to be permitted to carry a concealed firearm nationwide as a qualified retired law-enforcement officer as provided in the federal Law Enforcement Officers Safety Act of 2004. The bill establishes a program for issuing special qualified retired law-enforcement officer concealed firearm license by the State Police, authorizing legislative rules and provides that special qualified retired law-enforcement officer concealed firearm license is cumulative and supplemental. The bill prohibits state financial assistance to higher education institutions that infringe upon an individual's right to keep and bear arms as provided by law, expands prohibition on interference with hunters, trappers and fishermen to include the lawful possession or control of lawfully-taken wildlife, prohibits certain harassment, intimidation or threats against hunters, trappers or fishermen, provides exemptions to prohibited acts relating to interference with hunters, trappers and fishermen, provides exemption from prohibited acts relating to interference with hunters, trappers and fishermen for Constitutionally-protected activities, increases criminal penalties for interference with hunters, trappers and fishermen, provides civil remedies for unlawful interference with hunters, trappers and fishermen, clarifies that hunting statutes generally do not prohibit the otherwise lawful carrying of handguns for self-defense purposes and exempts persons who are licensed or otherwise authorized to lawfully carry concealed weapons from certain limitations on how firearms may be carried or transported. The bill provides additional lawful means for the transportation of rifles and shotguns in or on vehicles and vessels. The bill clarifies language on Sunday hunting local option election ballots to accurately state the nature of the question propounded. It modifies restrictions relating to discharging firearms near residences, parks and certain other public places and consolidates and clarifies certain penalty provisions. The bill requires notice of a guardianship or conservatorship hearing to include a warning of the potential consequences of the guardianship or conservatorship action on the alleged protected person's ability to lawfully possess firearms. It requires domestic violence protective orders to contain certain warnings about implications of order on legality of firearms possession and clarifies the effect of protective orders on legality of firearms possession. The bill prohibits an adoption agency or entity from making suitability determinations based on, requiring disclosure relating to, or restricting the lawful possession, storage or use of a firearm or ammunition. The bill provides immunity from civil liability for certain firearms safety instructors, course providers, sponsoring organizations and participants. It modifies the area covered by prohibition on transporting restricted articles on correctional facility premises. The bill prohibits the taking of lawfully possessed arms and ammunition during a declared state of emergency or riot. It repeals the prohibition on bringing weapons upon the State Capitol Complex. The bill declares legislative findings and intent and defines terms. It limits the requirement of license to carry concealed weapons to enumerated locations, provides additional exemptions to requirement of license to carry concealed weapons, grants full faith and credit to all qualified out-of-state license or permit to carry concealed weapons held by qualifying out-of-state licensees, requires certain persons who lawfully carry a concealed weapon without a license to inform the law-enforcement officer and submit to certain requests by the law-enforcement officer when the person is contacted by a law-enforcement officer and provides procedures for ascertaining the existence of a license or other lawful authorization to carry a concealed weapon. The bill establishes certain rebuttable presumptions regarding the existence or absence of evidence of a license or other lawful authorization to carry a concealed weapon, establishes multiple classes of licenses to carry concealed weapons, prescribing eligibility criteria for each class of license, repeals limitation of licenses to carry concealed weapons to pistols and revolvers only, repeals license to carry concealed weapons fee surcharge for Courthouse Facilities Improvement Fund; requiring the inclusion of certain information on applications for licenses to carry concealed weapons, modifies eligibility criteria for licenses to carry concealed weapons and specifies information to be provided in application for license to carry concealed weapons. The bill requires applicants for licenses to carry concealed weapons to provide specified documentation with application, specifies required components of background investigations of applicants for licenses to carry concealed weapons, requires background check on applicants for licenses to carry concealed weapons to determine an applicant's eligibility to possess or transport firearms under state and federal law and requires fingerprint-based state and national criminal and mental health background checks on applicants for Class 1 licenses. The bill establishes a State Police Concealed Weapons License Background Check Administration Fund, provides for the source of funds use of funds and authorizes expenditures from collections. The bill converts county concealed weapons license administration funds to perpetual revolving accounts and repeals authority of sheriff to expend surplus funds in county concealed weapons license administration fund. The bill establishes additional means of fulfilling requirement of demonstrating basic competence with a handgun, prescribes additional requirement for Class 1, 2 and 4 licenses of completing certain live fire shooting exercises and passing live fire shooting proficiency test and requires instructors of live fire shooting proficiency tests to maintain records on students. The bill modifies time limit for sheriffs to act on applications for licenses to carry concealed weapons. It conforms requirements for Social Security number solicitations on applications for licenses to carry concealed weapons to Section 7 of the federal Privacy Act of 1974, establishes a uniform system of numbering and indexing all licenses to carry concealed weapons throughout the state, specifies the form and contents of licenses to carry concealed weapons, establishes provisions governing the change of a licensee's name or address, modifies the license expiration and renewal cycle, prorates license fees and extends licenses of active-duty members of the Armed Forces while deployed. The bill requires Commissioner of Motor Vehicles to produce license cards upon request of sheriff, provides for the payment of cost of producing license cards, transfers responsibility for preparing license applications and other forms from Superintendent to Attorney General and requires sheriffs to accept certain methods of payment for fees for licenses to carry concealed weapons. The bill establishes procedure for appealing the suspension or revocation of a license to carry concealed weapons; specifying form of notice of denial, suspension or revocation of a license to carry concealed weapons. It specifies whether a license to carry concealed weapons shall be suspended or revoked, establishes optional procedure for reconsidering denial, suspension or revocation of license prior to judicial appeal, closing proceedings and sealing records in judicial appeals of denials, suspension and revocations of licenses to carry concealed weapons and modifies immunity from civil liability for certain acts relative to concealed weapons licensing. The bill declares licensing statute to be comprehensive and preemptive. It requires courts to determine whether individuals in proceedings resulting in disqualification from licensure are licensed to carry a concealed weapon and to notify issuing agency upon a licensee becoming disqualified for certain causes from continued licensure to carry concealed weapons. It requires sheriffs to issue notice of license expiration and renewal process and provides contents of notice. The bill provides criminal penalties for fraudulently obtaining or unlawfully disclosing confidential information about individuals who have applied for or been issued licenses to carry concealed weapons. It establishes provisions for the use of an alternate address by certain classes of protected persons. It requires the Attorney General to periodically notify the Attorney General and licensing authority of each state of this state's recognition of qualified out-of-state license or permit to carry concealed weapons held by qualifying out-of-state licensees and to negotiate and execute reciprocity agreements to secure recognition of West Virginia licenses when required by other states as a condition of recognizing West Virginia licenses. It further requires the Attorney General and the Superintendent of the State Police to provide certain annual reports to the Legislature, requiring the Attorney General to publish and annually revise a compendium of firearm and use of force laws. The bill provides for the disposition of applications for licenses to carry concealed weapons filed before and pending on the effective date of this article. The bill provides for classification of licenses to carry concealed weapons in effect on the effective date of this article, specifies procedures for upgrading or modifying class of license to carry concealed weapons, establishes emergency license to carry concealed weapons, eligibility criteria, license fee and creating uniform rule concerning the requirement to carry and exhibit license when carrying a concealed weapon for both West Virginia licensees and qualified out-of-state licensees. The bill conforms classes of persons prohibited from possessing firearms to federal law, clarifies conflicting statutory language, prohibits certain persons from carrying a concealed weapon in a public place and provides additional procedures for relief from weapons disabilities. The bill designates officials authorized to certify the transfer and registration of firearms subject to the National Firearms Act. It establishes time limit for designated officials to act on requests for certification, establishes uniform standard for approving or denying requested certifications and provides immunity from civil liability for lawfully performing required certifications. The bill prohibits licensed firearm dealers from refusing to sell or otherwise transfer a firearm to any person solely on the basis that the person purchased a firearm that was later the subject of a law-enforcement trace request, requires licensed firearms dealers to perform certain acts incident to firearm sales or transfers and prohibits the purchase or attempt to purchase a firearm from a firearm dealer by certain persons. The bill increases criminal penalties for any person other than a law-enforcement officer who knowingly solicits, persuades, encourages or entices any other person to violate firearm sales laws. It provides civil remedies for unlawful denial or delay of firearm sale or transfer. It specifies areas subject to prohibition on possession of deadly weapons on school premises, with exceptions, creates separate offense for possessing deadly weapon in school safety zone with the intent to use the deadly weapon unlawfully or to threaten or endanger another person and provides criminal penalties. The bill reduces criminal penalties for unlawful possession of deadly weapon in school safety zones without the intent to use the deadly weapon unlawfully or to threaten or endanger another person. It modifies requirements and procedures for suspending or revoking driver's license of person convicted of or adjudicated a juvenile delinquent for such offenses. It prohibits the possession or conveyance of deadly weapons into certain areas of courthouses and other places where judicial proceedings are held and declares certain persons exempt. It requires establishment of secure weapon storage areas and posting of signs and provides for the consolidation of required signage and secure weapon storage areas when premises contained within secure restricted access area. It provides for the establishment of secure restricted access areas in certain public buildings, procedures for establishment and prohibits the possession of or conveyance of deadly weapons into secure restricted access areas. The bill provides criminal penalties for possessing or conveying deadly weapons into restricted premises, signage requirements and requires the provision of secure weapon storage areas at secure restricted access areas for individuals to lawfully store firearms before entering secure restricted access area. The bill provides additional criminal penalties for the use or possession of firearms or other weapons during the commission of specified crimes. It exempts certain officers, employees and agents of the United States, this state or a political subdivision of this state from restrictions or prohibitions on possessing weapons imposed by private property owners, requiring all private property owners that have legally restricted or prohibited the possession or carrying of weapons on their premises to give notice of such prohibitions or restrictions by posting specified signs, provides the format of signs, effect of failure to properly post signs indicating such prohibition or restriction and provides immunity from civil liability to private property owners and private employers for certain acts or omissions of individuals licensed to carry concealed weapons or authorized to carry concealed weapons without a license if the private property owner or private employer voluntarily refrains from restricting the possession or carrying of deadly weapons by individuals licensed to carry concealed weapons or authorized to carry concealed weapons without a license. The bill prohibits a public or private employer from prohibiting a customer, employee or invitee from possessing any legally owned firearm or concealable weapon that is lawfully possessed and locked inside or locked to a private motor vehicle in a parking lot and prohibits a public or private employer from violating the privacy rights of a customer, employee or invitee by verbal or written inquiry regarding the presence of a firearm or concealable weapon inside or locked to a private motor vehicle in a parking lot or by the search of a private motor vehicle in a parking lot to ascertain the presence of a firearm or concealable weapon within the vehicle. It prohibits actions by a public or private employer against a customer, employee or invitee based upon verbal or written statements concerning possession of a firearm or concealable weapon stored inside a private motor vehicle in a parking lot for lawful purposes. It provides conditions under which a search of a private motor vehicle in the parking lot of a public or private employer may be conducted, prohibits a public or private employer from conditioning employment upon specified licensure status or upon a specified agreement, prohibits a public or private employer from attempting to prevent or prohibiting any customer, employee or invitee from entering the parking lot of the employer's place of business because the private motor vehicle of a customer, employee or invitee contains a legal firearm or concealable weapon and prohibits public or private employers from terminating the employment of or otherwise discriminating against an employee, or expelling a customer or invitee, for exercising his or her right to keep and bear arms or for exercising the right of self-defense. It provides a condition to the prohibition and that such prohibitions apply to all public-sector employers. It provides that, when subject to the prohibitions imposed by law, a public or private employer has no duty of care related to the actions prohibited, provides specified immunity from liability for public and private employers, provides nonapplicability of such immunity, provides construction and exceptions to certain prohibitions, provides for enforcement of certain prohibitions and provides for the award of reasonable personal costs and losses and award of court costs and attorney's fees. The bill declares the provisions of the West Virginia Code to be the sole means by which the keeping and bearing of arms may be regulated, preempting any ordinance, rule, policy or administrative action inconsistent therewith and stating exceptions. It provides for enforcement of prohibition on additional regulation of firearms or concealable weapons, provides rules of construction, prohibits the registration of firearms or firearm owners, with exceptions, provides compliance period for purging prohibited registries, limits seizures of concealable weapons and provides remedies for unlawful seizure of concealable weapon. The bill provides civil and criminal penalties for certain acts in violation of an individual's right to keep and bear arms and defines certain acts as per se official misconduct for purposes of removing public official from office. The bill establishes regulations for gun buy-back programs, establishes procedures to protect interests of owners of stolen firearms and preserve evidence of certain crimes, requires certain firearms disposed by a public agency to be offered for sale to licensed firearm dealers by public auction or sealed bids, procedures for public sale of certain firearms and requires award of court costs and attorney's fees in certain cases. The bill clarifies conflicting statutory language, updates references to licenses to carry concealed weapons in the state central mental health registry law and clarifies the permissible use of records in the central state mental health registry. The bill establishes statute of limitations for prosecuting certain crimes. It authorizes the setting aside and expungement of certain criminal convictions involving misdemeanor crimes of domestic violence. It defines eligible offenses. It provides a form and contents of petition, filing fee, service and notice requirements, prosecutor, victim and state agency opposition to petition, court procedure for hearing and ruling upon the petition, presumptions and burdens of proof, establishes procedures for expunging records and effects of set aside and expungement; and repeals or revising various archaic language  .", "pending_committee_id": 11, "committee": {"committee_id": 11, "chamber": "H", "chamber_id": 1, "name": "Judiciary"}, "referrals": [{"date": "2011-02-14", "committee_id": 11, "chamber": "H", "chamber_id": 1, "name": "Judiciary"}], "history": [{"date": "2011-02-14", "action": "Filed for introduction", "chamber": "", "chamber_id": 0, "importance": 0}, {"date": "2011-02-14", "action": "To Judiciary then Finance", "chamber": "", "chamber_id": 0, "importance": 0}, {"date": "2011-02-14", "action": "Introduced in House", "chamber": "", "chamber_id": 0, "importance": 1}, {"date": "2011-02-14", "action": "To House Judiciary", "chamber": "", "chamber_id": 0, "importance": 1}], "sponsors": [{"people_id": 75, "person_hash": "tugep434", "party_id": "2", "state_id": 48, "party": "R", "role_id": 1, "role": "Rep", "name": "William Romine", "first_name": "William", "middle_name": "Roger", "last_name": "Romine", "suffix": "", "nickname": "", "district": "HD-006", "ftm_eid": 6581821, "votesmart_id": 52469, "opensecrets_id": "", "knowwho_pid": 206314, "ballotpedia": "William_Romine", "sponsor_type_id": 0, "sponsor_order": 0, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 83, "person_hash": "p29tbwtq", "party_id": "1", "state_id": 48, "party": "D", "role_id": 1, "role": "Rep", "name": "Margaret Staggers", "first_name": "Margaret", "middle_name": "Anne", "last_name": "Staggers", "suffix": "", "nickname": "", "district": "HD-032", "ftm_eid": 7485049, "votesmart_id": 52436, "opensecrets_id": "", "knowwho_pid": 249567, "ballotpedia": "Margaret_Staggers", "sponsor_type_id": 0, "sponsor_order": 0, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 11207, "person_hash": "jxkhbjup", "party_id": "2", "state_id": 48, "party": "R", "role_id": 1, "role": "Rep", "name": "Larry Kump", "first_name": "Larry", "middle_name": "D.", "last_name": "Kump", "suffix": "", "nickname": "", "district": "HD-059", "ftm_eid": 6682528, "votesmart_id": 117682, "opensecrets_id": "", "knowwho_pid": 311648, "ballotpedia": "Larry_D._Kump", "sponsor_type_id": 0, "sponsor_order": 0, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 11305, "person_hash": "ou04zkbw", "party_id": "2", "state_id": 48, "party": "R", "role_id": 1, "role": "Rep", "name": "Eric Householder", "first_name": "Eric", "middle_name": "Lee", "last_name": "Householder", "suffix": "", "nickname": "", "district": "HD-064", "ftm_eid": 6682532, "votesmart_id": 117385, "opensecrets_id": "", "knowwho_pid": 293127, "ballotpedia": "Eric_Householder", "sponsor_type_id": 1, "sponsor_order": 0, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}], "sasts": [{"type_id": 1, "type": "Same As", "sast_bill_number": "SB543", "sast_bill_id": 279759}], "subjects": [{"subject_id": 3, "subject_name": "Acts"}], "texts": [{"doc_id": 165407, "date": "0000-00-00", "type": "Introduced", "type_id": 1, "mime": "text/html", "mime_id": 1, "url": "https://legiscan.com/WV/text/HB3125/id/165407", "state_link": "http://www.legis.state.wv.us/Bill_Status/bills_text.cfm?billdoc=hb3125%20intr.htm&yr=2011&sesstype=RS&i=3125", "text_size": 871796, "text_hash": "22197de9246059eeefbe08973d4dc0ec"}], "votes": [], "amendments": [], "supplements": [], "calendar": []}}