{"status": "OK", "bill": {"bill_id": 308153, "change_hash": "644762a81b8bf2821f4fe84d72957181", "session_id": 84, "session": {"session_id": 84, "state_id": 52, "year_start": 2011, "year_end": 2012, "prefile": 0, "sine_die": 1, "prior": 1, "special": 0, "session_tag": "Regular Session", "session_title": "2011-2012 Regular Session", "session_name": "112th Congress"}, "url": "https://legiscan.com/US/bill/HB1567/2011", "state_link": "https://www.congress.gov/bill/112th-congress/house-bill/1567/all-info", "completed": 0, "status": 1, "status_date": "2011-04-14", "progress": [{"date": "2011-04-14", "event": 1}, {"date": "2011-04-14", "event": 9}, {"date": "2011-07-29", "event": 9}, {"date": "2011-07-29", "event": 9}], "state": "US", "state_id": 52, "bill_number": "HB1567", "bill_type": "B", "bill_type_id": "1", "body": "H", "body_id": 114, "current_body": "H", "current_body_id": 114, "title": "Foreclosure Prevention and Sound Mortgage Servicing Act of 2011", "description": "Foreclosure Prevention and Sound Mortgage Servicing Act of 2011 - Amends the Real Estate Settlement Procedures Act of 1974 (RESPA) to require the mortgagee, upon default of a federally related mortgage loan secured by a lien on the borrower's principal residence, to engage in loss mitigation activities that provide for: (1) the long-term affordability of the loan, and (2) the maximum retention of home equity. Places upon the mortgagee of the senior lien on the residence the primary responsibility for such loss mitigation activities. Prohibits the mortgagee of any subordinate lien from interfering with or inhibiting the modification of the senior lien. Requires the mortgagee of a subordinate loan to comply with specified rules to modify the subordinate lien. Prohibits initiation, continuation, or completion of foreclosure on any mortgage loan if the mortgagee or servicer has at any time failed to comply with loss mitigation requirements. Makes filing of a certification of loss mitigation activities, with respect to a covered federally related mortgage loan, a condition precedent to: (1) any valid foreclosure sale, and (2) the filing of any action to recover possession of the residence by the purchaser at such a sale. Specifies priority, secondary, and last-resort mitigation activities, including the appropriate circumstances for each kind. Sets forth criteria regarding the affordability of scheduled payments due from the borrower or mortgagor under a covered federally related mortgage loan pursuant to loss mitigation activities.  Requires a mortgagee or servicer to explain to each requesting borrower or mortgagor why loss mitigation activities have been denied. Requires a mortgagee or servicer to provide the borrower with direct access to authorized loss mitigation personnel via a toll-free or collect-call telephone number. Prescribes general rules for third-party modification of a mortgage loan and consequent loss mitigation activities. Requires the servicer or mortgagee to forward to a housing counseling agency approved by the Secretary of Housing and Urban Development (HUD) the contact information of any borrower whose federally related mortgage loan payment is more than 60 days late. Prohibits a mortgagee from requiring a borrower, as a condition of loss mitigation activities, to: (1) waive or limit rights to certain legal actions against the mortgagee or servicer as a condition of accepting an offer of any loss mitigation activities, or (2) agree to arbitration as a condition of receiving loan modification activities. Specifies certain short sale and deed-in-lieu of foreclosure protections. Directs the Comptroller of the Currency to compile annually aggregate data by census tract for certain mortgagees in certain statistical areas. Requires the servicer of a mortgage loan to make available without charge, upon borrower's written request, specified account status information and documentation. Prohibits foreclosure proceedings while such a request is pending and the mortgagee or servicer has not complied with related requirements. Amends the Truth in Lending Act to prescribe: (1) the duties of standard of care governing lenders and loan servicers, and (2) fee assessments and disclosures. Prohibits fees for payoff statements. Amends RESPA to specify additional account information for the required notice by the transferor of a loan servicing contract at time of transfer. Directs the Director of the Bureau of Consumer Financial Protection of the Federal Reserve System and the federal banking regulatory agencies to issue regulations to ensure that the means and manner of compensation of servicers of federally related mortgage loans is consistent with the purposes of this Act and, to the extent possible, does not provide incentives for foreclosure of, or disincentives to engaging in reasonable loss mitigation activities for, such mortgages.", "pending_committee_id": 2588, "committee": {"committee_id": 2588, "chamber": "H", "chamber_id": 114, "name": "Subcommittee on Financial Institutions and Consumer Credit"}, "referrals": [{"date": "2011-04-14", "committee_id": 2304, "chamber": "H", "chamber_id": 114, "name": "Financial Services"}, {"date": "2011-07-29", "committee_id": 2590, "chamber": "H", "chamber_id": 114, "name": "Subcommittee on Insurance, Housing and Community Opportunity"}], "history": [{"date": "2011-04-14", "action": "Referred to the House Committee on Financial Services.", "chamber": "H", "chamber_id": 114, "importance": 1}, {"date": "2011-07-29", "action": "Referred to the Subcommittee on Insurance, Housing and Community Opportunity.", "chamber": "H", "chamber_id": 114, "importance": 1}, {"date": "2011-07-29", "action": "Referred to the Subcommittee on Financial Institutions and Consumer Credit.", "chamber": "H", "chamber_id": 114, "importance": 1}], "sponsors": [{"people_id": 9144, "person_hash": "ijja8k71", "party_id": "1", "state_id": 52, "party": "D", "role_id": 1, "role": "Rep", "name": "Maxine Waters", "first_name": "Maxine", "middle_name": "", "last_name": "Waters", "suffix": "", "nickname": "", "district": "HD-CA-43", "ftm_eid": 1257359, "votesmart_id": 26759, "opensecrets_id": "N00006690", "knowwho_pid": 158752, "ballotpedia": "Maxine_Waters", "sponsor_type_id": 1, "sponsor_order": 1, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 9023, "person_hash": "6f2n6oig", "party_id": "1", "state_id": 52, "party": "D", "role_id": 1, "role": "Rep", "name": "Emanuel Cleaver", "first_name": "Emanuel", "middle_name": "", "last_name": "Cleaver", "suffix": "", "nickname": "", "district": "HD-MO-5", "ftm_eid": 4396432, "votesmart_id": 39507, "opensecrets_id": "N00026790", "knowwho_pid": 226522, "ballotpedia": "Emanuel_Cleaver", "sponsor_type_id": 2, "sponsor_order": 2, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}], "sasts": [], "subjects": [{"subject_id": 13126, "subject_name": "Administrative law and regulatory procedures"}, {"subject_id": 13478, "subject_name": "Banking and financial institutions regulation"}, {"subject_id": 13322, "subject_name": "Civil actions and liability"}, {"subject_id": 13147, "subject_name": "Consumer affairs"}, {"subject_id": 13165, "subject_name": "Department of the Treasury"}, {"subject_id": 13832, "subject_name": "Federal Deposit Insurance Corporation (FDIC)"}, {"subject_id": 13636, "subject_name": "Federal Reserve System"}, {"subject_id": 13200, "subject_name": "Government information and archives"}, {"subject_id": 13202, "subject_name": "Government lending and loan guarantees"}, {"subject_id": 13220, "subject_name": "Housing finance and home ownership"}, {"subject_id": 13297, "subject_name": "Wages and earnings"}, {"subject_id": 13375, "subject_name": "Housing and community development"}], "texts": [{"doc_id": 254797, "date": "2011-04-20", "type": "Introduced", "type_id": 1, "mime": "application/pdf", "mime_id": 2, "url": "https://legiscan.com/US/text/HB1567/id/254797", "state_link": "https://www.congress.gov/112/bills/hr1567/BILLS-112hr1567ih.pdf", "text_size": 236395, "text_hash": "57a30ff195e1f9851cabbba23564ae9a"}], "votes": [], "amendments": [], "supplements": [], "calendar": []}}