{"status": "OK", "bill": {"bill_id": 334264, "change_hash": "ceb6f8efebab84d267f8231611d2d185", "session_id": 84, "session": {"session_id": 84, "state_id": 52, "year_start": 2011, "year_end": 2012, "prefile": 0, "sine_die": 1, "prior": 1, "special": 0, "session_tag": "Regular Session", "session_title": "2011-2012 Regular Session", "session_name": "112th Congress"}, "url": "https://legiscan.com/US/bill/SB1010/2011", "state_link": "https://www.congress.gov/bill/112th-congress/senate-bill/1010/all-info", "completed": 0, "status": 1, "status_date": "2011-05-17", "progress": [{"date": "2011-05-17", "event": 1}, {"date": "2011-05-17", "event": 9}], "state": "US", "state_id": 52, "bill_number": "SB1010", "bill_type": "B", "bill_type_id": "1", "body": "S", "body_id": 115, "current_body": "S", "current_body_id": 115, "title": "Postal Operations Sustainment and Transformation Act of 2011", "description": "Postal Operations Sustainment and Transformation Act of 2011 - Directs the Office of Personnel Management (OPM) to extend the redetermination of postal surplus or supplemental liability under the Civil Service Retirement System for each of FY2010 through FY2043 and report the results of such redetermination to the United States Postal Service (USPS) on or before June 30 of the subsequent fiscal year. Provides that if the result of a redetermination for a fiscal year is a surplus, that amount shall remain in the Civil Service Retirement and Disability Fund until distribution is authorized as follows: (1) if there is a surplus for FY2010-FY2016, such amount, or any part of it, may be transferred to the Postal Service Retiree Health Benefits Fund; (2) if there is a surplus for any of FY2017-FY2043, that amount, or any part of it, may be transferred to such Fund to pay any liability to such Fund; and (3) if all liability to such Fund is paid, amounts may be transferred to the Employees' Compensation Fund or to USPS for repayment of any obligation issued by it. Sets forth procedures for the transfer of such amounts. Prescribes the \"average pay\" and the appropriate percentage thereof to be used in determining annuities for civilian employment with USPS for purposes of provisions relating to future benefits attributable to such employment. Revises the method for calculating the Postal Service Retiree Health Benefits Fund liability. Requires OPM to provide data based on assumptions set by the Board of Actuaries of the Civil Service Retirement System and used in the actuarial valuations of the annuity and post-retirement health obligations of USPS. Requires USPS to develop a plan for the expansion of retail alternatives to post offices, such as self-service kiosks, vending machines, the Internet, Postal Service employees or contractors on delivery routes, and contract postal units.  Allows USPS to exercise its authority to: (1) establish service standards for market-dominant products, and (2) adjust the frequency of the delivery of such products. Requires USPS to obtain an advisory opinion from the Postal Regulatory Commission for any change in the nature of postal services relating to market-dominant products that will generally affect nationwide service. Requires the Commission to issue an advisory opinion not later than 90 days after receipt of a request from USPS.  Authorizes the shipping of wine and malt beverages by USPS. Permits USPS to provide other services that are not postal services if the provision of such services is consistent with the public interest, does not create unfair competition, and utilizes the existing postal network. Revises provisions relating to labor disputes in USPS to require the arbitration board to render a decision not later than 45 days after its appointment and to consider certain relevant factors in rendering a decision, including the financial condition of USPS.  Changes the date of the annual report of USPS to the Postal Regulatory Commission concerning costs, revenues, rates, and service from 90 days after the end of each year to the next January 15 after the end of each year. Includes USPS and the Postal Regulatory Commission as executive agencies for purposes of provisions relating to the resolution of public contract disputes.", "pending_committee_id": 0, "committee": [], "referrals": [{"date": "2011-05-17", "committee_id": 2329, "chamber": "S", "chamber_id": 115, "name": "Homeland Security And Governmental Affairs"}], "history": [{"date": "2011-05-17", "action": "Read twice and referred to the Committee on Homeland Security and Governmental Affairs.", "chamber": "S", "chamber_id": 115, "importance": 1}, {"date": "2011-09-06", "action": "Committee on Homeland Security and Governmental Affairs. Hearings held. Hearings printed: S.Hrg. 112-271.", "chamber": "S", "chamber_id": 115, "importance": 0}], "sponsors": [{"people_id": 9425, "person_hash": "dayilu15", "party_id": "1", "state_id": 52, "party": "D", "role_id": 2, "role": "Sen", "name": "Thomas Carper", "first_name": "Thomas", "middle_name": "R.", "last_name": "Carper", "suffix": "", "nickname": "", "district": "SD-DE", "ftm_eid": 8428238, "votesmart_id": 22421, "opensecrets_id": "N00012508", "knowwho_pid": 205484, "ballotpedia": "Tom_Carper", "sponsor_type_id": 1, "sponsor_order": 1, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}], "sasts": [{"type_id": 8, "type": "Related", "sast_bill_number": "HB2967", "sast_bill_id": 341351}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB3047", "sast_bill_id": 341659}], "subjects": [{"subject_id": 13126, "subject_name": "Administrative law and regulatory procedures"}, {"subject_id": 13175, "subject_name": "Employee benefits and pensions"}, {"subject_id": 13511, "subject_name": "Food industry and services"}, {"subject_id": 13198, "subject_name": "Government employee pay, benefits, personnel management"}, {"subject_id": 13203, "subject_name": "Government trust funds"}, {"subject_id": 13206, "subject_name": "Health care costs and insurance"}, {"subject_id": 13551, "subject_name": "Labor-management relations"}, {"subject_id": 13355, "subject_name": "Postal service"}, {"subject_id": 13357, "subject_name": "U.S. Postal Service"}, {"subject_id": 20687, "subject_name": "Alcoholic beverages"}, {"subject_id": 13356, "subject_name": "Government operations and politics"}], "texts": [{"doc_id": 318060, "date": "2011-05-31", "type": "Introduced", "type_id": 1, "mime": "application/pdf", "mime_id": 2, "url": "https://legiscan.com/US/text/SB1010/id/318060", "state_link": "https://www.congress.gov/112/bills/s1010/BILLS-112s1010is.pdf", "text_size": 211976, "text_hash": "71601e0223b160e8a15e250baab25e31"}], "votes": [], "amendments": [], "supplements": [], "calendar": []}}