{"status": "OK", "bill": {"bill_id": 339302, "change_hash": "f73c698d23bf893254108e8e2c47d5a6", "session_id": 84, "session": {"session_id": 84, "state_id": 52, "year_start": 2011, "year_end": 2012, "prefile": 0, "sine_die": 1, "prior": 1, "special": 0, "session_tag": "Regular Session", "session_title": "2011-2012 Regular Session", "session_name": "112th Congress"}, "url": "https://legiscan.com/US/bill/HB2551/2011", "state_link": "https://www.congress.gov/bill/112th-congress/house-bill/2551/all-info", "completed": 0, "status": 2, "status_date": "2011-07-22", "progress": [{"date": "2011-07-15", "event": 1}, {"date": "2011-07-22", "event": 2}, {"date": "2011-09-15", "event": 10}], "state": "US", "state_id": 52, "bill_number": "HB2551", "bill_type": "B", "bill_type_id": "1", "body": "H", "body_id": 114, "current_body": "S", "current_body_id": 115, "title": "Legislative Branch Appropriations Act, 2012", "description": "Legislative Branch Appropriations Act, 2012 - Title I: Legislative Branch - Makes appropriations to the Senate for FY2012 for: (1) expense allowances; (2) representation allowances for the Majority and Minority Leaders; (3) salaries of specified officers, employees, and committees (including the Committee on Appropriations); (4) agency contributions for employee benefits; (5) inquiries and investigations; (6) the U.S. Senate Caucus on International Narcotics Control; (7) the Offices of the Secretary and of the Sergeant at Arms and Doorkeeper of the Senate; (8) miscellaneous items; (9) the Senators' Official Personnel and Office Expense Account; and (10) official mail costs. (Sec. 1) Authorizes the Secretary of the Senate, if in any fiscal year amounts in any Senate appropriations account for the legislative branch are available for more than one fiscal year, to establish procedures for the payment of expenses with respect to that account from any amounts available for that fiscal year. Makes appropriations to the House of Representatives for FY2012 for: (1) salaries and/or expenses of the House leadership offices, committees (including the Committee on Appropriations), officers and employees; and (2) Members' representational allowances.  (Sec. 101) Requires deposit in the Treasury of any amounts of a Member's representational allowance remaining after all payments are made, to be used for federal deficit reduction, or, if there is no deficit, federal debt reduction. (Sec. 102) Amends the Legislative Branch Appropriations Act, 2005 to transfer authority to assign responsibilities to the Republican Policy Committee, and direct the obligation and expenditure of its allowance for salaries and expenses, from the chair of the Republican Conference to the Speaker of the House (or, if the Speaker is not a member of the Republican Party, the Minority Leader of the House). (Sec. 103) Grants authority to the Speaker and the Minority Leader of the House to allocate funds among specified offices. (Sec. 104) Amends the Legislative Branch Appropriations Act, 1999 to repeal the requirement for a 50%-50% allocation of funds between the Republican Conference and the Democratic Steering and Policy Committee for training and program development activities. Requires the Speaker and the Minority Leader to determine the terms and conditions under which such funds shall be paid for the activities of such organizations.  (Sec. 105) Amends the Emergency Supplemental Act, 2002 to abolish the House Office of Emergency Planning, Preparedness, and Operations (OEPPO).  Transfers and assigns OEPPO functions and responsibilities to the Sergeant at Arms of the House. Makes FY2012 appropriations for salaries and/or expenses of: (1) the Joint Economic Committee, the Joint Congressional Committee on Inaugural Ceremonies of 2013, and the Joint Committee on Taxation; (2) the Office of the Attending Physician; (3) the Office of Congressional Accessibility Services; (4) the Capitol Police; (5) the Office of Compliance; (6) the Congressional Budget Office (CBO); and (7) the Architect of the Capitol (AOC), including for the care and operation of Capitol buildings and grounds, Senate Office Buildings, House office buildings, the Capitol power plant, the Library of Congress buildings and grounds, the Capitol Police buildings, grounds, and security, the Botanic Garden, and the Capitol Visitor Center. (Sec. 1001) Amends the Legislative Branch Appropriations Act, 2002 with respect to the Senate employees student loan repayment program to make employees of the Office of Congressional Accessibility Services eligible to participate in the program. Prohibits such employees, however, from participating in both the federal student loan repayment program and the Senate student loan repayment program at the same time (dual participation). Appropriates FY2012 funds to: (1) the Library of Congress for salaries and expenses, the Copyright Office, the Congressional Research Service (CRS), and Books for the Blind and Physically Handicapped; (2) the Government Printing Office (GPO) for congressional printing and binding; (3) GPO for the Office of Superintendent of Documents; (4) the GPO Revolving Fund; (5) the Government Accountability Office (GAO) for salaries and expenses; (6) the Open World Leadership Center Trust Fund; and (7) the John C. Stennis Center for Public Service Development Trust Fund. (Sec. 1301) Establishes an upper limit of $169.725 million for the FY2012 obligational authority of the Library of Congress with regard to certain reimbursable and revolving fund activities.  Authorizes the Librarian of Congress to transfer temporarily up to $1.9 million of funds appropriated in this Act for Library of Congress salaries and expenses to the revolving fund for the FEDLINK Program and the Federal Research Program. (Sec. 1302) Authorizes the transfer of FY2012 Library of Congress appropriations between any \"Library of Congress\" headings, up to 10% per account, upon the approval of the congressional appropriations committees. (Sec. 1303) Makes balances of expired Library of Congress appropriations available to the Library to make a mandatory deposit to the credit of the Employees' Compensation Fund. (Sec. 1304) Authorizes the Librarian of Congress to dispose of surplus or obsolete Library personal property by inter-agency transfer, donation, sale, trade-in, or discarding. Requires receipts from such transactions to be credited to funds available for the Library's operations and available for the costs of acquiring similar property. (Sec. 1305) Amends the Library of Congress Fiscal Operations Improvement Act of 2000 to modify the use of the revolving fund established for duplication and delivery services associated with the national audiovisual conservation center to include storage of audiovisual materials. Adds traveling exhibitions and training to the authorized uses of the revolving fund established for the Library's gift shop, decimal classification, photo duplication, and related services. Revises a disclaimer on the disbursement of gifts, etc., to the Library to state that nothing in such Act shall be construed as prohibiting or restricting the Librarian of Congress from accepting in the name of the United States gifts or bequests of personal property, nonpersonal services, voluntary and uncompensated personal services, or money (as well as, under current law, gifts or bequests of money) for immediate disbursement in the interest of the Library, its collections, or its service. Prescribes reporting, disclosure, and notification requirements for the Librarian regarding such gifts or bequests. Title II: General Provisions - Specifies authorized and prohibited uses of funds appropriated by this Act identical or similar to corresponding provisions of the Legislative Branch Appropriations Act, 2011. (Sec. 207) Authorizes the AOC to maintain and improve the landscape features, excluding streets, in specified grassy areas of Washington, DC, SW. (Sec. 209) Prohibits the use of funds made available to the AOC in this Act to eliminate or restrict guided tours of the U.S. Capitol led by congressional employees and interns. Allows temporary suspension or restriction of such tours for security or related reasons to the same extent as guided tours of the U.S. Capitol led by the AOC. (Sec. 210) Rescinds specified unobligated balances available from prior year appropriations for the AOC.", "pending_committee_id": 0, "committee": [], "referrals": [{"date": "2011-07-22", "committee_id": 2319, "chamber": "S", "chamber_id": 115, "name": "Appropriations"}], "history": [{"date": "2011-07-15", "action": "The House Committee on Appropriations reported an original measure, H. Rept. 112-148, by Mr. Crenshaw.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2011-07-15", "action": "Placed on the Union Calendar, Calendar No. 95.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2011-07-20", "action": "Rules Committee Resolution H. Res. 359 Reported to House. Rule provides for consideration of H.R. 2551 with 1 hour of general debate. Previous question shall be considered as ordered without intervening motions except motion to recommit with or without instructions. Measure will be considered read. Specified amendments are in order.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2011-07-21", "action": "Rule H. Res. 359 passed House.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2011-07-21", "action": "ORDER OF BUSINESS - Mr. Crenshaw asked unanimous consent that during consideration of H.R. 2551, pursuant to House Resolution 359, the following amendments be permitted to be offered out of the specified order: Amendment No. 9 by Mr. Moran and Amendment No. 12 by Mr. Holt. Agreed to without objection.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2011-07-21", "action": "Considered under the provisions of rule H. Res. 359. (consideration: CR H5348-5369; text of Title I as reported in House: CR H5356-5359; text of Title II as reported in House: CR H5359-5360)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2011-07-21", "action": "Rule provides for consideration of H.R. 2551 with 1 hour of general debate. Previous question shall be considered as ordered without intervening motions except motion to recommit with or without instructions. Measure will be considered read. Specified amendments are in order.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2011-07-21", "action": "House resolved itself into the Committee of the Whole House on the state of the Union pursuant to H. Res. 359 and Rule XVIII.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2011-07-21", "action": "The Speaker designated the Honorable Rob Woodall to act as Chairman of the Committee.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2011-07-21", "action": "GENERAL DEBATE - The Committee of the Whole proceeded with one hour of general debate on H.R. 2551.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2011-07-21", "action": "H.AMDT.697 Amendment (A001) offered by Mr. Honda. (consideration: CR H5360; text: CR H5360)Amendment transfers $1 million in funding from transitioning costs to the Capitol Police fund for Member's District Office Security Upgrades.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2011-07-21", "action": "DEBATE - Pursuant to the provisions of H.Res. 359, the Committee of the Whole proceeded with 10 minutes of debate on the Honda amendment.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2011-07-21", "action": "H.AMDT.697 On agreeing to the Honda amendment Agreed to by voice vote.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2011-07-21", "action": "H.AMDT.698 Amendment (A002) offered by Mr. Watt. (consideration: CR H5360-5362; text: CR H5360)Amendment sought to reduce funding for the Office of Congressional Ethics (OCE) by $619,200 and to apply the savings to the spending reduction account.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2011-07-21", "action": "DEBATE - Pursuant to the provisions of H.Res. 359, the Committee of the Whole proceeded with 10 minutes of debate on the Watt (NC) amendment.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2011-07-21", "action": "POSTPONED PROCEEDINGS - At the conclusion of debate on the Watt(NC) amendment, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Mr. Watt(NC) demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2011-07-21", "action": "H.AMDT.699 Amendment (A003) offered by Mr. Broun (GA). (consideration: CR H5362; text: CR H5362)Amendment sought to reduce funding for the Joint Economic Committee by $1,050,750 (25%) and to apply the savings to the spending reduction account.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2011-07-21", "action": "DEBATE - Pursuant to the provisions of H.Res. 359, the Committee of the Whole proceeded with 10 minutes of debate on the Broun (GA) amendment.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2011-07-21", "action": "H.AMDT.699 On agreeing to the Broun (GA) amendment (A003) Failed by voice vote.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2011-07-21", "action": "H.AMDT.700 Amendment (A004) offered by Mr. Broun (GA). (consideration: CR H5362-5363; text: CR H5362)Amendment sought to reduce funding for the Office of Compliance by $467,000 and to apply the savings to the spending reduction account.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2011-07-21", "action": "DEBATE - Pursuant to the provisions of H. Res. 359, the Committee of the Whole proceeded with 10 minutes of debate on the Broun (GA) amendment.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2011-07-21", "action": "H.AMDT.700 On agreeing to the Broun (GA) amendment (A004) Failed by voice vote.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2011-07-21", "action": "H.AMDT.701 Amendment (A005) offered by Ms. Hayworth. (consideration: CR H5363-5364; text: CR H5363)Amendment to reduce funding for the Botanic Garden by $632,780 and to apply the savings to the spending reduction account.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2011-07-21", "action": "DEBATE - Pursuant to the provisions of H. Res. 359, the Committee of the Whole proceeded with 10 minutes of debate on the Hayworth amendment.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2011-07-21", "action": "POSTPONED PROCEEDINGS - At the conclusion of debate on the Hayworth amendment, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Ms. Hayworth demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2011-07-21", "action": "H.AMDT.702 Amendment (A006) offered by Mr. Broun (GA). (consideration: CR H5364-5365; text: CR H5364)Amendment sought to reduce funding for the Botanic Garden by $3,192,000 and to apply the savings to the spending reduction account.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2011-07-21", "action": "DEBATE - Pursuant to the provisions of H. Res. 359, the Committee of the Whole proceed with 10 minutes of debate on the Broun (GA) amendment.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2011-07-21", "action": "POSTPONED PROCEEDINGS - At the conclusion of debate on the Broun (GA) amendment, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Mr. Broun (GA) demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2011-07-21", "action": "H.AMDT.703 Amendment (A007) offered by Mr. Altmire. (consideration: CR H5365; text: CR H5365)Amendment, as modified, restores $1 million in funding for the Thirty-Year Mass Deacidification Program at the Library of Congress.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2011-07-21", "action": "H.AMDT.703 Altmire amendment (A007) modified by unanimous consent.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2011-07-21", "action": "DEBATE - Pursuant to the provisions of H. Res. 359, the Committee of the Whole proceeded with 10 minutes of debate on the Altmire amendment, as modified.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2011-07-21", "action": "H.AMDT.703 On agreeing to the Altmire amendment (A007) as modified Agreed to by voice vote. (text as modified: CR H5365)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2011-07-21", "action": "H.AMDT.704 Amendment (A008) offered by Mr. Stutzman. (consideration: CR H5365-5367; text: CR H5365)Amendment reduces GPO funding by $4,946,140.80 and apply the savings to the spending reduction account.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2011-07-21", "action": "DEBATE - Pursuant to the provisions of H. Res. 359, the Committee of the Whole proceeded with 10 minutes of debate on the Stutzman amendment.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2011-07-21", "action": "POSTPONED PROCEEDINGS - At the conclusion of debate on the Stutzman amendment, the Chair put the question on adoption of the amendment and by voice vote, announced that the ayes had prevailed. Mr. Crenshaw demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2011-07-21", "action": "H.AMDT.705 Amendment (A009) offered by Mr. Paulsen. (consideration: CR H5367; text: CR H5367)An amendment numbered 13 printed in House Report 112-173 to prevent the distribution of printed legislation to Member offices unless a Member requests the legislation.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2011-07-21", "action": "DEBATE - Pursuant to the provisions of H. Res. 359, the Committee of the Whole proceeded with 10 minutes of debate on the Paulsen amendment.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2011-07-21", "action": "H.AMDT.705 On agreeing to the Paulsen amendment (A009) Agreed to by voice vote.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2011-07-21", "action": "H.AMDT.706 Amendment (A010) offered by Mr. Paulsen. (consideration: CR H5367; text: CR H5367)An amendment numbered 14 printed in House Report 112-173 to prevent use of funds to distribute printed copies of the Congressional Record to Member offices.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2011-07-21", "action": "DEBATE - Pursuant to the provisions of H. Res. 359, the Committee of the Whole proceeded with 10 minutes of debate on the Paulsen amendment.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2011-07-21", "action": "H.AMDT.706 On agreeing to the Paulsen amendment (A010) Agreed to by voice vote.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2011-07-21", "action": "H.AMDT.707 Amendment (A011) offered by Mr. Thompson (PA). (consideration: CR H5367-5369; text: CR H5368)An amendment numbered 15 printed in House Report 112-173 to prohibit use of funds to purchase, acquire, install, or use any medium screw base compact fluorescent lamp or light bulb (CFL).", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2011-07-21", "action": "DEBATE - Pursuant to the provisions of H. Res. 359, the Committee of the Whole proceeded with 10 minutes of debate on the Thompson (PA) amendment.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2011-07-21", "action": "POSTPONED PROCEEDINGS - At the conclusion of debate on the Thompson (PA) amendment, the Chair put the question on adoption of the amendment and by voice vote, announced that the ayes had prevailed. Mr. Honda demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2011-07-21", "action": "H.AMDT.708 Amendment (A012) offered by Mr. Hanna. (consideration: CR H5369; text: CR H5369)An amendment numbered 16 printed in House Report 112-173 to prohibit use of funds by the Chief Administrative Officer to make any payments from any MRA for the leasing of a vehicle in an amount that exceeds $1,000 in any month.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2011-07-21", "action": "DEBATE - Pursuant to the provisions of H. Res. 359, the Committee of the Whole proceeded with 10 minutes of debate on the Hanna amendment.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2011-07-21", "action": "H.AMDT.708 On agreeing to the Hanna amendment (A012) Agreed to by voice vote.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2011-07-21", "action": "Mr. Crenshaw moved that the Committee rise.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2011-07-21", "action": "On motion that the Committee rise Agreed to by voice vote.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2011-07-21", "action": "Committee of the Whole House on the state of the Union rises leaving H.R. 2551 as unfinished business.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2011-07-21", "action": "ORDER OF PROCEDURE - Mr. Crenshaw asked unanimous consent that during further consideration of H.R. 2551 pursuant to H. Res. 359, the following amendments be permitted to be offered out of the specified order: Amendment No. 10 by Mr. Flake; Amendment No. 11 by Mr. Flake. Agreed to without objection.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2011-07-21", "action": "Considered as unfinished business. (consideration: CR H5369-5372)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2011-07-21", "action": "The House resolved into Committee of the Whole House on the state of the Union for further consideration.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2011-07-21", "action": "H.AMDT.709 Amendment (A013) offered by Mr. Flake. (consideration: CR H5370-5371; text: CR H5370)An amendment numbered 10 printed in House Report 112-173 to require all mail funded by the Members' representational allowance and from funds for official mail for committees and leadership offices of the House bear the official letterhead of the Member, committee, or office involved.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2011-07-21", "action": "DEBATE - Pursuant to the provisions of H. Res. 359, the Committee of the Whole proceeded with 10 minutes of debate on the Flake amendment.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2011-07-21", "action": "H.AMDT.709 On agreeing to the Flake amendment (A013) Failed by voice vote.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2011-07-21", "action": "H.AMDT.710 Amendment (A014) offered by Mr. Flake. (consideration: CR H5371-5372; text: CR H5371)An amendment numbered 11 printed in House Report 112-173 to prohibit use of funds by Members, committees, and leadership for purchase of online ads that link to a website maintained by Members, committees, and leadership offices.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2011-07-21", "action": "DEBATE - Pursuant to the provisions of H. Res. 359, the Committee of the Whole proceeded with 10 minutes of debate on the Flake amendment.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2011-07-21", "action": "H.AMDT.710 On agreeing to the Flake amendment (A014) Failed by voice vote.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2011-07-21", "action": "Mr. Crenshaw moved that the committee rise.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2011-07-21", "action": "On motion that the committee rise Agreed to by voice vote.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2011-07-21", "action": "Committee of the Whole House on the state of the Union rises leaving H.R. 2551 as unfinished business.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2011-07-22", "action": "Considered as unfinished business. (consideration: CR H5378-5381)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2011-07-22", "action": "The House resolved into Committee of the Whole House on the state of the Union for further consideration.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2011-07-22", "action": "H.AMDT.711 Amendment (A015) offered by Mr. Holt. (consideration: CR H5379-5380, H5385-5386; text: CR H5379)An amendment numbered 12 printed in House Report 112-173 to provide $2.5 million for the congressional Office of Technology Assessment and reduce funding for the House Historic Buildings Revitalization Trust Fund by the same amount.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2011-07-22", "action": "DEBATE - Pursuant to the provisions of H.Res. 359, the Committee of the Whole proceeded with 10 minutes of debate on the Holt amendment.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2011-07-22", "action": "POSTPONED PROCEEDINGS - At the conclusion of debate on the Holt amendment, the Chair put the question on adoption of the amendment and by voice vote, announced that the ayes had prevailed. Mr. Crenshaw demanded a recorded vote and the Chair postponed proceedings on the question of adoption of the amendment until a time to be announced.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2011-07-22", "action": "H.AMDT.712 Amendment (A016) offered by Mr. Moran. (consideration: CR H5380-5381, H5386-5387; text: CR H5380)An amendment numbered 9 printed in House Report 112-173 to prohibit the use of funds for polystyrene containers in the food service facilities of the House of Representatives.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2011-07-22", "action": "DEBATE - Pursuant to the provisions of H.Res. 359, the Committee of the Whole proceeded with 10 minutes of debate on the Moran amendment.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2011-07-22", "action": "POSTPONED PROCEEDINGS - At the conclusion of debate on the Moran amendment, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Mr. Moran demanded a recorded vote and the Chair postponed proceedings on the question of adoption of the amendment until a time to be announced.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2011-07-22", "action": "Mr. Crenshaw moved that the committee rise.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2011-07-22", "action": "On motion that the committee rise Agreed to by voice vote.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2011-07-22", "action": "Considered as unfinished business. (consideration: CR H5382-5387)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2011-07-22", "action": "The House resolved into Committee of the Whole House on the state of the Union for further consideration.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2011-07-22", "action": "UNFINISHED BUSINESS - The Chair announced that the unfinished business was on adoption of amendments, which were debated earlier and on which further proceedings were postponed.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2011-07-22", "action": "H.AMDT.698 On agreeing to the Watt amendment (A002) Failed by recorded vote: 102 - 302, 7 Present (Roll no. 622). (consideration: CR H5382-5383)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2011-07-22", "action": "H.AMDT.701 On agreeing to the Hayworth amendment (A005) Agreed to by recorded vote: 299 - 112 (Roll no. 623). (consideration: CR H5383)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2011-07-22", "action": "H.AMDT.702 On agreeing to the Broun (GA) amendment (A006) Failed by recorded vote: 153 - 260 (Roll no. 624). (consideration: CR H5383-5384)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2011-07-22", "action": "H.AMDT.704 On agreeing to the Stutzman amendment (A008) Agreed to by recorded vote: 218 - 194 (Roll no. 625). (consideration: CR H5384-5385)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2011-07-22", "action": "H.AMDT.707 On agreeing to the Thompson (PA) amendment (A011) Failed by recorded vote: 130 - 283 (Roll no. 626). (consideration: CR H5385)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2011-07-22", "action": "H.AMDT.711 On agreeing to the Holt amendment (A015) Failed by recorded vote: 176 - 235 (Roll no. 627).", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2011-07-22", "action": "H.AMDT.712 On agreeing to the Moran amendment (A016) Failed by recorded vote: 179 - 234 (Roll no. 628).", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2011-07-22", "action": "The House rose from the Committee of the Whole House on the state of the Union to report H.R. 2551.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2011-07-22", "action": "The previous question was ordered pursuant to the rule. (consideration: CR H5387)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2011-07-22", "action": "The House adopted the amendment in the nature of a substitute as agreed to by the Committee of the Whole House on the state of the Union.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2011-07-22", "action": "On passage Passed by the Yeas and Nays: 252 - 159 (Roll no. 629).", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2011-07-22", "action": "Motion to reconsider laid on the table Agreed to without objection.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2011-07-22", "action": "Received in the Senate and Read twice and referred to the Committee on Appropriations.", "chamber": "S", "chamber_id": 115, "importance": 1}, {"date": "2011-09-15", "action": "Committee on Appropriations. Ordered to be reported with an amendment in the nature of a substitute favorably.", "chamber": "S", "chamber_id": 115, "importance": 1}, {"date": "2011-09-15", "action": "Committee on Appropriations. Reported by Senator Nelson NE, with an amendment in the nature of a substitute. With written report No. 112-80.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2011-09-15", "action": "Placed on Senate Legislative Calendar under General Orders. Calendar No. 172.", "chamber": "S", "chamber_id": 115, "importance": 0}], "sponsors": [{"people_id": 9178, "person_hash": "95kqpg01", "party_id": "2", "state_id": 52, "party": "R", "role_id": 1, "role": "Rep", "name": "Ander Crenshaw", "first_name": "Ander", "middle_name": "", "last_name": "Crenshaw", "suffix": "", "nickname": "", "district": "HD-FL-4", "ftm_eid": 17657418, "votesmart_id": 31130, "opensecrets_id": "N00012739", "knowwho_pid": 205747, "ballotpedia": "Ander_Crenshaw", "sponsor_type_id": 1, "sponsor_order": 1, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}], "sasts": [{"type_id": 8, "type": "Related", "sast_bill_number": "HR359", "sast_bill_id": 339407}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB2055", "sast_bill_id": 334307}], "subjects": [{"subject_id": 13134, "subject_name": "Appropriations"}, {"subject_id": 13820, "subject_name": "Architect of the Capitol"}, {"subject_id": 13894, "subject_name": "Books and print media"}, {"subject_id": 13775, "subject_name": "Congressional Budget Office (CBO)"}, {"subject_id": 13826, "subject_name": "Congressional Research Service (CRS)"}, {"subject_id": 13145, "subject_name": "Congressional agencies"}, {"subject_id": 13677, "subject_name": "Congressional committees"}, {"subject_id": 13827, "subject_name": "Congressional leadership"}, {"subject_id": 13585, "subject_name": "Congressional officers and employees"}, {"subject_id": 13146, "subject_name": "Congressional oversight"}, {"subject_id": 13472, "subject_name": "Emergency planning and evacuation"}, {"subject_id": 13195, "subject_name": "Government Accountability Office (GAO)"}, {"subject_id": 13839, "subject_name": "Government Printing Office (GPO)"}, {"subject_id": 13196, "subject_name": "Government buildings, facilities, and property"}, {"subject_id": 13203, "subject_name": "Government trust funds"}, {"subject_id": 13590, "subject_name": "House of Representatives"}, {"subject_id": 13614, "subject_name": "Intellectual property"}, {"subject_id": 13615, "subject_name": "International exchange and broadcasting"}, {"subject_id": 13844, "subject_name": "Joint Committee on Taxation"}, {"subject_id": 13845, "subject_name": "Joint Economic Committee"}, {"subject_id": 13469, "subject_name": "Law enforcement officers"}, {"subject_id": 13760, "subject_name": "Library of Congress"}, {"subject_id": 13588, "subject_name": "Members of Congress"}, {"subject_id": 13793, "subject_name": "Senate"}, {"subject_id": 13526, "subject_name": "U.S. Capitol"}, {"subject_id": 13468, "subject_name": "Worker safety and health"}, {"subject_id": 13525, "subject_name": "Congress"}], "texts": [{"doc_id": 345632, "date": "2011-07-15", "type": "Introduced", "type_id": 1, "mime": "application/pdf", "mime_id": 2, "url": "https://legiscan.com/US/text/HB2551/id/345632", "state_link": "https://www.congress.gov/112/bills/hr2551/BILLS-112hr2551rh.pdf", "text_size": 225635, "text_hash": "8a143805f80c7bc0c3b7a139ad7c9aa5"}, {"doc_id": 347718, "date": "2011-07-22", "type": "Engrossed", "type_id": 4, "mime": "application/pdf", "mime_id": 2, "url": "https://legiscan.com/US/text/HB2551/id/347718", "state_link": "https://www.congress.gov/112/bills/hr2551/BILLS-112hr2551eh.pdf", "text_size": 196030, "text_hash": "59e699ad33bc1e3c88e896241fb70d22"}, {"doc_id": 363261, "date": "2011-09-16", "type": "Introduced", "type_id": 1, "mime": "application/pdf", "mime_id": 2, "url": "https://legiscan.com/US/text/HB2551/id/363261", "state_link": "https://www.congress.gov/112/bills/hr2551/BILLS-112hr2551rs.pdf", "text_size": 367805, "text_hash": "b266a4cb5dd435bcdbfd29228f0e3786"}], "votes": [{"roll_call_id": 219364, "date": "2011-07-22", "desc": "On Agreeing to the Amendment", "yea": 102, "nay": 302, "nv": 28, "absent": 0, "total": 432, "passed": 0, "chamber": "H", "chamber_id": 114, "url": "https://legiscan.com/US/rollcall/HB2551/id/219364", "state_link": "https://clerk.house.gov/Votes/2011622"}, {"roll_call_id": 219365, "date": "2011-07-22", "desc": "On Agreeing to the Amendment", "yea": 299, "nay": 112, "nv": 21, "absent": 0, "total": 432, "passed": 1, "chamber": "H", "chamber_id": 114, "url": "https://legiscan.com/US/rollcall/HB2551/id/219365", "state_link": "https://clerk.house.gov/Votes/2011623"}, {"roll_call_id": 219366, "date": "2011-07-22", "desc": "On Agreeing to the Amendment", "yea": 153, "nay": 260, "nv": 19, "absent": 0, "total": 432, "passed": 0, "chamber": "H", "chamber_id": 114, "url": "https://legiscan.com/US/rollcall/HB2551/id/219366", "state_link": "https://clerk.house.gov/Votes/2011624"}, {"roll_call_id": 219367, "date": "2011-07-22", "desc": "On Agreeing to the Amendment", "yea": 218, "nay": 194, "nv": 20, "absent": 0, "total": 432, "passed": 1, "chamber": "H", "chamber_id": 114, "url": "https://legiscan.com/US/rollcall/HB2551/id/219367", "state_link": "https://clerk.house.gov/Votes/2011625"}, {"roll_call_id": 219368, "date": "2011-07-22", "desc": "On Agreeing to the Amendment", "yea": 130, "nay": 283, "nv": 19, "absent": 0, "total": 432, "passed": 0, "chamber": "H", "chamber_id": 114, "url": "https://legiscan.com/US/rollcall/HB2551/id/219368", "state_link": "https://clerk.house.gov/Votes/2011626"}, {"roll_call_id": 219369, "date": "2011-07-22", "desc": "On Agreeing to the Amendment", "yea": 176, "nay": 235, "nv": 21, "absent": 0, "total": 432, "passed": 0, "chamber": "H", "chamber_id": 114, "url": "https://legiscan.com/US/rollcall/HB2551/id/219369", "state_link": "https://clerk.house.gov/Votes/2011627"}, {"roll_call_id": 219370, "date": "2011-07-22", "desc": "On Agreeing to the Amendment", "yea": 179, "nay": 234, "nv": 19, "absent": 0, "total": 432, "passed": 0, "chamber": "H", "chamber_id": 114, "url": "https://legiscan.com/US/rollcall/HB2551/id/219370", "state_link": "https://clerk.house.gov/Votes/2011628"}, {"roll_call_id": 219371, "date": "2011-07-22", "desc": "On Passage", "yea": 252, "nay": 159, "nv": 21, "absent": 0, "total": 432, "passed": 1, "chamber": "H", "chamber_id": 114, "url": "https://legiscan.com/US/rollcall/HB2551/id/219371", "state_link": "https://clerk.house.gov/Votes/2011629"}], "amendments": [], "supplements": [], "calendar": []}}