{"status": "OK", "bill": {"bill_id": 348848, "change_hash": "726996a7d61ac4e8da2ab1c6517f9057", "session_id": 342, "session": {"session_id": 342, "state_id": 14, "year_start": 2012, "year_end": 2012, "prefile": 0, "sine_die": 1, "prior": 1, "special": 0, "session_tag": "Regular Session", "session_title": "2012 Regular Session", "session_name": "2012 Regular Session"}, "url": "https://legiscan.com/IN/bill/SB0314/2012", "state_link": "http://www.in.gov/apps/lsa/session/billwatch/billinfo?year=2012&session=1&request=getBill&doctype=SB&docno=0314", "completed": 0, "status": 1, "status_date": "2012-01-05", "progress": [{"date": "2012-01-05", "event": 1}, {"date": "2012-01-05", "event": 9}], "state": "IN", "state_id": 14, "bill_number": "SB0314", "bill_type": "B", "bill_type_id": "1", "body": "S", "body_id": 38, "current_body": "S", "current_body_id": 38, "title": "Public deposit insurance fund.", "description": "Allows the board for depositories to merge with a domestic nonprofit corporation if certain conditions are met, including the approval of a resolution of merger and conversion by the board of directors and voting members of the domestic nonprofit corporation. Requires the surviving nonprofit corporation of the merger, known as the public deposit insurance corporation, to deliver to the secretary of state articles of merger that include certain information regarding the merger. Allows the secretary of state to approve or disapprove the articles of merger. Establishes the effect of the merger, including that the: (1) surviving nonprofit corporation does not have the statutory rights, privileges, immunities, and powers and is not subject to the statutory duties, restrictions, penalties, and liabilities of the board for depositories unless specifically expressed otherwise in law; and (2) title to real property and other property owned by each party to the merger is vested in the surviving nonprofit corporation, including the public deposit insurance fund (which, under the management of the public deposit insurance corporation, is called the corporation insurance fund.) Requires the merging nonprofit corporation to comply with the laws relating to mergers of nonprofits except for a provision that requires court approval or when the requirements are otherwise inconsistent with the provisions governing the merger with the board for depositories. Provides that all property in the corporation insurance fund and all property otherwise held by the public deposit insurance corporation is exempt from all taxes imposed by the state or any political subdivision. Establishes certain immunity for members of the board of directors and any officers, members, or employees of the public deposit insurance corporation. Provides for the expiration of provisions that: (1) create the board for depositories; and (2) establish the duties, restrictions, penalties, and liabilities regarding the board for depositories and the management of the public deposit insurance fund. Allows the secretary of state to file an affidavit with the governor requesting that the board for depositories continue administering the public deposit insurance fund if the board for depositories and a nonprofit corporation fail to merge by a certain date and requires the governor, within 10 days, to issue an executive order that allows the board for depositories to continue to administer the public deposit insurance fund until a certain date. Changes references from the \"board for depositories\" to the \"public deposit insurance corporation.\" Changes references from the \"public deposit insurance fund\" to the \"corporation insurance fund.\" Makes other changes related to the expiration of the provisions regarding the board for depositories.", "pending_committee_id": 1310, "committee": {"committee_id": 1310, "chamber": "S", "chamber_id": 38, "name": "Appropriations"}, "referrals": [], "history": [{"date": "2012-01-05", "action": "Authored by Senators Holdman and Hershman", "chamber": "", "chamber_id": 0, "importance": 0}, {"date": "2012-01-05", "action": "First reading: referred to Committee on Appropriations", "chamber": "", "chamber_id": 0, "importance": 1}], "sponsors": [{"people_id": 5581, "person_hash": "zoe5yxoi", "party_id": "2", "state_id": 14, "party": "R", "role_id": 2, "role": "Sen", "name": "Travis Holdman", "first_name": "Travis", "middle_name": "", "last_name": "Holdman", "suffix": "", "nickname": "", "district": "SD-019", "ftm_eid": 6682329, "votesmart_id": 100497, "opensecrets_id": "", "knowwho_pid": 263957, "ballotpedia": "Travis_Holdman", "sponsor_type_id": 0, "sponsor_order": 0, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 5602, "person_hash": "0gs0yn1i", "party_id": "2", "state_id": 14, "party": "R", "role_id": 2, "role": "Sen", "name": "Brandt Hershman", "first_name": "Brandt", "middle_name": "", "last_name": "Hershman", "suffix": "", "nickname": "", "district": "SD-007", "ftm_eid": 6592197, "votesmart_id": 34280, "opensecrets_id": "", "knowwho_pid": 160634, "ballotpedia": "Brandt_Hershman", "sponsor_type_id": 0, "sponsor_order": 0, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}], "sasts": [], "subjects": [], "texts": [{"doc_id": 507959, "date": "0000-00-00", "type": "Introduced", "type_id": 1, "mime": "text/html", "mime_id": 1, "url": "https://legiscan.com/IN/text/SB0314/id/507959", "state_link": "http://www.in.gov/legislative/bills/2012/IN/IN0314.1.html", "text_size": 101272, "text_hash": "92ab1074c8881703c67cf4083a6e9523"}], "votes": [], "amendments": [], "supplements": [], "calendar": []}}