{"status": "OK", "bill": {"bill_id": 423426, "change_hash": "fb795f4dc6a82dd95afe2e8b84bbb7d7", "session_id": 104, "session": {"session_id": 104, "state_id": 8, "year_start": 2011, "year_end": 2012, "prefile": 0, "sine_die": 1, "prior": 1, "special": 0, "session_tag": "Regular Session", "session_title": "2011-2012 Regular Session", "session_name": "146th General Assembly"}, "url": "https://legiscan.com/DE/bill/HB318/2011", "state_link": "http://legis.delaware.gov/LIS/lis146.nsf/2bede841c6272c888025698400433a04/468bfbb94bf32651852579d500497d2e?OpenDocument", "completed": 1, "status": 4, "status_date": "2012-07-18", "progress": [{"date": "2012-05-01", "event": 1}, {"date": "2012-05-01", "event": 9}, {"date": "2012-06-07", "event": 2}, {"date": "2012-06-13", "event": 9}, {"date": "2012-06-21", "event": 3}, {"date": "2012-07-18", "event": 4}], "state": "DE", "state_id": 8, "bill_number": "HB318", "bill_type": "B", "bill_type_id": "1", "body": "H", "body_id": 25, "current_body": "H", "current_body_id": 25, "title": "An Act To Amend Chapter 176, Volume 74 Laws Of Delaware, As Amended, Relating To The Charter Of The Town Of Smyrna.", "description": "Section 1 creates a simpler mechanism to update the Town’s municipal boundaries. Section 2 updates and revises annexation procedures in the Town. Under these procedures, an annexation vote is not required where 1) all persons of record either petition the annexation or consent in writing to the annexation and 2) no one who would have qualified to vote, had an annexation vote been held, files a written objection to the annexation. When an annexation vote is required, individuals and entities owning property in the annexation area are authorized to vote, as are residents of the annexation area who would qualify to vote in a Town election if the territory were to be annexed into Town. The section outlines the procedures for holding annexation elections, as well as the annexation procedures to be followed by the Town Council and Planning Commission. Section 3 authorizes the Town to enact civil penalties or criminal penalties. Section 4 provides a mechanism for the Town to ensure code compliance when common property owned by an association is not maintained in accordance with the Town Code. Section 5 outlines the representation of the Town through Council members elected at-large and through representative districts, requires the Town to review the districts with the release of each decennial census to verify that districts are reasonably equal in population, and this section outlines procedures to be followed when new districts are created. This section outlines qualifications to run for Council and addresses what happens when no one files to run for a Council seat. This section outlines the election procedures that are followed in the Town and revises the procedures to conform to the Delaware Municipal Elections statute. Section 6 prohibits elected officials from taking office sooner than 7 days following an election (in compliance with the Delaware Municipal Elections statute). Section 7 outlines the duties and powers of the Mayor and procedural steps required for the Mayor to act in instances of emergency. Section 8 deletes the provisions prohibiting contracting with the Town because this is controlled by 29 Del. C. Ch. 58. Section 9 outlines educational opportunities available to the Town Council and authorizes reimbursement for business expenses. Section 10 specifies the Town Manager’s appointment, responsibilities, and contract provisions. Section 11 sets forth procedures for the Mayor to appoint, and Council to confirm, boards, commissions, and committees. Section 12 changes the deadline for the budget from the second Council meeting in December to the first Council meeting in December. Section 13 corrects a typographical error that exists in the current Charter. Section 14 changes the audit deadline from April 15 to June 30. Section 15 specifies that the Board of Assessment shall be composed of 3 people who serve for a one-year term. Section 16 requires the Town Council to assess property of the Board of Assessment by an affirmative vote of five Council members. Section 17 clarifies that the Town may add to tax bills expenses the Town incurs to bring a property into compliance with the Town Code. Section 18 clarifies that notice of the annual assessment shall include procedures for appealing the assessment. Section 19 allows two or three members of Council to hear assessment appeals of taxpayers and clarifies that a Board of Assessment member shall be available at the appeals hearing. Section 20 allows two or three members of Council to hear supplemental assessment appeals. Section 21 changes the deadline for paying taxes early (in order to receive a discount) from June to July. Section 22 amends the Town Manager’s tax collection powers to comply with Title 9 as it has been recently amended. Section 23 authorizes the Town’s Board of Elections to act as the Board of Special Elections in borrowing proceedings and specifies that the voting polls in such proceedings shall be open for at least 6 hours. Section 24 authorizes the Town Council to delegate the authority to determine the form of bonds (e.g. interest rate, classes, series, maturity, callable or redeemable features) to the Town Manager, Mayor or a special committee. Section 25 clarifies that the Town’s electric generation powers include renewable energy, such as solar power, and include the leasing electric facilities. Section 26 limits owners of more than one parcel in an unfinished subdivision or phase of a subdivision to only one vote in special elections for long-term borrowing. Section 27 makes this bill effective upon its enactment.", "pending_committee_id": 0, "committee": [], "referrals": [{"date": "2012-05-01", "committee_id": 1655, "chamber": "H", "chamber_id": 25, "name": "Administration"}, {"date": "2012-06-13", "committee_id": 1676, "chamber": "S", "chamber_id": 26, "name": "Community/County Affairs"}], "history": [{"date": "2012-05-01", "action": "Introduced and Assigned to House Administration Committee in House", "chamber": "", "chamber_id": 0, "importance": 1}, {"date": "2012-05-16", "action": "Reported Out of Committee (HOUSE ADMINISTRATION) in House with 4 On Its Merits", "chamber": "", "chamber_id": 0, "importance": 0}, {"date": "2012-06-07", "action": "Passed by House of Representatives. Votes: Passed 39 YES 0 NO 0 NOT VOTING 2 ABSENT 0 VACANT", "chamber": "", "chamber_id": 0, "importance": 1}, {"date": "2012-06-13", "action": "Assigned to Community/County Affairs Committee in Senate", "chamber": "", "chamber_id": 0, "importance": 1}, {"date": "2012-06-20", "action": "Reported Out of Committee (COMMUNITY/COUNTY AFFAIRS) in Senate with 4 On Its Merits", "chamber": "", "chamber_id": 0, "importance": 0}, {"date": "2012-06-21", "action": "Passed by Senate. Votes: Passed 21 YES 0 NO 0 NOT VOTING 0 ABSENT 0 VACANT", "chamber": "", "chamber_id": 0, "importance": 1}, {"date": "2012-07-18", "action": "Signed by Governor", "chamber": "", "chamber_id": 0, "importance": 1}], "sponsors": [{"people_id": 4411, "person_hash": "2z94302f", "party_id": "1", "state_id": 8, "party": "D", "role_id": 1, "role": "Rep", "name": "William Carson", "first_name": "William", "middle_name": "J.", "last_name": "Carson", "suffix": "Jr.", "nickname": "", "district": "HD-028", "ftm_eid": 6496696, "votesmart_id": 102387, "opensecrets_id": "", "knowwho_pid": 261672, "ballotpedia": "William_Carson_Jr.", "sponsor_type_id": 0, "sponsor_order": 0, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 4471, "person_hash": "t612oj8p", "party_id": "1", "state_id": 8, "party": "D", "role_id": 2, "role": "Sen", "name": "Bruce Ennis", "first_name": "Bruce", "middle_name": "C.", "last_name": "Ennis", "suffix": "", "nickname": "", "district": "SD-014", "ftm_eid": 6381514, "votesmart_id": 5757, "opensecrets_id": "", "knowwho_pid": 193458, "ballotpedia": "Bruce_Ennis", "sponsor_type_id": 0, "sponsor_order": 0, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}], "sasts": [], "subjects": [], "texts": [{"doc_id": 636168, "date": "2012-05-01", "type": "Draft", "type_id": 9, "mime": "text/html", "mime_id": 1, "url": "https://legiscan.com/DE/text/HB318/id/636168", "state_link": "http://legis.delaware.gov/LIS/lis146.nsf/vwLegislation/HB+318/$file/legis.html?open", "text_size": 262096, "text_hash": "fd5c52dae5f2a823a8e6216bf2bd811b"}], "votes": [{"roll_call_id": 201641, "date": "2012-06-07", "desc": "House Third Reading", "yea": 39, "nay": 0, "nv": 0, "absent": 2, "total": 41, "passed": 1, "chamber": "H", "chamber_id": 25, "url": "https://legiscan.com/DE/rollcall/HB318/id/201641", "state_link": "http://legis.delaware.gov/LIS/lis146.nsf/7712cf7cc0e9227a852568470077336f/08eed53384b7298785257a16007597bc?OpenDocument"}, {"roll_call_id": 205027, "date": "2012-06-21", "desc": "Senate Third Reading", "yea": 21, "nay": 0, "nv": 0, "absent": 0, "total": 21, "passed": 1, "chamber": "S", "chamber_id": 26, "url": "https://legiscan.com/DE/rollcall/HB318/id/205027", "state_link": "http://legis.delaware.gov/LIS/lis146.nsf/7712cf7cc0e9227a852568470077336f/1e609c38ad4e456c85257a240067cbb5?OpenDocument"}], "amendments": [], "supplements": [], "calendar": []}}