{"status": "OK", "bill": {"bill_id": 429679, "change_hash": "26e1c1c403956d76f5fdb12cbdaeab0a", "session_id": 84, "session": {"session_id": 84, "state_id": 52, "year_start": 2011, "year_end": 2012, "prefile": 0, "sine_die": 1, "prior": 1, "special": 0, "session_tag": "Regular Session", "session_title": "2011-2012 Regular Session", "session_name": "112th Congress"}, "url": "https://legiscan.com/US/bill/HB5882/2011", "state_link": "https://www.congress.gov/bill/112th-congress/house-bill/5882/all-info", "completed": 0, "status": 2, "status_date": "2012-06-11", "progress": [{"date": "2012-06-01", "event": 1}, {"date": "2012-06-11", "event": 2}], "state": "US", "state_id": 52, "bill_number": "HB5882", "bill_type": "B", "bill_type_id": "1", "body": "H", "body_id": 114, "current_body": "S", "current_body_id": 115, "title": "Legislative Branch Appropriations Act, 2013", "description": "Legislative Branch Appropriations Act, 2013 - Title I: Legislative Branch - Makes appropriations to the Senate for FY2013 for: (1) expense allowances; (2) representation allowances for the Majority and Minority Leaders; (3) salaries of specified officers, employees, and committees (including the Committee on Appropriations); (4) agency contributions for employee benefits; (5) inquiries and investigations; (6) the U.S. Senate Caucus on International Narcotics Control; (7) the Offices of the Secretary and of the Sergeant at Arms and Doorkeeper of the Senate; (8) miscellaneous items; (9) the Senators' Official Personnel and Office Expense Account; and (10) official mail costs. Makes appropriations to the House of Representatives for FY2013 for: (1) salaries and/or expenses of the House leadership offices, committees (including the Committee on Appropriations), officers and employees; and (2) Members' representational allowances.  (Sec. 101) Requires deposit in the Treasury of any amounts of a Member's representational allowance remaining after all payments are made, to be used for federal deficit reduction, or, if there is no deficit, federal debt reduction. (Sec. 102) Amends the Legislative Branch Appropriations Act, 1998 to require reimbursement to the Secretary of Labor for unemployment compensation payments to former House employees out of the House account for making payments to the Employees' Compensation Fund. (Sec. 103) Amends the Legislative Branch Appropriations Act, 1993, with respect to authorized transfer of amounts appropriated for any fiscal year among specified headings, to add \"Joint Items\" (to the extent that amounts appropriated to a joint committee are disbursed by the House Chief Administrative Officer) and \"Office of the Attending Physician\" to the current list consisting of \"House Leadership Offices,\" \"Members' Representational Allowances,\" \"Committee Employees,\" \"Salaries, Officers, and Employees,\" and \"Allowances and Expenses.\"  (Sec. 104) Requires the House Office of the Inspector General (IG) to: (1) provide the House Committee on Appropriations with a copy of each produced IG audit and investigative report, and (2) consult regularly with the Committee with respect to the Office's operations.  Makes FY2013 appropriations for salaries and/or expenses of: (1) the Joint Economic Committee and the Joint Committee on Taxation; (2) the Office of the Attending Physician; (3) the Office of Congressional Accessibility Services; (4) the Capitol Police; (5) the Office of Compliance; (6) the Congressional Budget Office (CBO); and (7) the Architect of the Capitol (AOC), including for the care and operation of Capitol buildings and grounds, Senate office buildings, House office buildings, the Capitol power plant, the Library of Congress buildings and grounds, the Capitol Police buildings, grounds, and security, the Botanic Garden, and the Capitol Visitor Center.  (Sec. 1102) Makes balances of expired U.S. Capitol Police appropriations available to the Capitol Police for deposit to the credit of the mandatory Employees' Compensation Fund.  Amends the Legislative Branch Appropriations Act, 2003 to eliminate the separate Capitol Police account for making worker's compensation payments to Capitol Police employees.  (Sec. 1201) Makes balances of expired AOC appropriations available to the AOC for deposit to the credit of the mandatory Employees' Compensation Fund.  Appropriates FY2013 funds to: (1) the Library of Congress for salaries and expenses, the Copyright Office, the Congressional Research Service (CRS), and Books for the Blind and Physically Handicapped; (2) the Government Printing Office (GPO) for congressional printing and binding (including transfer of funds); (3) the GPO for the Office of Superintendent of Documents (including transfer of funds); (4) the GPO Revolving Fund; (5) Government Accountability Office (GAO) for salaries and expenses; (6) the Open World Leadership Center Trust Fund; and (7) the John C. Stennis Center for Public Service Development Trust Fund.  (Sec. 1301) Establishes an upper limit of $178.958 million for the FY2013 obligational authority of the Library of Congress with regard to certain reimbursable and revolving fund activities. Authorizes the Librarian of Congress to transfer temporarily up to $1.9 million of funds appropriated in this Act for Library of Congress salaries and expenses to the revolving fund for the FEDLINK Program and the Federal Research Program.   (Sec. 1302) Authorizes the transfer of FY2013 Library of Congress appropriations between any subheading under the heading \"Library of Congress,\" up to 10% per category, upon the approval of the congressional appropriations committees. (Sec. 1303) Amends the Library of Congress Fiscal Operations Improvement Act of 2000 to modify the use of the revolving fund for duplication and delivery services associated with the national audiovisual conservation center to include preservation and storage of audiovisual materials and associated collections. Renames the revolving fund established for the Library's gift shop, decimal classification, photo duplication, and related services as the revolving fund for the Library's sales shop and other services. Adds traveling exhibitions, exhibition materials, and training to the authorized uses of the revolving fund. (Sec. 1304) States that nothing shall be construed as prohibiting or restricting the Librarian of Congress from accepting non-personal services and voluntary and uncompensated personal services (as well as, under current law, gifts or bequests of money) for immediate disbursement in the interest of the Library, its collections, or its service. Prescribes reporting requirements for the Librarian regarding such gifts or bequests. (Sec. 1305) Modifies requirements for the use of appropriations to the Library of Congress for the purchase of books and sound-reproduction records for blind and other physically handicapped U.S. residents to change the terminology used to identify such individuals as \"residents or persons with disabilities.\" Limits the lending of such books, recordings, reproducers, musical scores, instructional texts, and other specialized materials by the Library's local or regional centers to blind and other U.S. residents with disabilities (including the several States, Territories, insular possessions, and the District of Columbia). (Sec. 1401) Makes balances of expired GAO appropriations available to GAO for deposit to the credit of the mandatory Employees' Compensation Fund.  Title II: General Provisions - Specifies authorized and prohibited uses of funds appropriated by this Act identical or similar to corresponding provisions of the Legislative Branch Appropriations Act, 2012.  (Sec. 207) Authorizes the AOC to maintain and improve the landscape features, excluding streets, in specified grassy areas of Washington, DC, SW.  (Sec. 209) Prohibits the use of funds made available to the AOC in this Act to eliminate or restrict guided tours of the U.S. Capitol led by congressional employees and interns. Allows temporary suspension or restriction of such tours for security or related reasons to the same extent as guided tours of the U.S. Capitol led by the AOC.  (Sec. 210) Adds to the Capitol Grounds certain property (defined in this Act as Union Square), including any monument or other facility located within such area, which was transferred to AOC jurisdiction and control under title I of division G of the Consolidated Appropriations Act, 2012 (CAA, 2012). Authorizes the Capitol Police to: (1) issue a permit authorizing a person to engage in commercial activity in Union Square in a manner that does not interfere with Congress; (2) establish and collect permit application fees; and (3) establish and collect other fees for the use of Union Square, all Capitol Police or AOC costs incurred resulting from such use, and costs to monitor the permitted activity.  Establishes a Union Square Commercial Account in the Treasury consisting of all such fees, to be made available, without fiscal year limitations or further appropriation, for disbursement by the Capitol Police to defray expenses associated with Union Square and to reimburse the AOC for costs incurred relating to its use. Requires the Capitol Police Board, subject to congressional approval, to promulgate regulations for commercial use of Union Square which shall: (1) describe the types of commercial activity authorized (which shall be substantially similar to the types permitted in Union Square on the day before enactment of CAA, 2012); and (2) provide for payment of fees and costs substantially similar to those collected by the National Park Service (NPS) on the day before such enactment. States that nothing in this Act or in CCA, 2012 shall be be construed to affect any permit for engaging in commercial activity in Union which was issued by the NPS before enactment of CAA, 2012.", "pending_committee_id": 0, "committee": [], "referrals": [{"date": "2012-06-11", "committee_id": 2319, "chamber": "S", "chamber_id": 115, "name": "Appropriations"}], "history": [{"date": "2012-06-01", "action": "The House Committee on Appropriations reported an original measure, H. Rept. 112-511, by Mr. Crenshaw.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2012-06-01", "action": "Placed on the Union Calendar, Calendar No. 359.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2012-06-08", "action": "Considered under the provisions of rule H. Res. 679. (consideration: CR H3665-3690; text of measure as reported in House: CR H3671-3675)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2012-06-08", "action": "Resolution provides for consideration of H.R. 436 and H.R. 5882. General debate on H.R. 5882 will continue for not to exceed one hour, equally divided and controlled. Specified amendments to H.R. 5882 are in order.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2012-06-08", "action": "House resolved itself into the Committee of the Whole House on the state of the Union pursuant to H. Res. 679 and Rule XVIII.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2012-06-08", "action": "The Speaker designated the Honorable Charles F. Bass to act as Chairman of the Committee.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2012-06-08", "action": "GENERAL DEBATE - The Committee of the Whole proceeded with one hour of general debate on H.R. 5882.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2012-06-08", "action": "H.AMDT.1278 Amendment (A001) offered by Mr. Gosar. (consideration: CR H3676-3677, H3685; text: CR H3676)Amendment reduces the budget for the Botanic Garden by $1,235,000 and to apply the savings to the spending reduction account.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2012-06-08", "action": "DEBATE - Pursuant to the provisions H. Res. 679, the Committee of the Whole proceeded with 10 minutes of debate on the Gosar amendment No. 1.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2012-06-08", "action": "POSTPONED PROCEEDINGS - At the conclusion of debate on the Gosar amendment, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Mr. Gosar demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2012-06-08", "action": "H.AMDT.1279 Amendment (A002) offered by Mr. Broun (GA). (consideration: CR H3677-3679, H3685-3686; text: CR H3677)Amendment reduces funding for the Congressional Research Service by $878,000 (FY 2012 Level) and to apply the savings to the spending reduction account.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2012-06-08", "action": "DEBATE - Pursuant to the provisions H. Res. 679, the Committee of the Whole proceeded with 10 minutes of debate on the Broun (GA) amendment No. 2.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2012-06-08", "action": "POSTPONED PROCEEDINGS - At the conclusion of debate on the Broun (GA) amendment, the Chair put the question on adoption of the amendment and by voice vote, announced that the ayes had prevailed. Mr. Honda demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2012-06-08", "action": "H.AMDT.1280 Amendment (A003) offered by Mr. Holt. (consideration: CR H3679-3680; text: CR H3679)Amendment adjusts funding for Congressional Printing and Binding under the GPO to address the availability of pocket versions of the United States Constitution for members of the House.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2012-06-08", "action": "DEBATE - Pursuant to the provisions H. Res. 679, the Committee of the Whole proceeded with 10 minutes of debate on the Holt amendment No. 3.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2012-06-08", "action": "H.AMDT.1280 On agreeing to the Holt amendment (A003) Agreed to by voice vote.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2012-06-08", "action": "H.AMDT.1281 Amendment (A004) offered by Mr. Scalise. (consideration: CR H3680-3681, H3686-3687; text: CR H3680)Amendment zeroes out the $1 million in funding for the Open World Leadership Center and applies the savings to the spending reduction account.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2012-06-08", "action": "DEBATE - Pursuant to the provisions H. Res. 679, the Committee of the Whole proceeded with 10 minutes of debate on the Scalise amendment No. 4.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2012-06-08", "action": "POSPTPONED PROCEEDINGS - At the conclusion of debate on the Scalise amendment, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Mr. Scalise demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2012-06-08", "action": "H.AMDT.1282 Amendment (A005) offered by Mr. Moran. (consideration: CR H3681-3683, H3687; text: CR H3681)An amendment numbered 5 printed in House Report 112-518 to prohibit the use of polystyrene products in food service facilities in the House of Representatives.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2012-06-08", "action": "DEBATE - Pursuant to the provisions H. Res. 679, the Committee of the Whole proceeded with 10 minutes of debate on the Moran amendment No. 5.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2012-06-08", "action": "POSTPONED PROCEEDINGS - At the conclusion of debate on the Moran amendment, the Chair put the question on adoption of the amendment and by voice vote, announced that the ayes had prevailed. Mr. Dan Lungren (CA) demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2012-06-08", "action": "H.AMDT.1283 Amendment (A006) offered by Mr. Harper. (consideration: CR H3683; text: CR H3683)An amendment numbered 6 printed in House Report 112-518 to limit the print copies of the U.S. Code for the House of Representatives to 50 copies.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2012-06-08", "action": "DEBATE - Pursuant to the provisions H. Res. 679, the Committee of the Whole proceeded with 10 minutes of debate on the Harper amendment No. 6.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2012-06-08", "action": "H.AMDT.1283 On agreeing to the Harper amendment (A006) Agreed to by voice vote.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2012-06-08", "action": "H.AMDT.1284 Amendment (A007) offered by Mr. Flake. (consideration: CR H3683-3684, H3687-3688; text: CR H3683)An amendment numbered 7 printed in House Report 112-518 to prohibit funding for the purchase of paid online advertisements by Members, committees, and leadership offices.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2012-06-08", "action": "DEBATE - Pursuant to the provisions H. Res. 679, the Committee of the Whole proceeded with 10 minutes of debate on the Flake amendment No. 7.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2012-06-08", "action": "POSTPONED PROCEEDINGS - At the conclusion of debate on the Flake amendment, the Chair put the question on adoption of the amendment and by voice vote, announced that the ayes had prevailed. Mr. Crenshaw demanded a recorded vote and the Chair post poned further proceedings on the question of adoption of the amendment until a time to be announced.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2012-06-08", "action": "UNFINISHED BUSINESS - The Chair announced that the unfinished business was the question on adoption of amendments which had been debated earlier and on which further proceedings had been postponed.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2012-06-08", "action": "H.AMDT.1278 On agreeing to the Gosar amendment (A001) Agreed to by recorded vote: 213 - 193 (Roll no. 371).", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2012-06-08", "action": "H.AMDT.1279 On agreeing to the Broun (GA) amendment (A002) Agreed to by recorded vote: 214 - 189 (Roll no. 372).", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2012-06-08", "action": "H.AMDT.1281 On agreeing to the Scalise amendment (A004) Agreed to by recorded vote: 204 - 203 (Roll no. 373).", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2012-06-08", "action": "H.AMDT.1282 On agreeing to the Moran amendment (A005) Failed by recorded vote: 178 - 229 (Roll no. 374).", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2012-06-08", "action": "H.AMDT.1284 On agreeing to the Flake amendment (A007) Failed by recorded vote: 148 - 261 (Roll no. 375).", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2012-06-08", "action": "The House rose from the Committee of the Whole House on the state of the Union to report H.R. 5882.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2012-06-08", "action": "The previous question was ordered pursuant to the rule. (consideration: CR H3688)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2012-06-08", "action": "The House adopted the amendments en gross as agreed to by the Committee of the Whole House on the state of the Union.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2012-06-08", "action": "Ms. Pingree (ME) moved to recommit with instructions to Appropriations. (consideration: CR H3688-3689; text: CR H3688)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2012-06-08", "action": "DEBATE - The House proceeded with 10 minutes of debate on the Pingree motion to recommit with instructions. The instructions contained in the motion seek to report the same back to the House forthwith with an amendment to reduce funds available for the Members' Representational Allowances, including Members' clerk hire, official expenses, and official mail, by $3,099,244.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2012-06-08", "action": "The previous question on the motion to recommit with instructions was ordered without objection. (consideration: CR H3689)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2012-06-08", "action": "On motion to recommit with instructions Failed by recorded vote: 101 - 309 (Roll no. 376).", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2012-06-08", "action": "On passage Passed by the Yeas and Nays: 307 - 102 (Roll no. 377).", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2012-06-08", "action": "Motion to reconsider laid on the table Agreed to without objection.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2012-06-11", "action": "Received in the Senate and Read twice and referred to the Committee on Appropriations.", "chamber": "S", "chamber_id": 115, "importance": 1}, {"date": "2012-08-02", "action": "Committee on Appropriations. Reported by Senator Nelson NE, with an amendment in the nature of a substitute. With written report No. 112-197.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2012-08-02", "action": "Placed on Senate Legislative Calendar under General Orders. Calendar No. 466.", "chamber": "S", "chamber_id": 115, "importance": 0}], "sponsors": [{"people_id": 9178, "person_hash": "95kqpg01", "party_id": "2", "state_id": 52, "party": "R", "role_id": 1, "role": "Rep", "name": "Ander Crenshaw", "first_name": "Ander", "middle_name": "", "last_name": "Crenshaw", "suffix": "", "nickname": "", "district": "HD-FL-4", "ftm_eid": 17657418, "votesmart_id": 31130, "opensecrets_id": "N00012739", "knowwho_pid": 205747, "ballotpedia": "Ander_Crenshaw", "sponsor_type_id": 1, "sponsor_order": 1, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}], "sasts": [{"type_id": 8, "type": "Related", "sast_bill_number": "HR679", "sast_bill_id": 430035}], "subjects": [{"subject_id": 13134, "subject_name": "Appropriations"}, {"subject_id": 13820, "subject_name": "Architect of the Capitol"}, {"subject_id": 13894, "subject_name": "Books and print media"}, {"subject_id": 13775, "subject_name": "Congressional Budget Office (CBO)"}, {"subject_id": 13826, "subject_name": "Congressional Research Service (CRS)"}, {"subject_id": 13145, "subject_name": "Congressional agencies"}, {"subject_id": 13677, "subject_name": "Congressional committees"}, {"subject_id": 13827, "subject_name": "Congressional leadership"}, {"subject_id": 13585, "subject_name": "Congressional officers and employees"}, {"subject_id": 13166, "subject_name": "Disability and paralysis"}, {"subject_id": 13385, "subject_name": "Disability assistance"}, {"subject_id": 13195, "subject_name": "Government Accountability Office (GAO)"}, {"subject_id": 13839, "subject_name": "Government Printing Office (GPO)"}, {"subject_id": 13196, "subject_name": "Government buildings, facilities, and property"}, {"subject_id": 13198, "subject_name": "Government employee pay, benefits, personnel management"}, {"subject_id": 13200, "subject_name": "Government information and archives"}, {"subject_id": 13203, "subject_name": "Government trust funds"}, {"subject_id": 13548, "subject_name": "Horticulture and plants"}, {"subject_id": 13840, "subject_name": "House Committee on Appropriations"}, {"subject_id": 13590, "subject_name": "House of Representatives"}, {"subject_id": 13614, "subject_name": "Intellectual property"}, {"subject_id": 13844, "subject_name": "Joint Committee on Taxation"}, {"subject_id": 13845, "subject_name": "Joint Economic Committee"}, {"subject_id": 13469, "subject_name": "Law enforcement officers"}, {"subject_id": 13389, "subject_name": "Libraries and archives"}, {"subject_id": 13760, "subject_name": "Library of Congress"}, {"subject_id": 13588, "subject_name": "Members of Congress"}, {"subject_id": 13248, "subject_name": "Motor vehicles"}, {"subject_id": 13260, "subject_name": "Public contracts and procurement"}, {"subject_id": 13533, "subject_name": "Travel and tourism"}, {"subject_id": 13526, "subject_name": "U.S. Capitol"}, {"subject_id": 13648, "subject_name": "User charges and fees"}, {"subject_id": 13146, "subject_name": "Congressional oversight"}, {"subject_id": 13793, "subject_name": "Senate"}, {"subject_id": 13525, "subject_name": "Congress"}], "texts": [{"doc_id": 651795, "date": "2012-06-02", "type": "Introduced", "type_id": 1, "mime": "application/pdf", "mime_id": 2, "url": "https://legiscan.com/US/text/HB5882/id/651795", "state_link": "https://www.congress.gov/112/bills/hr5882/BILLS-112hr5882rh.pdf", "text_size": 288550, "text_hash": "4d8d1b5cf073c2adfb91b9aa58ef4e25"}, {"doc_id": 653856, "date": "2012-06-09", "type": "Engrossed", "type_id": 4, "mime": "application/pdf", "mime_id": 2, "url": "https://legiscan.com/US/text/HB5882/id/653856", "state_link": "https://www.congress.gov/112/bills/hr5882/BILLS-112hr5882eh.pdf", "text_size": 158851, "text_hash": "b61c2bc22029e8906f0edd9a71be0044"}, {"doc_id": 660217, "date": "2012-08-03", "type": "Introduced", "type_id": 1, "mime": "application/pdf", "mime_id": 2, "url": "https://legiscan.com/US/text/HB5882/id/660217", "state_link": "https://www.congress.gov/112/bills/hr5882/BILLS-112hr5882rs.pdf", "text_size": 357412, "text_hash": "368b87f2f34f262b0ca190b70d9d30d2"}], "votes": [{"roll_call_id": 216913, "date": "2012-06-08", "desc": "On Agreeing to the Amendment", "yea": 213, "nay": 193, "nv": 25, "absent": 0, "total": 431, "passed": 1, "chamber": "H", "chamber_id": 114, "url": "https://legiscan.com/US/rollcall/HB5882/id/216913", "state_link": "https://clerk.house.gov/Votes/2012371"}, {"roll_call_id": 216914, "date": "2012-06-08", "desc": "On Agreeing to the Amendment", "yea": 214, "nay": 189, "nv": 28, "absent": 0, "total": 431, "passed": 1, "chamber": "H", "chamber_id": 114, "url": "https://legiscan.com/US/rollcall/HB5882/id/216914", "state_link": "https://clerk.house.gov/Votes/2012372"}, {"roll_call_id": 216915, "date": "2012-06-08", "desc": "On Agreeing to the Amendment", "yea": 204, "nay": 203, "nv": 24, "absent": 0, "total": 431, "passed": 1, "chamber": "H", "chamber_id": 114, "url": "https://legiscan.com/US/rollcall/HB5882/id/216915", "state_link": "https://clerk.house.gov/Votes/2012373"}, {"roll_call_id": 216916, "date": "2012-06-08", "desc": "On Agreeing to the Amendment", "yea": 178, "nay": 229, "nv": 24, "absent": 0, "total": 431, "passed": 0, "chamber": "H", "chamber_id": 114, "url": "https://legiscan.com/US/rollcall/HB5882/id/216916", "state_link": "https://clerk.house.gov/Votes/2012374"}, {"roll_call_id": 216917, "date": "2012-06-08", "desc": "On Agreeing to the Amendment", "yea": 148, "nay": 261, "nv": 22, "absent": 0, "total": 431, "passed": 0, "chamber": "H", "chamber_id": 114, "url": "https://legiscan.com/US/rollcall/HB5882/id/216917", "state_link": "https://clerk.house.gov/Votes/2012375"}, {"roll_call_id": 216918, "date": "2012-06-08", "desc": "On Motion to Recommit with Instructions", "yea": 101, "nay": 309, "nv": 21, "absent": 0, "total": 431, "passed": 0, "chamber": "H", "chamber_id": 114, "url": "https://legiscan.com/US/rollcall/HB5882/id/216918", "state_link": "https://clerk.house.gov/Votes/2012376"}, {"roll_call_id": 216919, "date": "2012-06-08", "desc": "On Passage", "yea": 307, "nay": 102, "nv": 22, "absent": 0, "total": 431, "passed": 1, "chamber": "H", "chamber_id": 114, "url": "https://legiscan.com/US/rollcall/HB5882/id/216919", "state_link": "https://clerk.house.gov/Votes/2012377"}, {"roll_call_id": 218958, "date": "2012-06-08", "desc": "On Agreeing to the Amendment", "yea": 213, "nay": 193, "nv": 25, "absent": 0, "total": 431, "passed": 1, "chamber": "H", "chamber_id": 114, "url": "https://legiscan.com/US/rollcall/HB5882/id/218958", "state_link": "https://clerk.house.gov/Votes/2012371"}, {"roll_call_id": 218959, "date": "2012-06-08", "desc": "On Agreeing to the Amendment", "yea": 214, "nay": 189, "nv": 28, "absent": 0, "total": 431, "passed": 1, "chamber": "H", "chamber_id": 114, "url": "https://legiscan.com/US/rollcall/HB5882/id/218959", "state_link": "https://clerk.house.gov/Votes/2012372"}, {"roll_call_id": 218960, "date": "2012-06-08", "desc": "On Agreeing to the Amendment", "yea": 204, "nay": 203, "nv": 24, "absent": 0, "total": 431, "passed": 1, "chamber": "H", "chamber_id": 114, "url": "https://legiscan.com/US/rollcall/HB5882/id/218960", "state_link": "https://clerk.house.gov/Votes/2012373"}, {"roll_call_id": 218961, "date": "2012-06-08", "desc": "On Agreeing to the Amendment", "yea": 178, "nay": 229, "nv": 24, "absent": 0, "total": 431, "passed": 0, "chamber": "H", "chamber_id": 114, "url": "https://legiscan.com/US/rollcall/HB5882/id/218961", "state_link": "https://clerk.house.gov/Votes/2012374"}, {"roll_call_id": 218962, "date": "2012-06-08", "desc": "On Agreeing to the Amendment", "yea": 148, "nay": 261, "nv": 22, "absent": 0, "total": 431, "passed": 0, "chamber": "H", "chamber_id": 114, "url": "https://legiscan.com/US/rollcall/HB5882/id/218962", "state_link": "https://clerk.house.gov/Votes/2012375"}, {"roll_call_id": 218963, "date": "2012-06-08", "desc": "On Motion to Recommit with Instructions", "yea": 101, "nay": 309, "nv": 21, "absent": 0, "total": 431, "passed": 0, "chamber": "H", "chamber_id": 114, "url": "https://legiscan.com/US/rollcall/HB5882/id/218963", "state_link": "https://clerk.house.gov/Votes/2012376"}, {"roll_call_id": 218964, "date": "2012-06-08", "desc": "On Passage", "yea": 307, "nay": 102, "nv": 22, "absent": 0, "total": 431, "passed": 1, "chamber": "H", "chamber_id": 114, "url": "https://legiscan.com/US/rollcall/HB5882/id/218964", "state_link": "https://clerk.house.gov/Votes/2012377"}], "amendments": [], "supplements": [], "calendar": []}}