{"status": "OK", "bill": {"bill_id": 645606, "change_hash": "07cadfa2f2103eda5598989487181090", "session_id": 1026, "session": {"session_id": 1026, "state_id": 52, "year_start": 2013, "year_end": 2014, "prefile": 0, "sine_die": 1, "prior": 1, "special": 0, "session_tag": "Regular Session", "session_title": "2013-2014 Regular Session", "session_name": "113th Congress"}, "url": "https://legiscan.com/US/bill/HB4487/2013", "state_link": "https://www.congress.gov/bill/113th-congress/house-bill/4487/all-info", "completed": 0, "status": 2, "status_date": "2014-05-05", "progress": [{"date": "2014-04-17", "event": 1}, {"date": "2014-05-05", "event": 2}, {"date": "2014-06-19", "event": 10}], "state": "US", "state_id": 52, "bill_number": "HB4487", "bill_type": "B", "bill_type_id": "1", "body": "H", "body_id": 114, "current_body": "S", "current_body_id": 115, "title": "Legislative Branch Appropriations Act, 2015", "description": "Legislative Branch Appropriations Act, 2015 - Title I: Legislative Branch - Makes appropriations to the Senate for FY2015 for: (1) expense allowances; (2) representation allowances for the Majority and Minority Leaders; (3) salaries of specified officers, employees, and committees (including the Committee on Appropriations); (4) agency contributions for employee benefits; (5) inquiries and investigations; (6) the U.S. Senate Caucus on International Narcotics Control; (7) the Offices of the Secretary and of the Sergeant at Arms and Doorkeeper of the Senate; (8) miscellaneous items; (9) the Senators' Official Personnel and Office Expense Account; and (10) official mail costs. (Sec. 1) Amends the Revised Statutes to repeal the requirement that stationery for the Senate be purchased according to a bidding process. (Sec. 2) Amends the Federal Election Campaign Act of 1971 to require that all designations, statements, and reports required to be filed by a candidate for the Senate, by the candidate's principal campaign committee, and by the Republican and Democratic Senatorial Campaign Committees be filed directly with the Federal Election Commission (FEC). (Currently, they must be filed with the Secretary of the Senate, who receives them as custodian for the FEC.) Makes appropriations to the House of Representatives for FY2015 for: (1) salaries and/or expenses of the House leadership offices, committees (including the Committee on Appropriations), and officers and employees; and (2) Members' representational allowances. (Sec. 101) Requires deposit in the Treasury of any amounts of a Member's representational allowance remaining after all payments are made, to be used for federal deficit reduction, or, if there is no deficit, federal debt reduction.  (Sec. 102) Prohibits the use of funds made available in this Act to deliver a printed copy of a bill, joint resolution, or resolution to the office of a Member of the House of Representatives unless the Member requests a copy. (Sec. 103) Prohibits the use of funds made available in this Act to deliver a printed copy of any version of the Congressional Record to the office of a Member.  (Sec. 104) Prohibits the use of funds made available in this Act by the Chief Administrative Officer of the House to make any payments from any Members' Representational Allowance for the leasing of a vehicle (except mobile district offices) in an aggregate amount that exceeds $1,000 for the vehicle in any month.  (Sec. 105) Prohibits the use of funds made available in this Act to provide an aggregate number of more than 50 printed copies of any edition of the U.S. Code to all House offices. Makes appropriations for salaries and/or expenses of: (1) the Joint Economic Committee; (2) the Joint Committee on Taxation; (3) the Office of the Attending Physician; (4) the Office of Congressional Accessibility Services; (5) the Capitol Police; (6) the Office of Compliance; (7) the Congressional Budget Office (CBO); and (8) the Architect of the Capitol (AOC), including for the care and operation of Capitol buildings and grounds, Senate office buildings, House office buildings, the Capitol power plant, the Library of Congress buildings and grounds, the Capitol Police buildings, grounds, and security, the Botanic Garden, and the Capitol Visitor Center.  (Sec. 1001) Amends the Congressional Accountability Act of 1995 to revise requirements for the Office of Compliance program of education for Members of Congress and other employing authorities of the legislative branch respecting the laws applying to them as well as a program to inform individuals of their rights under such laws.  Modifies the requirement that the Office distribute its telephone number, address, and the procedures for consideration of alleged violations of rights and protections under specified laws to the residences of covered employees. Requires instead that the information and procedures be distributed to the covered employees by the end of each fiscal year.  (Sec. 1101) Authorizes the AOC, subject to the direction of the Joint Committee of Congress on the Library, to enter into: (1) cooperative agreements with entities to support the Botanic Garden; and (2) a no-cost agreement with a qualified entity to conduct, or provide support for, an educational exhibit, program, class, or outreach that benefits the Botanic Garden's educational mission. Appropriates funds for: (1) the Library of Congress for salaries and expenses, the Copyright Office, Congressional Research Service (CRS), and Books for the Blind and Physically Handicapped; (2) the Government Publishing Office (GPO) for congressional publishing; (3) GPO for public information programs of the Office of Superintendent of Documents; (4) the Government Publishing Office Business Operations Revolving Fund; (5) the Government Accountability Office (GAO) for salaries and expenses; (6) a payment to the Open World Leadership Center Trust Fund; and (7) a payment to the John C. Stennis Center for Public Service Development Trust Fund.  (Sec. 1201) Establishes an upper limit of $203.057 million for the FY2015 obligational authority of the Library of Congress with regard to certain reimbursable and revolving fund activities.  (Sec. 1202) Authorizes the transfer of FY2015 Library of Congress appropriations between any subheading under the heading \"Library of Congress,\" up to 10% per category, upon the approval of congressional appropriations committees. (Sec. 1301) Redesignates the Government Printing Office as the Government Publishing Office. Renames: (1) the Public Printer as the Director of the Government Publishing Office, and (2) the Deputy Public Printer as the Deputy Director. Revises requirements with respect to the qualifications and duties of the Director and the Deputy Director. (Sec. 1401) Requires the Comptroller General (GAO) to establish the Center for Audit Excellence within GAO to:  build institutional auditing capacity; and promote good governance by providing affordable, relevant, and high-quality training, technical assistance, and products and services to qualified personnel and entities of governments (including federal, state, and local governments, tribal governments, and governments of foreign nations), international organizations, and other private organizations.   Authorizes GAO to:  establish, charge, and collect fees (on a reimbursable or advance basis) for the training, technical assistance, and products or services; and accept and use conditional or non-conditional gifts of real and personal property and services (including services of guest lecturers) to support the Center's operation.   Prohibits GAO from accepting or using such a gift if its acceptance or use would compromise or appear to compromise GAO's integrity.  Expresses the sense of Congress that the Center should be staffed primarily by GAO personnel not otherwise engaged in carrying out other GAO duties, so as to ensure that the Center's operation will not have a negative impact on GAO's ability to maintain a consistently high level of service to Congress.  Establishes in the Treasury (as a separate GAO account) the Center for Audit Excellence Account consisting of fees deposited by GAO and such other amounts as may be appropriated under law.  Makes amounts in the Account available to GAO in amounts specified in appropriations Acts and without fiscal year limitation to carry out this Act. Authorizes appropriations. Prohibits GAO from operating the Center until:  it submits a business plan for the Center to congressional appropriations committees, and each such committee approves the plan.   Title II: General Provisions - Specifies authorized and prohibited uses of funds appropriated by this Act identical or similar to corresponding provisions of the Legislative Branch Appropriations Act, 2014. (Sec. 206) Authorizes the AOC to maintain and improve the landscape features, excluding streets, in specified grassy areas of Washington, DC, SW. (Sec. 208) Prohibits the use of funds made available to the AOC in this Act to eliminate or restrict guided tours of the U.S. Capitol led by congressional employees and interns. Allows temporary suspension or restriction of such tours for security or related reasons to the same extent as guided tours of the U.S. Capitol led by the AOC. (Sec. 209) Prohibits a Member of Congress from receiving a cost of living adjustment to the Member's salary under the Legislative Reorganization Act of 1946 during FY2015.  (Sec. 210) Bars the use of funds made available in this Act to make bonus awards to contractors for work on projects for which the contractor is behind schedule or over budget, unless the head of the agency determines that any such deviations are due to unforeseeable events or are not significant within the context of the project. (Sec. 211) Bars the use of funds made available in this Act to pay for the painting of portraits of a federal officer or employee, including the President, the Vice President, a Member of Congress (including a Delegate or a Resident Commissioner to Congress), the head of an executive branch agency, or the head of an office of the legislative branch.", "pending_committee_id": 0, "committee": [], "referrals": [{"date": "2014-05-05", "committee_id": 2319, "chamber": "S", "chamber_id": 115, "name": "Appropriations"}], "history": [{"date": "2014-04-17", "action": "The House Committee on Appropriations reported an original measure, H. Rept. 113-417, by Mr. Cole.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-04-17", "action": "Placed on the Union Calendar, Calendar No. 307.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-04-29", "action": "Rules Committee Resolution H. Res. 557 Reported to House. The resolution provides for 1 hour of general debate for both bills. For H.R. 4486, the resolution provides that the bill shall be considered for amendment under the five-minute rule. For H.R. 4487, the resolution makes in order only those specified amendments printed in the report. The resolution provides one motion to recommit with or without instructions during consideration of each bill.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-04-30", "action": "Rule H. Res. 557 passed House.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-05-01", "action": "Considered under the provisions of rule H. Res. 557. (consideration: CR H3368-3392; text of measure as reported in House: CR H3376-3380)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-05-01", "action": "The resolution provides for 1 hour of general debate for both bills. For H.R. 4486, the resolution provides that the bill shall be considered for amendment under the five-minute rule. For H.R. 4487, the resolution makes in order only those specified amendments printed in the report. The resolution provides one motion to recommit with or without instructions during consideration of each bill.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-05-01", "action": "The Speaker designated the Honorable Ileana Ros-Lehtinen to act as Chairwoman of the Committee.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-05-01", "action": "House resolved itself into the Committee of the Whole House on the state of the Union pursuant to H. Res. 557 and Rule XVIII.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-05-01", "action": "GENERAL DEBATE - The Committee of the Whole proceeded with one hour of general debate on H.R. 4487.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-05-01", "action": "H.AMDT.642 Amendment (A001) offered by Mr. Nugent. (consideration: CR H3380-3381, H3387-3388; text: CR H3380)Amendment sought to prohibit the CAO of the House of Representatives from making any payments from any Members' Representational Allowance for the leasing of a vehicle, excluding mobile district offices and short-term vehicle rentals.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-05-01", "action": "DEBATE - Pursuant to the provisions of H. Res. 557, the Committee of the Whole proceeded with 10 minutes of debate on the Nugent amendment No. 1.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-05-01", "action": "POSTPONED PROCEEDINGS - At the conclusion of debate on the Nugent amendment, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes prevailed. Mr. Nugent demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until later in the legislative day.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-05-01", "action": "H.AMDT.643 Amendment (A002) offered by Ms. Speier. (consideration: CR H3381-3382; text: CR H3381)Amendment provides $500,000 for sexual harassment training for all House offices which will be carried out by the Congressional Office of Compliance. The funds are offset from the AOC General Administration account.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-05-01", "action": "DEBATE - Pursuant to the provisions of H. Res. 557, the Committee of the Whole proceeded with 10 minutes of debate on the Speier amendment No. 2.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-05-01", "action": "H.AMDT.643 On agreeing to the Speier amendment (A002) Agreed to by voice vote.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-05-01", "action": "H.AMDT.644 Amendment (A003) offered by Mr. Gosar. (consideration: CR H3382-3383, H3388-3389; text: CR H3382)Amendment reduces the amount provided for the Botanic Garden by $3,166,946, to the fiscal year 2014 level and applies the savings to the spending reduction account.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-05-01", "action": "DEBATE - Pursuant to the provisions of H. Res. 557, the Committee of the Whole proceeded with 10 minutes of debate on the Gosar amendment No. 3.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-05-01", "action": "POSTPONED PROCEEDINGS - At the conclusion of debate on the Gosar amendment, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes prevailed. Mr. Gosar demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until later in the legislative day.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-05-01", "action": "H.AMDT.645 Amendment (A004) offered by Mr. Broun (GA). (consideration: CR H3383-3384, H3389; text: CR H3383)Amendment sought to reduce the funding for the Capitol Visitor Center by $243,000 and to apply the savings to the spending reduction account.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-05-01", "action": "DEBATE - Pursuant to the provisions of H. Res. 557, the Committee of the Whole proceeded with 10 minutes of debate on the Broun (GA) amendment No. 4.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-05-01", "action": "POSTPONED PROCEEDINGS - At the conclusion of debate on the Broun (GA) amendment, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes prevailed. Mr. Broun (GA) demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until later in the legislative day.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-05-01", "action": "H.AMDT.646 Amendment (A005) offered by Mr. Duffy. (consideration: CR H3384-3385; text: CR H3384)Amendment sought to zero out the $3,420,000 in funding for the Open World Leadership Center and to apply the savings to the spending reduction account.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-05-01", "action": "DEBATE - Pursuant to the provisions of H. Res. 557, the Committee of the Whole proceeded with 10 minutes of debate on the Duffy amendment No. 5.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-05-01", "action": "H.AMDT.646 On agreeing to the Duffy amendment (A005) Failed by voice vote.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-05-01", "action": "H.AMDT.647 Amendment (A006) offered by Mr. Hall. (consideration: CR H3385; text: CR H3385)Amendment prohibits funds from being used to deliver a printed copy of the CAO's Statement of Disbursements of the House to any Member of the House of Representatives.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-05-01", "action": "DEBATE - Pursuant to the provisions of H. Res. 557, the Committee of the Whole proceeded with 10 minutes of debate on the Hall amendment No. 6.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-05-01", "action": "H.AMDT.647 On agreeing to the Hall amendment (A006) Agreed to by voice vote.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-05-01", "action": "H.AMDT.648 Amendment (A007) offered by Mr. Wenstrup. (consideration: CR H3385-3386; text: CR H3386)An amendment numbered 7 printed in House Report 113-426 to prohibit funding for the delivery of printed copies of the Daily Calendar of the United States House of Representatives to member offices, as this document is accessible online.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-05-01", "action": "DEBATE - Pursuant to the provisions of H. Res. 557, the Committee of the Whole proceeded with 10 minutes of debate on the Wenstrup amendment No. 7.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-05-01", "action": "H.AMDT.648 On agreeing to the Wenstrup amendment (A007) Agreed to by voice vote.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-05-01", "action": "H.AMDT.649 Amendment (A008) offered by Mr. Holt. (consideration: CR H3386-3387, H3389-3390; text: CR H3386)Amendment sought to reallocate $2.5 million to the Office of Technology Assessment (OTA), offset from funds in the House Historic Buildings Revitalization Trust Fund.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-05-01", "action": "DEBATE - Pursuant to the provisions of H. Res. 557, the Committee of the Whole proceeded with 10 minutes of debate on the Holt amendment No. 8.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-05-01", "action": "POSTPONED PROCEEDINGS - At the conclusion of debate on the Holt amendment, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes prevailed. Mr. Holt demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until later in the legislative day.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-05-01", "action": "UNFINISHED BUSINESS - The Chair announced that the unfinished business was the question on adoption of amendments which had been debated earlier and on which further proceedings had been postponed.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-05-01", "action": "H.AMDT.642 On agreeing to the Nugent amendment (A001) Failed by recorded vote: 196 - 221 (Roll no. 188).", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-05-01", "action": "H.AMDT.644 On agreeing to the Gosar amendment (A003) Agreed to by recorded vote: 219 - 198 (Roll no. 189).", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-05-01", "action": "H.AMDT.645 On agreeing to the Broun (GA) amendment (A004) Failed by recorded vote: 207 - 212 (Roll no. 190).", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-05-01", "action": "H.AMDT.649 On agreeing to the Holt amendment (A008) Failed by recorded vote: 164 - 248 (Roll no. 191).", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-05-01", "action": "The House rose from the Committee of the Whole House on the state of the Union to report H.R. 4487.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-05-01", "action": "The previous question was ordered pursuant to the rule. (consideration: CR H3390)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-05-01", "action": "The House adopted the amendments en gross as agreed to by the Committee of the Whole House on the state of the Union.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-05-01", "action": "Mr. Ruiz moved to recommit with instructions to the Committee on Appropriations. (consideration: CR H3390-3392; text: CR H3390)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-05-01", "action": "DEBATE - The House proceeded with 10 minutes of debate on the Ruiz motion to recommit with instructions. The instructions contained in the motion seek to require the bill to be reported back to the House with an amendment to provide additional funds to hire Wounded Warriors and the Books for the Blind and Handicapped program.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-05-01", "action": "The previous question on the motion to recommit with instructions was ordered without objection. (consideration: CR H3391)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-05-01", "action": "On motion to recommit with instructions Failed by recorded vote: 194 - 222 (Roll no. 192).", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-05-01", "action": "On passage Passed by the Yeas and Nays: 402 - 14 (Roll no. 193).", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-05-01", "action": "Motion to reconsider laid on the table Agreed to without objection.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-05-05", "action": "Received in the Senate and Read twice and referred to the Committee on Appropriations.", "chamber": "S", "chamber_id": 115, "importance": 1}, {"date": "2014-06-10", "action": "Committee on Appropriations Subcommittee on Legislative Branch. Approved for full committee consideration with an amendment favorably.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2014-06-19", "action": "Committee on Appropriations. Ordered to be reported with an amendment in the nature of a substitute favorably.", "chamber": "S", "chamber_id": 115, "importance": 1}, {"date": "2014-06-19", "action": "Committee on Appropriations. Reported by Senator Shaheen with an amendment in the nature of a substitute. With written report No. 113-196.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2014-06-19", "action": "Placed on Senate Legislative Calendar under General Orders. Calendar No. 436.", "chamber": "S", "chamber_id": 115, "importance": 0}], "sponsors": [{"people_id": 9213, "person_hash": "86i58pyg", "party_id": "2", "state_id": 52, "party": "R", "role_id": 1, "role": "Rep", "name": "Tom Cole", "first_name": "Tom", "middle_name": "", "last_name": "Cole", "suffix": "", "nickname": "", "district": "HD-OK-4", "ftm_eid": 14964187, "votesmart_id": 46034, "opensecrets_id": "N00025726", "knowwho_pid": 211693, "ballotpedia": "Tom_Cole_(Oklahoma)", "sponsor_type_id": 1, "sponsor_order": 1, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}], "sasts": [{"type_id": 8, "type": "Related", "sast_bill_number": "HB2792", "sast_bill_id": 562547}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB3547", "sast_bill_id": 571680}, {"type_id": 8, "type": "Related", "sast_bill_number": "SB1283", "sast_bill_id": 562036}, {"type_id": 8, "type": "Related", "sast_bill_number": "HR557", "sast_bill_id": 646542}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB83", "sast_bill_id": 440735}], "subjects": [{"subject_id": 13134, "subject_name": "Appropriations"}, {"subject_id": 13820, "subject_name": "Architect of the Capitol"}, {"subject_id": 13503, "subject_name": "Budget deficits and national debt"}, {"subject_id": 13525, "subject_name": "Congress"}, {"subject_id": 13775, "subject_name": "Congressional Budget Office (CBO)"}, {"subject_id": 13826, "subject_name": "Congressional Research Service (CRS)"}, {"subject_id": 13145, "subject_name": "Congressional agencies"}, {"subject_id": 13677, "subject_name": "Congressional committees"}, {"subject_id": 13827, "subject_name": "Congressional leadership"}, {"subject_id": 13585, "subject_name": "Congressional officers and employees"}, {"subject_id": 13167, "subject_name": "District of Columbia"}, {"subject_id": 13195, "subject_name": "Government Accountability Office (GAO)"}, {"subject_id": 13839, "subject_name": "Government Printing Office (GPO)"}, {"subject_id": 13196, "subject_name": "Government buildings, facilities, and property"}, {"subject_id": 13198, "subject_name": "Government employee pay, benefits, personnel management"}, {"subject_id": 13200, "subject_name": "Government information and archives"}, {"subject_id": 13203, "subject_name": "Government trust funds"}, {"subject_id": 13211, "subject_name": "Health personnel"}, {"subject_id": 13548, "subject_name": "Horticulture and plants"}, {"subject_id": 13840, "subject_name": "House Committee on Appropriations"}, {"subject_id": 13590, "subject_name": "House of Representatives"}, {"subject_id": 13614, "subject_name": "Intellectual property"}, {"subject_id": 13844, "subject_name": "Joint Committee on Taxation"}, {"subject_id": 13845, "subject_name": "Joint Economic Committee"}, {"subject_id": 13469, "subject_name": "Law enforcement officers"}, {"subject_id": 13389, "subject_name": "Libraries and archives"}, {"subject_id": 13760, "subject_name": "Library of Congress"}, {"subject_id": 13588, "subject_name": "Members of Congress"}, {"subject_id": 13248, "subject_name": "Motor vehicles"}, {"subject_id": 13260, "subject_name": "Public contracts and procurement"}, {"subject_id": 13533, "subject_name": "Travel and tourism"}, {"subject_id": 13526, "subject_name": "U.S. Capitol"}, {"subject_id": 13648, "subject_name": "User charges and fees"}, {"subject_id": 13510, "subject_name": "Accounting and auditing"}], "texts": [{"doc_id": 1012173, "date": "2014-04-17", "type": "Introduced", "type_id": 1, "mime": "application/pdf", "mime_id": 2, "url": "https://legiscan.com/US/text/HB4487/id/1012173", "state_link": "https://www.congress.gov/113/bills/hr4487/BILLS-113hr4487rh.pdf", "text_size": 282953, "text_hash": "722609c587909442e3b6ce92d1bf86a8"}, {"doc_id": 1017853, "date": "2014-05-01", "type": "Engrossed", "type_id": 4, "mime": "application/pdf", "mime_id": 2, "url": "https://legiscan.com/US/text/HB4487/id/1017853", "state_link": "https://www.congress.gov/113/bills/hr4487/BILLS-113hr4487eh.pdf", "text_size": 158063, "text_hash": "4d576ac8d0fc23429e17ec6d07e3798a"}, {"doc_id": 1036550, "date": "2014-06-20", "type": "Introduced", "type_id": 1, "mime": "application/pdf", "mime_id": 2, "url": "https://legiscan.com/US/text/HB4487/id/1036550", "state_link": "https://www.congress.gov/113/bills/hr4487/BILLS-113hr4487rs.pdf", "text_size": 358417, "text_hash": "ed4af0a9af35edd98a99c030c7fd4e1c"}], "votes": [{"roll_call_id": 361759, "date": "2014-05-01", "desc": "On Agreeing to the Amendment", "yea": 196, "nay": 221, "nv": 14, "absent": 0, "total": 431, "passed": 0, "chamber": "H", "chamber_id": 114, "url": "https://legiscan.com/US/rollcall/HB4487/id/361759", "state_link": "https://clerk.house.gov/Votes/2014188"}, {"roll_call_id": 361760, "date": "2014-05-01", "desc": "On Agreeing to the Amendment", "yea": 219, "nay": 198, "nv": 14, "absent": 0, "total": 431, "passed": 1, "chamber": "H", "chamber_id": 114, "url": "https://legiscan.com/US/rollcall/HB4487/id/361760", "state_link": "https://clerk.house.gov/Votes/2014189"}, {"roll_call_id": 361761, "date": "2014-05-01", "desc": "On Agreeing to the Amendment", "yea": 207, "nay": 212, "nv": 12, "absent": 0, "total": 431, "passed": 0, "chamber": "H", "chamber_id": 114, "url": "https://legiscan.com/US/rollcall/HB4487/id/361761", "state_link": "https://clerk.house.gov/Votes/2014190"}, {"roll_call_id": 361762, "date": "2014-05-01", "desc": "On Agreeing to the Amendment", "yea": 164, "nay": 248, "nv": 19, "absent": 0, "total": 431, "passed": 0, "chamber": "H", "chamber_id": 114, "url": "https://legiscan.com/US/rollcall/HB4487/id/361762", "state_link": "https://clerk.house.gov/Votes/2014191"}, {"roll_call_id": 361763, "date": "2014-05-01", "desc": "On Motion to Recommit with Instructions", "yea": 194, "nay": 222, "nv": 15, "absent": 0, "total": 431, "passed": 0, "chamber": "H", "chamber_id": 114, "url": "https://legiscan.com/US/rollcall/HB4487/id/361763", "state_link": "https://clerk.house.gov/Votes/2014192"}, {"roll_call_id": 361764, "date": "2014-05-01", "desc": "On Passage", "yea": 402, "nay": 14, "nv": 15, "absent": 0, "total": 431, "passed": 1, "chamber": "H", "chamber_id": 114, "url": "https://legiscan.com/US/rollcall/HB4487/id/361764", "state_link": "https://clerk.house.gov/Votes/2014193"}], "amendments": [], "supplements": [], "calendar": []}}