{"status": "OK", "bill": {"bill_id": 654119, "change_hash": "22c421e6484c1d3754c553c517f76d4c", "session_id": 1026, "session": {"session_id": 1026, "state_id": 52, "year_start": 2013, "year_end": 2014, "prefile": 0, "sine_die": 1, "prior": 1, "special": 0, "session_tag": "Regular Session", "session_title": "2013-2014 Regular Session", "session_name": "113th Congress"}, "url": "https://legiscan.com/US/bill/HB5016/2013", "state_link": "https://www.congress.gov/bill/113th-congress/house-bill/5016/all-info", "completed": 0, "status": 2, "status_date": "2014-07-17", "progress": [{"date": "2014-07-02", "event": 1}, {"date": "2014-07-17", "event": 2}], "state": "US", "state_id": 52, "bill_number": "HB5016", "bill_type": "B", "bill_type_id": "1", "body": "H", "body_id": 114, "current_body": "S", "current_body_id": 115, "title": "Financial Services and General Government Appropriations Act, 2015", "description": "- Sets forth permissions for and restrictions upon the use of funds under this Act.  (Sec. 606) Prohibits the expenditure of funds under this Act by an entity unless it agrees to comply with the Buy American Act.  (Sec. 607) Prohibits the use of funds under this Act by any person or entity that has been convicted of violating the Buy American Act. (Sec. 610) Prohibits the Executive Office of the President from using funds provided in this Act to request either a Federal Bureau of Investigation (FBI) background investigation or an IRS determination with respect to tax exempt status under section 501(a) of the Internal Revenue Code of 1986. Includes exceptions if an individual requests a background investigation or if the request is required due to extraordinary circumstances involving national security.  (Sec. 611) Makes certain cost accounting standards inapplicable to the Federal Employees Health Benefits Program contract. (Sec. 612) Authorizes OPM to accept and utilize (without regard to any restriction on unanticipated travel expenses) funds made available pursuant to court approval for resolving litigation and implementing any settlement agreements regarding the nonforeign area cost-of-living allowance program. (Sec. 613) Prohibits funds appropriated by this Act from being used to pay for an abortion, or the administrative expenses in connection with any health plan under the federal employees health benefits program which provides any benefits or coverage for abortions unless the life of the mother would be endangered if the fetus were carried to term, or the pregnancy is the result of an act of rape or incest.  (Sec. 615) Makes the restriction on purchasing nondomestic articles, materials, and supplies set forth in the Buy American Act inapplicable to the acquisition by the federal government of commercial information technology.  (Sec. 616) Prohibits an officer or employee of any regulatory agency or commission funded by this Act from accepting travel payments or reimbursements from a person or entity regulated by the agency or commission unless the person or entity is a nonprofit tax-exempt organization.  (Sec. 617) Permits the Commodity Futures Trading Commission (CFTC) and the SEC to use funds for the interagency funding and sponsorship of a joint advisory committee to advise on emerging regulatory issues.  (Sec. 618) Requires the Department of the Treasury, the Executive Office of the President, the judiciary, the FCC, the FTC, GSA, the NARA, the SEC, and SBA to provide congressional appropriations committees a quarterly accounting of any unobligated funds.  (Sec. 619) Requires an executive agency covered by this Act to consult with GSA before seeking new office space or making alterations to existing office space. Authorizes any such agency with authority to enter into an emergency lease to do so during any period for which the President requires emergency leasing authority.  (Sec. 620) Prohibits the use of FTC funds to complete the draft report entitled \"Interagency Working Group on Food Marketed to Children: Preliminary Proposed Nutrition Principles to Guide Industry Self-Regulatory Efforts\" unless the Working Group complies with Executive Order 13563 (\"Improving Regulation and Regulatory Review\").  (Sec. 621) Bars the use of funds to pay the salaries and expenses for the following positions, including substantially similar ones: (1) Director of the White House Office of Health Reform, (2) Assistant to the President for Energy and Climate Change, (3) Senior Advisor to the Secretary of the Treasury assigned to the Presidential Task Force on the Auto Industry and Senior Counselor for Manufacturing Policy, and (4) White House Director of Urban Affairs.  (Sec. 622) Prohibits the use of funds to enter into a contract, memorandum of understanding, or cooperative agreement with, make a grant to, or provide a loan or loan guarantee to, any corporation that has any unpaid federal tax liability that has been assessed, for which all judicial and administrative remedies have been exhausted or have lapsed, and that is not being paid in a timely manner pursuant to an agreement with the authority responsible for collecting the tax liability. Includes exception if the agency has considered suspension or debarment of the corporation and made a determination that this further action is not necessary to protect the interests of the government.  (Sec. 623) Prohibits the use of funds to enter into a contract, memorandum of understanding, or cooperative agreement with, make a grant to, or provide a loan or loan guarantee to, any corporation that was convicted of a felony criminal violation under any federal law within the preceding 24 months, where the awarding agency is aware of the conviction. Includes an exception if the agency has considered suspension or debarment of the corporation and made a determination that this further action is not necessary to protect the interests of the government.  (Sec. 624) Appropriates amounts required under current law for:   compensation of the President;  payments to the Judicial Officers' Retirement Fund, the Judicial Survivors' Annuities Fund, and the U.S. Court of Federal Claims Judges' Retirement Fund; payment of government contributions for health benefits of federal retired employees, and life insurance benefits for such employees; and  payment to finance the unfunded liability of new and increased annuity benefits under the Civil Service Retirement and Disability Fund.   (Sec. 625) Prohibits obligation of funds in FY2015 from the Securities and Exchange Commission Reserve Fund established by Dodd-Frank.  (Sec. 626) Prohibits the SEC from using funds provided in this Act to finalize, issue, or implement any rule, regulation, or order regarding the disclosure of political contributions, contributions to tax exempt organizations, or dues paid to trade associations.  (Sec. 627) Extends the Multinational Species Conservation Fund Semipostal Stamp Act of 2010. Requires the USPS to continue printing the stamp through 2017 and offer additional stamps depicting endangered species.  (Sec. 628) Requires the CPSC, the FCC, the FTC, and the SEC to report to the congressional appropriations committees on:   increasing public participation in the rulemaking process and reducing uncertainty; improving coordination with other federal agencies to eliminate redundant, inconsistent, and overlapping regulations; and  identifying existing regulations that have been reviewed and determined to be outmoded, ineffective, or excessively burdensome.   (Sec. 629) Prohibits funds provided in this Act from being used for contracts to train any employees of an executive agency to learn how to support or defeat legislation pending before Congress. (Sec. 630) Prohibits the IRS from using funds to destroy, deface, or dispose of records in contravention of the Federal Records Act (FRA). Requires the Archivist of the United States to report on IRS compliance with the FRA. (Sec. 631) Prohibits funds from being used to require a provider of electronic communications service or remote computing services to disclose certain wire or electronic communications by any other means other than those authorized by specific statutory provisions requiring procedures such as a warrant.  (Sec. 632) Amends a provision in Dodd-Frank that prohibited federal assistance for entities engaged in certain swap dealing activities (a type of derivative involving the exchange of one asset or liability for a similar asset or liability).  Title VII: General Provisions Government-Wide - Sets forth requirements for the use of appropriations by designated departments, agencies, and corporations.  (Sec. 701) Prohibits the use of appropriations by any federal department, agency, or instrumentality unless it administers a policy designed to ensure that all workplaces are free from the illegal use, possession, or distribution of controlled substances.  (Sec. 702) Establishes price limitations on vehicles to be purchased by the federal government. Includes exemptions for electric, plug-in hybrid electric, and hydrogen fuel cell vehicles.  (Sec. 704) Prohibits the employment of noncitizens with certain exceptions.  (Sec. 706) Authorizes agencies to finance the costs of recycling and waste prevention programs with proceeds from the sale of materials recovered through those programs. (Sec. 708) Prohibits interagency financing of boards, commission, councils, committees, or similar groups absent prior statutory approval. (Sec. 709) Prohibits funds from being used to implement, administer, or enforce any regulation which has been disapproved pursuant to a joint resolution.  (Sec. 711) Permits interagency funding of national security and emergency telecommunications initiatives.  (Sec. 712) Requires agencies to certify that certain appointments were not created solely or primarily to detail an individual to the White House.  (Sec. 713) Bars payment of any employee who prohibits, threatens, or prevents another employee from communicating with Congress.  (Sec. 714) Prohibits funds from being used for certain types of federal training that is not directly related to the performance of official duties, contains elements likely to induce high levels of emotional response or stress, does not require prior employee notification of the content and written end of course evaluation, contains religious content, or is offensive to or designed to change participants' personal values or lifestyle.  (Sec. 715) Prohibits an agency of the executive branch from using funds for publicity or propaganda purposes or for the preparation or distribution of materials designed to support or defeat legislation pending before Congress. (Sec. 716) Prohibits an agency from providing a federal employee's home address to any labor organization absent employee authorization or a court order. (Sec. 717) Prohibits funds from being used to provide any non-public information such as mailing, telephone, or electronic mailing lists to any organization outside the federal government without approval of the appropriations committees.  (Sec. 718) Prohibits funds from being used for propaganda and publicity purposes not authorized by Congress.  (Sec. 720) Allows the use of funds to finance an appropriate share of the Federal Accounting Standards Advisory Board. (Sec. 722) Permits breastfeeding at any location in a federal building or on federal property if the woman and child are authorized to be present at the location.  (Sec. 723) Permits interagency funding of the National Science and Technology Council and requires OMB to provide a report describing the budget and resources connected with the council.  (Sec. 725) Prohibits the use of funds by federal agencies to collect, review, create or contract for any aggregation of data by any means of any personally identifiable information relating to an individual's access to or use of any federal government or nongovernmental Internet site. Includes exceptions for data that does not identify particular persons; a voluntary submission of personally identifiable information; law enforcement, regulatory, or supervisory purposes; and system security actions taken by the operator of the site.  (Sec. 726) Prohibits the use of funds to enter into or renew a contract for a federal employee health plan which includes a provision providing prescription drug coverage, except where the contract also includes a provision for contraceptive coverage. Exempts specified religious plans from such prohibition. Prohibits a federal employee health plan, however, from discriminating against an individual on the basis that the individual refuses to prescribe or otherwise provide for contraceptives because such activities would be contrary to his or her religious beliefs or moral convictions.  (Sec. 728) Allows the use of funds appropriated for official travel by federal departments and agencies, if consistent with OMB Circular A-126 regarding official travel for government personnel, to participate in the fractional aircraft ownership pilot program.  (Sec. 729) Bars the use of funds to: (1) implement or enforce restrictions or limitations on the Coast Guard Congressional Fellowship Program, or (2) implement proposed OPM regulations relating to the detail of executive branch employees to the legislative branch.  (Sec. 730) Prohibits an executive branch agency from purchasing, constructing, and/or leasing any additional facilities, except within or contiguous to existing locations, to conduct federal law enforcement training without advance approval of congressional appropriations committees. Authorizes the Federal Law Enforcement Training Center to obtain the temporary use of additional facilities by lease, contract, or other agreement for training which cannot be accommodated in existing Center facilities.  (Sec. 731) Bars the use of funds by an executive branch agency, unless otherwise authorized by existing law, to produce any prepackaged news story intended for broadcast or distribution in the United States, unless the story includes a clear notification within its text or audio that it was prepared or funded by that agency.  (Sec. 732) Bars the use of funds in contravention of the Privacy Act or regulations concerning protection of privacy and freedom of information.  (Sec. 733) Prohibits the use of funds for any federal government contract with any foreign incorporated entity which is treated as an inverted domestic corporation under the Homeland Security Act of 2002, or any subsidiary of such an entity. Requires any Secretary to waive such prohibition if so required in the interest of national security. Exempts contracts entered into before the enactment of this Act or task orders issued pursuant to such contracts.  (Sec. 734) Requires for each employee, during FY2015, who retires under voluntary early retirement authority (VERA) of the Civil Service Retirement System (CSRS) or Federal Employees' Retirement System (FERS), or under any other CSRS or FERS requirement and receives a voluntary separation incentive payment (VISP), that the separating agency remit to the Civil Service Retirement and Disability Fund an amount equal to OPM's average unit cost of processing a retirement claim for the preceding year.  (Sec. 735) Bars the use of funds to recommend or require any entity submitting an offer for a federal contract to disclose specified information regarding contributions or expenditures with respect to a federal election as a condition of such offer or acquisition.  (Sec. 736) Bars the use of funds to pay for the painting of portraits of a federal officer or employee, including the President, the Vice President, a Member of Congress (including a Delegate or a Resident Commissioner to Congress), the head of an executive branch agency, or the head of an office of the legislative branch.  (Sec. 737) Limits pay increases for certain categories of prevailing rate employees.  (Sec. 738) Eliminates automatic pay increases for the Vice President and certain categories of political appointees.  Title VIII: General Provisions (District of Columbia) - Sets forth authorized or prohibited uses of funds appropriated by this Act for the District of Columbia.  (Sec. 801) Appropriates funds for refunding overpayments of taxes collected and for paying settlements and judgments against the District of Columbia government.  (Sec. 802) Prohibits the use of federal funds provided in this Act for publicity or propaganda purposes or implementation of any policy including boycott designed to support or defeat legislation pending before Congress or any state legislature.  (Sec. 806) Prohibits the use of federal funds contained in this Act by the District of Columbia Attorney General or any other officer or entity of the District government to provide assistance for any petition drive or civil action which seeks to require Congress to provide for voting representation in Congress for the District.  Declares that nothing in this section bars the District of Columbia Attorney General from reviewing or commenting on briefs in private lawsuits, or from consulting with officials of the District government regarding such lawsuits.  (Sec. 807) Bars the use of federal funds contained in this Act for any program of distributing sterile needles or syringes for the hypodermic injection of any illegal drug.  (Sec. 808) Provides that nothing in this Act may be construed to prevent the Council or the Mayor from addressing the issue of the provision of contraceptive coverage by health insurance plans. Expresses the intent of Congress that any legislation enacted on such issue should include a \"conscience clause\" which provides exceptions for religious beliefs and moral convictions.  (Sec. 809) Prohibits the use of federal funds contained in this Act to legalize or otherwise reduce penalties associated with the possession, use, or distribution of any schedule I substance under the Controlled Substances Act or any tetrahydrocannabinols (THC) derivative.  Prohibits the use of federal funds to legalize or reduce penalties associated with possession, use, or distribution of any schedule I substance under the Controlled Substance Act or any tetrahydrocannabinols derivative for recreational use.   (Sec. 810) Prohibits the expenditure of funds appropriated under this Act for abortions except where the mother's life would be endangered if the fetus were carried to term, or in cases of rape or incest. (Sec. 816) Appropriates local funds to the District of Columbia during FY2016 if there is no continuing resolution or regular appropriation for the District of Columbia in effect.  Title IX: Additional General Provisions - (Sec 901) Prohibits funds under this Act from being used to pay for an abortion or the administrative expenses in connection with a multistate qualified health plan offered under a contract under section 1334 of the Patient Protection and Affordable Care Act which provides any benefits or coverage for abortions. Includes exceptions where the life of the mother would be endangered or the pregnancy is the result of an act of rape or incest.  (Sec. 902) Establishes a spending reduction account consisting of the amount by which each applicable allocation of new budget authority made by the Committee on Appropriations of the House exceeds the amount of proposed new budget authority.  (Sec. 904) Prohibits funds made available by this Act from being used to award contracts to corporations incorporated or chartered in Bermuda or the Cayman Islands if they were previously incorporated in the United States.  (Sec. 905) Prohibits funds made available by this Act from being used to reinstall the Red Mountain sculpture on the plaza of the Hugo Black Courthouse in Birmingham, Alabama.  (Sec. 906) Prohibits funds made available by this Act from being used to award contracts to contractors who have disclosed certain violations of the Fair Labor Standards Act.  (Sec. 907) Prohibits funds made available by this Act from being used to modify or rebuild any portion of the White House bowling alley.  (Sec. 908) Prohibits funds made available by this Act from being used to award a contract to a company currently indicted or previously convicted of certain crimes, or that has delinquent taxes of more than $3,000.  (Sec. 909) Prohibits funds made available by this Act from being used in contravention of the Federal Records Act.  (Sec. 910) Prohibits OMB from apportioning funds made available by this Act for any position held by an employee with respect to whom the President of the Senate or Speaker of the House of Representatives has certified a statement of facts to a U.S. Attorney related to contempt of Congress.  (Sec. 911) Prohibits the IRS from using funds made available by this Act to contravene a provision of the Internal Revenue Code of 1986 related to the confidentiality and disclosure of returns and return information.  (Sec. 912) Prohibits funds made available by this Act from being used to lease or purchase new light duty vehicles for any executive fleet inventory except in accordance with a specific Presidential Memorandum related to federal fleet performance.  (Sec. 913) Prohibits funds made available by this Act from being used to designate a nonbank financial company as \"too big to fail,\" designate a nonbank financial company as a \"systemically important financial institution,\" or to make a determination that a nonbank financial company could pose a threat to the financial stability of the United States.  (Sec. 914) Prohibits funds made available in this Act from being used to study, promulgate, draft, review, implement, or enforce any rule pursuant to a section of Dodd-Frank related to the obligations of brokers, dealers, and investment advisers. (Sec. 915) Prohibits funds made available by this Act from being used to pay a performance award to certain IRS employees.  (Sec. 916) Prohibits funds made available by this Act from being used to penalize a financial institution for providing services to marijuana-related businesses that engage in activities permissible under state or local laws.  (Sec. 917) Prohibits the IRS from using funds made available by this Act to create machine-readable materials that are not subject to certain safeguards related to protecting against the removal or loss of records. (Sec. 918) Prohibits the IRS from using funds made available by this Act for conferences.  (Sec. 919) Prohibits funds from the Hardest Hit Fund program established in title I of the Emergency Economic Stabilization Act of 2008 (Troubled Asset Relief Program or TARP) from being used to provide funds to any state or local government for the purpose of funding pension obligations of the state or local government. (Sec. 920) Prohibits the FCC from using funds provided in this Act to implement any regulation preempting certain state laws regarding municipal broadband internet access.  (Sec. 921) Prohibits the CPSC from using funds provided in this Act to finalize, implement, or enforce the proposed rule entitled \"Voluntary Remedial Actions and Guidelines for Voluntary Recall Notices.\"  (Sec. 922) Prohibits the District of Columbia from using funds provided in this Act to enforce various local laws related to firearms.", "pending_committee_id": 2319, "committee": {"committee_id": 2319, "chamber": "S", "chamber_id": 115, "name": "Appropriations"}, "referrals": [{"date": "2014-07-17", "committee_id": 2319, "chamber": "S", "chamber_id": 115, "name": "Appropriations"}], "history": [{"date": "2014-07-02", "action": "The House Committee on Appropriations reported an original measure, H. Rept. 113-508, by Mr. Crenshaw.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-02", "action": "Placed on the Union Calendar, Calendar No. 380.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-09", "action": "Rules Committee Resolution H. Res. 661 Reported to House. The resolution provides for the consideration of H.R. 5016 and H.R. 4718. The resolution provides for one hour of debate for each bill. Amendments may be offered to H.R. 5016, however no amendments are in order for H.R. 4718 except for the amendment in the nature of a substitute recommended by the Committee on Ways and Means and modified by the amendment printed in House Report 113-517. One motion to recommit is allowed for each bill.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-14", "action": "Considered under the provisions of rule H. Res. 661. (consideration: CR H6169-6213; text of Title I as reported in House: CR H6180-6181, H6181, H6182, H6183, H6185, H6186, H6187, H6190, H6191-6192; text of Title II as reported in House: CR H6192-6194; text of Title III as reported in House: CR H6194, H6195-6196; text of Title IV as reported in House: CR H6196-6197; text of Title V as reported in House: CR H6197, H6198, H6199-6203, H6204, H6205; text of Title VI as reported in House: CR H6205-6207, H6208; text of Title VII as reported in House: CR H6208-6212; text of Title VIII as reported in House: CR H6212-6213; text of Title IX as reported in House: CR H6213)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-14", "action": "The resolution provides for the consideration of H.R. 5016 and H.R. 4718. The resolution provides for one hour of debate for each bill. Amendments may be offered to H.R. 5016, however no amendments are in order for H.R. 4718 except for the amendment in the nature of a substitute recommended by the Committee on Ways and Means and modified by the amendment printed in House Report 113-517. One motion to recommit is allowed for each bill.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-14", "action": "House resolved itself into the Committee of the Whole House on the state of the Union pursuant to H. Res. 661 and Rule XVIII.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-14", "action": "The Speaker designated the Honorable Chris Collins to act as Chairman of the Committee.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-14", "action": "GENERAL DEBATE - The Committee of the Whole proceeded with one hour of general debate on H.R. 5016.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-14", "action": "H.AMDT.1052 Amendment (A001) offered by Mr. Sessions. (consideration: CR H6181; text: CR H6181)Amendment reduces funding for salaries and expenses at the Department of Treasury by $1.75 million and applies the savings to the spending reduction account.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-14", "action": "DEBATE - Pursuant to the provisions of H. Res. 661, the Committee of the Whole proceeded with 10 minutes of debate on the Sessions amendment.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-14", "action": "H.AMDT.1052 On agreeing to the Sessions amendment (A001) Agreed to by voice vote.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-14", "action": "H.AMDT.1053 Amendment (A002) offered by Mr. Grayson. (consideration: CR H6181-6182; text: CR H6181)Amendment sought to increase funding for salaries and expenses of the Office of Terrorism and Financial Intelligence by $5 million and to reduce funding for salaries and expenses of Administration of Treasury Inspector General for Tax by a similar amount.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-14", "action": "DEBATE - Pursuant to the provisions of H. Res. 661, the Committee of the Whole proceeded with 10 minutes of debate on the Grayson amendment.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-14", "action": "H.AMDT.1053 On agreeing to the Grayson amendment (A002) Failed by voice vote.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-14", "action": "H.AMDT.1054 Amendment (A003) offered by Mr. Posey. (consideration: CR H6182-6183; text: CR H6182)Amendment transfers $1 million from the IRS enforcement division to the IRS Office of the Inspector General.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-14", "action": "DEBATE - Pursuant to the provisions of H. Res. 661, the Committee of the Whole proceeded with 10 minutes of debate on the Posey amendment.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-14", "action": "H.AMDT.1054 On agreeing to the Posey amendment (A003) Agreed to by voice vote.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-14", "action": "H.AMDT.1055 Amendment (A004) offered by Ms. Jackson Lee. (consideration: CR H6183-6184; text: CR H6183)Amendment sought to reduce funding for salaries and expenses of the Financial Crimes Enforcement Network by $200,000 and to increase funding for taxpayer services at the IRS by $100,000.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-14", "action": "DEBATE - Pursuant to the provisions of H. Res. 661, the Committee of the Whole proceeded with 10 minutes of debate on the Jackson Lee amendment.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-14", "action": "POSTPONED PROCEEDINGS - At the conclusion of debate on the Jackson Lee amendment, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Ms. Jackson Lee demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-14", "action": "H.AMDT.1056 Amendment (A005) offered by Mr. Lynch. (consideration: CR H6184-6185; text: CR H6184)Amendment increases funding for salaries and expenses for Financial Crimes Enforcement Network by $3,339,000 and reduces funding for the Federal Buildings Fund at GSA by a similar amount.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-14", "action": "DEBATE - Pursuant to the provisions of H. Res. 661, the Committee of the Whole proceeded with 10 minutes of debate on the Lynch amendment.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-14", "action": "H.AMDT.1056 On agreeing to the Lynch amendment (A005) Agreed to by voice vote.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-14", "action": "H.AMDT.1057 Amendment (A006) offered by Ms. Jackson Lee. (consideration: CR H6185-6186; text: CR H6185)Amendment increases funding for the Fund Program Account of the Community Development Financial Institutions by $500,000 and reduces funding for taxpayer services at IRS by $1 million.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-14", "action": "DEBATE - Pursuant to the provisions of H. Res. 661, the Committee of the Whole proceeded with 10 minutes of debate on the Jackson Lee amendment.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-14", "action": "H.AMDT.1057 On agreeing to the Jackson Lee amendment (A006) Agreed to by voice vote.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-14", "action": "H.AMDT.1058 Amendment (A007) offered by Mr. Roskam. (consideration: CR H6186-6187; text: CR H6186)Amendment increases funding for taxpayer services at IRS by $10 million and reduces funding for enforcement at IRS by a similar amount.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-14", "action": "DEBATE - Pursuant to the provisions of H. Res. 661, the Committee of the Whole proceeded with 10 minutes of debate on the Roskam amendment.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-14", "action": "POSTPONED PROCEEDINGS - At the conclusion of debate on the Roskam amendment, the Chair put the question on adoption of the amendment and by voice vote, announced that the ayes had prevailed. Mr. Roskam demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-14", "action": "H.AMDT.1059 Amendment (A008) offered by Mr. Grayson. (consideration: CR H6187; text: CR H6187)Amendment provides for a $2.8 million increase in funding for Tax Counseling for the Elderly.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-14", "action": "DEBATE - Pursuant to the provisions of H. Res. 661, the Committee of the Whole proceeded with 10 minutes of debate on the Grayson amendment.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-14", "action": "H.AMDT.1059 On agreeing to the Grayson amendment (A008) Agreed to by voice vote.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-14", "action": "H.AMDT.1060 Amendment (A009) offered by Mrs. Blackburn. (consideration: CR H6187-6188; text: CR H6187)Amendment reduces funding for IRS enforcement by $2 million and increases funding for third-party testing burden relief at CPSC by $1 million.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-14", "action": "DEBATE - Pursuant to the provisions of H. Res. 661, the Committee of the Whole proceeded with 10 minutes of debate on the Blackburn amendment.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-14", "action": "H.AMDT.1060 On agreeing to the Blackburn amendment (A009) Agreed to by voice vote.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-14", "action": "H.AMDT.1061 Amendment (A010) offered by Mr. Gosar. (consideration: CR H6188-6189; text: CR H6188)Amendment reduces funding for tax enforcement activities of the IRS by $353 million and applies the savings to the spending reduction account.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-14", "action": "DEBATE - Pursuant to the provisions of H. Res. 661, the Committee of the Whole proceeded with 10 minutes of debate on the Gosar amendment.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-14", "action": "H.AMDT.1061 On agreeing to the Gosar amendment (A010) Agreed to by voice vote.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-14", "action": "H.AMDT.1062 Amendment (A011) offered by Mr. Huizenga (MI). (consideration: CR H6189-6190; text: CR H6189)Amendment reduces funding for enforcement at IRS by $788,111,800 and applies the savings to the spending reduction account.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-14", "action": "DEBATE - Pursuant to the provisions of H. Res. 661, the Committee of the Whole proceeded with 10 minutes of debate on the Huizenga (MI) amendment.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-14", "action": "H.AMDT.1062 On agreeing to the Huizenga (MI) amendment (A011) Agreed to by voice vote.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-14", "action": "H.AMDT.1063 Amendment (A012) offered by Mr. Camp. (consideration: CR H6190-6191; text: CR H6190)Amendment reduces funding for the Office of the Commissioner and the Office of Legislative Affairs at IRS by $2 million and applies the savings to the spending reduction account.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-14", "action": "DEBATE - Pursuant to the provisions of H. Res. 661, the Committee of the Whole proceeded with 10 minutes of debate on the Camp amendment.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-14", "action": "H.AMDT.1063 On agreeing to the Camp amendment (A012) Agreed to by voice vote.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-14", "action": "H.AMDT.1064 Amendment (A013) offered by Mr. Gosar. (consideration: CR H6194-6195; text: CR H6194)Amendment increases funding for the U.S. court system by $42 million and reduces funding for GSA by $43 million.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-14", "action": "DEBATE - Pursuant to the provisions of H. Res. 661, the Committee of the Whole proceeded with 10 minutes of debate on the Gosar amendment.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-14", "action": "H.AMDT.1064 On agreeing to the Gosar amendment (A013) Agreed to by voice vote.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-14", "action": "H.AMDT.1065 Amendment (A014) offered by Ms. Moore. (consideration: CR H6197-6198; text: CR H6197)Amendment sought to strike section 501 from the bill which relates to administrative provisions of the Consumer Financial Protection Bureau.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-14", "action": "DEBATE - Pursuant to the provisions of H. Res. 661, the Committee of the Whole proceeded with 10 minutes of debate on the Moore amendment.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-14", "action": "POSTPONED PROCEEDINGS - At the conclusion of debate on the Moore amendment, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Ms. Moore demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-14", "action": "H.AMDT.1066 Amendment (A015) offered by Ms. Waters. (consideration: CR H6198-6199; text: CR H6198)An amendment to insert new provisions which strike section 502 making CFPB part of the appropriations process.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-14", "action": "DEBATE - Pursuant to the provisions of H. Res. 661, the Committee of the Whole proceeded with 10 minutes of debate on the Waters amendment, pending reservation of a point of order.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-14", "action": "H.AMDT.1066 Mr. Crenshaw raised a point of order against the Waters amendment (A015). Mr. Crenshaw stated that the provisions of the Waters amendment sought to change existing law and constituted legislation in an appropriations bill. The Chair sustained the point of order.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-14", "action": "H.AMDT.1067 Amendment (A016) offered by Ms. Waters. (consideration: CR H6203-6204; text: CR H6203)Amendment sought to provide $300 million in funding for the SEC thereby bringing the level up to the President's request of $1.7 billion.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-14", "action": "DEBATE - Pursuant to the provisions of H. Res. 661, the Committee of the Whole proceeded with 10 minutes of debate on the Waters amendment.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-14", "action": "POSTPONED PROCEEDINGS - At the conclusion of debate on the Waters amendment, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Ms. Waters demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-14", "action": "H.AMDT.1068 Amendment (A017) offered by Mr. Gosar. (consideration: CR H6204-6205; text: CR H6204)Amendment reduces funding for salaries and expenses at SBA by $3,882,000 and increases funding for entrepeneurial development programs by a similar amount.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-14", "action": "DEBATE - Pursuant to the provisions of H. Res. 661, the Committee of the Whole proceeded with 10 minutes of debate on the Gosar amendment.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-14", "action": "H.AMDT.1068 On agreeing to the Gosar amendment (A017) Agreed to by voice vote.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-14", "action": "H.AMDT.1069 Amendment (A018) offered by Ms. Waters. (consideration: CR H6207-6208; text: CR H6207)An amendment to add a new section which amends section 204 of the Investment Advisers Act of 1940 regarding investment adviser fees by the SEC.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-14", "action": "DEBATE - Pursuant to the provisions of H. Res. 661, the Committee of the Whole proceeded with 10 minutes of debate on the Waters amendment, pending reservation of a point of order.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-14", "action": "H.AMDT.1069 Mr. Crenshaw raised a point of order against the Waters amendment (A018). Mr. Crenshaw stated that the provisions of the Waters amendment sought to change existing law and constituted legislation in an appropriations bill. The Chair sustained the point of order.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-14", "action": "Mr. Crenshaw moved that the Committee rise.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-14", "action": "On motion that the Committee rise Agreed to by voice vote.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-14", "action": "Committee of the Whole House on the state of the Union rises leaving H.R. 5016 as unfinished business.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-15", "action": "Considered as unfinished business. (consideration: CR H6242-6245)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-15", "action": "The House resolved into Committee of the Whole House on the state of the Union for further consideration.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-15", "action": "H.AMDT.1055 On agreeing to the Jackson Lee amendment (A004) Failed by recorded vote: 161 - 258 (Roll no. 409). (consideration: CR H6242-6243)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-15", "action": "H.AMDT.1058 On agreeing to the Roskam amendment (A007) Agreed to by recorded vote: 338 - 80 (Roll no. 410). (consideration: CR H6243-6244)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-15", "action": "H.AMDT.1065 On agreeing to the Moore amendment (A014) Failed by recorded vote: 170 - 244 (Roll no. 411). (consideration: CR H6244)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-15", "action": "H.AMDT.1067 On agreeing to the Waters amendment (A016) Failed by recorded vote: 184 - 235 (Roll no. 412). (consideration: CR H6244-6245)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-15", "action": "Mr. Crenshaw moved that the Committee rise.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-15", "action": "On motion that the Committee rise Agreed to by voice vote.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-15", "action": "Committee of the Whole House on the state of the Union rises leaving H.R. 5016 as unfinished business.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-15", "action": "Considered as unfinished business. (consideration: CR H6261-6284)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-15", "action": "The House resolved into Committee of the Whole House on the state of the Union for further consideration.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-15", "action": "H.AMDT.1071 Amendment (A019) offered by Mr. Frelinghuysen. (consideration: CR H6262-6263; text: CR H6262)An amendment to reduce the funds for National Security Council and Homeland Security Council - Salaries and Expenses by $4,200,000.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-15", "action": "DEBATE - Pursuant to the provisions of H. Res. 661, the Committee of the Whole proceeded with 10 minutes of debate on the Frelinghuysen amendment.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-15", "action": "H.AMDT.1071 On agreeing to the Frelinghuysen amendment (A019) Agreed to by voice vote.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-15", "action": "H.AMDT.1072 Amendment (A020) offered by Ms. DeLauro. (consideration: CR H6263-6264; text: CR H6263)Amendment to prohibit the use of funds to enter into contracts with incorporated entities whose sealed bid or competitive proposal shows that the entity is incorporated or chartered in Bermuda or the Cayman Islands and previously incorporated in the United States.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-15", "action": "DEBATE - Pursuant to the provisions of H. Res. 661, the Committee of the Whole proceeded with 10 minutes of debate on the DeLauro amendment.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-15", "action": "H.AMDT.1072 On agreeing to the DeLauro amendment (A020) Agreed to by voice vote.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-15", "action": "H.AMDT.1073 Amendment (A021) offered by Mr. Bachus. (consideration: CR H6264-6265; text: CR H6264)An amendment numbered 4, printed in the Congressional Record, to prohibit the use of funds to reinstall the Red Mountain sculpture on the plaza of the Hugo Black Courthouse in Birmingham, Alabama.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-15", "action": "DEBATE - Pursuant to the provisions of H. Res. 661, the Committee of the Whole proceeded with 10 minutes of debate on the Bachus amendment No. 4.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-15", "action": "H.AMDT.1073 On agreeing to the Bachus amendment (A021) Agreed to by voice vote.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-15", "action": "H.AMDT.1074 Amendment (A022) offered by Ms. Schakowsky. (consideration: CR H6265-6266; text: CR H6265)An amendment to prohibit the use of funds to enter into a contract with any person whose disclosures of a proceeding with a disposition listed in section 2313(c)(1) of title 41, United States Code, in the Federal Awardee Performance and Integrity Information System include the term \"Fair Labor Standards Act.\".", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-15", "action": "DEBATE - Pursuant to the provisions of H. Res. 661, the Committee of the Whole proceeded with 10 minutes of debate on the Schakowsky amendment.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-15", "action": "H.AMDT.1074 On agreeing to the Schakowsky amendment (A022) Agreed to by voice vote.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-15", "action": "H.AMDT.1075 Amendment (A023) offered by Mr. Meehan. (consideration: CR H6266-6267; text: CR H6266)An amendment numbered 2, printed in the Congressional Record, to prohibit the use of funds to modify or rebuild any portion of the White House bowling alley, including using phenolic synthetic material.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-15", "action": "DEBATE - Pursuant to the provisions of H. Res. 661, the Committee of the Whole proceeded with 10 minutes of debate on the Meehan amendment No. 2.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-15", "action": "POSTPONED PROCEEDINGS - At the conclusion of debate on the Meehan amendment, the Chair put the question on adoption of the amendment and by voice vote, announced that the ayes had prevailed. Mr. Serrano demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-15", "action": "H.AMDT.1076 Amendment (A024) offered by Mr. Grayson. (consideration: CR H6267-6268; text: CR H6267)Amendment prohibits the use of funds to enter into a contract with any offeror that has been convicted of misconduct such as theft, forgery, bribery, or violating Federal criminal tax laws.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-15", "action": "DEBATE - Pursuant to the provisions of H. Res. 661, the Committee of the Whole proceeded with 10 minutes of debate on the Grayson amendment.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-15", "action": "H.AMDT.1076 On agreeing to the Grayson amendment (A024) Agreed to by voice vote.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-15", "action": "H.AMDT.1077 Amendment (A025) offered by Mr. Sherman. (consideration: CR H6268; text: CR H6268)An amendment to prohibit the use of funds to implement, administer, or enforce final leasing accounting standard rules, regulations, or requirements in FASB Project 2013-270, Accounting Standards Update Topic 842.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-15", "action": "DEBATE - Pursuant to the provisions of H. Res. 661, the Committee of the Whole proceeded with 10 minutes of debate on the Sherman amendment.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-15", "action": "H.AMDT.1077 By unanimous consent, the Sherman amendment was withdrawn. (consideration: CR H6268)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-15", "action": "H.AMDT.1078 Amendment (A026) offered by Mr. Fleming. (consideration: CR H6268-6270; text: CR H6268)An amendment numbered 1 printed in the Congressional Record to prohibit the use of funds to implement guidance FIN-2014-G001 (relating to BSA Expectations Regarding Marijuana-Related Businesses) issued on February 14, 2014.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-15", "action": "DEBATE - Pursuant to the provisions of H. Res. 661, the Committee of the Whole proceeded with 10 minutes of debate on the Fleming amendment No. 1.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-15", "action": "POSTPONED PROCEEDINGS - At the conclusion of debate on the Fleming amendment, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Mr. Fleming demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-15", "action": "H.AMDT.1079 Amendment (A027) offered by Mr. Gosar. (consideration: CR H6270-6271; text: CR H6270)An amendment to prohibit the use of funds to pay performance awards to employees of the IRS.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-15", "action": "DEBATE - Pursuant to the provisions of H. Res. 661, the Committee of the Whole proceeded with 10 minutes of debate on the Gosar amendment.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-15", "action": "POSTPONED PROCEEDINGS - At the conclusion of debate on the Gosar amendment, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Mr. Gosar demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-15", "action": "H.AMDT.1080 Amendment (A028) offered by Mr. Heck (WA). (consideration: CR H6271-6272; text: CR H6271)An amendment to prohibit funds from being used with respect to specified States to prohibit or penalize a financial institution from providing financial services to an entity solely because the entity is a manufacturer, producer, or person that participates in any business or organized activity that involves handling marijuana or marijuana products and engages in such activity pursuant to a law established by a State or local government.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-15", "action": "DEBATE - Pursuant to the provisions of H. Res. 661, the Committee of the Whole proceeded with 10 minutes of debate on the Heck (WA) amendment pending a reservation of a point or order.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-15", "action": "H.AMDT.1080 Mr. Crenshaw raised a point of order against the Heck (WA) amendment (A028). Mr. Crenshaw stated the provisions of the Heck(WA) amendment sought to change existing law and constituted legislation in an appropriations bill. The Chair sustained the point of order.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-15", "action": "H.AMDT.1081 Amendment (A029) offered by Mr. Walberg. (consideration: CR H6272; text: CR H6272)Amendment prohibits use of funds in the bill by the IRS to act in contravention of the Federal Records Act.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-15", "action": "DEBATE - Pursuant to the provisions of H. Res. 661, the Committee of the Whole proceeded with 10 minutes of debate on the Walberg amendment.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-15", "action": "H.AMDT.1081 On agreeing to the Walberg amendment (A029) Agreed to by voice vote.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-15", "action": "H.AMDT.1082 Amendment (A030) offered by Mr. Farenthold. (consideration: CR H6272-6273; text: CR H6273)Amendment to prohibit the use of funds for the Office of Management and Budget to process or approve an apportionment request that does not include the following phrase: \"Apportioned amounts are not available for any position that is held by an employee with respect to whom the President of the Senate or the Speaker of the House of Representatives has certified a statement of facts to a United States attorney under section 104 of the Revised Statutes.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-15", "action": "DEBATE - Pursuant to the provisions of H. Res. 661, the Committee of the Whole proceeded with 10 minutes of debate on the Farenthold amendment.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-15", "action": "H.AMDT.1082 On agreeing to the Farenthold amendment (A030) Agreed to by voice vote.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-15", "action": "H.AMDT.1083 Amendment (A031) offered by Mr. Grayson. (consideration: CR H6273-6274; text: CR H6273)Amendment sought to provide that the Federal Government may not pay anyone less than $10.10 an hour.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-15", "action": "DEBATE - Pursuant to the provisions of H. Res. 661, the Committee of the Whole proceeded with 10 minutes of debate on the Grayson amendment.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-15", "action": "POSTPONED PROCEEDINGS - At the conclusion of debate on the Grayson amendment, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Mr. Grayson demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-15", "action": "H.AMDT.1084 Amendment (A032) offered by Mr. Massie. (consideration: CR H6274; text: CR H6274)An amendment to prohibit the use of funds by any authority of the government of the District of Columbia to prohibit the ability of any person to possess, acquire, use, sell, or transport a firearm except to the extent such activity is prohibited by Federal law.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-15", "action": "DEBATE - Pursuant to the provisions of H. Res. 661, the Committee of the Whole proceeded with 10 minutes of debate on the Massie amendment pending a reservation of a point or order.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-15", "action": "H.AMDT.1084 Mr. Serrano raised a point of order against the Massie amendment (A032). Mr. Serrano stated the provisions of the Massie amendment sought to change existing law and constituted legislation in an appropriations bill. The Chair sustained the point of order.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-15", "action": "Mr. Massie appealed the ruling of the Chair. The Chair announced that the question before the Committee was \"shall the decision of the Chair stand as the judgement of the Committee\".", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-15", "action": "H.AMDT.1085 Amendment (A033) offered by Mr. Marino. (consideration: CR H6274-6275; text: CR H6275)An amendment to prohibit the use of funds to collect any underpayment of any tax imposed by the Internal Revenue Code of 1986 to the extent such underpayment is attributable to the taxpayer's loss of records (except in the case of fraud).", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-15", "action": "DEBATE - Pursuant to the provisions of H. Res. 661, the Committee of the Whole proceeded with 10 minutes of debate on the Marino amendment pending a reservation of a point or order.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-15", "action": "H.AMDT.1085 By unanimous consent, the Marino amendment was withdrawn. (consideration: CR H6275)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-15", "action": "H.AMDT.1086 Amendment (A034) offered by Mr. Heck (WA). (consideration: CR H6275-6276; text: CR H6275)Amendment to prohibit use of funds with respect to specified States, to penalize a financial institution solely because the institution provides financial services to an entity that is a manufacturer, producer, or a person that participates in any business or organized activity that involves handling marijuana or marijuana products and engages in such activity pursuant to a law established by a State or local government and engages in such activity pursuant to a law established by a State or local government.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-15", "action": "DEBATE - Pursuant to the provisions of H. Res. 661, the Committee of the Whole proceeded with 10 minutes of debate on the Heck (WA) amendment.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-15", "action": "POSTPONED PROCEEDINGS - At the conclusion of debate on the Heck(WA) amendment, the Chair put the question on adoption of the amendment and by voice vote, announced that the ayes had prevailed. Mr. Crenshaw demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-15", "action": "H.AMDT.1087 Amendment (A035) offered by Mr. Price (GA). (consideration: CR H6276-6277; text: CR H6276)An amendment numbered 6 printed in the Congressional Record to prohibit the use of funds in contravention of Internal Revenue Code of 1986 (relating to confidentiality and disclosure of returns and return information).", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-15", "action": "DEBATE - Pursuant to the provisions of H. Res. 661, the Committee of the Whole proceeded with 10 minutes of debate on the Price (GA) amendment No. 6.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-15", "action": "H.AMDT.1087 On agreeing to the Price (GA) amendment (A035) Agreed to by voice vote.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-15", "action": "H.AMDT.1088 Amendment (A036) offered by Mr. DeSantis. (consideration: CR H6277; text: CR H6277)An amendment to prohibit the use of funds for any IRS instant message or other electronic communications system that is not operationally searchable and archivable at all times.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-15", "action": "H.AMDT.1088 By unanimous consent, the DeSantis amendment was withdrawn. (consideration: CR H6277)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-15", "action": "H.AMDT.1089 Amendment (A037) offered by Mr. DeSantis. (consideration: CR H6277; text: CR H6277)An amendment to prohibit the use of funds to be used by the IRS to create machine-readable materials that are not subject to the safeguards established pursuant to section 3105 of title 44, United States Code.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-15", "action": "DEBATE - Pursuant to the provisions of H. Res. 661, the Committee of the Whole proceeded with 10 minutes of debate on the DeSantis first amendment.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-15", "action": "POSTPONED PROCEEDINGS - At the conclusion of debate on the DeSantis first amendment, the Chair put the question on adoption of the amendment and by voice vote, announced that the ayes had prevailed. Mr. DeSantis demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-15", "action": "H.AMDT.1090 Amendment (A038) offered by Mr. DeSantis. (consideration: CR H6277-6278; text: CR H6277)An amendment to prohibit the use of funds to the IRS may be obligated or expended on conferences.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-15", "action": "DEBATE - Pursuant to the provisions of H. Res. 661, the Committee of the Whole proceeded with 10 minutes of debate on the DeSantis second amendment.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-15", "action": "POSTPONED PROCEEDINGS - At the conclusion of debate on the DeSantis second amendment, the Chair put the question on adoption of the amendment and by voice vote, announced that the ayes had prevailed. Mr. DeSantis demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-15", "action": "H.AMDT.1091 Amendment (A039) offered by Mrs. Blackburn. (consideration: CR H6278-6279; text: CR H6278)Amendment sought to reduce funds made available in the bill by 1 percent except for specified accounts.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-15", "action": "DEBATE - Pursuant to the provisions of H. Res. 661, the Committee of the Whole proceeded with 10 minutes of debate on the Blackburn first amendment.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-15", "action": "POSTPONED PROCEEDINGS - At the conclusion of debate on the Blackburn first amendment, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Mrs. Blackburn demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-15", "action": "H.AMDT.1092 Amendment (A040) offered by Mrs. Blackburn. (consideration: CR H6279-6280; text: CR H6279)An amendment to prohibit the use of funds for Hardest Hit Fund Program for any State or local government for the purpose of funding pension obligations.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-15", "action": "DEBATE - Pursuant to the provisions of H. Res. 661, the Committee of the Whole proceeded with 10 minutes of debate on the Blackburn second amendment.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-15", "action": "POSTPONED PROCEEDINGS - At the conclusion of debate on the Blackburn second amendment, the Chair put the question on adoption of the amendment and by voice vote, announced that the ayes had prevailed. Mr. Serrano demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-15", "action": "H.AMDT.1093 Amendment (A041) offered by Mrs. Blackburn. (consideration: CR H6280-6282; text: CR H6280)Amendment to prohibit the use of funds with respect to specified States, to prevent such States from implementing their own State laws with respect to the provision of broadband Internet access service by the State or a municipality or other political subdivision of the State.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-15", "action": "DEBATE - Pursuant to the provisions of H. Res. 661, the Committee of the Whole proceeded with 10 minutes of debate on the Blackburn third amendment.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-15", "action": "POSTPONED PROCEEDINGS - At the conclusion of debate on the Blackburn third amendment, the Chair put the question on adoption of the amendment and by voice vote, announced that the ayes had prevailed. Mr. Serrano demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-15", "action": "H.AMDT.1094 Amendment (A042) offered by Mrs. Blackburn. (consideration: CR H6282-6284; text: CR H6282)An amendment to prohibit the use of funds by the Consumer Product Safety Commission to finalize, implement, or enforce the proposed rule entitled \"Voluntary Remedial Actions and Guidelines for Voluntary Recall Notices\".", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-15", "action": "DEBATE - Pursuant to the provisions of H. Res. 661, the Committee of the Whole proceeded with 10 minutes of debate on the Blackburn fourth amendment.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-15", "action": "POSTPONED PROCEEDINGS - At the conclusion of debate on the Blackburn fourth amendment, the Chair put the question on adoption of the amendment and by voice vote, announced that the ayes had prevailed. Mr. Serrano demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-15", "action": "Mr. Crenshaw moved that the committee rise.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-15", "action": "On motion that the committee rise Agreed to by voice vote.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-15", "action": "Committee of the Whole House on the state of the Union rises leaving H.R. 5016 as unfinished business.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-16", "action": "Considered as unfinished business. (consideration: CR H6316-6323)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-16", "action": "The House resolved into Committee of the Whole House on the state of the Union for further consideration.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-16", "action": "H.AMDT.1095 Amendment (A043) offered by Mr. Engel. (consideration: CR H6316-6317; text: CR H6316)An amendment to prohibit the use of funds to lease or purchase new light duty vehicles for any executive fleet, or for an agency's fleet inventory, except in accordance with Presidential Memorandum-Federal Fleet Performance, dated May 24, 2011.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-16", "action": "DEBATE - Pursuant to the provisions of H. Res. 661, the Committee of the Whole proceeded with 10 minutes of debate on the Engel amendment.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-16", "action": "H.AMDT.1095 On agreeing to the Engel amendment (A043) Agreed to by voice vote.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-16", "action": "H.AMDT.1096 Amendment (A044) offered by Mr. Garrett. (consideration: CR H6317-6318; text: CR H6317)Amendment to prohibit the use of funds to designate any nonbank financial company as \"too big to fail\" or as a \"systemically important financial institution\" or to make a determination that material financial distress at a nonbank financial company could pose a threat to U.S. financial stability.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-16", "action": "DEBATE - Pursuant to the provisions of H. Res. 661, the Committee of the Whole proceeded with 10 minutes of debate on the Garrett amendment.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-16", "action": "H.AMDT.1096 On agreeing to the Garrett amendment (A044) Agreed to by voice vote.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-16", "action": "H.AMDT.1097 Amendment (A045) offered by Mr. Gallego. (consideration: CR H6318; text: CR H6318)An amendment to prohibit the use of funds to implement or enforce Revenue Ruling 2012-2018 (or any guidance of the same substance).", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-16", "action": "DEBATE - Pursuant to the provisions of H. Res. 661, the Committee of the Whole proceeded with 10 minutes of debate on the Gallego amendment, pending a reservation of a point or order.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-16", "action": "H.AMDT.1097 By unanimous consent, the Gallego amendment was withdrawn. (consideration: CR H6318)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-16", "action": "H.AMDT.1098 Amendment (A046) offered by Mr. Massie. (consideration: CR H6318-6320, H6330-6331; text: CR H6318)Amendment prohibits the use of funds by the District of Columbia to prevent individuals from possessing, using, or transporting a firearm.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-16", "action": "DEBATE - Pursuant to the provisions of H. Res. 661, the Committee of the Whole proceeded with 10 minutes of debate on the Massie amendment.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-16", "action": "POSTPONED PROCEEDINGS - At the conclusion of debate on the Massie amendment, the Chair put the question on adoption of the amendment and by voice vote, announced that the ayes had prevailed. Mr. Massie demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-16", "action": "H.AMDT.1099 Amendment (A047) offered by Mr. Ellison. (consideration: CR H6320; text: CR H6320)An amendment to reduce the amount made available for \"Supreme Court of the United States-Salaries and Expenses\", and increasing the amount made available for \"The White House-Salaries and Expenses\", by $2.13.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-16", "action": "DEBATE - Pursuant to the provisions of H. Res. 661, the Committee of the Whole proceeded with 10 minutes of debate on the Massie amendment.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-16", "action": "H.AMDT.1099 On agreeing to the Ellison amendment (A047) Failed by voice vote.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-16", "action": "H.AMDT.1100 Amendment (A048) offered by Mr. Rokita. (consideration: CR H6320-6321; text: CR H6320)An amendment to prohibit the use of funds to implement any rule issued after the date of enactment of this Act, that is issued pursuant to section 553 of title 5, United States Code. The prohibition shall not apply with respect to rules excepted under section 553(a) of title 5, United States Code, or that are made on the record after opportunity for an agency hearing under sections 556 or 557 of such title.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-16", "action": "DEBATE - Pursuant to the provisions of H. Res. 661, the Committee of the Whole proceeded with 10 minutes of debate on the Rokita amendment, pending a reservation of a point or order.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-16", "action": "H.AMDT.1100 By unanimous consent, the Rokita amendment was withdrawn. (consideration: CR H6320)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-16", "action": "H.AMDT.1101 Amendment (A049) offered by Mr. Crowley. (consideration: CR H6321-6322; text: CR H6321)An amendment to reduce the amount made available for \"Supreme Court of the United States-Salaries and Expenses\", and increasing the amount made available for \"The White House-Salaries and Expenses\", by $7.25.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-16", "action": "DEBATE - Pursuant to the provisions of H. Res. 661, the Committee of the Whole proceeded with 10 minutes of debate on the Crowley amendment.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-16", "action": "H.AMDT.1101 On agreeing to the Crowley amendment (A049) Failed by voice vote.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-16", "action": "H.AMDT.1102 Amendment (A050) offered by Mr. Lankford. (consideration: CR H6322-6323; text: CR H6322)An amendment to prohibit the use of funds to study, promulgate, draft, review, implement, or enforce any rule pursuant to section 913 of the Dodd-Frank Wall Street Reform and Consumer Protection Act or amendments made by such section.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-16", "action": "DEBATE - Pursuant to the provisions of H. Res. 661, the Committee of the Whole proceeded with 10 minutes of debate on the Lankford amendment.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-16", "action": "H.AMDT.1102 On agreeing to the Lankford amendment (A050) Agreed to by voice vote.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-16", "action": "H.AMDT.1103 Amendment (A051) offered by Mr. Lankford. (consideration: CR H6323; text: CR H6323)An amendment to prohibit the use of funds by the Federal Communications Commission to make any changes to its policies with respect to broadcast indecency.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-16", "action": "DEBATE - Pursuant to the provisions of H. Res. 661, the Committee of the Whole proceeded with 10 minutes of debate on the Lankford amendment.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-16", "action": "H.AMDT.1103 By unanimous consent, the Lankford amendment was withdrawn. (consideration: CR H6323)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-16", "action": "WITHDRAWN DEMAND FOR RECORDED VOTE - Mr. Serrano asked unanimous consent to withdraw his demand for a recorded vote on the Meehan amendment No. 2 debated earlier to the end that the amendment stand affirmed pursuant to the earlier voice vote on the amendment. Agreed to without objection.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-16", "action": "DISPOSITION OF MEEHAN AMENDMENT - The Chair announced that, without objection, the request for a recorded vote having been withdrawn, the Meehan amendment, stands affirmed in accordance with the previous voice vote thereon.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-16", "action": "H.AMDT.1075 On agreeing to the Meehan amendment (A023) Agreed to by voice vote. (consideration: CR H6323; text: CR H6323)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-16", "action": "Mr. Crenshaw moved that the Committee rise.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-16", "action": "On motion that the Committee rise Agreed to by voice vote.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-16", "action": "Committee of the Whole House on the state of the Union rises leaving H.R. 5016 as unfinished business.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-16", "action": "Considered as unfinished business. (consideration: CR H6323-6333)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-16", "action": "The House resolved into Committee of the Whole House on the state of the Union for further consideration.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-16", "action": "UNFINISHED BUSINESS - The Chair announced that the unfinished business was the question of adoption of amendments which had been debated earlier and on which further proceedings had been postponed.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-16", "action": "H.AMDT.1078 On agreeing to the Fleming amendment (A026) Failed by recorded vote: 186 - 236 (Roll no. 415). (consideration: CR H6324)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-16", "action": "H.AMDT.1079 On agreeing to the Gosar amendment (A027) Agreed to by recorded vote: 282 - 138, 1 Present (Roll no. 416). (consideration: CR H6324-6325)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-16", "action": "H.AMDT.1083 On agreeing to the Grayson amendment (A031) Failed by recorded vote: 193 - 230 (Roll no. 417). (consideration: CR H6325)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-16", "action": "H.AMDT.1086 On agreeing to the Heck (WA) amendment (A034) Agreed to by recorded vote: 231 - 192 (Roll no. 418). (consideration: CR H6326)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-16", "action": "H.AMDT.1089 On agreeing to the DeSantis amendment (A037) Agreed to by recorded vote: 351 - 71 (Roll no. 419). (consideration: CR H6326-6327)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-16", "action": "H.AMDT.1090 On agreeing to the DeSantis amendment (A038) Agreed to by recorded vote: 264 - 157 (Roll no. 420). (consideration: CR H6327)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-16", "action": "H.AMDT.1091 On agreeing to the Blackburn amendment (A039) Failed by recorded vote: 168 - 256 (Roll no. 421). (consideration: CR H6327-6328)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-16", "action": "H.AMDT.1092 On agreeing to the Blackburn amendment (A040) Agreed to by recorded vote: 239 - 184 (Roll no. 422). (consideration: CR H6328-6329)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-16", "action": "H.AMDT.1093 On agreeing to the Blackburn amendment (A041) Agreed to by recorded vote: 223 - 200 (Roll no. 423). (consideration: CR H6329)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-16", "action": "H.AMDT.1094 On agreeing to the Blackburn amendment (A042) Agreed to by recorded vote: 229 - 194 (Roll no. 424). (consideration: CR H6329-6330)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-16", "action": "H.AMDT.1098 On agreeing to the Massie amendment (A046) Agreed to by recorded vote: 241 - 181 (Roll no. 425).", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-16", "action": "Mr. Crenshaw moved that the Committee of the Whole rise and report.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-16", "action": "On motion to rise and report Agreed to by voice vote.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-16", "action": "The House rose from the Committee of the Whole House on the state of the Union to report H.R. 5016.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-16", "action": "Pursuant to the rule the previous question was ordered. (consideration: CR H6331)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-16", "action": "The House adopted the amendments en gross as agreed to by the Committee of the Whole House on the state of the Union.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-16", "action": "Mr. Nolan moved to recommit with instructions to the Committee on Appropriations. (consideration: CR H6331-6333; text: CR H6331)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-16", "action": "DEBATE - The House proceeded with 10 minutes of debate on the Nolan motion to recommit with instructions. The instructions contained in the motion seek to require the bill to be reported back to the House with amendments to increase the Consumer Product Safety Commission Salaries and Expenses account by a total of $5 million and increase the Small Business Administration Entrepreneurial Development Program account by $5 million. The motion is offset by decreasing the General Services Administration (GSA) Real Property Activities Federal Buildings Fund's rental account by $10 million.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-16", "action": "On motion to recommit with instructions Failed by recorded vote: 198 - 225 (Roll no. 426). (consideration: CR H6333)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-16", "action": "On passage Passed by the Yeas and Nays: 228 - 195 (Roll no. 427).", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-16", "action": "Motion to reconsider laid on the table Agreed to without objection.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2014-07-17", "action": "Received in the Senate and Read twice and referred to the Committee on Appropriations.", "chamber": "S", "chamber_id": 115, "importance": 1}], "sponsors": [{"people_id": 9178, "person_hash": "95kqpg01", "party_id": "2", "state_id": 52, "party": "R", "role_id": 1, "role": "Rep", "name": "Ander Crenshaw", "first_name": "Ander", "middle_name": "", "last_name": "Crenshaw", "suffix": "", "nickname": "", "district": "HD-FL-4", "ftm_eid": 17657418, "votesmart_id": 31130, "opensecrets_id": "N00012739", "knowwho_pid": 205747, "ballotpedia": "Ander_Crenshaw", "sponsor_type_id": 1, "sponsor_order": 1, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}], "sasts": [{"type_id": 8, "type": "Related", "sast_bill_number": "HB992", "sast_bill_id": 525991}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB2786", "sast_bill_id": 562559}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB3547", "sast_bill_id": 571680}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB3573", "sast_bill_id": 571800}, {"type_id": 8, "type": "Related", "sast_bill_number": "SB474", "sast_bill_id": 526049}, {"type_id": 8, "type": "Related", "sast_bill_number": "SB1371", "sast_bill_id": 562691}, {"type_id": 8, "type": "Related", "sast_bill_number": "SB2397", "sast_bill_id": 650379}, {"type_id": 8, "type": "Related", "sast_bill_number": "HR661", "sast_bill_id": 654252}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB83", "sast_bill_id": 440735}], "subjects": [{"subject_id": 13347, "subject_name": "Abortion"}, {"subject_id": 13510, "subject_name": "Accounting and auditing"}, {"subject_id": 13814, "subject_name": "Administrative Conference of the U.S."}, {"subject_id": 13126, "subject_name": "Administrative law and regulatory procedures"}, {"subject_id": 13127, "subject_name": "Advisory bodies"}, {"subject_id": 13438, "subject_name": "Alabama"}, {"subject_id": 13134, "subject_name": "Appropriations"}, {"subject_id": 13688, "subject_name": "Area studies and international education"}, {"subject_id": 13538, "subject_name": "Art, artists, authorship"}, {"subject_id": 13135, "subject_name": "Aviation and airports"}, {"subject_id": 13478, "subject_name": "Banking and financial institutions regulation"}, {"subject_id": 13914, "subject_name": "Bermuda"}, {"subject_id": 13768, "subject_name": "Business ethics"}, {"subject_id": 13140, "subject_name": "Buy American requirements"}, {"subject_id": 13391, "subject_name": "California"}, {"subject_id": 13489, "subject_name": "Caribbean area"}, {"subject_id": 22134, "subject_name": "Cayman Islands"}, {"subject_id": 13142, "subject_name": "Child health"}, {"subject_id": 21500, "subject_name": "Climate change and greenhouse gases"}, {"subject_id": 13690, "subject_name": "Coal"}, {"subject_id": 13621, "subject_name": "Comprehensive health care"}, {"subject_id": 20565, "subject_name": "Computer security and identity theft"}, {"subject_id": 13657, "subject_name": "Congressional-executive branch relations"}, {"subject_id": 20665, "subject_name": "Consumer Financial Protection Bureau"}, {"subject_id": 13638, "subject_name": "Consumer Product Safety Commission"}, {"subject_id": 13148, "subject_name": "Corporate finance and management"}, {"subject_id": 13373, "subject_name": "Criminal investigation, prosecution, interrogation"}, {"subject_id": 13344, "subject_name": "Criminal procedure and sentencing"}, {"subject_id": 13583, "subject_name": "Cuba"}, {"subject_id": 13735, "subject_name": "Cultural exchanges and relations"}, {"subject_id": 13654, "subject_name": "Currency"}, {"subject_id": 13165, "subject_name": "Department of the Treasury"}, {"subject_id": 13167, "subject_name": "District of Columbia"}, {"subject_id": 13345, "subject_name": "Drug trafficking and controlled substances"}, {"subject_id": 13307, "subject_name": "Drug, alcohol, tobacco use"}, {"subject_id": 13171, "subject_name": "Education programs funding"}, {"subject_id": 13494, "subject_name": "Elections, voting, political campaign regulation"}, {"subject_id": 13173, "subject_name": "Electric power generation and transmission"}, {"subject_id": 13174, "subject_name": "Elementary and secondary education"}, {"subject_id": 13495, "subject_name": "Emergency communications systems"}, {"subject_id": 13176, "subject_name": "Employment and training programs"}, {"subject_id": 13178, "subject_name": "Employment taxes"}, {"subject_id": 13543, "subject_name": "Endangered and threatened species"}, {"subject_id": 13183, "subject_name": "Executive Office of the President"}, {"subject_id": 13184, "subject_name": "Executive agency funding and structure"}, {"subject_id": 13622, "subject_name": "Family planning and birth control"}, {"subject_id": 13634, "subject_name": "Federal Communications Commission (FCC)"}, {"subject_id": 13832, "subject_name": "Federal Deposit Insurance Corporation (FDIC)"}, {"subject_id": 13833, "subject_name": "Federal Election Commission (FEC)"}, {"subject_id": 13707, "subject_name": "Federal Labor Relations Authority"}, {"subject_id": 13514, "subject_name": "Federal Trade Commission (FTC)"}, {"subject_id": 13617, "subject_name": "Federal appellate courts"}, {"subject_id": 13659, "subject_name": "Federal district courts"}, {"subject_id": 13737, "subject_name": "Federal officials"}, {"subject_id": 13187, "subject_name": "Financial services and investments"}, {"subject_id": 13341, "subject_name": "Firearms and explosives"}, {"subject_id": 13663, "subject_name": "First Amendment rights"}, {"subject_id": 13191, "subject_name": "Foreign labor"}, {"subject_id": 13309, "subject_name": "Fraud offenses and financial crimes"}, {"subject_id": 13194, "subject_name": "General Services Administration"}, {"subject_id": 13196, "subject_name": "Government buildings, facilities, and property"}, {"subject_id": 13198, "subject_name": "Government employee pay, benefits, personnel management"}, {"subject_id": 13199, "subject_name": "Government ethics and transparency, public corruption"}, {"subject_id": 13200, "subject_name": "Government information and archives"}, {"subject_id": 13202, "subject_name": "Government lending and loan guarantees"}, {"subject_id": 13203, "subject_name": "Government trust funds"}, {"subject_id": 13605, "subject_name": "HIV/AIDS"}, {"subject_id": 13206, "subject_name": "Health care costs and insurance"}, {"subject_id": 13207, "subject_name": "Health care coverage and access"}, {"subject_id": 13212, "subject_name": "Health programs administration and funding"}, {"subject_id": 13519, "subject_name": "Hybrid, electric, and advanced technology vehicles"}, {"subject_id": 13898, "subject_name": "Industrial policy and productivity"}, {"subject_id": 13500, "subject_name": "Intelligence activities, surveillance, classified information"}, {"subject_id": 13231, "subject_name": "Intergovernmental relations"}, {"subject_id": 13368, "subject_name": "Internal Revenue Service (IRS)"}, {"subject_id": 13615, "subject_name": "International exchange and broadcasting"}, {"subject_id": 13233, "subject_name": "Internet and video services"}, {"subject_id": 13618, "subject_name": "Judges"}, {"subject_id": 13551, "subject_name": "Labor-management relations"}, {"subject_id": 13235, "subject_name": "Latin America"}, {"subject_id": 13342, "subject_name": "Lawyers and legal services"}, {"subject_id": 13701, "subject_name": "Manufacturing"}, {"subject_id": 13313, "subject_name": "Medical tests and diagnostic methods"}, {"subject_id": 13893, "subject_name": "Merit Systems Protection Board"}, {"subject_id": 13248, "subject_name": "Motor vehicles"}, {"subject_id": 13849, "subject_name": "Multilateral development programs"}, {"subject_id": 13560, "subject_name": "Museums, exhibitions, cultural centers"}, {"subject_id": 13386, "subject_name": "National Archives and Records Administration"}, {"subject_id": 13791, "subject_name": "National Credit Union Administration"}, {"subject_id": 13251, "subject_name": "National Guard and reserves"}, {"subject_id": 13806, "subject_name": "News media and reporting"}, {"subject_id": 13315, "subject_name": "Nutrition and diet"}, {"subject_id": 13855, "subject_name": "Office of Government Ethics"}, {"subject_id": 13679, "subject_name": "Office of Management and Budget (OMB)"}, {"subject_id": 13770, "subject_name": "Office of Personnel Management (OPM)"}, {"subject_id": 13811, "subject_name": "Office of Special Counsel"}, {"subject_id": 13256, "subject_name": "Oil and gas"}, {"subject_id": 13623, "subject_name": "Physical fitness and lifestyle"}, {"subject_id": 13776, "subject_name": "Postal Regulatory Commission"}, {"subject_id": 13355, "subject_name": "Postal service"}, {"subject_id": 13490, "subject_name": "Prescription drugs"}, {"subject_id": 13388, "subject_name": "Presidents and presidential powers"}, {"subject_id": 13640, "subject_name": "Product safety and quality"}, {"subject_id": 13260, "subject_name": "Public contracts and procurement"}, {"subject_id": 13652, "subject_name": "Public participation and lobbying"}, {"subject_id": 13266, "subject_name": "Religion"}, {"subject_id": 13270, "subject_name": "Right of privacy"}, {"subject_id": 13273, "subject_name": "Securities"}, {"subject_id": 13666, "subject_name": "Securities and Exchange Commission (SEC)"}, {"subject_id": 13857, "subject_name": "Selective Service System"}, {"subject_id": 13275, "subject_name": "Small Business Administration"}, {"subject_id": 13281, "subject_name": "Solid waste and recycling"}, {"subject_id": 13762, "subject_name": "Specialized courts"}, {"subject_id": 13284, "subject_name": "State and local finance"}, {"subject_id": 13285, "subject_name": "State and local government operations"}, {"subject_id": 13286, "subject_name": "Student aid and college costs"}, {"subject_id": 13725, "subject_name": "Supreme Court"}, {"subject_id": 13319, "subject_name": "Tax administration and collection, taxpayers"}, {"subject_id": 13738, "subject_name": "Tax-exempt organizations"}, {"subject_id": 13431, "subject_name": "Terrorism"}, {"subject_id": 13644, "subject_name": "Transportation costs"}, {"subject_id": 13533, "subject_name": "Travel and tourism"}, {"subject_id": 13357, "subject_name": "U.S. Postal Service"}, {"subject_id": 13662, "subject_name": "U.S. Sentencing Commission"}, {"subject_id": 13646, "subject_name": "Urban and suburban affairs and development"}, {"subject_id": 13434, "subject_name": "Voting rights"}, {"subject_id": 81065, "subject_name": "Employee performance"}, {"subject_id": 81059, "subject_name": "Privacy and Civil Liberties Oversight Board"}, {"subject_id": 13124, "subject_name": "Economics and public finance"}], "texts": [{"doc_id": 1038710, "date": "2014-07-03", "type": "Introduced", "type_id": 1, "mime": "application/pdf", "mime_id": 2, "url": "https://legiscan.com/US/text/HB5016/id/1038710", "state_link": "https://www.congress.gov/113/bills/hr5016/BILLS-113hr5016rh.pdf", "text_size": 476586, "text_hash": "bb8b45db46725f2d8c8469d564a015f1"}, {"doc_id": 1039856, "date": "2014-07-18", "type": "Engrossed", "type_id": 4, "mime": "application/pdf", "mime_id": 2, "url": "https://legiscan.com/US/text/HB5016/id/1039856", "state_link": "https://www.congress.gov/113/bills/hr5016/BILLS-113hr5016eh.pdf", "text_size": 305815, "text_hash": "953869f253bb7c1ce9486fba5e89a194"}], "votes": [{"roll_call_id": 375823, "date": "2014-07-15", "desc": "On Agreeing to the Amendment", "yea": 161, "nay": 258, "nv": 13, "absent": 0, "total": 432, "passed": 0, "chamber": "H", "chamber_id": 114, "url": "https://legiscan.com/US/rollcall/HB5016/id/375823", "state_link": "https://clerk.house.gov/Votes/2014409"}, {"roll_call_id": 375824, "date": "2014-07-15", "desc": "On Agreeing to the Amendment", "yea": 338, "nay": 80, "nv": 14, "absent": 0, "total": 432, "passed": 1, "chamber": "H", "chamber_id": 114, "url": "https://legiscan.com/US/rollcall/HB5016/id/375824", "state_link": "https://clerk.house.gov/Votes/2014410"}, {"roll_call_id": 375825, "date": "2014-07-15", "desc": "On Agreeing to the Amendment", "yea": 170, "nay": 244, "nv": 18, "absent": 0, "total": 432, "passed": 0, "chamber": "H", "chamber_id": 114, "url": "https://legiscan.com/US/rollcall/HB5016/id/375825", "state_link": "https://clerk.house.gov/Votes/2014411"}, {"roll_call_id": 375826, "date": "2014-07-15", "desc": "On Agreeing to the Amendment", "yea": 184, "nay": 235, "nv": 13, "absent": 0, "total": 432, "passed": 0, "chamber": "H", "chamber_id": 114, "url": "https://legiscan.com/US/rollcall/HB5016/id/375826", "state_link": "https://clerk.house.gov/Votes/2014412"}, {"roll_call_id": 375848, "date": "2014-07-16", "desc": "On Agreeing to the Amendment", "yea": 186, "nay": 236, "nv": 10, "absent": 0, "total": 432, "passed": 0, "chamber": "H", "chamber_id": 114, "url": "https://legiscan.com/US/rollcall/HB5016/id/375848", "state_link": "https://clerk.house.gov/Votes/2014415"}, {"roll_call_id": 375849, "date": "2014-07-16", "desc": "On Agreeing to the Amendment", "yea": 282, "nay": 138, "nv": 12, "absent": 0, "total": 432, "passed": 1, "chamber": "H", "chamber_id": 114, "url": "https://legiscan.com/US/rollcall/HB5016/id/375849", "state_link": "https://clerk.house.gov/Votes/2014416"}, {"roll_call_id": 375850, "date": "2014-07-16", "desc": "On Agreeing to the Amendment", "yea": 193, "nay": 230, "nv": 9, "absent": 0, "total": 432, "passed": 0, "chamber": "H", "chamber_id": 114, "url": "https://legiscan.com/US/rollcall/HB5016/id/375850", "state_link": "https://clerk.house.gov/Votes/2014417"}, {"roll_call_id": 375851, "date": "2014-07-16", "desc": "On Agreeing to the Amendment", "yea": 231, "nay": 192, "nv": 9, "absent": 0, "total": 432, "passed": 1, "chamber": "H", "chamber_id": 114, "url": "https://legiscan.com/US/rollcall/HB5016/id/375851", "state_link": "https://clerk.house.gov/Votes/2014418"}, {"roll_call_id": 375852, "date": "2014-07-16", "desc": "On Agreeing to the Amendment", "yea": 351, "nay": 71, "nv": 10, "absent": 0, "total": 432, "passed": 1, "chamber": "H", "chamber_id": 114, "url": "https://legiscan.com/US/rollcall/HB5016/id/375852", "state_link": "https://clerk.house.gov/Votes/2014419"}, {"roll_call_id": 375853, "date": "2014-07-16", "desc": "On Agreeing to the Amendment", "yea": 264, "nay": 157, "nv": 11, "absent": 0, "total": 432, "passed": 1, "chamber": "H", "chamber_id": 114, "url": "https://legiscan.com/US/rollcall/HB5016/id/375853", "state_link": "https://clerk.house.gov/Votes/2014420"}, {"roll_call_id": 375854, "date": "2014-07-16", "desc": "On Agreeing to the Amendment", "yea": 168, "nay": 256, "nv": 8, "absent": 0, "total": 432, "passed": 0, "chamber": "H", "chamber_id": 114, "url": "https://legiscan.com/US/rollcall/HB5016/id/375854", "state_link": "https://clerk.house.gov/Votes/2014421"}, {"roll_call_id": 375855, "date": "2014-07-16", "desc": "On Agreeing to the Amendment", "yea": 239, "nay": 184, "nv": 9, "absent": 0, "total": 432, "passed": 1, "chamber": "H", "chamber_id": 114, "url": "https://legiscan.com/US/rollcall/HB5016/id/375855", "state_link": "https://clerk.house.gov/Votes/2014422"}, {"roll_call_id": 375856, "date": "2014-07-16", "desc": "On Agreeing to the Amendment", "yea": 223, "nay": 200, "nv": 9, "absent": 0, "total": 432, "passed": 1, "chamber": "H", "chamber_id": 114, "url": "https://legiscan.com/US/rollcall/HB5016/id/375856", "state_link": "https://clerk.house.gov/Votes/2014423"}, {"roll_call_id": 375857, "date": "2014-07-16", "desc": "On Agreeing to the Amendment", "yea": 229, "nay": 194, "nv": 9, "absent": 0, "total": 432, "passed": 1, "chamber": "H", "chamber_id": 114, "url": "https://legiscan.com/US/rollcall/HB5016/id/375857", "state_link": "https://clerk.house.gov/Votes/2014424"}, {"roll_call_id": 375858, "date": "2014-07-16", "desc": "On Agreeing to the Amendment", "yea": 241, "nay": 181, "nv": 10, "absent": 0, "total": 432, "passed": 1, "chamber": "H", "chamber_id": 114, "url": "https://legiscan.com/US/rollcall/HB5016/id/375858", "state_link": "https://clerk.house.gov/Votes/2014425"}, {"roll_call_id": 375859, "date": "2014-07-16", "desc": "On Motion to Recommit with Instructions", "yea": 198, "nay": 225, "nv": 9, "absent": 0, "total": 432, "passed": 0, "chamber": "H", "chamber_id": 114, "url": "https://legiscan.com/US/rollcall/HB5016/id/375859", "state_link": "https://clerk.house.gov/Votes/2014426"}, {"roll_call_id": 375860, "date": "2014-07-16", "desc": "On Passage", "yea": 228, "nay": 195, "nv": 9, "absent": 0, "total": 432, "passed": 1, "chamber": "H", "chamber_id": 114, "url": "https://legiscan.com/US/rollcall/HB5016/id/375860", "state_link": "https://clerk.house.gov/Votes/2014427"}], "amendments": [], "supplements": [], "calendar": []}}