{"status": "OK", "bill": {"bill_id": 787150, "change_hash": "a8861f14e7425eeb4abaa9f5600d6e92", "session_id": 1156, "session": {"session_id": 1156, "state_id": 52, "year_start": 2015, "year_end": 2016, "prefile": 0, "sine_die": 1, "prior": 1, "special": 0, "session_tag": "Regular Session", "session_title": "2015-2016 Regular Session", "session_name": "114th Congress"}, "url": "https://legiscan.com/US/bill/HB2995/2015", "state_link": "https://www.congress.gov/bill/114th-congress/house-bill/2995/all-info", "completed": 0, "status": 1, "status_date": "2015-07-09", "progress": [{"date": "2015-07-09", "event": 1}], "state": "US", "state_id": 52, "bill_number": "HB2995", "bill_type": "B", "bill_type_id": "1", "body": "H", "body_id": 114, "current_body": "H", "current_body_id": 114, "title": "Financial Services and General Government Appropriations Act, 2016", "description": "Financial Services and General Government Appropriations Act, 2016 Provides FY2016 appropriations for financial services and general government, including programs in the Department of the Treasury, the Executive Office of the President, the federal judiciary, the District of Columbia, and several independent agencies. Department of the Treasury Appropriations Act, 2016 TITLE I--DEPARTMENT OF THE TREASURY Provides appropriations to the Department of the Treasury for Departmental Offices, including: Salaries and Expenses, the Office of Terrorism and Financial Intelligence, the Office of Inspector General, the Treasury Inspector General for Tax Administration, and the Special Inspector General for the Troubled Asset Relief Program. Provides appropriations to Treasury for: the Financial Crimes Enforcement Network, the Bureau of the Fiscal Service, the Alcohol and Tobacco Tax and Trade Bureau, the U.S. Mint, and the Community Development Financial Institutions Fund Program Account. Rescinds specified unobligated balances from the Treasury Forfeiture Fund. Provides appropriations to the Internal Revenue Service (IRS) for: Taxpayer Services, Enforcement, Operations Support, and Business Systems Modernization. (Sec. 101) Permits up to 5% of any IRS appropriation provided by this bill to be transferred to any other IRS appropriation upon advance approval of Congress. (Sec. 102) Requires the IRS to maintain an employee training program that includes taxpayers' rights, dealing courteously with taxpayers, cross-cultural relations, ethics, and the impartial application of tax law. (Sec. 103) Requires the IRS to institute and enforce policies and procedures to safeguard the confidentiality of taxpayers' information and protect against identity theft. (Sec. 104) Permits the IRS to use funds for improved facilities and increased staffing to provide sufficient and effective 1-800 help line service for taxpayers. (Sec. 105) Bars the IRS from using funds provided by this bill to make a video unless it is approved in advance by the Service-Wide Video Editorial Board. (Sec. 106) Requires the IRS to notify employers of any address changes related to employment tax payments. (Sec. 107) Prohibits the IRS from using funds provided by this bill to target U.S. citizens for exercising any rights guaranteed under the First Amendment to the U.S. Constitution. (Sec. 108) Prohibits the IRS from using funds provided by this bill to target groups for regulatory scrutiny based on their ideological beliefs. (Sec. 109) Requires the IRS to comply with certain procedures and policies for conference spending that were recommended by the Treasury Inspector General for Tax Administration. (Sec. 110) Prohibits funds provided by the Patient Protection and Affordable Care Act (PPACA) from being transferred to the IRS to implement PPACA. (Sec. 111) Prohibits the IRS from using funds provided by this bill to implement the requirement under PPACA that individuals maintain minimum essential health care coverage. (Sec. 112) Prohibits the IRS from using funds provided by this bill for providing employee bonuses or hiring former employees without considering conduct and federal tax compliance. (Sec. 113) Prohibits the IRS from using funds provided by this bill to violate the confidentiality of tax returns. (Sec. 114) Prohibits the IRS from using funds provided by this bill for pre-populated returns. (Sec. 115) Permits Treasury to use funds provided by this bill for uniforms, overseas motor vehicles and insurance, contracts with the Department of State for health and medical services for overseas Treasury employees, and experts or consultants (Sec. 116) Permits certain transfers between Treasury accounts, subject to congressional approval and specified requirements. (Sec. 117) Permits the IRS to transfer certain funds to the Treasury Inspector General for Tax Administration, subject to congressional approval and specified requirements. (Sec. 118) Bars Treasury or the Bureau of Engraving and Printing from using funds to redesign the $1 Federal Reserve note. (Sec. 119) Permits Treasury to transfer funds from Bureau of Fiscal Services--Salaries and Expenses to the Debt Collection Fund to cover the costs of debt collection. Requires the transferred amounts to be reimbursed from debt collections received in the Fund. (Sec. 120) Prohibits the U.S. Mint from using funds to construct or operate any museum without congressional approval. (Sec. 121) Prohibits the use of funds to merge the U.S. Mint and the Bureau of Engraving and Printing without congressional approval. (Sec. 122) Deems funds provided for Treasury's intelligence-related activities as authorized for FY2016 until enactment of the Intelligence Authorization Act for FY2016. (Sec. 123) Permits up to $5,000 to be made available from the Bureau of Engraving and Printing Fund for official reception and representation expenses. (Sec. 124) Requires Treasury to submit a capital investment plan to Congress. (Sec. 125) Requires the Office of Financial Stability and the Office of Financial Research to report quarterly to Congress on their activities. (Sec. 126) Amends the Dodd-Frank Wall Street Reform and Consumer Protection Act (Dodd-Frank) to limit the fees available for obligation by the Office of Financial Research to the amount provided in appropriations acts beginning in FY2017. (Sec. 127) Requires Treasury to report to Congress on the Franchise Fund. (Sec. 128) Requires Treasury to report to Congress on economic warfare and financial terrorism. (Sec. 129) Prohibits Treasury from using funds for certain regulations, revenue rulings, or other guidance related to the standards used to determine the tax-exempt status of a 501(c)(4) organization. (Sec. 130) Prohibits funds provided by this bill from being used to approve, license, facilitate, authorize, or otherwise allow certain categories of travel to Cuba incident to non-academic educational exchanges. (Sec. 131) Prohibits funds provided by this bill from being used to approve, license, facilitate, authorize, or otherwise allow the importation of property confiscated by the Cuban government. (Sec. 132) Prohibits funds provided by this bill from being used to approve, license, facilitate, authorize, or otherwise allow any financial transactions with the Cuban military or intelligence service. Includes exceptions for: (1) exports permitted under the Trade Sanctions Reform and Export Enhancement Act of 2000, and (2) financial transactions necessary for the maintenance and improvement of the military base at Guantanamo Bay, Cuba. (Sec. 133) Prohibits Treasury from using funds provided by this bill to enforce specified guidance for U.S. positions on multilateral development banks which engage with developing countries on coal-fired power generation. (Sec. 134) Requires the Office of Financial Research to provide public notice of at least 90 days before issuing a proposed rule, report, or regulation. (Sec. 135) Prohibits the IRS from using funds provided by this bill to determine that a church is not exempt from taxation for participating in, or intervening in, any political campaign unless: the IRS Commissioner consents, Congress is notified, and the determination is effective no earlier than 90 days after congressional notification. Executive Office of the President Appropriations Act, 2016 TITLE II--EXECUTIVE OFFICE OF THE PRESIDENT AND FUNDS APPROPRIATED TO THE PRESIDENT Provides FY2016 appropriations to the Executive Office of the President and designated accounts, including: the White House, the Executive Residence at the White House, White House Repair and Restoration, the Council of Economic Advisers, the National Security Council and the Homeland Security Council, the Office of Administration, the Office of Management and Budget (OMB), the Office of National Drug Control Policy, Information Technology Oversight and Reform, Special Assistance to the President, and the Official Residence of the Vice President. (Sec. 201) Permits certain transfers of funds between accounts within the Executive Office of the President, subject to congressional approval and specified requirements. (Sec. 202) Require the OMB to report to Congress on the costs of implementing the Dodd-Frank Wall Street Reform and Consumer Protection Act (Dodd-Frank). (Sec. 203) Requires the OMB to include a statement of budgetary impact with any executive order or Presidential memorandum issued during FY2016. (Sec. 204) Prohibits funds provided by this bill from being used for statements abrogating legislation passed by Congress and signed by the President. (Sec. 205) Prohibits funds provided by this bill from being used for an executive order or Presidential memorandum that contravenes existing law. Judiciary Appropriations Act, 2016 TITLE III--THE JUDICIARY Provides FY2016 appropriations to the judiciary for: the Supreme Court of the United States; the U.S. Court of Appeals for the Federal Circuit; the U.S. Court of International Trade; Courts of Appeals, District Courts, and Other Judicial Services; the Administrative Office of the U.S. Courts; the Federal Judicial Center; and the U.S. Sentencing Commission. (Sec. 301) Permits funds provided by this title for salaries and expenses to be used for the employment of temporary or intermittent experts and consultants. (Sec. 302) Permits certain transfers of funds between judiciary accounts, subject to congressional notification and specified requirements. (Sec. 303) Permits up to $11,000 of appropriations provided for salaries and expenses for Courts of Appeals, District Courts, and Other Judicial Services to be used for official reception and representation expenses of the Judicial Conference of the United States. (Sec. 304) Permits the delegation of authority to the judiciary for contracts for repairs that are under $100,000. (Sec. 305) Requires the U.S. Marshals Service to provide a court security pilot program. (Sec. 306) Amends the Judicial Improvement Act of 1990; the Transportation, Treasury, Housing and Urban Development, the Judiciary, the District of Columbia, and Independent Agencies Appropriations Act, 2006; and the 21st Century Department of Justice Appropriations Authorization Act to extend several temporary judgeships. District of Columbia Appropriations Act, 2016 TITLE IV--DISTRICT OF COLUMBIA Provides FY2016 appropriations to the District of Columbia, including federal payments for: Resident Tuition Support; Emergency Planning and Security Costs in the District of Columbia; District of Columbia Courts; Defender Services in District of Columbia Courts; the Court Services and Offender Supervision Agency for the District of Columbia; the District of Columbia Public Defender Service; the Criminal Justice Coordinating Council; Judicial Commissions; School Improvement; the District of Columbia National Guard; and Testing and Treatment of HIV/AIDS. Provides local funds for the operation of the District of Columbia out of the General Fund of the District of Columbia as set forth in the FY2016 Budget Request Act of 2015 that the District of Columbia submitted to Congress. TITLE V--INDEPENDENT AGENCIES Provides appropriations for independent agencies, including: the Administrative Conference of the United States, the Consumer Financial Protection Bureau (CFPB), the Consumer Product Safety Commission, the Election Assistance Commission, the Federal Communications Commission (FCC), the Federal Deposit Insurance Corporation, the Federal Election Commission, the Federal Labor Relations Authority, the Federal Trade Commission (FTC), the General Services Administration (GSA), the Merit Systems Protection Board, the National Archives and Records Administration, the National Credit Union Administration, the Office of Government Ethics, the Office of Personnel Management (OPM), the Office of Special Counsel, the Postal Regulatory Commission, the Privacy and Civil Liberties Oversight Board, the Securities and Exchange Commission (SEC), the Selective Service System, the Small Business Administration (SBA), the U.S. Postal Service, and the U.S. Tax Court. Requires the U.S. Postal Service to: (1) continue six day delivery and rural delivery of the mail at not less than the 1983 level, and (2) maintain and comply with service standards for first class mail and periodicals effective on July 1, 2012. (Sec. 501) Amends Dodd-Frank to permit the congressional appropriations committees to review transfers from the Federal Reserve system to the CFPB. (Sec. 502) Changes the CFPB's source of funding from transfers from the Federal Reserve System to annual appropriations beginning in FY2017. (Sec. 503) Requires the CFPB to notify Congress of any request for a transfer of funds from the Board of Governors of the Federal Reserve System. (Sec. 504) Requires the CFPB to submit to Congress quarterly reports on its activities. (Sec. 505) Permits the GSA to use funds to hire passenger motor vehicles. (Sec. 506) Permits funds provided for the Federal Buildings Fund to be transferred between activities if necessary to meet program requirements, subject to congressional approval. (Sec. 507) Requires budget requests for courthouse construction funds to meet specified standards. (Sec. 508) Prohibits funds provided by this bill from being used to increase square footage, provide cleaning services or security enhancements, or provide any other service usually provided through the Federal Buildings Fund to any agency that does not pay the assessed rent. (Sec. 509) Permits the GSA to use specified funds to pay claims against the federal government that are under $250,000 and arise from direct construction projects and building acquisitions if Congress is notified in advance. (Sec. 510) Requires GSA, if specified congressional committees adopt a resolution granting lease authority pursuant to a prospectus, to ensure that the delineated area of procurement matches the prospectus. (Sec. 511) Requires GSA to submit a spending plan and explanation to Congress for: (1) each project funded with the Major Repairs and Alterations and Judiciary Capital Security Program accounts, and (2) E-Government projects funded with the Federal Citizen Services Fund account. (Sec. 512) Permits the SBA to transfer specified funds between appropriations accounts. (Sec. 513) Waives certain loan guarantee fees for veterans and their spouses. TITLE VI--GENERAL PROVISIONS--THIS ACT Sets forth permissible, restricted, and prohibited uses for funds provided by this bill. (Sec. 601) Prohibits funds provided by this bill from being used to pay expenses or otherwise compensate non-federal parties intervening in regulatory or adjudicatory proceedings funded in this bill. (Sec. 602) Prohibits funds provided by this bill from being obligated beyond the current fiscal year or transferred to other appropriations unless authority is expressly provided by this bill. (Sec. 603) Limits expenditures for consulting services to contracts where expenditures are a matter of public record, except where otherwise permitted under existing law. (Sec. 604) Prohibits funds provided by this bill from being transferred to any department, agency, or instrumentality of the U.S. government, except pursuant to transfer authority provided by an appropriations Act. (Sec. 605) Requires enforcement of a Tariff Act of 1930 provision barring the importation of goods manufactured using convict labor. (Sec. 606) Requires entities receiving funds provided by this bill to comply with the Buy American Act. (Sec. 607) Prohibits the use of funds provided by this bill by any person or entity convicted of violating the Buy American Act. (Sec. 608) Provides authority, restrictions, and requirements for reprogramming. Requires agencies funded in this bill to submit to Congress a report establishing a baseline for the application of reprogramming and transfer authorities. (Sec. 609) Permits up to 50% of unobligated balances remaining at the end of FY2016 for salaries and expenses to remain available through FY2017, subject to reprogramming guidelines and congressional approval. (Sec. 610) Prohibits the Executive Office of the President from using funds provided by this bill to request either a Federal Bureau of Investigation background investigation or an IRS determination of tax-exempt status under section 501(a) of the Internal Revenue Code, except with the consent of the individual involved in an investigation or in extraordinary circumstances involving national security. (Sec. 611) Makes certain cost accounting standards inapplicable to contracts under the Federal Employees Health Benefits Program. (Sec. 612) Permits the OPM to accept and utilize funds made available for resolving litigation and implementing any settlement agreements regarding the nonforeign area cost-of-living allowance program. (Sec. 613) Prohibits funds provided by this bill from being used to pay for an abortion, or the administrative expenses in connection with any health plan under the Federal Employees Health Benefits Program which provides any benefits or coverage for abortions. (Sec. 614) Provides exceptions to the prohibition in section 613 if the life of the mother would be endangered if the fetus were carried to term, or the pregnancy is the result of an act of rape or incest. (Sec. 615) Waives Buy American Act restrictions for commercial information technology acquired by the federal government. (Sec. 616) Prohibits an officer or employee of any regulatory agency or commission funded by this bill from accepting payments or reimbursements for travel, subsistence, or related expenses from a person or entity regulated by the agency or commission, subject to an exception for nonprofit tax-exempt organizations. (Sec. 617) Permits the Commodity Futures Trading Commission and the SEC to use funds for the interagency funding and sponsorship of a joint advisory committee to advise on emerging regulatory issues. (Sec. 618) Requires agencies covered by this bill to consult with GSA before seeking new office space or making alterations to existing office space. Permits any agency with authority to enter into an emergency lease to do so during any period declared by the President to require emergency leasing authority. (Sec. 619) Provides funds required under current law for: compensation of the President; payments to the Judicial Officers' Retirement Fund, the Judicial Survivors' Annuities Fund, and the U.S. Court of Federal Claims Judges' Retirement Fund; payment of government contributions for health and life insurance benefits of federal retired employees; payments to finance the unfunded liability of annuity benefits under the Civil Service Retirement and Disability Fund; and payments of annuities authorized to be paid from the Civil Service Retirement and Disability Fund. (Sec. 620) Prohibits the FTC from using funds provided by this bill to complete the draft report entitled \"Interagency Working Group on Food Marketed to Children: Preliminary Proposed Nutrition Principles to Guide Industry Self-Regulatory Efforts\" unless the Working Group complies with Executive Order 13563 (Improving Regulation and Regulatory Review). (Sec. 621) Bars the use of funds provided by this bill for the following positions: (1) Director of the White House Office of Health Reform, (2) Assistant to the President for Energy and Climate Change, (3) Senior Advisor to the Secretary of the Treasury assigned to the Presidential Task Force on the Auto Industry and Senior Counselor for Manufacturing Policy, and (4) White House Director of Urban Affairs. (Sec. 622) Prohibits funds provided by this bill from being used in contravention of the Federal Records Act. (Sec. 623) Requires specified regulatory agencies to report to Congress on increasing public participation in rulemaking, improving coordination among federal agencies, and identifying ineffective or excessively burdensome regulations. (Sec. 624) Prohibits the obligation of funds in FY2016 from the Securities and Exchange Commission Reserve Fund established by Dodd-Frank. (Sec. 625) Prohibits the SEC from using funds provided by this bill to require the disclosure of political contributions, contributions to tax-exempt organizations, or dues paid to trade associations. (Sec. 626) Amends the Securities Exchange Act of 1934 to repeal the indemnification agreement for swap data repositories and replace it with a confidentiality agreement. (Sec. 627) Prohibits funds provided by this bill from being used to require Internet service providers to disclose electronic communications information in a manner that violates the Fourth Amendment of the U.S. Constitution. (Sec. 628) Prohibits the FCC from implementing, administering, or enforcing any rule unless the FCC publishes the text of the rule 21 days before a vote on the rule. (Sec. 629) Prohibits the FCC from regulating rates for either broadband or wireless Internet providers. (Sec. 630) Prohibits the FCC from implementing a specified order regarding protecting and promoting the open Internet (commonly known as net neutrality) until specified court challenges have been resolved. (Sec. 631) Prohibits the Financial Stability Oversight Council from designating nonbanks as systemically important financial institutions until it: (1) identifies the risks to financial stability presented by the nonbank, and (2) permits the nonbank to present a plan to modify its business, structure, or operation to mitigate the identified risk prior to final designation. (Sec. 632) Prohibits the CFPB from implementing a rule regarding the use of arbitration until specified requirements are addressed. (Sec. 633) Prohibits the FCC from implementing a specified rule related to joint sales agreements. TITLE VII--GENERAL PROVISIONS--GOVERNMENT-WIDE Sets forth permissible, restricted, and prohibited uses for appropriations by designated departments, agencies, and corporations. (Sec. 701) Prohibits the use of appropriations by any federal department, agency, or instrumentality unless it administers a policy designed to ensure that all workplaces are free from the illegal use, possession, or distribution of controlled substances. (Sec. 702) Establishes price limitations on vehicles purchased by the federal government and specifies exceptions. (Sec. 703) Permits appropriations for the current fiscal year to be used for quarters and cost-of-living allowances. (Sec. 704) Prohibits the employment of noncitizens with certain exceptions. (Sec. 705) Permits appropriations provided to any department or agency for necessary expenses such as maintenance and operating expenses to be used for payments to the GSA for space and services. (Sec. 706) Permits agencies to finance the costs of recycling and waste prevention programs with proceeds from the sale of materials recovered through the programs (Sec. 707) Permits funds provided to certain corporations and agencies for administrative expenses to be used to pay rent and other service costs in the District of Columbia (Sec. 708) Prohibits interagency financing of boards, commission, councils, committees, or similar groups absent prior statutory approval. (Sec. 709) Prohibits funds from being used to implement, administer, or enforce any regulation which has been disapproved pursuant to a joint resolution. (Sec. 710) Prohibits spending more than $5000 to redecorate or furnish the office of the head of a department or agency in specified circumstances unless Congress is notified in advance. (Sec. 711) Permits interagency funding of national security and emergency preparedness telecommunications initiatives. (Sec. 712) Requires agencies to certify that certain appointments were not created solely or primarily to detail an individual to the White House. (Sec. 713) Bars payment of any employee who prohibits, threatens, prevents, or otherwise penalizes another employee from communicating with Congress. (Sec. 714) Prohibits funds from being used for training that is not directly related to the performance of official duties. (Sec. 715) Prohibits an agency of the executive branch from using funds for publicity or propaganda purposes and for the preparation or distribution of materials designed to support or defeat legislation pending before Congress. (Sec. 716) Prohibits an agency from providing a federal employee's home address to any labor organization absent employee authorization or a court order. (Sec. 717) Prohibits funds from being used to provide any non-public information such as mailing, telephone, or electronic mailing lists to any organization outside the federal government without approval of Congress. (Sec. 718) Prohibits funds from being used for propaganda and publicity purposes not authorized by Congress. (Sec. 719) Directs agency employees to use official time in an honest effort to perform official duties. (Sec. 720) Allows the use of funds to finance an appropriate share of the Federal Accounting Standards Advisory Board administrative costs. (Sec. 721) Permits agencies to transfer funds to the GSA to support specified government-wide and multiagency activities that meet certain requirements and are approved by OMB. (Sec. 722) Permits breastfeeding at any location in a federal building or on federal property if the woman and child are authorized to be there. (Sec. 723) Permits interagency funding of the National Science and Technology Council, and requires the OMB to provide a report describing the budget and resources connected with the council. (Sec. 724) Requires documents involving the distribution of federal funds to indicate the agency providing the funds and the amount provided. (Sec. 725) Prohibits federal agencies from using funds to monitor individuals' Internet use, subject to specified exceptions. (Sec. 726) Prohibits the use of funds provided by this bill for health plans with prescription drug coverage unless contraceptive coverage is included. Includes exemptions for certain religious plans. Prohibits plans from discriminating against individuals who refuse to provide contraceptives due to religious beliefs or moral convictions. (Sec. 727) States that the United States is committed to ensuring the health of its Olympic, Pan American, and Paralympic athletes, and supports the strict adherence to anti-doping in sports through testing, adjudication, education, and research. (Sec. 728) Permits federal agencies and departments to use funds appropriated for official travel to participate in the fractional aircraft ownership pilot program, if consistent with OMB Circular A-126 regarding official travel for government personnel. (Sec. 729) Prohibits funds from being used to implement OPM regulations limiting executive branch detailees to the legislative branch or to implement limitations on the Coast Guard Congressional Fellowship Program. (Sec. 730) Prohibits agencies from using funds for additional law enforcement training facilities that are not within or contiguous to existing locations without the approval of Congress. Permits the Federal Law Enforcement Training Center to obtain the temporary use of additional facilities for training which cannot be accommodated in existing facilities. (Sec. 731) Prohibits agencies from using funds to produce any prepackaged news story intended for broadcast or distribution in the United States, unless the story includes a notification that it was prepared or funded by the agency. (Sec. 732) Prohibits the use of funds in contravention of the Privacy Act or associated regulations. (Sec. 733) Prohibits the use of funds for contracts with any foreign incorporated entity which is an inverted domestic corporation. Requires a waiver if necessary for national security. Exempts contracts entered into prior to enactment of this bill. (Sec. 734) Requires agencies to pay a fee to the OPM for processing retirements of employees who separate under Voluntary Early Retirement Authority or receive Voluntary Separation Incentive Payments. (Sec. 735) Bars the use of funds to recommend or require any entity submitting an offer for a federal contract to disclose specified political contribution as a condition of submitting the offer. (Sec. 736) Bars the use of funds for portraits of a federal officer or employee, including the President, the Vice President, a Member of Congress, or the head of an executive branch agency or legislative branch office. (Sec. 737) Limits pay increases for certain categories of prevailing rate employees. (Sec. 738) Eliminates automatic pay increases for the Vice President and certain categories of political appointees. (Sec. 739) Requires agencies to submit annual reports to Inspectors General or senior ethics officials regarding the costs and contracting procedures for conferences that cost more than $100,000. (Sec. 740) Prohibits the use of funds to increase, eliminate, or reduce funding for a program, project, or activity, unless the changes have been enacted into law or made using transfer or reprogramming authority provided in an appropriations Act. (Sec. 741) Prohibits funds from being used to require contractors or employees to sign confidentiality agreements or statements restricting or prohibiting the reporting of waste, fraud, or abuse to investigative or law enforcement representatives. (Sec. 742) Prohibits the use of funds to implement or enforce a nondisclosure agreement unless it meets specified criteria. (Sec. 743) Prohibits the use of funds for specified transactions with any corporation with certain unpaid federal tax liabilities, unless an agency has considered suspension or debarment of the corporation and decided that further action is not necessary to protect the interests of the government. (Sec. 744) Prohibits the use of funds for specified transactions with any corporation that was convicted of a felony within the preceding 24 months, unless an agency has considered suspension or debarment of the corporation and decided that further action is not necessary to protect the interests of the government. (Sec. 745) Prohibits the use of funds for Executive Order 13690 (Establishing a Federal Flood Risk Management Standard and a Process for Further Soliciting and Considering Stakeholder Input). (Sec. 746) Provides that references to \"this Act\" shall not apply to titles IV (District of Columbia) or VIII (General Provisions--District of Columbia) unless it is included in those titles or expressly provided for in this bill. TITLE VIII--GENERAL PROVISIONS--DISTRICT OF COLUMBIA Sets forth permitted, restricted, and prohibited uses of funds appropriated by this bill for the District of Columbia. (Sec. 801) Appropriates District of Columbia funds for making refunds and paying settlements or judgments against the District of Columbia government. (Sec. 802) Prohibits the use of federal funds provided by this bill for publicity or propaganda purposes or implementation of any policy including boycott designed to support or defeat legislation pending before Congress or any state legislature. (Sec. 803) Establishes reprogramming procedures for federal funds. (Sec. 804) Prohibits the use of federal funds for the salaries and expenses of shadow U.S. Representatives or Senators. (Sec. 805) Requires official vehicles provided to any officer or employee of the District of Columbia to be used only for official duties. (Sec. 806) Prohibits the use of federal funds for a petition drive or civil action seeking voting representation in Congress for the District. (Sec. 807) Bars the use of federal funds provided by this bill to distribute needles or syringes for the hypodermic injection of any illegal drug. (Sec. 808) Provides that nothing in this bill prevents the Council or the Mayor from addressing contraceptive coverage by health insurance plans. Expresses the intent of Congress that legislation enacted on the issue should include a conscience clause providing exceptions for religious beliefs and moral convictions. (Sec. 809) Prohibits the use of federal funds provided by this bill to legalize or otherwise reduce penalties for the possession, use, or distribution of any schedule I substance under the Controlled Substances Act or any tetrahydrocannabinols derivative (THC, the psychoactive component of marijuana). Prohibits the use of funds provided by this bill to legalize or reduce penalties for possession, use, or distribution of any schedule I substance under the Controlled Substance Act or any tetrahydrocannabinols derivative (THC, the psychoactive component of marijuana) for recreational purposes. (Sec. 810) Prohibits funds provided by this bill from being used for abortions except where the mother's life would be endangered if the fetus were carried to term, or in cases of rape or incest. (Sec. 811) Requires the Chief Financial Officer (CFO) of the District of Columbia to submit to Congress, the Mayor, and the Council a revised operating budget for agencies requiring a reallocation to address unanticipated changes in program requirements. (Sec. 812) Requires the CFO of the District of Columbia to submit to Congress, the Mayor, and the Council a revised operating budget for the District of Columbia Public Schools that aligns the school budget to actual enrollment. (Sec. 813) Permits the District of Columbia to reprogram or transfer funds between operating funds and capital and enterprise funds. Prohibits the transfer of any funds derived from bonds, notes, or other obligations issued for capital projects. (Sec. 814) Prohibits federal funds from being obligated beyond the current fiscal year or transferred unless expressly permitted in this bill. (Sec. 815) Permits up to 50% of unobligated balances available at the end of FY2016 from federal appropriations for salaries and expenses to remain available through FY2017, subject to congressional approval and reprogramming guidelines. (Sec. 816) Appropriates local funds to the District of Columbia for FY2017 if no continuing resolution or regular appropriation for the District of Columbia is in effect. Provides the funds under the same authorities, conditions, and manner as provided for FY2016. (Sec. 817) Provides that references to \"this Act\" in this title or title IV (District of Columbia) refer only to those titles, unless this Act expressly provides otherwise. (Sec. 818) Prohibits funds provided by this bill from being used to carry out the Reproductive Health Non-Discrimination Amendment Act of 2014 (D.C. Law 20-261) or to implement any rule or regulation promulgated to carry out the Act. TITLE IX--ADDITIONAL GENERAL PROVISIONS (Sec. 901) Prohibits funds provided by this bill from being used to pay for an abortion or the administrative expenses in connection with a multi-state qualified health plan offered under PPACA which provides any benefits or coverage for abortions. Includes exceptions if the life of the mother would be endangered if the fetus were carried to term, or the pregnancy is the result of rape or incest. (Sec. 902) Establishes a spending reduction account for the amount by which spending proposed in this bill exceeds the subcommittee's allocation under the Congressional Budget Act of 1974. Specifies that the amount is $0. (Under the Rules of the House of Representatives, any savings included in the spending reduction account are not available for further appropriation during consideration of the bill.)", "pending_committee_id": 0, "committee": [], "referrals": [], "history": [{"date": "2015-07-09", "action": "The House Committee on Appropriations reported an original measure, H. Rept. 114-194, by Mr. Crenshaw.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2015-07-09", "action": "Placed on the Union Calendar, Calendar No. 144.", "chamber": "H", "chamber_id": 114, "importance": 0}], "sponsors": [{"people_id": 9178, "person_hash": "95kqpg01", "party_id": "2", "state_id": 52, "party": "R", "role_id": 1, "role": "Rep", "name": "Ander Crenshaw", "first_name": "Ander", "middle_name": "", "last_name": "Crenshaw", "suffix": "", "nickname": "", "district": "HD-FL-4", "ftm_eid": 17657418, "votesmart_id": 31130, "opensecrets_id": "N00012739", "knowwho_pid": 205747, "ballotpedia": "Ander_Crenshaw", "sponsor_type_id": 1, "sponsor_order": 1, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}], "sasts": [{"type_id": 8, "type": "Related", "sast_bill_number": "SB1910", "sast_bill_id": 788648}, {"type_id": 8, "type": "Related", "sast_bill_number": "SB2132", "sast_bill_id": 792244}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB2029", "sast_bill_id": 774335}], "subjects": [{"subject_id": 13347, "subject_name": "Abortion"}, {"subject_id": 13814, "subject_name": "Administrative Conference of the U.S."}, {"subject_id": 13126, "subject_name": "Administrative law and regulatory procedures"}, {"subject_id": 13127, "subject_name": "Advisory bodies"}, {"subject_id": 13134, "subject_name": "Appropriations"}, {"subject_id": 13538, "subject_name": "Art, artists, authorship"}, {"subject_id": 13609, "subject_name": "Athletes"}, {"subject_id": 13478, "subject_name": "Banking and financial institutions regulation"}, {"subject_id": 13140, "subject_name": "Buy American requirements"}, {"subject_id": 13489, "subject_name": "Caribbean area"}, {"subject_id": 13142, "subject_name": "Child health"}, {"subject_id": 21500, "subject_name": "Climate change and greenhouse gases"}, {"subject_id": 13690, "subject_name": "Coal"}, {"subject_id": 13621, "subject_name": "Comprehensive health care"}, {"subject_id": 13144, "subject_name": "Computers and information technology"}, {"subject_id": 13146, "subject_name": "Congressional oversight"}, {"subject_id": 20665, "subject_name": "Consumer Financial Protection Bureau"}, {"subject_id": 13638, "subject_name": "Consumer Product Safety Commission"}, {"subject_id": 13344, "subject_name": "Criminal procedure and sentencing"}, {"subject_id": 13583, "subject_name": "Cuba"}, {"subject_id": 13165, "subject_name": "Department of the Treasury"}, {"subject_id": 13167, "subject_name": "District of Columbia"}, {"subject_id": 13345, "subject_name": "Drug trafficking and controlled substances"}, {"subject_id": 13307, "subject_name": "Drug, alcohol, tobacco use"}, {"subject_id": 13171, "subject_name": "Education programs funding"}, {"subject_id": 13501, "subject_name": "Election Assistance Commission"}, {"subject_id": 13494, "subject_name": "Elections, voting, political campaign regulation"}, {"subject_id": 13173, "subject_name": "Electric power generation and transmission"}, {"subject_id": 13174, "subject_name": "Elementary and secondary education"}, {"subject_id": 81065, "subject_name": "Employee performance"}, {"subject_id": 13177, "subject_name": "Employment discrimination and employee rights"}, {"subject_id": 13183, "subject_name": "Executive Office of the President"}, {"subject_id": 13184, "subject_name": "Executive agency funding and structure"}, {"subject_id": 13622, "subject_name": "Family planning and birth control"}, {"subject_id": 13634, "subject_name": "Federal Communications Commission (FCC)"}, {"subject_id": 13832, "subject_name": "Federal Deposit Insurance Corporation (FDIC)"}, {"subject_id": 13833, "subject_name": "Federal Election Commission (FEC)"}, {"subject_id": 13707, "subject_name": "Federal Labor Relations Authority"}, {"subject_id": 13636, "subject_name": "Federal Reserve System"}, {"subject_id": 13514, "subject_name": "Federal Trade Commission (FTC)"}, {"subject_id": 13617, "subject_name": "Federal appellate courts"}, {"subject_id": 13659, "subject_name": "Federal district courts"}, {"subject_id": 13737, "subject_name": "Federal officials"}, {"subject_id": 13663, "subject_name": "First Amendment rights"}, {"subject_id": 13189, "subject_name": "Floods and storm protection"}, {"subject_id": 13511, "subject_name": "Food industry and services"}, {"subject_id": 13309, "subject_name": "Fraud offenses and financial crimes"}, {"subject_id": 13194, "subject_name": "General Services Administration"}, {"subject_id": 13196, "subject_name": "Government buildings, facilities, and property"}, {"subject_id": 13198, "subject_name": "Government employee pay, benefits, personnel management"}, {"subject_id": 13199, "subject_name": "Government ethics and transparency, public corruption"}, {"subject_id": 13200, "subject_name": "Government information and archives"}, {"subject_id": 13202, "subject_name": "Government lending and loan guarantees"}, {"subject_id": 13203, "subject_name": "Government trust funds"}, {"subject_id": 13605, "subject_name": "HIV/AIDS"}, {"subject_id": 13206, "subject_name": "Health care costs and insurance"}, {"subject_id": 13207, "subject_name": "Health care coverage and access"}, {"subject_id": 13215, "subject_name": "Higher education"}, {"subject_id": 13402, "subject_name": "Human rights"}, {"subject_id": 13519, "subject_name": "Hybrid, electric, and advanced technology vehicles"}, {"subject_id": 13898, "subject_name": "Industrial policy and productivity"}, {"subject_id": 13500, "subject_name": "Intelligence activities, surveillance, classified information"}, {"subject_id": 13368, "subject_name": "Internal Revenue Service (IRS)"}, {"subject_id": 13615, "subject_name": "International exchange and broadcasting"}, {"subject_id": 13233, "subject_name": "Internet and video services"}, {"subject_id": 13618, "subject_name": "Judges"}, {"subject_id": 13606, "subject_name": "Judicial procedure and administration"}, {"subject_id": 13234, "subject_name": "Labor standards"}, {"subject_id": 13551, "subject_name": "Labor-management relations"}, {"subject_id": 13235, "subject_name": "Latin America"}, {"subject_id": 13701, "subject_name": "Manufacturing"}, {"subject_id": 13313, "subject_name": "Medical tests and diagnostic methods"}, {"subject_id": 13893, "subject_name": "Merit Systems Protection Board"}, {"subject_id": 13248, "subject_name": "Motor vehicles"}, {"subject_id": 13849, "subject_name": "Multilateral development programs"}, {"subject_id": 13560, "subject_name": "Museums, exhibitions, cultural centers"}, {"subject_id": 13386, "subject_name": "National Archives and Records Administration"}, {"subject_id": 13791, "subject_name": "National Credit Union Administration"}, {"subject_id": 13251, "subject_name": "National Guard and reserves"}, {"subject_id": 13315, "subject_name": "Nutrition and diet"}, {"subject_id": 13855, "subject_name": "Office of Government Ethics"}, {"subject_id": 13679, "subject_name": "Office of Management and Budget (OMB)"}, {"subject_id": 13770, "subject_name": "Office of Personnel Management (OPM)"}, {"subject_id": 13811, "subject_name": "Office of Special Counsel"}, {"subject_id": 13256, "subject_name": "Oil and gas"}, {"subject_id": 13258, "subject_name": "Performance measurement"}, {"subject_id": 13426, "subject_name": "Pollution liability"}, {"subject_id": 13776, "subject_name": "Postal Regulatory Commission"}, {"subject_id": 13355, "subject_name": "Postal service"}, {"subject_id": 13490, "subject_name": "Prescription drugs"}, {"subject_id": 128868, "subject_name": "Presidents and presidential powers, Vice Presidents"}, {"subject_id": 81059, "subject_name": "Privacy and Civil Liberties Oversight Board"}, {"subject_id": 13640, "subject_name": "Product safety and quality"}, {"subject_id": 13260, "subject_name": "Public contracts and procurement"}, {"subject_id": 13652, "subject_name": "Public participation and lobbying"}, {"subject_id": 13266, "subject_name": "Religion"}, {"subject_id": 13270, "subject_name": "Right of privacy"}, {"subject_id": 13273, "subject_name": "Securities"}, {"subject_id": 13666, "subject_name": "Securities and Exchange Commission (SEC)"}, {"subject_id": 13857, "subject_name": "Selective Service System"}, {"subject_id": 13349, "subject_name": "Sex and reproductive health"}, {"subject_id": 13275, "subject_name": "Small Business Administration"}, {"subject_id": 13276, "subject_name": "Small business"}, {"subject_id": 13762, "subject_name": "Specialized courts"}, {"subject_id": 13708, "subject_name": "State and local courts"}, {"subject_id": 13284, "subject_name": "State and local finance"}, {"subject_id": 13286, "subject_name": "Student aid and college costs"}, {"subject_id": 13725, "subject_name": "Supreme Court"}, {"subject_id": 13319, "subject_name": "Tax administration and collection, taxpayers"}, {"subject_id": 13738, "subject_name": "Tax-exempt organizations"}, {"subject_id": 13431, "subject_name": "Terrorism"}, {"subject_id": 13644, "subject_name": "Transportation costs"}, {"subject_id": 13533, "subject_name": "Travel and tourism"}, {"subject_id": 13357, "subject_name": "U.S. Postal Service"}, {"subject_id": 13662, "subject_name": "U.S. Sentencing Commission"}, {"subject_id": 13382, "subject_name": "Veterans' loans, housing, homeless programs"}, {"subject_id": 13434, "subject_name": "Voting rights"}, {"subject_id": 13302, "subject_name": "Women's health"}, {"subject_id": 13375, "subject_name": "Housing and community development"}], "texts": [{"doc_id": 1254782, "date": "2015-07-09", "type": "Introduced", "type_id": 1, "mime": "application/pdf", "mime_id": 2, "url": "https://legiscan.com/US/text/HB2995/id/1254782", "state_link": "https://www.congress.gov/114/bills/hr2995/BILLS-114hr2995rh.pdf", "text_size": 488587, "text_hash": "69dad69f678c16fbfd2786c546465199"}], "votes": [], "amendments": [], "supplements": [], "calendar": []}}