{"votes": {"No": [["William  Ihlenfeld", "180490", "Democratic", "WV", "1"], ["Robert  H. 'Bob'  Plymale", "7551", "Democratic", "WV", "5"], ["Ron  Stollings", "52368", "Democratic", "WV", "7"], ["Glenn  Jeffries", "167265", "Democratic", "WV", "8"], ["Richard  David  Lindsay", "148555", "Democratic", "WV", "8"], ["Stephen  Baldwin\n                  Jr.", "167417", "Democratic", "WV", "10"], ["Kenny  W.  Mann", "167269", "Republican", "WV", "10"], ["Douglas  Eugene 'Doug'  Facemire", "102185", "Democratic", "WV", "12"], ["Michael  J. 'Mike'  Romano", "143730", "Democratic", "WV", "12"], ["Roman  W.  Prezioso\n                  Jr.", "7620", "Democratic", "WV", "13"], ["Robert  D. 'Bob'  Beach", "52354", "Democratic", "WV", "13"], ["John  Ronald  Unger\n                  II", "26510", "Democratic", "WV", "16"], ["Corey  Lee  Palumbo", "52176", "Democratic", "WV", "17"]], "Yes": [["Ryan  William  Weld", "148395", "Republican", "WV", "1"], ["Michael  J. 'Mike'  Maroney", "167247", "Republican", "WV", "2"], ["Charles  H. 'Charlie'  Clements", "7578", "Republican", "WV", "2"], ["Michael  Thomas 'Mike'  Azinger", "148408", "Republican", "WV", "3"], ["Donna  Jean  Boley", "7535", "Republican", "WV", "3"], ["Eric  J.  Tarr", "177679", "Republican", "WV", "4"], ["Mitchell  Brian 'Mitch'  Carmichael", "52201", "Republican", "WV", "4"], ["Michael 'Mike'  Woelfel", "148367", "Democratic", "WV", "5"], ["Mark  R.  Maynard", "104892", "Republican", "WV", "6"], ["Chandler  Swope", "167261", "Republican", "WV", "6"], ["Paul  Hardesty", "186031", "Democratic", "WV", "7"], ["Naomi  Sue  Cline", "148453", "Republican", "WV", "9"], ["Rollan  A.  Roberts", "177687", "Republican", "WV", "9"], ["William  D. 'Bill'  Hamilton", "52422", "Republican", "WV", "11"], ["John  R. 'JR'  Pitsenbarger", "174724", "Republican", "WV", "11"], ["Randy  Edward  Smith", "135450", "Republican", "WV", "14"], ["David  C. 'Dave'  Sypolt", "52108", "Republican", "WV", "14"], ["Charles  S. 'Charley'  Trump\n                  IV", "7636", "Republican", "WV", "15"], ["Craig  P.  Blair", "52565", "Republican", "WV", "15"], ["Patricia  Puertas  Rucker", "148634", "Republican", "WV", "16"], ["Tom  Takubo", "148384", "Republican", "WV", "17"]], "Did Not Vote": [], "NA": []}, "synopsis": "Vote to amend and pass a bill that increases penalties for critical infrastructure protesting and trespassing.", "link": "https://justfacts.votesmart.org/bill/27831/71815/increases-penalties-for-critical-infrastructure-protesting", "name": "HB 4615 - Increases Penalties for Critical Infrastructure Protesting - West Virginia Key Vote", "pg": "Highlights: Specifies that any individual who willfully and knowingly trespasses or enters property containing a critical infrastructure facility in order to damage, destroy, vandalize, deface, tamper with equipment, or impede or inhibit operations of the critical infrastructure facility without permission of the owner shall be guilty of a misdemeanor, punished by a fine of between $100 and $1,000, or confined in jail for between 30 days and one year (Article 10, Sec. 61). Specifies that any individual that conspires to commit the above-mentioned offense and actually trespasses at a critical infrastructure facility and causes damage in excess of $2,500 shall be guilty of a felony and subject to a fine between $1,000 and $5,000 or imprisoned in a state correctional facility for a period of between one and 5 years (Article 10, Sec. 61). Specifies that any individual arrested or convicted for an offense under this section shall be held civilly liable for any damages to personal or real property in addition to the penalties imposed by this act (Article 10, Sec. 61). Specifies that any person or entity that compensates, provides consideration to, or remunerates an individual for trespassing may also be held liable for damages to personal or real property committed by the individual compensated or remunerated for trespassing (Article 10, Sec. 61). Specifies that the provisions of this act do not apply to the following individuals or organizations that accomplish the following, including (Article 10, Sec. 61): Monitoring or attentive to compliance with public or worker safety laws; Picketing at the workplace that is otherwise lawful and arises out of a bona fide labor dispute, including: Controversy concerning wages, salaries, hours, working conditions, or benefits including; Health and welfare, sick leave, insurance, and pension or retirement plans; or The managing or maintenance of collective bargaining agreements and the terms included in those agreements; and Engaging in union organizing or recruitment activities, including attempting to reach workers verbally or in written pamphlets. Specifies that the provisions of this act do not apply to the right to free speech or assembly, including, but not limited to, protesting and picketing (Article 10, Sec. 61). Defines “critical infrastructure” as systems and assets, whether physical or virtual, so vital to the United States or the state of West Virginia that the incapacity or destruction of such systems and assets would have a debilitating impact on any combination of the following, including (Article 10, Sec. 61): Security; National or state economic security; and National or state public health and safety. Defines “critical infrastructure facility” as any of the following that is completely enclosed by a fence or other physical barrier that is obviously designed to exclude intruders or clearly marked with an easily visible sign, including, but not limited to (Article 10, Sec. 61): A petroleum or alumina refinery; An electrical power generating facility, substation, switching station, electrical control center or electrical power lines and associated equipment infrastructure; A chemical, polymer or rubber manufacturing facility; A water intake structure, water treatment facility, wastewater treatment plant or pump station; A natural gas compressor station; A liquid natural gas terminal or storage facility; Wireline and wireless telecommunications infrastructure; A port, railroad switching yard, trucking terminal, or other freight transportation facility; A gas processing plant, including a plant used in the processing, treatment, or fractionation of natural gas liquids; A transmission facility used by a federally licensed radio or television station; A steelmaking facility that uses an electric arc furnace to make steel; A dam regulated by the state or federal government; A crude oil or refined products storage and distribution utility facility including pipeline interconnections; or A crude oil or refined products storage and distribution facility, including pipeline interconnections and pump stations."}