{"votes": {"No": [["Tyler  Lindholm", "153751", "Republican", "WY", "1"], ["Hans  Hunt", "127278", "Republican", "WY", "2"], ["Jared  Olsen", "171208", "Republican", "WY", "11"], ["Clarence  L.  Styvar", "171210", "Republican", "WY", "12"], ["Cathy  Connolly", "106124", "Democratic", "WY", "13"], ["Michael 'Mike'  Yin", "184068", "Democratic", "WY", "16"], ["Albert  Sommers", "140052", "Republican", "WY", "20"], ["Dan  Laursen", "153967", "Republican", "WY", "25"], ["Jamie  Flitner", "171241", "Republican", "WY", "26"], ["John  R.  Winter", "184072", "Republican", "WY", "28"], ["Mark  Jennings", "153972", "Republican", "WY", "30"], ["Scott  Clem", "153974", "Republican", "WY", "31"], ["Tim  Salazar", "153981", "Republican", "WY", "34"], ["Richard  L.  Tass", "69248", "Republican", "WY", "40"], ["Garry  C.  Piiparinen", "139815", "Republican", "WY", "49"], ["Roy  Edwards", "100261", "Republican", "WY", "53"], ["David  R.  Miller", "52678", "Republican", "WY", "55"], ["Chuck  Gray", "154005", "Republican", "WY", "57"]], "Yes": [["Eric  Barlow", "140045", "Republican", "WY", "3"], ["Dan  R.  Kirkbride", "100315", "Republican", "WY", "4"], ["Shelly  Duncan", "184049", "Republican", "WY", "5"], ["Aaron  Clausen", "171195", "Republican", "WY", "6"], ["Susan 'Sue'  Wilson", "139808", "Republican", "WY", "7"], ["Bob  Nicholas", "106111", "Republican", "WY", "8"], ["Landon  J.  Brown", "171204", "Republican", "WY", "9"], ["John  Eklund\n                  Jr.", "127284", "Republican", "WY", "10"], ["Daniel 'Dan'  Furphy", "171216", "Republican", "WY", "14"], ["Donald  E.  Burkhart\n                  Jr.", "127286", "Republican", "WY", "15"], ["JoAnn  Dayton", "140050", "Democratic", "WY", "17"], ["Thomas  D. 'Tom'  Crank", "171226", "Republican", "WY", "18"], ["Danny  Eyre", "171228", "Republican", "WY", "19"], ["Evan  J.  Simpson", "179191", "Republican", "WY", "21"], ["James  A. 'Jim'  Roscoe", "106141", "Independent", "WY", "22"], ["Andy  Schwartz", "100329", "Democratic", "WY", "23"], ["Sandy  Newsome", "175358", "Republican", "WY", "24"], ["Michael  D. 'Mike'  Greear", "127298", "Republican", "WY", "27"], ["Mark  S.  Kinner", "158029", "Republican", "WY", "29"], ["Timothy  P. 'Tim'  Hallinan", "66029", "Republican", "WY", "32"], ["Andrea 'Andi'  LeBeau", "153976", "Democratic", "WY", "33"], ["Joe  MacGuire", "176156", "Republican", "WY", "35"], ["Arthur 'Art'  Washut", "184074", "Republican", "WY", "36"], ["Steve  Harshman", "52736", "Republican", "WY", "37"], ["Tom  Walters", "52688", "Republican", "WY", "38"], ["Stan  Blake", "65449", "Democratic", "WY", "39"], ["Theodore 'Jim'  Blackburn", "127322", "Republican", "WY", "42"], ["Daniel  K. 'Dan'  Zwonitzer", "52807", "Republican", "WY", "43"], ["Sara  Burlingame", "184076", "Democratic", "WY", "44"], ["Charles  F.  Pelkey", "153994", "Democratic", "WY", "45"], ["Bill  Haley", "171291", "Republican", "WY", "46"], ["Jerry  Paxton", "100266", "Republican", "WY", "47"], ["Clark  Stith", "52783", "Republican", "WY", "48"], ["David  Northrup", "139816", "Republican", "WY", "50"], ["Cyrus  Western", "184079", "Republican", "WY", "51"], ["William  H. 'Bill'  Pownall", "154002", "Republican", "WY", "52"], ["Lloyd  Charles  Larsen", "140069", "Republican", "WY", "54"], ["Jerry  A.  Obermueller", "171306", "Republican", "WY", "56"], ["Patrick 'Pat'  Sweeney", "171315", "Republican", "WY", "58"], ["Carl 'Bunky'  Loucks", "127331", "Republican", "WY", "59"], ["John  L.  Freeman", "127333", "Democratic", "WY", "60"]], "Did Not Vote": [["William 'Bill'  Henderson", "153990", "Republican", "WY", "41"]], "NA": []}, "synopsis": "Vote to amend and pass a bill that requires the public service commission to establish electricity generation portfolio standards for public utilities.", "link": "https://justfacts.votesmart.org/bill/27928/72215/establishes-low-carbon-energy-standards-and-subsidizes-carbon-capture-projects", "name": "HB 200 - Establishes Low-Carbon Energy Standards and Subsidizes Carbon Capture Projects - Wyoming Key Vote", "pg": "Highlights: Requires the public service commission to establish energy portfolio standards that will maximize the use of dispatchable and reliable low-carbon electricity, through which the commission will (Sec. 1): Require a public utility to generate a specified percentage of electricity generated to be dispatchable and reliable low-carbon electricity; Establish a date no later than July 1, 2030, for requiring a percentage of electricity generated by a public utility to be dispatchable and reliable low-carbon electricity taking into consideration any potentially expiring federal tax credits; Establish intermediate standards and requirements for dispatchable and reliable low-carbon electricity that public utilities must generate before the final electricity generation standard is established; Require each public utility to demonstrate in each integrated resource plan, submitted to the commission, stating the steps the public utility is taking to achieve the final electricity generation standard; and For each each public utility: Establish baseline standards for electric reliability to ensure that new or expanded intermittent generation resources do not unreasonably diminish power quality or increase momentary outages across a utility's service territory or in any particular location; Require the utility to monitor and report electric reliability and power quality outcomes in integrated resource plan submissions or as otherwise directed by the commission; and Require the utility to take any steps the commission deems reasonably necessary to maintain reasonable levels of electric reliability and power quality. Authorizes a public utility that generates dispatchable and reliable low-carbon electricity to apply to the commission for rate recovery of the cost of any carbon capture, utilization, and storage technology used to achieve the electricity generation standards provided that the carbon capture, utilization, and storage technology is integral or adjacent to a coal-fired generation facility (Sec. 1). Authorizes a public utility to apply to the commission for authorization to allow a portion of any revenues from the sale of carbon dioxide captured, stored, or utilized as a result of generating dispatchable and reliable low-carbon electricity to be returned to the shareholders of the public utility (Sec. 1). Authorizes a public utility to implement a rate recovery mechanism that collects a surcharge from customers up to 2 percent of each customer's total electric bill to provide for the recovery of the prudently incurred incremental costs to comply with the reliable and dispatchable low-carbon energy standard (Sec. 1).c Defines “carbon capture, utilization, and storage technology” as technology that has the principal purpose of capturing, reusing, storing, sequestering, or using carbon dioxide emissions to prevent carbon dioxide from entering the atmosphere, whether constructed integral or adjacent to a coal-fired generation facility (Sec. 1). Defines “dispatchable” as a source of electricity that is available for use on-demand and that can be dispatched upon request of a power grid operator or that can have its power output adjusted according to market needs (Sec. 1). Defines “reliable” as meaning generated electricity that is not subject to intermittent availability (Sec. 1). Specifies that the provisions of this act will not apply to any public utility owned or operated by a municipality or any cooperative electrical generation and transmission association operating in interstate commerce (Sec. 2)."}