{"votes": {"No": [["Rosanna  Gabaldón", "141336", "Democratic", "AZ", "2"], ["Sally  Ann  Gonzales", "12275", "Democratic", "AZ", "3"], ["Lisa  Otondo", "28473", "Democratic", "AZ", "4"], ["Jamescita 'Mae'  Peshlakai", "141360", "Democratic", "AZ", "7"], ["Victoria  Steele", "141367", "Democratic", "AZ", "9"], ["Kirsten  Engel", "171720", "Democratic", "AZ", "10"], ["Sean  Bowie", "171663", "Democratic", "AZ", "18"], ["Guadalupe  Chavira 'Lupe'  Contreras", "141487", "Democratic", "AZ", "19"], ["Lela  Alston", "123722", "Democratic", "AZ", "24"], ["Juan  Mendez", "141502", "Democratic", "AZ", "26"], ["Rebecca  Rios", "3107", "Democratic", "AZ", "27"], ["Christine  Porter  Marsh", "184542", "Democratic", "AZ", "28"], ["Martín  J.  Quezada", "123716", "Democratic", "AZ", "29"], ["Otoniel 'Tony'  Navarrete", "171893", "Democratic", "AZ", "30"]], "Yes": [["Karen  Fann", "123640", "Republican", "AZ", "1"], ["Sonny  Borrelli", "129361", "Republican", "AZ", "5"], ["Wendy  J.  Rogers", "123618", "Republican", "AZ", "6"], ["Thomas  J. 'T.J.'  Shope", "141366", "Republican", "AZ", "8"], ["Venden 'Vince'  Leach", "153854", "Republican", "AZ", "11"], ["Warren  Petersen", "141381", "Republican", "AZ", "12"], ["Sine  Kerr", "178430", "Republican", "AZ", "13"], ["David  M.  Gowan\n                  Sr.", "28241", "Republican", "AZ", "14"], ["Nancy  K.  Barto", "58371", "Republican", "AZ", "15"], ["Kelly  Townsend", "123798", "Republican", "AZ", "16"], ["Javan 'J.D.'  Mesnard", "123791", "Republican", "AZ", "17"], ["Paul  Boyer", "141493", "Republican", "AZ", "20"], ["Rick  Gray", "123693", "Republican", "AZ", "21"], ["David  Livingston", "141496", "Republican", "AZ", "22"], ["Michelle  B.  Ugenti-Rita", "123686", "Republican", "AZ", "23"], ["Tyler  Pace", "184537", "Republican", "AZ", "25"]], "Did Not Vote": [], "NA": []}, "synopsis": "Vote to pass a bill that classifies gun stores as essential businesses.", "link": "https://justfacts.votesmart.org/bill/30610/79004/classifies-gun-stores-as-essential-businesses", "name": "SB 1382 - Classifies Gun Stores as Essential Businesses - Arizona Key Vote", "pg": "Highlights: Authorizes the governor to do the following during a state of war emergency (Sec. 1.A): Suspend the provisions of any statute prescribing the procedure for conduct of state business, or the orders or rules of any state agency, if the governor determines and proclaims that strict compliance with the provisions of any such statute, order or rule would in any way prevent, hinder or delay mitigation of the effects of the emergency; and Commandeer and use any property, except for firearms or ammunition or firearms or ammunition components, or personnel deemed necessary in carrying out the responsibilities vested in the office of the governor by this chapter as chief executive of this state, and thereafter this state will pay reasonable compensation for the property as follows: If property is taken for temporary use, the governor, within ten days after the taking, will determine the amount of compensation to be paid for the property. If the property is returned in a damaged condition, the governor, within ten days after its return, will determine the amount of compensation to be paid for such damage; If the governor deems it necessary for this state to take title to property under this law, the governor shall then cause the owner of the property to be notified thereof in writing by registered mail, postage prepaid, and then cause a copy of the notice to be filed with the secretary of state; or If the owner refuses to accept the amount of compensation fixed by the governor for the property, the amount of compensation will be determined by appropriate proceedings in the superior court in the county where the property was originally taken. Authorizes the governor to have complete authority over all agencies of the state government and to exercise all police power vested in this state by the constitution and laws of this state (Sec. 1.B). Specifies the powers granted to the governor by this chapter with respect to a state of war emergency will terminate if the legislature is not in session and the governor, within twenty‐four hours after the beginning of such a state of war emergency, has not issued a call for an immediate special session of the legislature for the purpose of legislating on subjects relating to such a state of war emergency (Sec. 1.C). Establishes the following during a state of emergency (Sec. 1.E): The governor shall have complete authority over all agencies of the state government and the right to exercise, within the area designated, all police power vested in this state by the constitution and laws of this state in order to effectuate the purposes of this chapter; The governor may direct all agencies of the state government to use and employ state personnel, equipment and facilities to perform any activities designed to prevent or alleviate actual and threatened damage due to the emergency. The governor may direct such agencies to provide supplemental services and equipment to political subdivisions to restore any services in order to provide for the health and safety of the citizens of the affected area. Prohibits the emergency powers of the governor, the adjutant general or any other official or person from being construed to allow the imposition of additional restrictions on the lawful possession, transfer, sale, transportation, carrying, storage, display or use of firearms or ammunition or firearms or ammunition components. A store that sells firearms or ammunition, or firearms or ammunition components, is an essential business, and there may not be any restrictions imposed on the store’s normal operations (Sec. 1.J)."}