{"votes": {"No": [["Jerry  Sonnenberg", "66361", "Republican", "CO", "1"], ["Dennis  Hisey", "80789", "Republican", "CO", "2"], ["Jim  Smallwood", "169952", "Republican", "CO", "4"], ["Don  Coram", "125548", "Republican", "CO", "6"], ["Robert  E. 'Bob'  Rankin", "138788", "Republican", "CO", "8"], ["Paul  Lundeen", "125570", "Republican", "CO", "9"], ["Owen  Hill", "125362", "Republican", "CO", "10"], ["Bob  Gardner", "65710", "Republican", "CO", "12"], ["John  B.  Cooke\n                  III", "149321", "Republican", "CO", "13"], ["Rob  Woodward", "181710", "Republican", "CO", "15"], ["Vicki  Marble", "138668", "Republican", "CO", "23"], ["Kevin  Priola", "106512", "Democratic", "CO", "25"], ["John  A. 'Jack'  Tate", "149365", "Republican", "CO", "27"], ["Chris  Holbert", "125519", "Republican", "CO", "30"], ["Larry  W.  Crowder", "138695", "Republican", "CO", "35"]], "Yes": [["Leroy  M.  Garcia\n                  Jr.", "130019", "Democratic", "CO", "3"], ["Kerry  Donovan", "149316", "Democratic", "CO", "5"], ["Sanford  E. 'Pete'  Lee", "106254", "Democratic", "CO", "11"], ["Joann  Ginal", "138784", "Democratic", "CO", "14"], ["Tammy  Story", "169987", "Democratic", "CO", "16"], ["Mike  Foote", "138713", "Democratic", "CO", "17"], ["Stephen 'Steve'  Fenberg", "169954", "Democratic", "CO", "18"], ["Rachel  Zenzinger", "129975", "Democratic", "CO", "19"], ["Jessie  Danielson", "149351", "Democratic", "CO", "20"], ["Dominick  Moreno", "129994", "Democratic", "CO", "21"], ["Brittany  Pettersen", "138744", "Democratic", "CO", "22"], ["Faith  Winter", "105656", "Democratic", "CO", "24"], ["Jeff  Bridges", "169966", "Democratic", "CO", "26"], ["Nancy  Janann  Todd", "30073", "Democratic", "CO", "28"], ["Rhonda  Fields", "128419", "Democratic", "CO", "29"], ["Lois  Court", "106446", "Democratic", "CO", "31"], ["Robert  Rodriguez", "181713", "Democratic", "CO", "32"], ["Angela  Williams", "125479", "Democratic", "CO", "33"], ["Julie  Gonzales", "181717", "Democratic", "CO", "34"]], "Did Not Vote": [["Ray 'Bob'  Scott", "125544", "Republican", "CO", "7"]], "NA": []}, "synopsis": "Vote to pass a bill that amends local government control over environmental regulations.", "link": "https://justfacts.votesmart.org/bill/26151/66500/amends-local-environmental-regulations", "name": "SB 19-181 - Amends Local Environmental Regulations - Colorado Key Vote", "pg": "Highlights: Requires the Air Quality Control Commission to adopt rules to minimize emissions of methane and other hydrocarbons, volatile organic compounds, and oxides of nitrogen from facilities in all segments of the oil and natural gas supply chain (Sec. 3). Requires the commission to review its leak detection and repair rules for oil and natural gas well production facilities and compressor stations and specifically consider adopting more stringent provision, including (Sec. 3): A requirement that all oil and natural gas well production facilities must conduct, at a minimum, semi-annual leak detection and repair inspections; A requirement that owners and operators of oil and gas transmission pipelines inspect and maintain equipment and pipelines on a regular basis; and A requirement that oil and natural gas operators must install and operate continuous methane emissions monitors at facilities with large emissions potential, at multi-well facilities, and at facilities in close proximity to occupied dwellings. Requires the commission to promulgate rules to ensure proper wellbore integrity of all oil and gas production wells in promulgating the rules, and consider the incorporation of recommendations from the state oil and gas regulatory exchange, which will include provisions to (Sec. 11): Address the permitting, construction, operation, and closure of production wells; Require that wells are constructed using current practices and standards that protect water zones and prevent blowouts; Enhance safety and environmental protections during operations such as drilling and hydraulic fracturing; Require regular integrity assessments for all oil and gas production wells, such as pressure monitoring during production; and Address the use of nondestructive testing of well joints. Requires the commission to adopt rules of certification for workers in the following fields (Sec 11): A compliance officers with regard to the federal “Occupational Safety and Health Act of 1970”, including specifically working in confined spaces; Compliance officers with regard to codes published by the American Petroleum Institute and American Society of Mechanical Engineers, or their successors organizations; The handling of hazardous materials; Welders working on oil and gas process lines, including; Knowledge of the flowline rules; A minimum of 7,000 hours of training of documented on-the-job training, which requirement can be met by an employee working under the supervision of an individual with the requisite 7,000 hours of training; and Passage of the International Code Council Exam, National Standard Journeyman Mechanical, or an Analogous Successor Exam, for any person working on pressurized process lines in upstream and midstream operations. Requires the director of the commission to submit a report to the general assembly by January 1, 2021, regarding any recommended structural changes to the commission including making commission membership a full-time paid position and evaluating the use of additional administrative law judges and hearing officers to allow the commission to devote more of its time and efforts to setting policy and promulgating rules (Sec. 9). Prohibits anything in this act as authorizing state and local government to regulate the activities of (Sec. 10): Federally recognized Indian tribes, their political subdivision, or tribally controlled affiliates, undertaken or to be undertaken with respect to mineral evaluation, exploration, or development on lands within the exterior boundaries of an Indian Reservation located within the state; or Third parties, undertaken or to be undertaken with respect to mineral evaluation, exploration, or development on Indian trust lands within the exterior boundaries of an Indian reservation located within the state."}