{"votes": {"No": [["Jerry  Sonnenberg", "66361", "Republican", "CO", "1"], ["Dennis  Hisey", "80789", "Republican", "CO", "2"], ["Jim  Smallwood", "169952", "Republican", "CO", "4"], ["Don  Coram", "125548", "Republican", "CO", "6"], ["Ray 'Bob'  Scott", "125544", "Republican", "CO", "7"], ["Robert  E. 'Bob'  Rankin", "138788", "Republican", "CO", "8"], ["Paul  Lundeen", "125570", "Republican", "CO", "9"], ["Larry  G.  Liston", "30002", "Republican", "CO", "10"], ["Bob  Gardner", "65710", "Republican", "CO", "12"], ["John  B.  Cooke\n                  III", "149321", "Republican", "CO", "13"], ["Rob  Woodward", "181710", "Republican", "CO", "15"], ["Barbara  J.  Kirkmeyer", "29991", "Republican", "CO", "23"], ["Chris  Holbert", "125519", "Republican", "CO", "30"], ["Cleave  Simpson", "191801", "Republican", "CO", "35"]], "Yes": [["Leroy  M.  Garcia\n                  Jr.", "130019", "Democratic", "CO", "3"], ["Kerry  Donovan", "149316", "Democratic", "CO", "5"], ["Sanford  E. 'Pete'  Lee", "106254", "Democratic", "CO", "11"], ["Joann  Ginal", "138784", "Democratic", "CO", "14"], ["Tammy  Story", "169987", "Democratic", "CO", "16"], ["Sonya  Jaquez Lewis", "181737", "Democratic", "CO", "17"], ["Stephen 'Steve'  Fenberg", "169954", "Democratic", "CO", "18"], ["Rachel  Zenzinger", "129975", "Democratic", "CO", "19"], ["Jessie  Danielson", "149351", "Democratic", "CO", "20"], ["Dominick  Moreno", "129994", "Democratic", "CO", "21"], ["Brittany  Pettersen", "138744", "Democratic", "CO", "22"], ["Faith  Winter", "105656", "Democratic", "CO", "24"], ["Kevin  Priola", "106512", "Democratic", "CO", "25"], ["Jeff  Bridges", "169966", "Democratic", "CO", "26"], ["Christopher 'Chris'  Kolker", "181774", "Democratic", "CO", "27"], ["Janet  P.  Buckner", "166139", "Democratic", "CO", "28"], ["Rhonda  Fields", "128419", "Democratic", "CO", "29"], ["Chris  Hansen", "169970", "Democratic", "CO", "31"], ["Robert  Rodriguez", "181713", "Democratic", "CO", "32"], ["James  Rashad  Coleman", "169972", "Democratic", "CO", "33"], ["Julie  Gonzales", "181717", "Democratic", "CO", "34"]], "Did Not Vote": [], "NA": []}, "synopsis": "Vote to pass a bill that extends assistance to aid in the transition to \"healthier\" homes powered by renewable energies.", "link": "https://justfacts.votesmart.org/bill/30754/79406/extends-assistance-to-aid-in-the-transition-to-healthier-homes", "name": "SB 21-246 - Extends Assistance to Aid in the Transition to \"Healthier\" Homes - Colorado Key Vote", "pg": "Highlights: Requires the Public Utilities Commission to apply the cost of carbon dioxide and the social cost of methane emissions to the non energy benefits for programs that are defined to be beneficial electrification (Sec 4-5). Specifies the following requirements apply to beneficial electrification projects in new or existing industrial, commercial, or multifamily residential buildings (Sec. 5-4): For plumbing, mechanical, or electrical projects undertaken by a commercial or industrial customer in a building that contains 20,000 square feet or more of conditioned floor space and for which a rebate is to be provided directly to the customer as part of a beneficial electrification program, the utility will condition payment of the rebate on the customer's exclusive use of contractors from the certified contractor list unless the work is done by employees of the utility; and For plumbing, mechanical, or electrical projects that involve the beneficial electrification of central building systems in a multifamily building that contains 20,000 feet or more of conditioned floor space and for which a rebate is to be provided directly to the building owner as part of a beneficial electrification program, the utility will condition payment of the rebate on the building owner's exclusive use of contractors that participate in apprenticeship programs registered with the united states department of labor's employment and training administration or with a state apprenticeship council recognized by the united states department of labor for any necessary plumbing or electrical work. Authorizes the beneficial electrification strategic issues filing to be combined with other demand-side management strategic issues or related filings as appropriate, and an investor-owned gas utility to file with the commission an application for a beneficial electrification plan for regulated activities to support beneficial electrification as part of such a proceeding or as a separate application (Sec. 5-6.b). Requires the public school facility construction guidelines to identify and describe the capital construction, renovation, and equipment needs in public school facilities and means of addressing those needs that will provide educational and safety benefits at a reasonable cost (Sec. 6-2). Authorizes the Public Utilities Commission to consider incentive mechanisms to promote the advancement of the utility's beneficial electrification programs, which may include (Sec. 6-5): An incentive rate of return on beneficial electrification investments; An incentive to allow the utility to accelerate depreciation; An incentive to allow the utility to retain a portion of the net economic benefits of beneficial electrification; An incentive to allow the utility to collect the cost of beneficial electrification programs through a rider or cost adjustment clause; or Any other incentive mechanism the commission deems appropriate."}