{"votes": {"No": [["Dallas  L.  Heard", "150832", "Republican", "OR", "1"], ["Fred  Frank  Girod", "69243", "Republican", "OR", "9"], ["Brian  J.  Boquist", "46475", "Republican", "OR", "12"], ["Kim  Thatcher", "46657", "Republican", "OR", "13"], ["Charles  William 'Chuck'  Thomsen", "119275", "Republican", "OR", "26"], ["Dennis  B.  Linthicum", "132916", "Republican", "OR", "28"]], "Yes": [["Herman  Baertschiger\n                  Jr.", "136768", "Republican", "OR", "2"], ["Jeffrey  S. 'Jeff'  Golden", "179932", "Democratic", "OR", "3"], ["Floyd  F.  Prozanski\n                  Jr.", "3024", "Democratic", "OR", "4"], ["Arnold  L. 'Arnie'  Roblan", "46654", "Democratic", "OR", "5"], ["Lee  L.  Beyer", "2987", "Democratic", "OR", "6"], ["James  I.  Manning\n                  Jr.", "168035", "Democratic", "OR", "7"], ["Sara  A.  Gelser Blouin", "46496", "Democratic", "OR", "8"], ["Jackie  F.  Winters", "10832", "Republican", "OR", "10"], ["Peter  C.  Courtney", "2985", "Democratic", "OR", "11"], ["Mark  D.  Hass", "46683", "Democratic", "OR", "14"], ["Charles  D. 'Chuck'  Riley", "46500", "Democratic", "OR", "15"], ["Elizabeth  K. 'Betsy'  Johnson", "46663", "Democratic", "OR", "16"], ["Elizabeth  Steiner Hayward", "135217", "Democratic", "OR", "17"], ["Ginny  Burdick", "10706", "Democratic", "OR", "18"], ["Robert 'Rob'  Wagner", "178216", "Democratic", "OR", "19"], ["Alan  Randal  Olsen", "119272", "Republican", "OR", "20"], ["Kathleen  Taylor", "150928", "Democratic", "OR", "21"], ["Lew  Frederick", "116854", "Democratic", "OR", "22"], ["Michael  E.  Dembrow", "103193", "Democratic", "OR", "23"], ["Shemia  P.  Fagan", "135209", "Democratic", "OR", "24"], ["Laurie  Monnes Anderson", "23811", "Democratic", "OR", "25"], ["Tim  Knopp", "23696", "Republican", "OR", "27"], ["William  S. 'Bill'  Hansell", "96436", "Republican", "OR", "29"]], "Did Not Vote": [["Cliff  Bentz", "102400", "Republican", "OR", "30"]], "NA": []}, "synopsis": "Vote to pass a bill that prohibits single-use plastic straws at restaurants unless asked for one directly.", "link": "https://justfacts.votesmart.org/bill/26297/66891/prohibits-single-use-plastic-straws-at-restaurants-unless-asked-for", "name": "SB 90 - Prohibits Single-Use Plastic Straws at Restaurants Unless Asked For - Oregon Key Vote", "pg": "Highlights: Prohibits a food and beverage provider or convenience store from providing single-use plastic straw to a consumer unless the consumer specifically requests the single-use plastic straw (Sec. 1). Authorizes a consumer to request, and food and beverage provider or a convenience store to offer to the consumer, a single-use plastic straw in an area of the food service provider’s or convenience store’s premises in which the consumer can receive a delivery of prepared food or beverage while seated in or on a vehicle (Sec. 1). Exempts a convenience store that does the following from the prohibition in this act (Sec. 1): Sells or offers single-use plastic straws for sale in bulk or unconnected with a sale or provision of food or a beverage; or Makes single-use plastic straws available to consumers in an unattended location, provided that the convenience store leaves the single-use plastic straws in an unattended location only if the convenience store does not have space in which to store the single-use plastic straws in a location where employees of the convenience store provide service to consumers. Specifies that a food and beverage provider or convenience store found in violation of this bill will be issued a notice for first and second violations, and will be fined no more than $25 for each day in which the food and beverage provider or convenience store remains in violation, for third and subsequent violations (Sec. 1). Authorizes an enforcement officer to enforce this bill in the course conducting an inspection (Sec. 1). Prohibits the enforcement officer from imposing fines of more than $300 during a calendar year for a food and beverage provider’s or convenience store’s violation (Sec. 1). Prohibits a local government or municipality from enacting an ordinance, resolution, regulation, rule or other law with requirements that differ from the provision in this act (Sec. 2). Specifies this act becomes operative on January 1, 2020 (Sec. 3)."}