{"votes": {"No": [["Dallas  L.  Heard", "150832", "Republican", "OR", "1"], ["Herman  Baertschiger\n                  Jr.", "136768", "Republican", "OR", "2"], ["Denyc  Nicole  Boles", "155851", "Republican", "OR", "10"], ["Brian  J.  Boquist", "46475", "Republican", "OR", "12"], ["Kim  Thatcher", "46657", "Republican", "OR", "13"], ["Elizabeth  K. 'Betsy'  Johnson", "46663", "Democratic", "OR", "16"], ["Alan  Randal  Olsen", "119272", "Republican", "OR", "20"], ["Charles  William 'Chuck'  Thomsen", "119275", "Republican", "OR", "26"], ["Tim  Knopp", "23696", "Republican", "OR", "27"], ["William  S. 'Bill'  Hansell", "96436", "Republican", "OR", "29"], ["Cliff  Bentz", "102400", "Republican", "OR", "30"]], "Yes": [["Jeffrey  S. 'Jeff'  Golden", "179932", "Democratic", "OR", "3"], ["Floyd  F.  Prozanski\n                  Jr.", "3024", "Democratic", "OR", "4"], ["Arnold  L. 'Arnie'  Roblan", "46654", "Democratic", "OR", "5"], ["Lee  L.  Beyer", "2987", "Democratic", "OR", "6"], ["James  I.  Manning\n                  Jr.", "168035", "Democratic", "OR", "7"], ["Sara  A.  Gelser Blouin", "46496", "Democratic", "OR", "8"], ["Peter  C.  Courtney", "2985", "Democratic", "OR", "11"], ["Mark  D.  Hass", "46683", "Democratic", "OR", "14"], ["Charles  D. 'Chuck'  Riley", "46500", "Democratic", "OR", "15"], ["Elizabeth  Steiner Hayward", "135217", "Democratic", "OR", "17"], ["Ginny  Burdick", "10706", "Democratic", "OR", "18"], ["Robert 'Rob'  Wagner", "178216", "Democratic", "OR", "19"], ["Kathleen  Taylor", "150928", "Democratic", "OR", "21"], ["Lew  Frederick", "116854", "Democratic", "OR", "22"], ["Michael  E.  Dembrow", "103193", "Democratic", "OR", "23"], ["Shemia  P.  Fagan", "135209", "Democratic", "OR", "24"], ["Laurie  Monnes Anderson", "23811", "Democratic", "OR", "25"]], "Did Not Vote": [["Fred  Frank  Girod", "69243", "Republican", "OR", "9"], ["Dennis  B.  Linthicum", "132916", "Republican", "OR", "28"]], "NA": []}, "synopsis": "Vote to pass a bill that reduces the number of certain diesel trucks allowed in Multnomah, Clackamas and Washington Counties.", "link": "https://justfacts.votesmart.org/bill/26771/68276/reduces-number-of-diesel-trucks-allowed-in-specified-counties", "name": "HB 2007 - Reduces Number of Diesel Trucks Allowed in Specified Counties - Oregon Key Vote", "pg": "Highlights: Prohibits the Department of Transportation from issuing certificates of title for medium-duty trucks powered by a diesel engine from 2009 or older, or heavy-duty trucks powered by a diesel engine from 2006 or older, to owners located in Multnomah, Clackamas or Washington Counties, on or after January 1, 2025 (Sec. 4). Prohibits the department from issuing registration, including renewal of registration, to owners in Multnomah, Clackamas or Washington Counties, on or after January 1, 2023 for medium-duty trucks powered by a diesel engine from 1996 or older, and on January 1, 2029 for heavy-duty trucks powered by a diesel engine from 2009 or older if owned by a public body, or from 2006 or older if owned by an individual other than a public body (Sec. 4). Authorizes the department to issue certificates of title, issue registration, or issue renewal of registration for vehicles powered by diesel engines that have been retrofitted with approved retrofit technology and proof of certification of the retrofit has been issued under this act (Sec. 4). Exempts the following vehicles from these requirements (Sec. 4): Motor vehicles registered as farm vehicles; Farm tractors; Implements of husbandry; Motor vehicles used only as training vehicles; Publicly and privately owned emergency vehicles; Ambulances; Campers; Motor homes; Recreational vehicles; Heavy-duty trucks operated for 5,000 miles or fewer on Oregonian highways during one calendar year; Carriers with a fleet size of five or fewer heavy-duty trucks; Antique vehicles; and Motor trucks used primarily to transport logs. Defines “heavy-duty truck” as a motor vehicle or combination of vehicles operated as a unit that has a [combined weight] gross vehicle weight rating that is greater than 26,000 pounds (Sec. 1). Defines “retrofit” as equipping a diesel engine with new emissions-reducing parts or technology after the manufacture of the original engine, or converting the diesel engine into an engine capable of being powered by alternative fuel (Sec. 1). Requires any money left over from the Clean Diesel Engine Fund to be expended by the Department of Environmental Quality for grants that help reduce emissions from diesel engines and or reduce diesel particulate matter emissions from diesel engines (Sec. 2). Specifies that preference for these grants will be given to disadvantaged business enterprises, minority-owned businesses, women-owned businesses, businesses that a service-disabled veteran owns, or an emerging small business (Sec. 2). Specifies that preference will also be given to benefit owners and operators of heavy-duty trucks, if the fleet of the owner or operator has only one heavy duty truck and this truck is registered in Multnomah, Clackamas or Washington County (Sec. 2). Establishes the Supporting Businesses in Reducing Diesel Emissions Task Force (Sec. 19). Establishes the declaration of an emergency, through which this act helps in the immediate preservation of the public, peace, health, and safety (Sec. 25)."}