{"votes": {"No": [["Donald  F. 'Don'  Humason\n                  Jr.", "35895", "Republican", "MA", "Second Hampden and Hampshire"], ["Robert  L. 'Bob'  Hedlund\n                  Jr.", "4739", "Republican", "MA", "Plymouth and Norfolk"], ["Richard  T. 'Dick'  Moore", "13596", "Democratic", "MA", "Worcester and Norfolk"]], "Yes": [["Benjamin  Brackett  Downing", "66074", "Democratic", "MA", "Berkshire, Hampshire, Franklin and Hampden"], ["James  E. 'Jim'  Timilty", "18909", "Democratic", "MA", "Bristol and Norfolk"], ["Michael  J.  Rodrigues", "4834", "Democratic", "MA", "First Bristol and Plymouth"], ["Mark  C.  Montigny", "4749", "Democratic", "MA", "Second Bristol and Plymouth"], ["Daniel  A. 'Dan'  Wolf", "125310", "Democratic", "MA", "Cape and Islands"], ["Kathleen  A.  O'Connor-Ives", "141568", "Democratic", "MA", "First Essex"], ["Joan  B.  Lovely", "35974", "Democratic", "MA", "Second Essex"], ["Thomas  M.  McGee", "4850", "Democratic", "MA", "Third Essex"], ["Bruce  E.  Tarr", "4759", "Republican", "MA", "First Essex and Middlesex"], ["Barry  R.  Finegold", "13653", "Democratic", "MA", "Second Essex and Middlesex"], ["James  T. 'Jim'  Welch", "36030", "Democratic", "MA", "Hampden"], ["Gale  D.  Candaras", "15108", "Democratic", "MA", "First Hampden and Hampshire"], ["Stanley  C. 'Stan'  Rosenberg", "4757", "Democratic", "MA", "Hampshire, Franklin and Worcester"], ["Eileen  M.  Donoghue", "125316", "Democratic", "MA", "First Middlesex"], ["Patricia  D. 'Pat'  Jehlen", "4820", "Democratic", "MA", "Second Middlesex"], ["Michael  J. 'Mike'  Barrett", "141572", "Democratic", "MA", "Third Middlesex"], ["Kenneth  J.  Donnelly", "109507", "Democratic", "MA", "Fourth Middlesex"], ["Jason  M.  Lewis", "109548", "Democratic", "MA", "Fifth Middlesex"], ["Cynthia Stone 'Cindy'  Creem", "18877", "Democratic", "MA", "First Middlesex and Norfolk"], ["Karen  E.  Spilka", "35683", "Democratic", "MA", "Second Middlesex and Norfolk"], ["Sal  N.  DiDomenico", "75393", "Democratic", "MA", "Middlesex and Suffolk"], ["James  B. 'Jamie'  Eldridge", "36072", "Democratic", "MA", "Middlesex and Worcester"], ["John  F.  Keenan", "78257", "Democratic", "MA", "Norfolk and Plymouth"], ["Michael  F. 'Mike'  Rush", "35666", "Democratic", "MA", "Norfolk and Suffolk"], ["Richard  J.  Ross", "36049", "Republican", "MA", "Norfolk, Bristol and Middlesex"], ["Brian  A.  Joyce", "13678", "Democratic", "MA", "Norfolk, Bristol and Plymouth"], ["Therese  Murray", "4751", "Democratic", "MA", "Plymouth and Barnstable"], ["Marc  R.  Pacheco", "4754", "Democratic", "MA", "First Plymouth and Bristol"], ["Thomas  P.  Kennedy", "4825", "Democratic", "MA", "Second Plymouth and Bristol"], ["Linda  Dorcena  Forry", "35873", "Democratic", "MA", "First Suffolk"], ["Sonia  Rosa  Chang-Diaz", "109511", "Democratic", "MA", "Second Suffolk"], ["Anthony  W.  Petruccelli", "1965", "Democratic", "MA", "First Suffolk and Middlesex"], ["William  N. 'Will'  Brownsberger", "66893", "Democratic", "MA", "Second Suffolk and Middlesex"], ["Harriette  L.  Chandler", "4778", "Democratic", "MA", "First Worcester"], ["Michael  O. 'Mike'  Moore", "109518", "Democratic", "MA", "Second Worcester"], ["Jennifer  L. 'Jen'  Flanagan", "35829", "Democratic", "MA", "Worcester and Middlesex"], ["Stephen  M. 'Steve'  Brewer", "4768", "Democratic", "MA", "Worcester, Hampden, Hampshire and Middlesex"]], "Did Not Vote": [], "NA": []}, "synopsis": "Vote to adopt a conference report that amends firearm and school safety laws.", "link": "https://justfacts.votesmart.org/bill/18736/50009/amends-firearm-laws", "name": "H 4278 - Amends Firearm Laws - Massachusetts Key Vote", "pg": "Highlights: Authorizes the licensing authority of a firearm identification card to petition the court to deny or revoke an individual’s application for, renewal of, or currently held firearm identification card due to the individual’s “unsuitability” (Sec. 30). Requires the court to determine within 15 days of the petition whether there is sufficient evidence to support the licensing authority’s claim that an individual is unsuitable (Sec. 30). Requires the court to hold a hearing within 90 days of the petition to determine the unsuitability of the individual named in the petition (Sec. 30). Requires the determination of unsuitability to be based on a “preponderance” of evidence suggesting that the individual could create a risk to public safety (Sec. 30). Requires the Department of Criminal Justice Information Services to transmit all federally required information to the National Instant Criminal Background Check System for the purpose of conducting background checks for firearms sales or licensing (Secs. 1, 16, 72, 73 & 76). Authorizes an individual who was committed to a hospital or institution for mental illness, alcohol abuse, or substance abuse to petition the court 5 years after the date of commitment in order to restore the individual’s right to possess a firearm (Secs. 15 & 17). Requires an individual who is selling or transferring a firearm to use a web-based portal established by the Department of Criminal Justice Information Services for certain purposes, including, but not limited to, the following purposes (Sec. 29): To verify the identities of the individuals involved in the sale or transfer; To determine whether or not the transaction is allowed under law; and To display a sale authorization, if one is granted. Authorizes the colonel of the state police to establish a criminal firearms and trafficking unit within the state police to assist in investigating and prosecuting all state firearm crimes (Sec. 5). Requires school districts to develop and implement a “Safe and Supportive School Framework,” which provides guidance and support to create safe and supportive schools using certain operations, including, but not limited to, the following operations (Sec. 6): Providing access to behavioral health services including prevention, intervention, screening, and treatment; Providing academic and non-academic support to maximize time spent in the classroom and to minimize suspensions, expulsions, and other removals; and Providing collaboration with families. Requires school officials to review the school’s emergency response sequence with local fire and police officials at least once a year (Sec. 7). Requires a school district to develop and implement a plan to address the general mental health needs of its students and the potential need for emergency treatment as a result of a tragedy or crisis in the school or district (Sec. 11). Requires the regional chief of police to appoint at least 1 school resource officer to each school district who will provide law enforcement and security services to elementary and secondary public schools (Sec. 11). Requires a school to have a 2-way communication device to be used solely for communicating with local fire and police departments during an emergency (Sec. 11). Requires a school to provide at least 2 hours of suicide awareness and prevention training every 3 years to all licensed school personnel (Sec. 12). Requires the Department of Public Health to collect, record, and analyze data on all suicides in the state (Sec. 13). Increases the minimum fines and sentences for certain firearm-based crimes including, but not limited to, the unauthorized sale or transfer of firearms (Secs. 77-97). In Massachusetts, a new bill number is assigned when a new version of the bill is drafted. The bill number was changed to H 4376 for the House & Senate Conference Report stages."}