{"votes": {"No": [["Lisa  A.  Murkowski", "15841", "Republican", "AK", "Sr"], ["Daniel  S. 'Dan'  Sullivan", "114964", "Republican", "AK", "Jr"], ["Richard  C.  Shelby", "53266", "Republican", "AL", "Sr"], ["Tommy  Tuberville", "188306", "Republican", "AL", "Jr"], ["John  N.  Boozman", "27958", "Republican", "AR", "Sr"], ["Thomas 'Tom'  Cotton", "135651", "Republican", "AR", "Jr"], ["Marco  Rubio", "1601", "Republican", "FL", "Sr"], ["Richard  Lynn 'Rick'  Scott", "124204", "Republican", "FL", "Jr"], ["Charles  E. 'Chuck'  Grassley", "53293", "Republican", "IA", "Sr"], ["Joni  K.  Ernst", "128583", "Republican", "IA", "Jr"], ["Michael  D. 'Mike'  Crapo", "26830", "Republican", "ID", "Sr"], ["James  E. 'Jim'  Risch", "2919", "Republican", "ID", "Jr"], ["Todd  C.  Young", "120345", "Republican", "IN", "Sr"], ["Michael 'Mike'  Braun", "148564", "Republican", "IN", "Jr"], ["Gerald  W. 'Jerry'  Moran", "542", "Republican", "KS", "Sr"], ["Roger  Wayne  Marshall", "172080", "Republican", "KS", "Jr"], ["Addison  Mitchell 'Mitch'  McConnell\n                  Jr.", "53298", "Republican", "KY", "Sr"], ["Rand  Paul", "117285", "Republican", "KY", "Jr"], ["William 'Bill'  Cassidy", "69494", "Republican", "LA", "Sr"], ["John  Neely  Kennedy", "35496", "Republican", "LA", "Jr"], ["Susan  Margaret  Collins", "379", "Republican", "ME", "Sr"], ["Roy  Blunt", "418", "Republican", "MO", "Sr"], ["Joshua  David 'Josh'  Hawley", "169716", "Republican", "MO", "Jr"], ["Roger  F.  Wicker", "21926", "Republican", "MS", "Sr"], ["Cindy  Hyde-Smith", "20784", "Republican", "MS", "Jr"], ["Steve  Daines", "135720", "Republican", "MT", "Jr"], ["Richard  M.  Burr", "21787", "Republican", "NC", "Sr"], ["Thomas  Roland 'Thom'  Tillis", "57717", "Republican", "NC", "Jr"], ["John  H.  Hoeven", "41788", "Republican", "ND", "Sr"], ["Kevin  Cramer", "444", "Republican", "ND", "Jr"], ["Debra 'Deb'  Fischer", "41963", "Republican", "NE", "Sr"], ["Ben  Sasse", "150182", "Republican", "NE", "Jr"], ["Robert  J. 'Rob'  Portman", "27008", "Republican", "OH", "Jr"], ["James  Mountain 'Jim'  Inhofe", "27027", "Republican", "OK", "Sr"], ["James  Lankford", "124938", "Republican", "OK", "Jr"], ["Patrick  J. 'Pat'  Toomey", "24096", "Republican", "PA", "Jr"], ["Lindsey  O.  Graham", "21992", "Republican", "SC", "Sr"], ["Timothy  E. 'Tim'  Scott", "11940", "Republican", "SC", "Jr"], ["John  R.  Thune", "398", "Republican", "SD", "Sr"], ["Marion  Michael 'Mike'  Rounds", "7455", "Republican", "SD", "Jr"], ["Marsha  Blackburn", "25186", "Republican", "TN", "Sr"], ["Bill  Hagerty", "128466", "Republican", "TN", "Jr"], ["John  Cornyn", "15375", "Republican", "TX", "Sr"], ["Rafael  Edward 'Ted'  Cruz", "135705", "Republican", "TX", "Jr"], ["Michael 'Mike'  Lee", "66395", "Republican", "UT", "Sr"], ["Willard  Mitt  Romney", "21942", "Republican", "UT", "Jr"], ["Ronald  H. 'Ron'  Johnson", "126217", "Republican", "WI", "Sr"], ["Shelley  Moore  Capito", "11701", "Republican", "WV", "Jr"], ["John  Barrasso", "52662", "Republican", "WY", "Sr"], ["Cynthia  M.  Lummis", "15546", "Republican", "WY", "Jr"]], "Yes": [["Kyrsten  Sinema", "28338", "Democratic", "AZ", "Sr"], ["Mark  Kelly", "190594", "Democratic", "AZ", "Jr"], ["Dianne  Feinstein", "53273", "Democratic", "CA", "Sr"], ["Alex  Padilla", "59742", "Democratic", "CA", "Jr"], ["Michael  Farrand  Bennet", "110942", "Democratic", "CO", "Sr"], ["John  Wright  Hickenlooper", "71547", "Democratic", "CO", "Jr"], ["Richard 'Dick'  Blumenthal", "1568", "Democratic", "CT", "Sr"], ["Christopher  S. 'Chris'  Murphy", "17189", "Democratic", "CT", "Jr"], ["Thomas  Richard 'Tom'  Carper", "22421", "Democratic", "DE", "Sr"], ["Christopher  A. 'Chris'  Coons", "122834", "Democratic", "DE", "Jr"], ["Jon  Ossoff", "176134", "Democratic", "GA", "Sr"], ["Raphael  Gamaliel  Warnock", "189794", "Democratic", "GA", "Jr"], ["Brian  Emmaneul  Schatz", "17852", "Democratic", "HI", "Sr"], ["Mazie  K.  Hirono", "1677", "Democratic", "HI", "Jr"], ["Richard  J. 'Dick'  Durbin", "26847", "Democratic", "IL", "Sr"], ["Tammy  Duckworth", "57442", "Democratic", "IL", "Jr"], ["Elizabeth  Ann  Warren", "141272", "Democratic", "MA", "Sr"], ["Edward  J. 'Ed'  Markey", "26900", "Democratic", "MA", "Jr"], ["Benjamin  L. 'Ben'  Cardin", "26888", "Democratic", "MD", "Sr"], ["Christopher 'Chris'  Van Hollen\n                  Jr.", "6098", "Democratic", "MD", "Jr"], ["Angus  S.  King\n                  Jr.", "22381", "Independent", "ME", "Jr"], ["Deborah  Ann 'Debbie'  Stabenow", "515", "Democratic", "MI", "Sr"], ["Gary  C.  Peters", "8749", "Democratic", "MI", "Jr"], ["Amy  Jean  Klobuchar", "65092", "Democratic", "MN", "Sr"], ["Tina  Smith", "152968", "Democratic", "MN", "Jr"], ["Jon  Tester", "20928", "Democratic", "MT", "Sr"], ["Kamala  Devi  Harris", "120012", "Democratic", "NA", ""], ["Jeanne  Shaheen", "1663", "Democratic", "NH", "Sr"], ["Margaret  Wood 'Maggie'  Hassan", "42552", "Democratic", "NH", "Jr"], ["Robert 'Bob'  Menendez", "26961", "Democratic", "NJ", "Sr"], ["Cory  A.  Booker", "76151", "Democratic", "NJ", "Jr"], ["Ben  Ray  Lujan\n                  Jr.", "102842", "Democratic", "NM", "Sr"], ["Martin  Trevor  Heinrich", "74517", "Democratic", "NM", "Jr"], ["Catherine  Cortez Masto", "69579", "Democratic", "NV", "Sr"], ["Jacklyn  S. 'Jacky'  Rosen", "169471", "Democratic", "NV", "Jr"], ["Charles  Ellis 'Chuck'  Schumer", "26976", "Democratic", "NY", "Sr"], ["Kirsten  E.  Gillibrand", "65147", "Democratic", "NY", "Jr"], ["Sherrod  C.  Brown", "27018", "Democratic", "OH", "Sr"], ["Ron  Wyden", "27036", "Democratic", "OR", "Sr"], ["Jeffrey  A. 'Jeff'  Merkley", "23644", "Democratic", "OR", "Jr"], ["Robert  P. 'Bob'  Casey\n                  Jr.", "2541", "Democratic", "PA", "Sr"], ["John  Francis 'Jack'  Reed", "27060", "Democratic", "RI", "Sr"], ["Sheldon  Whitehouse", "2572", "Democratic", "RI", "Jr"], ["Mark  R.  Warner", "535", "Democratic", "VA", "Sr"], ["Timothy  Michael 'Tim'  Kaine", "50772", "Democratic", "VA", "Jr"], ["Patrick  J.  Leahy", "53353", "Democratic", "VT", "Sr"], ["Bernard 'Bernie'  Sanders", "27110", "Independent", "VT", "Jr"], ["Patricia 'Patty'  Murray", "53358", "Democratic", "WA", "Sr"], ["Maria  Cantwell", "27122", "Democratic", "WA", "Jr"], ["Tammy  Baldwin", "3470", "Democratic", "WI", "Jr"], ["Joseph 'Joe'  Manchin\n                  III", "7547", "Democratic", "WV", "Sr"]], "Did Not Vote": [], "NA": []}, "synopsis": "Vote to pass a bill that appropriates over $740 billion in funds for a down payment on deficit reduction to fight inflation; invest in domestic energy production and manufacturing; reduce carbon emissions by roughly 40 percent by 2030; and authorize Medicare to negotiate for prescription drug prices and extend the expanded Affordable Care Act program for 3 years, through 2025.", "link": "https://justfacts.votesmart.org/bill/31958/87519/inflation-reduction-act-of-2022", "name": "HR 5376 - Inflation Reduction Act of 2022 - National Key Vote", "pg": "Highlights: Authorizes an alternative minimum tax of 15 percent of the average annual adjusted financial statement income of domestic corporations (excluding Subchapter S corporations, regulated investment companies, and real estate investment trusts, that exceed $1 billion over a specified 3-year period, effective beginning December 31, 2022 (Title I, Subtitle A, Part 1). Authorizes a one percent excise tax on the fair market value of stock repurchased by a domestic corporation after 2022, with certain exceptions (Title I, Subtitle A, Part 2). Appropriates additional funding for the IRS for taxpayer services and enforcement, including the development of a free direct e-file tax return system, and provides additional funding for the Department of Treasury Inspector General for Tax Adminstration, the Office of Tax Policy, the Tax Court, and Treasury departmental offices (Title I, Subtitle A, Part 3). Requires the Centers for Medicare and Medicaid Services (CMS) to negotiate the prices of certain prescription drugs under Medicare beginning in 2026 (Title I, Subtitle B, Part 1). Requires CMS negotiate maximum prices for brand-name drugs that do not have other generic equivalents and that account for the greatest Medicare spending, and establishes drug manufacturers that fail to comply with negotiation requirements are subject to civil penalties and excise taxes. specifically the CMS must negotiate the prices of (Title I, Subtile B, Part 2): 10 drugs in 2026; 15 drugs in 2027 and 2028; and 20 drugs in 2029 and each year thereafter. Requires drug manufactures issue rebates to the CMS for brand-name drugs without generic equivalents under Medicare that cost $100 or more per year per individual and for which prices increase faster than inflation, and specifies that manufacturers that fail to comply shall be subject to civil penalties (Title I, Subtile B, Part 2). Repeals the beneficiary cost-sharing above the annual out-of-pocket spending threshold under the Medicare prescription drug benefit beginning in 2024 and caps the annual out-of-pocket spending at $25,000 in 2025, with annual adjustments thereafter (Title I, Subtitle B, Part 3). Establishes a program under which drug manufactureres provide discounts to beneficiaries who have incurred costs above the annual deductible beginning in 2025 (Title I, Subtitle B, Part 3). Establishes a process through which certain beneficiaries may have their monthly out-of-pocket costs capped and paid in monthly installments beginning in 2025, and appropriates funds for FY2023 for the CMS to implement this process (Title I, Subtitle B, Part 3). Prohibits the implementation of a Department of health and Human services rule relating to the treatment of certain Medicare prescription drug benefit rebates from drug manufactureres for purposes of federal anti-kickback laws (Title I, Subtitle B, Part 4). Establishes a series of additional programs and requirements relating to coverage under the Medicare prescription drug benefit, including elimiating the cost-sharing under the aforementioned drug benefit for adult vaccines that are reccommended by the Advisory Committee on Immunization Practices, and requires coverage, without cost-sharing, of such vaccines under Medicaid and the CHIP (Title I, Subtitle B, Part 5). Establishes a cost-sharing cap under the Meicare prescription drug benefit for a months supply of covered insuline products at $35 for 2023 through 2025, and in 2026, $35, 25 percent of the governments negotiated price, or 25 percent of the plans negotiated price, whichever is less (Title I, Subtitle B, Part 5). Extends through 2025 certain adjustments and expansions of the premium tax credit, including to allow taxpayers with income above 400 percent of the federal poverty line to qualify for the credit (Title I, Subtitle C). Extends and modifies tax credits through 2024 for (Title I, Subtitle D): Producing electricity from renewable resources, specifically for wind, biomass, geothermal and solar, landfill gas, trash, qualified hydropower, and marine and hydrokinetic resources; For investment in certain energy properties (solar, fuel cells, waste energy recovery, combined heat and power, small wind property, and microturbine property); and For alternative fuels and fuel mixtures, and biodiesel and renewable diesel. Establishes new tax credits for the following, including (Title I, Subtitle D): Qualifying zero-emission nuclear power produced and sold after 2023; The sale or mixture of sustainable aviation fuel beginning in 2023; The production of clean hydrogen; The production of clean electricity and for investment in zero-emissions of electricity generation facilities or energy storage technoly; Domestic clean fuel production beginning in 2025; and The domestic production and sale of qualifying solar and wind components. Amends and extends through 2032 the tax credit for nonbusiness energy property and increases its rate to 30 percent, with certain limitation, the new energy efficient home credit, and the tax credit for alternate fuel refueling property expenditures (Title I, Subtitle D). Amends requirements for the tax deduction for energy efficient commercial buildings, establishes new credit for commercial clean vehicles, and modifies the refundable tax credit for the purchase of plug-in electric vehicles and previously-owned electric vehicles (Title I, Subtitle D). Authorizes the permanent reinstatement of the Hazardous Substance Superfund financing rate for certain excise taxes, including the excise tax on domestic crude oil and imported petroleum products at a rate of 16.4 cents per barrel in 2023 (Title I, Subtitle D). Increases the permanent rate of the coal excise tax for funding the Black Lung Disability Trust Fund and increases teh amount of the research tax credit that may be applied against the payroll tax liabilities of certain small businesses (Title I, Subtitle D). Authorizes the reinstatement of the current suspension of the tax deduction for state and local taxes and extends the limitation on excess business losses of noncorprorate taxpayers until 2025 (Title I, Subtitle D). Appropriates funds for the Department of Agriculture (USDA) for a variety of programs related to conservation and renewable energy (Title II, Subtitle A). Appropriates funds for the USDA for voluntary conservation programs, such as the environmental quality incentives program, the conservation stewardship program, the agricultural conservation easement program, and the regional conservation partnership program (Title II, Subtile B). Appropriates funds for the USDA’s Natural Resources Conservation Service for conservation technical assistance, and a program to quantify carbon sequestration and carbon dioxide, methane, and nitrous oxide emissions (Title II, Subtitle B). Establishes the Rural Developemnt and Agricultural Credit and appropriates additional funding to the USDA for several programs such as the Rural Energy for America Program that support the generation, storage, and use of renewable energy in rural communities (Title II, Subtitle C). Appropriates additional funding to the USDA for the National Forest System, including the forest restoration, wildfire prevention, and related activities, and provides further funding to the USDA for programs that award grants to owners of state or private forests for climate mitigation, forest resilience, or related activities (Title II, Subtitle D). Appropriates additional funding for the President to carry out activities under the Defense Production Act of 1950 in order to provide essential materials and goods for the national defense (Title III). Appropriates funding to the Department of Housing and Urban Development for loans and grants to fund projects that address affordable housing and climate change issues, such as projects designed to increase the energy or water efficiency of affordable housing (Title III). Appropriates additional funding for coastal communities, coastal and marine habitats, weather forecasting, and aviation technology for example, funding for (Title IV): Coastal communities so they can prepare for extreme storms and other changing climate conditions; NOAA facilities (fisheries, laboratories, and national marine sanctuaries facilities); Weather research and focasting innovations; and Acquiring a hurrican hunter aircraft. Appropriates funding to the Department of Transportation for a program that awards grants for projects that produce, transport, blend, or store sustainable aviation fuel, or develop, demonstrate, or apply low-emission aviation technologies (Title IV). Appropriates funding to the Department of Energy (DOE) for a variety of programs concerning energy rebates, energy efficiency buildings, electric transmissions, advanced industrial facilities, and other energy matters (Title V, Subtitle A, Part I). Approprites funding to the DOE for a HOMES rebate program that awards grants to state energy offices, and requires states provide rebates to homeowners and aggregators for certain whole-house energy saving retrofits amde for low- and moderate-income households (Title V, Subtitle A, Part 2). Appropraites additional funding to the DOE for a high-efficiency electric home rebate program that awards grants to state energy offices and Indian tribes, and requires rebates under the program be given for qualified electrification projects for low- or moderate-income households (Title V, Subtitle A, Part 2). Apprporiates funding to the DOE for grants to states and local governments to adopt and implement building vodes for residential buildings that meet or exceed the 2021 International Energy Conservation Code (Title V, Subtitle A, Part 3). Appropriates funding to support financing of energy infrastructure projects including projects to replace nonoperational energy infrastructure or reduce emissions of energy infrastructure, and for specified DOE loan programs, including (Title V, Subtile A, Part 4): Certain loans issued under the Energy Policy Act of 2005; Loans for facilities that manufacture advanced vehicles that emit either a low or no amount of greenhouse gas emissions; and Loans for the domestic production of efficient hybrid, plug-in electric hybrid, plug-in electric drive, and hydrogen fuel cell electric vehicles. Appropriates funding to the DOE for a program that provides loans for the construction or modification of electric transmission facilities that are located within a national interest electric transmission corridor and authorizes the DOE to make grants to facilitate the siting of interstate electricity transmission lines and for the interregional and offshore wind electricity transmission planning, modeling and analysis (Title V, Subtitle A, Part 5). Appropriates funding the the DOE Office of Clean Energy Demonstrations to carry out the advances industrial facilities deployment program, specifically accelerating the reduction and elimination of greenhouse gas emissions at industrial facilities (Title V, Subtitle A, Part 6). Appropriates funding for other energy matters, including infrastructure projects for DOE’s national laboratories and efforts to increase the availability of of high-assay low-enriched uranium which is used in advanced nuclear reactors (Title V, Subtitle A, Part 7). Appropriates funding for natural resources, water supplies, the Office of Insular Affairs, leases to develop energy on federal lands, and other related issues (Title V, Subtitle B, Part 1). Appropriates funding to the NPS to hire more employees to cary our priority deferred maintenance projects and to the Department of interior to carry out projects for (Title V, Subtitle B, Part 2): The conservation, protection, and resiliency of lands and resources administered by the National Park Service (NPS) and the Bureau of Land Management (BLM); and Conservation and ecosystem and habitat restoration projects on lands administered by the NPS and the BLM. Appropriates funding to the BLM for water supply projects, projects to cover water conveyance facilities with solar panels, and drought mitigation in the western states (Title V, Subtitle B, Part 3). Appropriates funding to the Interior’s Office of Insular Affairs to provide technical assistance for climate change planning, mitigation, adaption, and resilience to United States Insular Areas (Title V, Subtitle B, Part 4). Defines “United States Insular Areas” as American Somoa, Northern Mariana Islands, Guam, Puerto Rce, and the U.S. Virgin Islands (Title V, Subtitle B, Part 4). Authorizes the the Department of Interior to lease of federal land in the Outer Continental Shelf (OCS) for offshore wind development, specifically from sources other than oil and gas and in areas previously withdrawn from leasing (Title V, Subtitle B, Part 5). Expands the definition of the OCS to include land that is within the U.S. exclusive economic zone and adjacent to any territory of the United States and allows the Department of the Interior to conduct wind leasesales that are in such areas if the leases meet specified criteria (Title V, Subtitle B, Part 5). Amends several provisions related to oil and gas leasing on public lands, such as the following, including, but not limited to (Title V, Subtitle B, Part 6): Increasing the minimum royaly raates for oil and gas leases on federal lands as well as offshore land in the OCS; Increasing the rentalraates and minimum bidding standards for onshore oil and gas leases; Establishing a new fee that must be paid by any individual who nominates public land for such leasing; and Requiring royalties be paid for methan gas extracted from federal lands, including offshore land. Appropriates funding to the DOE, the Federal Energy Regulatory Commission, and Interior for environmental reviews, and for the United States Geological Survey to produce, collect, disseminate, and use 3D elevation data (Title V, Subtitle B-C, Part 7). Appropriates funding to the Environmental Protection Agency (EPA) to establish a greenhouse gas reduction fund and to support several programs that provide financial incentives to reduce greenhouse gas emissions and other air pollution emissions, for example (Title VI, Subtitle A): Replace eligible medium-duty vehicles (e.g., school buses) and heavy-duty vehicles (e.g., garbage trucks) with zero-emission vehicles; Purchase or install equipment and technology to reduce pollution at ports; Identify and reduce emissions from diesel engines; Monitor air pollution and greenhouse gases; Encourage states to adopt and implement greenhouse gas and zero-emission standards for mobile sources; and Reduce methane emissions from petroleum and natural gas systems. Appropriates funding to implement the renewable fuels programs and the American Innivation and Manufacturing Act and to the EPA for environmental and climate justice block grants that benefit disadvantaged communities (Title VI, Subtitle A-B). Appropriates funding to the United States Fish and Wildlife Service (USFWS) to develop and implement plans for the conservation and survival of endangered and threatened species, specifically to rebuild and restore units of the National Wildlife Refuge System and state wildlife management areas by (Title VI, Subtitle C): Addressing the threat of invasive species; Increasing the resiliency and capacity of habitats and infrastructure to withstand weather events; and Reducing the amount of damage caused by weather events. Appropriates funding to the Council on Environmental Quality for the following, including (Title VI, Subtitle D): Collecting data related to environmental and climate issues; Tracking disproportionate burdens and cumulative impacts; and Supporting efforts to ensure that any mapping or screening tool is accessible to community-based organizations and community members. Appropriates funding to the Federal Highway Adminstration and to the General Services Administration to fund the neighborhood access and equity grant program. The environmental review of transportation projects, and grants for the use of low-carbon construction materials and products on federally funded transportation projects (Title VI, Subtitle E). Appropriates funding to the Federal Building Fund for (Title VI, Subtitle E): Converting and constructing federal facilities to high-performance green buildings; Acquiring and installing low-carbon materials and products in the construction of federal buildings; and Emerging and sustainable technologies as well as related sustainability and environmental programs. Appropriates funding for the oversight of this act, as well as a variety of environmental programs, such as funding for (Title VII): The Department of Homeland Security for implementing sustainability and environmental programs; The U.S. Postal Service for purchasing zero-emission delivery vehicles and installing related infrastructure; and The Federal Emergency Management Agency so it may provide assistance under the Robert T. Stafford Disaster Relief and Emergency Assistance Act for costs associated with low-carbon building materials as well as incentives that encourage low-carbon and net-zero energy projects. Appropriates funding to assist Indian tribes in addressing climate change, including funding to (Title VIII): The Bureau of Indian Affairs and the Office of Native Hawaiian Relations for climate resilience and adaptation programs; The Bureau of Indian Affairs for a tribal electrification program; and The BLM for providing emergency drought relief to Indian tribes located in the western United States.​​"}