{"status": "OK", "bill": {"bill_id": 1392388, "change_hash": "031a8d586f679adf87da56b5703ea3c0", "session_id": 1802, "session": {"session_id": 1802, "state_id": 14, "year_start": 2021, "year_end": 2021, "prefile": 0, "sine_die": 1, "prior": 1, "special": 0, "session_tag": "Regular Session", "session_title": "2021 Regular Session", "session_name": "2021 Regular Session"}, "url": "https://legiscan.com/IN/bill/SB0100/2021", "state_link": "http://iga.in.gov/legislative/2021/bills/senate/100/", "completed": 0, "status": 1, "status_date": "2021-01-05", "progress": [{"date": "2021-01-05", "event": 1}, {"date": "2021-01-05", "event": 9}], "state": "IN", "state_id": 14, "bill_number": "SB0100", "bill_type": "B", "bill_type_id": "1", "body": "S", "body_id": 38, "current_body": "S", "current_body_id": 38, "title": "Prevailing wage.", "description": "Prevailing wage. Requires that, whenever the actual costs for the construction of a public improvement are at least $150,000, a contractor or subcontractor shall pay the workers employed in the performance of work for the construction of the public improvement a rate of wages that is not less than the prevailing wage determined by the commissioner of the department of labor (commissioner). Requires that employer contributions for fringe benefits paid under a bona fide collective bargaining agreement be included in the prevailing wage determination unless a contractor or subcontractor is required by federal, state, or local law to provide the fringe benefit. Provides that a prevailing wage determination is conclusive for one year from the date of the determination unless the determination is superseded by a later determination. Requires that all prevailing wage determinations be publicly available. Requires that a contract or subcontract for the construction of a public improvement contain a provision stating that the contractor or subcontractor is required to pay a rate of wages that is not less than the prevailing wage, and that, if it is determined that a worker has been paid less than the prevailing wage, the public body may terminate the contract or part of the contract and continue the work with the public body's own work force or another contractor or subcontractor. Requires a contractor or subcontractor to make full payment of wages without any deductions, except for deductions required by federal or state law and deductions agreed to by the worker and approved by the contracting public body as fair and reasonable. Provides that, if a contractor or subcontractor fails to provide records requested by the commissioner concerning the payment of a prevailing wage, the commissioner may direct the fiscal or financial officer of the contracting public body to withhold from payment up to 25% of the contract amount and pay the workers directly any wages and fringe benefits due and payable. Requires the commissioner to distribute to all public bodies in the state a list of persons and firms that the commissioner has determined have not paid prevailing wages and prohibits a public body from awarding a contract or subcontract to a person or firm on the list for three years after the list is published. Provides mechanisms for the commissioner, workers, or an interested body to enforce violations of the prevailing wage law. Requires a contractor or subcontractor that fails to pay prevailing wages to pay as a civil penalty 75% of the difference between the prevailing wage rate and the wages paid to the workers. Deposits the civil penalties into a prevailing wage penalty enforcement fund to be used to pay expenses incurred by the commissioner in the administration and enforcement of the prevailing wage law. Prohibits a person from requesting or demanding all or a portion of a worker's wages in exchange for employment on the construction of a public improvement. Prohibits a public body from dividing the construction of a public improvement into two or more contracts to avoid paying the prevailing wage.", "pending_committee_id": 1329, "committee": {"committee_id": 1329, "chamber": "S", "chamber_id": 38, "name": "Pensions and Labor"}, "referrals": [{"date": "2021-01-05", "committee_id": 1329, "chamber": "S", "chamber_id": 38, "name": "Pensions and Labor"}], "history": [{"date": "2021-01-05", "action": "Authored by Senator Niezgodski", "chamber": "S", "chamber_id": 38, "importance": 0}, {"date": "2021-01-05", "action": "First reading: referred to Committee on Pensions and Labor", "chamber": "S", "chamber_id": 38, "importance": 1}], "sponsors": [{"people_id": 5489, "person_hash": "fpmu5pnb", "party_id": "1", "state_id": 14, "party": "D", "role_id": 1, "role": "Rep", "name": "David Niezgodski", "first_name": "David", "middle_name": "L.", "last_name": "Niezgodski", "suffix": "", "nickname": "", "district": "SD-010", "ftm_eid": 7320467, "votesmart_id": 57875, "opensecrets_id": "", "knowwho_pid": 249846, "ballotpedia": "David_Niezgodski", "sponsor_type_id": 1, "sponsor_order": 1, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}], "sasts": [], "subjects": [], "texts": [{"doc_id": 2226643, "date": "2021-01-04", "type": "Introduced", "type_id": 1, "mime": "application/pdf", "mime_id": 2, "url": "https://legiscan.com/IN/text/SB0100/id/2226643", "state_link": "http://iga.in.gov/static-documents/e/4/b/d/e4bd7ed7/SB0100.01.INTR.pdf", "text_size": 273997, "text_hash": "4d2df922dd78bee61fca4134838b5149"}], "votes": [], "amendments": [], "supplements": [{"supplement_id": 126927, "date": "2021-01-04", "type": "Fiscal Note", "type_id": 1, "title": "Fiscal Note", "description": "Fiscal Note #1: Introduced Senate Bill (S)", "mime": "application/pdf", "mime_id": 2, "url": "https://legiscan.com/IN/supplement/SB0100/id/126927", "state_link": "http://iga.in.gov/static-documents/c/4/1/4/c414e72c/SB0100.01.INTR.FN001.pdf", "supplement_size": 81713, "supplement_hash": "a57944b04836d5ce9cb33c025a67bf2f"}], "calendar": []}}