{"status": "OK", "bill": {"bill_id": 1464525, "change_hash": "f4e34ff7192455a053066052ce50d8b0", "session_id": 1823, "session": {"session_id": 1823, "state_id": 52, "year_start": 2021, "year_end": 2022, "prefile": 0, "sine_die": 0, "prior": 0, "special": 0, "session_tag": "Regular Session", "session_title": "2021-2022 Regular Session", "session_name": "117th Congress"}, "url": "https://legiscan.com/US/bill/HB1319/2021", "state_link": "https://www.congress.gov/bill/117th-congress/house-bill/1319/all-info", "completed": 1, "status": 4, "status_date": "2021-03-11", "progress": [{"date": "2021-02-24", "event": 1}, {"date": "2021-03-02", "event": 2}, {"date": "2021-03-10", "event": 3}, {"date": "2021-03-11", "event": 4}, {"date": "2021-03-11", "event": 8}, {"date": "2021-03-11", "event": 4}], "state": "US", "state_id": 52, "bill_number": "HB1319", "bill_type": "B", "bill_type_id": "1", "body": "H", "body_id": 114, "current_body": "H", "current_body_id": 114, "title": "American Rescue Plan Act of 2021 American Rescue Plan Act of 2021", "description": "Provides additional relief to address the continued impact of COVID-19 (i.e., coronavirus disease 2019) on the economy, public health, state and local governments, individuals, and businesses. TITLE I--COMMITTEE ON AGRICULTURE, NUTRITION, AND FORESTRY Subtitle A--Agriculture (Sec. 1001) This section provides funding for FY2021 to the Department of Agriculture (USDA) to (1) purchase food and agricultural commodities; (2) purchase and distribute agricultural commodities (including fresh produce, dairy, seafood, eggs, and meat) to individuals in need; (3) provide grants and loans for small or midsized food processors or distributors, seafood processing facilities and processing vessels, farmers markets, producers, or other organizations to respond to COVID-19; and (4) provide grants, loans, and other assistance to maintain and improve food and agricultural supply chain resiliency. The section also requires USDA to use specified amounts of the funding to (1) conduct animal surveillance and monitoring related to COVID-19; and (2) reduce overtime inspection costs borne by federally inspected small and very small meat, poultry, or egg processors. (Sec. 1002) This section provides funding for, and directs USDA to establish, an emergency pilot program to provide grants to certain applicants for rural health care and other rural development needs related to COVID-19. (Sec. 1003) This section provides funding for necessary administrative expenses associated with carrying out this subtitle. (Sec. 1004) This section provides funding through FY2022 to the Office of the Inspector General of USDA for audits, investigations, and other oversight activities of projects and activities related to the COVID-19 pandemic. (Sec. 1005) This section provides funding for USDA to pay off outstanding farm loan debts of socially disadvantaged farmers and ranchers. (Sec. 1006) This section provides funding for USDA to address historical discrimination and disparities in the agriculture sector. Specifically, USDA must use specified amounts to provide outreach, mediation, training, and assistance on issues concerning food, agriculture, agricultural credit, agricultural extension, rural development, or nutrition to certain socially disadvantaged groups, including socially disadvantaged farmers, ranchers, or forest landowners; provide grants and loans to improve land access for such groups; fund one or more equity commissions to address racial equity issues within USDA and its programs; support and supplement agricultural research, education, and extension, as well as scholarships and programs that provide internships and pathways to federal employment; and provide financial assistance to socially disadvantaged farmers, ranchers, or forest landowners who are former farm loan borrowers and suffered related adverse actions or past discrimination or bias in USDA programs. (Sec. 1007) This section provides funding through FY2022 to use the Commodity Credit Corporation to make commodities available and pay associated expenses for the Food for Peace program. Subtitle B--Nutrition (Sec. 1101) This section extends through FY2021 the requirement to calculate the value of benefits under the Supplemental Nutrition Assistance Program (SNAP, formerly known as the food stamp program) by using 115% of the June 2020 value of the thrifty food plan. It also provides funding through FY2023 for the costs of state administrative expenses and administering SNAP. (Sec. 1102) This section provides additional funding through FY2026 for USDA to (1) make technological improvements to improve online purchasing in SNAP; (2) modernize electronic benefit transfer technology; (3) support the mobile technologies demonstration projects and the use of mobile technologies; and (4) provide technical assistance to educate retailers on the process and technical requirements for the online acceptance of SNAP benefits, mobile payments, and electronic benefit transfer modernization initiatives. (Sec. 1103) This section provides additional funding through FY2027 for USDA to provide grants to the Commonwealth of the Northern Mariana Islands, Puerto Rico, and American Samoa for nutrition assistance. (Sec. 1104) This section provides funding through FY2022 to USDA for the Commodity Supplemental Food Program. (Sec. 1105) This section provides authority and funding for USDA to approve state requests to increase the amount of a cash-value voucher under the Special Supplemental Nutrition Program for Women, Infants, and Children (WIC) for a qualified food package to up to $35 for a four-month period during the COVID-19 public health emergency. Authority to increase the amount of a cash-value voucher shall terminate on September 30, 2021. (Cash-value vouchers are redeemable for fruits and vegetables as part of a WIC food package.) (Sec. 1106) This section provides funding for USDA to carry out outreach, innovation, and program modernization efforts to increase participation in and redemption of benefits under WIC, including through appropriate waivers and flexibilities. However, such waivers and flexibilities may not relate to the content of WIC food packages or nondiscrimination requirements. (Sec. 1107) This section directs USDA to reimburse institutions that are emergency shelters for meals and supplements provided under the Child and Adult Care Food Program during the COVID-19 public health emergency to individuals who have not attained the age of 25 and who are receiving assistance from such shelters. Under current law, emergency shelters may not receive reimbursement for meals and supplements provided to individuals who are older than age 18. (Sec. 1108) This section expands the Pandemic Electronic Benefit Transfer (P-EBT) program by authorizing it to be implemented during any school year in which there is a COVID-19 public health emergency designation in effect. It also allows the program to operate during the summer months. (The P-EBT program allows USDA to approve state plans to provide emergency nutrition benefits to households with children who would otherwise receive free or reduced-price school meals if their schools were not closed due to a public health emergency.) TITLE II--COMMITTEE ON HEALTH, EDUCATION, LABOR, AND PENSIONS Subtitle A--Education Matters Part 1--Department of Education (Sec. 2001) This section provides additional FY2021 funding for the Department of Education (ED) to assist states with addressing the impacts of COVID-19 on elementary and secondary schools. ED must use specified funds to support the identification, enrollment, and school participation of homeless children and youth. Local educational agencies (LEAs) must reserve funds to address student learning loss. The remaining funds may be used for any allowable purpose under federal education programs and for other specified purposes, including for the purchase of sanitization supplies and educational technology. LEAs must, within 30 days of receiving funds, develop and publish plans to safely reopen schools for in-person instruction. (Sec. 2002) This section provides additional FY2021 funding for the Emergency Assistance to Non-Public Schools program, through which states must provide services or assistance to nonpublic schools that enroll a significant percentage of low-income students and are most impacted by COVID-19. These funds may not be used for reimbursements to nonpublic schools. (Sec. 2003) This section provides additional FY2021 funding for institutions of higher education (IHEs). IHEs must allocate at least half of these funds to provide emergency financial-aid grants to students. (Sec. 2004) This section outlines maintenance-of-effort requirements for states, which may be waived by ED. Further, state educational agencies (SEAs) and LEAs must comply with certain maintenance-of-equity requirements. (Sec. 2005) This section provides additional FY2021 funding for grants to outlying areas based on need. (Sec. 2006) This section provides additional FY2021 funding for the Kendall Demonstration Elementary School, the Model Secondary School for the Deaf, and Gallaudet University to respond to COVID-19, including to defray institutional expenses and provide financial-aid grants to students. (Sec. 2007) This section provides additional FY2021 funding for the student aid administration within ED to respond to COVID-19, including through direct outreach to students and borrowers about financial aid and other assistance. (Sec. 2008) This section provides additional FY2021 funding for Howard University to respond to COVID-19, including to defray institutional expenses and provide financial-aid grants to students. (Sec. 2009) This section provides additional FY2021 funding for the National Technical Institute for the Deaf to respond to COVID-19, including to defray institutional expenses and provide financial-aid grants to students. (Sec. 2010) This section provides additional FY2021 funding for the Institute of Education Sciences to study student learning loss caused by COVID-19 and disseminate the findings to SEAs, LEAs, and other entities. (Sec. 2011) This section provides additional FY2021 funding for program administration within ED to respond to COVID-19 and for salaries and expenses. (Sec. 2012) This section provides additional FY2021 funding to the Office of Inspector General of ED for salaries and expenses. (Sec. 2013) This section modifies the so-called 90/10 rule to require for-profit IHEs to include all forms of federal education aid in the revenue calculation for federal student-aid program eligibility. (Sec. 2014) This section provides additional FY2021 funding to assist states with providing special education and related services to children and students with disabilities. Part 2--Miscellaneous (Sec. 2021) This section provides additional FY2021 funding for the National Endowment for the Arts to provide grants to state arts agencies and regional arts organizations. (Sec. 2022) This section provides additional FY2021 funding for the National Endowment for the Humanities to provide grants to state humanities councils and humanities organizations. (Sec. 2023) This section provides additional FY2021 funding for the Institute of Museum and Library Services to carry out museum and library services. Subtitle B--Labor Matters (Sec. 2101) This section provides funding for various agencies within the Department of Labor to conduct worker protection activities with respect to COVID-19. Subtitle C--Human Services and Community Supports (Sec. 2201) This section provides additional funding for the Child Care and Development Block Grant program. States, territories, Indian tribes, and tribal organizations may use this funding to provide child care assistance to essential workers without regard to income eligibility requirements. (Sec. 2202) This section provides funding for grants to lead child care agencies and providers for personnel costs, facility costs, the purchase of personal protective equipment, and other costs associated with responding to the COVID-19 public health emergency. (Sec. 2203) This section provides additional funding through FY2022 to Head Start agencies based on their enrollment. (Sec. 2204) This section provides additional FY2021 funding for programs supporting adult and youth victims of family violence, domestic violence, or dating violence, including grants for community-based services. (Sec. 2205) This section provides additional FY2021 funding for child abuse or neglect prevention and treatment programs, including grants to states for community-based prevention services. (Sec. 2206) This section provides additional FY2021 funding for the Corporation for National and Community Service to operate and support national service programs. The corporation must prioritize entities disproportionately impacted by COVID-19 and take into account the diversity of the communities and participants served by such entities. Subtitle D--Public Health (Sec. 2301) This section provides additional FY2021 funding to the Centers for Disease Control and Prevention (CDC) for COVID-19 vaccination efforts. The CDC must use some of this funding to supplement certain existing grants awarded to health departments for their COVID-19 vaccination activities. (Sec. 2302) This section provides additional FY2021 funding to the CDC for activities to increase confidence in vaccines and improve vaccination rates. (Sec. 2303) This section provides additional FY2021 funding for the Department of Health and Human Services (HHS) to acquire vaccines, therapeutics, and other supplies to prevent and respond to COVID-19, the virus that causes COVID-19 and its variants, and other diseases or viruses with pandemic potential. (Sec. 2304) This section provides funding for HHS to evaluate the safety and effectiveness of COVID-19 vaccines and therapeutics and to oversee the supply chain for those products. HHS must also carry out reviews, inspections, and related activities necessary to approve medical products and devices that were delayed or cancelled for reasons related to COVID-19. (Sec. 2305) This section makes individuals who received unemployment compensation in 2021 eligible for cost-sharing subsidies for health care expenses under qualified health insurance plans. Subtitle E--Testing (Sec. 2401) This section provides additional FY2021 funding for HHS to carry out various activities to support COVID-19 testing, contact tracing, surveillance, and mitigation measures. (Sec. 2402) This section provides additional FY2021 funding for the CDC to improve its capacity and the capacity of public health laboratories to conduct genomic sequencing, analytics, and disease surveillance, including for the virus that causes COVID-19 and its variants. (Sec. 2403) This section provides additional FY2021 funding for the CDC to address COVID-19 and other infectious diseases globally. (Sec. 2404) This section provides additional FY2021 funding for the CDC to modernize and expand public health data surveillance systems, including to maintain a disease warning system to track COVID-19 and emerging biological threats. Subtitle F--Public Health Workforce (Sec. 2501) This section provides additional FY2021 funding for HHS to award grants and take other actions to expand and sustain the public health workforce, including to respond to COVID-19. (Sec. 2502) This section provides additional FY2021 funding for the Medical Reserve Corps. This is a network of volunteers, including medical providers and public health professionals, organized locally to improve community health and safety. Subtitle G--Public Health Investments (Sec. 2601) This section provides additional FY2021 funding to expand health care services and infrastructure of federally qualified health centers and similar entities that serve Native Hawaiians, including specifically for COVID-19 vaccinations and treatments. (Sec. 2602) This section provides additional FY2021 funding for the National Health Services Corps. This program provides scholarships and student loan repayment to health care providers who agree to work in areas of the United States with limited access to primary care, dental care, and mental health care. (Sec. 2603) This section provides additional FY2021 funding for the Nurse Corps. This program provides scholarships and student loan repayment to nurses who agree to work in areas of the United States with limited access to primary care and mental health care. It also provides student loan repayment for nurses who work as faculty in nursing schools. (Sec. 2604) This section provides additional FY2021 funding to establish or expand graduate medical education training programs carried out in teaching health centers. (Sec. 2605) This section provides additional FY2021 funding to entities that provide family planning services. Subtitle H--Mental Health and Substance Use Disorder (Sec. 2701) This section provides additional FY2021 funding for block grants for community mental health services and for mental health and substance use services. This funding must be expended by the end of FY2025. (Sec. 2702) This section provides additional FY2021 funding for various grants and programs to prevent and treat substance abuse. This funding must be expended by the end of FY2025. (Sec. 2703) This section provides additional FY2021 funding to the Health Resources and Services Administration (HRSA) for grants and other activities to address and prevent suicide, burnout, mental health conditions, and substance use disorders among health care professionals. HRSA must consider the needs of rural and medically underserved communities in these activities. (Sec. 2704) This section provides additional FY2021 funding for the CDC to educate health care professionals and first responders about primary prevention of mental health conditions and substance use disorders and treatments. (Sec. 2705) This section provides additional FY2021 funding for HRSA to award grants to health care providers and health care professional associations to promote mental health among those who work in the health care field. (Sec. 2706) This section provides additional FY2021 funding to the Substance Abuse and Mental Health Services Administration (SAMHSA) for grants for overdose prevention programs, syringe services programs, and other harm reduction measures. (Sec. 2707) This section provides additional FY2021 funding to SAMHSA for grants to address community behavioral health needs made worse by the COVID-19 emergency. (Sec. 2708) This section provides additional FY2021 funding for grants to prevent the long-term consequences of child trauma by providing early intervention services and treatments with a focus on high-risk or medically underserved populations that experience violence-related stress. (Sec. 2709) This section provides additional FY2021 funding for Project Aware, which promotes access to mental health services among school-aged youth and their families. (Sec. 2710) This section provides additional FY2021 funding for youth suicide prevention activities and for services for students with mental health or substance use disorders. (Sec. 2711) This section provides additional FY2021 funding for grants to support mental and behavioral health education and training programs. (Sec. 2712) This section provides additional FY2021 funding to increase access to pediatric mental health services in primary care settings. (Sec. 2713) This section provides additional FY2021 funding for certified community behavioral health clinics. These clinics provide integrated mental health and substance use disorder treatment services in communities. Subtitle I--Exchange Grant Program (Sec. 2801) This section provides funding for grants for health benefit exchanges to modernize their systems and technology. Subtitle J--Continued Assistance to Rail Workers (Sec. 2901) This section extends the Railroad Unemployment Insurance Act (RUIA) benefits-registration period through September 6, 2021, for qualified railroad employees to receive an additional RUIA benefit of $600. (Sec. 2902) This section modifies and reauthorizes the temporary increase of extended RUIA benefits to employees who received regular RUIA benefits during the period beginning July 1, 2019, and ending on June 30, 2022. However, the section does not apply to any employee with respect to a registration period beginning after September 6, 2021. (Sec. 2903) This section provides funding through September 6, 2021, to temporarily reimburse states that waive the seven-day waiting period for benefits under the RUIA. (Sec. 2904) This section provides funding for FY2021 for the Railroad Retirement Board to prevent, prepare for, and respond to COVID-19. It also provides funding for the Railroad Retirement Board Office of Inspector General for audit, investigatory, and review activities. Subtitle K--Ratepayer Protection (Sec. 2911) This section provides funding through FY2022 for the low-income home energy assistance program, with specified limitations. (Sec. 2912) This section provides funding for FY2021 to HHS to provide grants to states, Indian tribes, and other jurisdictions to assist low-income households that pay a high proportion of household income for drinking water and wastewater services by providing funds to owners or operators of public water systems or treatment works to reduce arrearages of and rates charged to such households for such services. Subtitle L--Assistance for Older Americans, Grandfamilies, and Kinship Families (Sec. 2921) This section provides additional FY2021 funding for programs that provide nutrition, health promotion, and other services for older adults and caregivers. (Sec. 2922) This section provides additional FY2021 funding for the Administration for Community Living to establish a National Technical Assistance Center on Grandfamilies and Kinship Families. The center must provide technical assistance to government agencies, nonprofits, and other community-based organizations that support grandfamilies and kinship families. The focus must be on families in which the primary caregiver is 55 years or older or the child has one or more disabilities. TITLE III--COMMITTEE ON BANKING, HOUSING, AND URBAN AFFAIRS Subtitle A--Defense Production Act of 1950 (Sec. 3101) This section provides additional FY2021 funding to carry out activities under the Defense Production Act of 1950 to manage the supply chain for personal protective equipment, vaccines, and other products to address COVID-19 and other declared public health emergencies. That act confers on the President a broad set of authorities to influence domestic industry in order to provide essential materials and goods for the national defense. Subtitle B--Housing Provisions This subtitle provides additional FY2021 funding for rental assistance, homelessness assistance, housing counseling, and housing assistance related to the COVID-19 pandemic. (Sec. 3201) This section provides FY2021 funding for the Department of the Treasury's Emergency Rental Assistance program, which was established in response to the COVID-19 pandemic. The program provides grants to states, local governments, and territories for financial assistance to households for rent, utilities, and other housing expenses. Low-income households that are at risk of homelessness and are experiencing unemployment or financial hardship are eligible. The aggregate period of assistance a household may receive under this program may not exceed 18 months. (Sec. 3202) This section provides FY2021 funding for emergency rental assistance vouchers through the Department of Housing and Urban Development (HUD) for families and individuals who are (1) experiencing homelessness; (2) at risk of homelessness; (3) fleeing, or attempting to flee, domestic violence and other dangerous situations; or (4) recently homeless. (Sec. 3203) This section provides FY2021 funding for rental assistance through USDA for individuals living in certain rural rental property. (Sec. 3204) This section provides FY2021 funding for the Neighborhood Reinvestment Corporation for grants to housing counseling intermediaries for housing counseling services, including counseling provided directly to households facing housing instability. (Sec. 3205) This section provides FY2021 funding for HUD's HOME Investment Partnerships Program. Funding is provided for tenant-based rental assistance, development and support of affordable housing, supportive housing services, and the acquisition of non-congregate shelter units. These units may remain non-congregate shelter units, be converted into permanent affordable housing, or be used as emergency shelter. Individuals qualifying for such assistance include at-risk veterans and individuals who are homeless, at risk of homelessness, or fleeing or attempting to flee domestic violence or other dangerous situations. (Sec. 3206) This section establishes and provides FY2021 funding for the Homeowner Assistance Fund, which provides assistance to mitigate the financial hardships associated with the COVID-19 pandemic. Specifically, grants are provided to states, territories, and tribes for the purpose of preventing homeowner mortgage delinquency, defaults, foreclosures, loss of utilities, and displacements of homeowners experiencing financial hardship after January 21, 2020. (Sec. 3207) This section provides FY2021 funding to USDA's Direct Home Loan and Housing Repair Loan programs for rural housing. (Sec. 3208) This section provides FY2021 funding for the Fair Housing Initiatives Program for fair housing organizations to address fair housing inquiries, complaints, investigations, outreach services, and the costs of delivering or adapting services related to the COVID-19 pandemic. Subtitle C--Small Business (SSBCI) (Sec. 3301) This section reauthorizes the State Small Business Credit Initiative and provides FY2021 funding for COVID-19 support to eligible small businesses. Specifically, the section provides this funding for states and tribal governments to support small business credit expansion programs that deliver loans or investments to eligible small businesses. The section allocates specified portions of this funding for (1) states to support businesses that are owned by socially and economically disadvantaged individuals, (2) an incentive program to boost funding for states that demonstrate robust support for those businesses, (3) support for very small businesses (e.g., those with fewer than 10 employees), and (4) tribal governments. Additionally, Treasury may provide funds to states, the Minority Business Development Agency, or other advisory firms to provide technical assistance to specified small businesses. Subtitle D--Public Transportation (Sec. 3401) This section provides funding through FY2024 to the Federal Transit Administration to provide grants to state, local, and tribal governments, and publicly owned operators of public transportation. The grants shall be used for transit agencies to prevent, prepare for, and respond to COVID-19, including for (1) reimbursement for payroll of public transportation; (2) operating costs to maintain service due to lost revenue due as a result of the COVID-19 public health emergency, including the purchase of personal protective equipment; and (3) paying the administrative leave of operations or contractor personnel due to reductions in service. This section provides funding for urbanized area formula grants; formula grants for the enhanced mobility of seniors and individuals with disabilities; formula grants for rural areas; the fixed guideway capital investment program; bus operators that partner with recipients or sub-recipients of rural area formula grants, with specified exceptions for states or territories that do not have eligible bus providers; planning of public transportation associated with the restoration of services as the COVID-19 public health emergency concludes, with specified limitations for route planning related to transitioning public transportation service to a transportation network company or other third-party contract provider; and recipients and sub-recipients of grants that, as a result of COVID-19, require additional assistance for costs related to operations, personnel, cleaning, and sanitization combating the spread of pathogens on transit systems, and debt service payments incurred to maintain operations and avoid layoffs and furloughs. TITLE IV--COMMITTEE ON HOMELAND SECURITY AND GOVERNMENTAL AFFAIRS (Sec. 4001) This section establishes and funds the Emergency Federal Employee Leave Fund. Amounts in the fund shall be available for reimbursement to an agency for the use of paid leave by any agency employee who is unable to work because the employee is subject to a federal, state, or local quarantine or isolation order related to COVID-19; has been advised by a health care provider to self-quarantine due to concerns related to COVID-19; is caring for an individual who is subject to such an order or has been so advised; is experiencing symptoms of COVID-19 and seeking a medical diagnosis; is caring for a son or daughter of such employee if, due to COVID-19 precautions, the school or place of care of the son or daughter has been closed, the school of such son or daughter requires or makes optional a virtual learning instruction model or a hybrid of in-person and virtual learning instruction models, or the child care provider of such son or daughter is unavailable; is experiencing any other substantially similar condition; is caring for a family member with a mental or physical disability or who is 55 years of age or older and incapable of self-care, without regard to whether another individual other than the employee is available to care for such family member, if the place of care for such family member is closed or the direct care provider is unavailable due to COVID-19; or is obtaining immunization related to COVID-19 or is recovering from any injury, disability, illness, or condition related to such immunization. The section sets forth limitations on such leave. (Sec. 4002) This section provides funding for the Government Accountability Office to prevent, prepare for, and respond to COVID-19 and to support oversight of the COVID-19 response and of funds provided pertaining to the pandemic; the Pandemic Response Accountability Committee to support oversight of the COVID-19 response and of funds provided pertaining to the pandemic; necessary expenses for the White House to prevent, prepare for, and respond to COVID-19; and carrying out the purposes of the Disaster Relief Fund for costs associated with major disaster declarations. (Sec. 4006) This section provides financial assistance for COVID-19-related funeral expenses, for which the federal cost share shall be 100%. (Sec. 4007) This section provides funding for the emergency food and shelter program, including for purposes of providing humanitarian relief to families and individuals encountered by the Department of Homeland Security; the Cybersecurity and Infrastructure Security Agency for cybersecurity risk mitigation; the United States Digital Service; the Technology Modernization Fund and the Federal Citizen Services Fund of the General Services Administration; assistance to firefighter grants and for staffing for adequate fire and emergency response grants; and emergency management performance grants of the Federal Emergency Management Agency (FEMA). (Sec. 4015) This section extends for one year the authority of federal agencies to reimburse contractors for certain leave paid to employees or subcontractors due to facility closures or other restrictions as result of COVID-19. (Sec. 4016) This section provides that certain federal employees shall, with respect to any claim for workers' compensation benefits, be deemed to have an injury proximately caused by exposure to COVID-19 arising out of the nature of the employee's employment. Such an employee, or a beneficiary of such an employee, shall be entitled to benefits for such claim, including disability compensation, medical services, and survivor benefits. A covered employee is an individual who is employed in federal service at any time during the period beginning on January 27, 2020, and ending on January 27, 2023; is diagnosed with COVID-19 during such period; and during a period prior to such diagnosis, carries out duties that require contact with patients, members of the public, or coworkers, or include a risk of exposure to COVID-19. An individual who is exclusively teleworking during the exposure period is not covered. The costs of benefits for claims approved on the basis of this section shall not be included in the annual statement of the cost of benefits and other payments of an agency or instrumentality. Costs of administration of such claims may be paid from the Employees' Compensation Fund and shall not be subject to a provision regarding payment of the fair share of administrative costs. TITLE V--COMMITTEE ON SMALL BUSINESS AND ENTREPRENEURSHIP This title modifies and extends existing programs and creates new programs to support small businesses, restaurants, shuttered venue operators, and other entities that have been affected during the COVID-19 pandemic. (Sec. 5001) This section provides FY2021 funding for and otherwise modifies the Paycheck Protection Program (PPP). Specifically, the section expands eligibility for the program (and for second-draw loans under the program) to include certain nonprofit entities and certain internet publishing organizations. The section also excludes from the loan forgiveness calculation certain payroll costs related to continuation coverage premium assistance. (Sec. 5002) This section provides additional FY2021 funding for emergency grants under the Economic Injury Disaster Loan (EIDL) Program. These grants must be awarded to (1) entities that have not already received the full grant amount to which they are entitled under current law, and (2) small businesses that have suffered an economic loss of greater than 50% and that have 10 or fewer employees. (Sec. 5003) This section establishes through December 31, 2021, and provides FY2021 funding for the Restaurant Revitalization Fund, from which Treasury must make grants to eligible restaurants for specified costs such as payroll, operational expenses, and paid sick leave. For the grant program's initial 21-day period, Treasury must prioritize awarding grants to marginalized and underrepresented communities. Grant amounts must be equal to the recipient's pandemic-related revenue loss, and the calculation of this loss must be reduced by any amounts received under the PPP or the EIDL Program. (Sec. 5004) This section establishes and provides FY2021 funding for a Community Navigator pilot program to improve access to COVID-19 assistance programs and resources for small businesses. (Sec. 5005) This section provides additional FY2021 funding for grants to shuttered venue operators, and it reduces the amount of these grants by the total amount of any PPP or EIDL Program funds that the grant recipient has received on or after December 27, 2020. (Sec. 5006) This section provides additional funding in FY2021 for administrative expenses related to specified COVID-19 relief measures and for the EIDL Program. TITLE VI--COMMITTEE ON ENVIRONMENT AND PUBLIC WORKS (Sec. 6001) This section provides funding to the Department of Commerce, the Environmental Protection Agency (EPA), and the U.S. Fish and Wildlife Service (USFWS). Specifically, it provides funding to Commerce for the Economic Development Administration. (Sec. 6002) Within the EPA, this section provides funding to address health outcome disparities from pollution and the COVID-19 pandemic. (Sec. 6003) Within the USFWS, this section provides funding for (1) wildlife investigations, efforts to address illegal trade of animals or plants, and related activities; (2) the care of certain species, such as rescued wildlife; and (3) research and other activities to detect, respond, and manage wildlife disease outbreaks before they become pandemics. TITLE VII--COMMITTEE ON COMMERCE, SCIENCE, AND TRANSPORTATION Subtitle A--Transportation and Infrastructure (Sec. 7101) This section provides funding through FY2024 to the National Railroad Passenger Corporation (Amtrak) for grants to prevent, prepare for, and respond to COVID-19. For example, Amtrak shall use specified amounts to (1) restore the frequency of rail service on long-distance and rehire employees furloughed on or after October 1, 2020, as a result of COVID-19; (2) offset amounts required to be paid by states for state-supported routes; (3) repay or prepay debt, including for loans from the Department of Transportation (DOT); and (4) provide project management oversight. (Sec. 7102) This section provides funding through FY2024 for assistance to airport sponsors to prevent, prepare for, and respond to COVID-19, including for costs related to operations, personnel, cleaning, sanitization, janitorial services, combating the spread of pathogens at the airport, and debt service payments. (Sec. 7103) This section establishes in the Federal Aviation Administration (FAA) the Emergency FAA Employee Leave Fund for the use of paid leave by an FAA employee who is unable to work due to COVID-19. (Sec. 7104) This section establishes in the Transportation Security Administration (TSA) the Emergency TSA Employee Leave Fund for the use of paid leave by a TSA employee who is unable to work due to COVID-19. Subtitle B--Aviation Manufacturing Jobs Protection (Sec. 7202) This section directs DOT to establish a payroll support program and enter into agreements with employers that meet specified criteria to provide public contributions to supplement compensation of an eligible employee group. Eligible employee group means the portion of an employer's U.S. workforce that (1) does not exceed 25% of the employer's total U.S. workforce as of April 1, 2020; (2) contains only employees with a total compensation level of $200,000 or less per year; and (3) is engaged in aviation manufacturing activities and services, or maintenance, repair, and overhaul activities and services. Subtitle C--Airlines (Sec. 7301) This section directs DOT to provide financial assistance to certain air carriers and contractors for the continuation of payment of employee wages, salaries, and benefits. Subtitle D--Consumer Protection and Commerce Oversight (Sec. 7401) This section provides additional FY2021 funding for the Consumer Product Safety Commission to conduct surveillance at ports of entry, and other monitoring activities, to identify products with risks associated with COVID-19. (Sec. 7402) This section provides funding for the Federal Communications Commission to reimburse schools and libraries for the purchase of computer and internet connectivity equipment during the COVID-19 public health emergency. (Sec. 7403) This section provides additional FY2021 funding for the Office of the Inspector General of Commerce to respond to COVID-19. (Sec. 7404) This section provides additional FY2021 funding for the Federal Trade Commission to address complaints and respond to unfair or deceptive practices related to COVID-19. Subtitle E--Science and Technology (Sec. 7501) This section provides additional FY2021 funding for the National Institute of Standards and Technology to support research, development, and testing related to COVID-19. (Sec. 7502) This section provides additional FY2021 funding for National Science Foundation to provide research grants, scholarships, cooperative agreements, and other activities to respond to COVID-19. Subtitle F--Corporation for Public Broadcasting (Sec. 7601) This section provides additional FY2021 funding for the Corporation for Public Broadcasting to respond to COVID-19, including by providing grants to public broadcast stations. TITLE VIII--COMMITTEE ON VETERANS' AFFAIRS (Sec. 8001) This section provides funding to remain available through FY2023 for veterans' benefits claims and appeals processing purposes. (Sec. 8002) This section provides funding to remain available through FY2023 for Department of Veterans Affairs (VA) medical and health care programs, with a specified amount available for the Veterans Community Care Program. (Sec. 8003) This section provides funding to remain available through FY2022 for the VA's supply chain modernization initiative. (Sec. 8004) This section provides varying amounts to fund state homes. A state home is a home established by a state for veterans who are disabled by age, disease, or otherwise and incapable of earning a living because of such disability. The term also includes a home that furnishes nursing home care for veterans. (Sec. 8005) This section provides funding for FY2021 to the Office of Inspector General of the VA. (Sec. 8006) This section requires and funds the implementation of a program under which the VA must provide up to 12 months of nontransferable retraining assistance to up to 17,250 eligible veterans for the pursuit of a specified program of education. Under the bill, an eligible veteran is an individual who, among other requirements, is unemployed due to COVID-19. (Sec. 8007) This section requires the VA to provide for any co-payment or other cost sharing for veterans between April 6, 2020, and September 30, 2021. The VA must reimburse any veteran who paid a co-payment or other cost sharing for VA health care during this time period. (Sec. 8008) This section establishes and funds the Emergency Department of Veterans Affairs Employee Leave Fund to provide paid leave through September 30, 2021, to specified employees for reasons related to COVID-19. TITLE IX--COMMITTEE ON FINANCE Subtitle A--Crisis Support for Unemployed Workers Part 1--Extensions of Care Act Unemployment Provisions (Sec. 9011) This section extends pandemic unemployment assistance (PUA) for up to 79 weeks through September 6, 2021. Certain payments of PUA to an individual shall not be considered as an overpayment; however, a PUA recipient shall not receive such assistance and pandemic emergency unemployment compensation (PEUC) for the same week of unemployment. (Sec. 9012) This section provides funding through September 6, 2021, for the transfer of funds to state accounts in the Unemployment Trust Fund for the reimbursement of certain governmental entities and nonprofit organizations for amounts paid (in lieu of contributions) into such accounts. This section also increases the amount of these reimbursements from 50% to 75% of amounts paid for weeks of unemployment beginning after March 31, 2021, and ending on or before September 6, 2021. (Sec. 9013) This section extends through September 6, 2021, federal-state agreements under which the aggregate amount of weekly employment compensation included an additional $300 in federal pandemic unemployment compensation. This section also extends through such date the additional $100 in mixed earner unemployment compensation to certain recipients of at least $5,000 of self-employment income in the most recent taxable year before the individual applied for regular compensation. (Sec. 9014) This section provides funding through September 6, 2021, for unemployment benefits for the first week of unemployment paid by states without a one-week waiting period. This section also retroactively provides such funding 100% instead of 50% for weeks of unemployment after December 31, 2020. (Sec. 9015) This section temporarily waives through September 6, 2021, certain merit staffing requirements with respect to certain temporary hiring actions taken by states to quickly process unemployment claims. (Sec. 9016) This section provides funding for 53 additional weeks of PEUC through September 6, 2021, for individuals who have exhausted all rights to regular unemployment compensation and meet other specified requirements. (Sec. 9017) This section provides funding to temporarily reimburse states for making short-time compensation (STC) payments under existing or new STC programs for weeks of unemployment ending on or before September 6, 2021. (STC, also known as work sharing, is a program that provides prorated unemployment compensation to workers whose hours have been reduced in lieu of a layoff.) (Sec. 9018) This section provides funding to support STC payments by states that do not have STC programs under state law through September 6, 2021. Part 2--Extension of FFCRA Unemployment Provisions (Sec. 9021) This section extends the suspension on the accrual of interest through September 6, 2021, on federal payments made to states for assistance with unemployment. (Sec. 9022) This section extends the federal share of payments to states for extended and regular unemployment compensation through September 6, 2021. Part 3--Department of Labor Funding for Timely, Accurate, and Equitable Payment (Sec. 9031) This section provides funding to the Department of Labor for FY2021 (1) for federal activities relating to the administration of unemployment compensation programs; and (2) to detect and prevent fraud, promote equitable access, and ensure the timely payment of benefits for unemployment compensation programs, including programs extended under this subtitle. Part 4--Other Provisions (Sec. 9041) This section extends through December 31, 2026, the limitation on excess farm and business losses of noncorporate taxpayers. (Sec. 9042) This section allows taxpayers with adjusted gross incomes of less than $150,000 (regardless of their filing status) to exclude up to $10,200 in unemployment compensation from their gross income in 2020. Subtitle B--Emergency Assistance to Families Through Home Visiting Programs(Sec. 9101) This section provides additional FY2021 funding for entities receiving grants for early childhood home visitation programs. The funds must be used to facilitate virtual visits, provide hazard pay to staff, train home visitors, or provide other supports to families participating in such programs.Subtitle C--Emergency Assistance to Children and Families(Sec. 9201) This section provides additional FY2021 funding to states, territories, and Indian tribes to supplement Temporary Assistance for Needy Families block grants. These funds must be allocated according to a specified formula and used for only nonrecurrent short-term benefits, such as cash benefits for families experiencing hardship resulting from the COVID-19 pandemic. Subtitle D--Elder Justice and Support Guarantee (Sec. 9301) This section provides additional funding for elder justice programs, including adult protective services that report and investigate abuse of older adults and adults with disabilities. Subtitle E--Support to Skilled Nursing Facilities in Response to COVID-19(Sec. 9401) This section provides additional funding for quality improvement organizations under Medicare to support COVID-19 infection control and vaccination uptake at skilled nursing facilities. (Sec. 9402) This section provides additional funding to deploy teams to support skilled nursing facilities with cases of COVID-19 among residents or staff during, and for one year after, the COVID-19 public health emergency.Subtitle F--Preserving Health Benefits for Workers(Sec. 9501) This section provides health insurance premium assistance for individuals who become eligible for, and elect to enroll in, the COBRA (Consolidated Omnibus Budget Reconciliation Act) continuation coverage program. Specifically, the premiums for such individuals are treated as paid through September 30, 2021. The section also extends the election period for eligible individuals who have not elected COBRA coverage and for individuals who elected COBRA coverage but discontinued the coverage.Subject to specified requirements for eligible individuals changing or enrolling in other health plans under this program, such assistance is not available once an individual becomes eligible for any other group health plan. Assistance eligible individuals must notify their group health plan when they become eligible for coverage under another plan, subject to monetary penalties.Additionally, the section requires employers to provide eligible individuals specified written notice about the premium assistance program, including, among other information, available health plan enrollment options and the date that such assistance expires.Further, Treasury must reimburse employers, group health plans, and insurance issuers through a payroll tax credit or refund for unpaid premiums that were treated as paid under the program.Premium assistance is not considered income for federal income tax purposes. Subtitle G--Promoting Economic Security PART 1--2021 RECOVERY REBATES TO INDIVIDUALS (Sec. 9601) This section allows the payment of recovery rebates to individual taxpayers in 2021. The rebate amounts are $1,400 for an individual taxpayer ($2,800 for joint returns) and $1,400 for each taxpayer dependent. The amount of the rebate is limited by the taxpayer's adjusted gross income. To be eligible for the rebate, taxpayers must include a valid Social Security account number on their tax returns. Treasury must make advance payments of recovery rebates and carry out an outreach program to inform taxpayers of their eligibility for advance payments. This section provides additional funding for necessary expenses of the Internal Revenue Service, for the Bureau of the Fiscal Service, and for the Treasury Inspector General for Tax Administration for oversight purposes. PART 2--CHILD TAX CREDIT (Sec. 9611) This section revises and increases the child tax credit in 2021 and makes the credit refundable. The amount of the credit shall increase to $3,000 for each child under age 17 and to $3,600 for children under the age of 6 years. The amount of the credit is reduced based upon the adjusted gross income of the taxpayer. Treasury must establish a program for advance payments of the child tax credit. (Sec. 9612) This section sets forth rules for the application of the child tax credit in U.S. possessions and territories. PART 3--EARNED INCOME TAX CREDIT (Sec. 9621) This section revises the earned income tax credit (EITC) in 2021 for individuals with no qualifying children. It lowers the minimum age for eligibility for the credit for students and foster youth. (Sec. 9622) This section eliminates the verification requirement for EITC recipients with no children. (Sec. 9623) This credit expands eligibility for the EITC for certain separated spouses. (Sec. 9624) This section increases the threshold for disqualification of the EITC based on investment income from $2,200 to $10,000. (Sec. 9625) This section sets forth rules for the application of the EITC in U.S. possessions. (Sec. 9626) This section permits taxpayers whose earned income in 2021 is less than their earned income in 2019 to elect to substitute 2019 earned income for purposes of calculating the EITC. PART 4--DEPENDENT CARE ASSISTANCE (Sec. 9631) This section increases rate of the tax credit for child and dependent care expenses and makes the credit refundable. It also increases the dollar limit on such expenses that are eligible for the credit. (Sec. 9632) This section increases the amount of the tax exclusion for employer-provided dependent care assistance to $10,500 in 2021. PART 5--CREDITS FOR PAID SICK AND FAMILY LEAVE (Sec. 9641) This section allows certain employers whose businesses were affected by COVID-19 a payroll tax credit for 100% of qualified sick leave wages paid in a calendar quarter. (Sec. 9642) This section allows a refundable income tax credit for sick leave for self-employed individuals. (Sec. 9643) This section allows self-employed individuals a refundable income tax credit for 100% of qualified family leave. PART 6--EMPLOYEE RETENTION CREDIT (Sec. 9651) This section allows certain employers whose businesses were affected by the COVID-19 pandemic and who experienced a reduction of gross receipts due to the pandemic a payroll tax credit for 70% of employee wages in a calendar quarter. The credit may not exceed $50,000 for startup businesses and the amount of employee wages taken into account for purposes of the credit may not exceed $10,000 in any calendar quarter. The credit applies to wages paid after June 30, 2021, and before January 1, 2022. PART 7--PREMIUM TAX CREDIT (Sec. 9661) This section provides for increases in the rate of the refundable tax credit for coverage under qualified health plan (premium tax credit) in 2021 and 2022 for certain low-income taxpayers. (Sec. 9662) This section allows a temporary modification for taxable years beginning in 2020 of limitations on the reconciliation of the premium tax credit with advance payments of the credit. (Sec. 9663) This section extends eligibility for the premium tax credit to individuals receiving unemployment compensation in 2021. PART 8--MISCELLANEOUS PROVISIONS (Sec. 9671) This section repeals the taxpayer election to allocate and apportion interest expense of each member of a domestic corporation that is a member of an affiliated group on a worldwide basis. (Sec. 9672) This section allows an exclusion from gross income for targeted Economic Injury Disaster Loan advances received from the Small Business Administration (SBA). (Sec. 9673) This section allows an exclusion from gross income for restaurant revitalization grant amounts received from the SBA. (Sec. 9674) This section provides for a de minimis exception to the reporting requirements of third party network transactions for transactions not exceeding $600. (Sec. 9675) This section modifies the tax treatment of income attributable to the forgiveness of certain student loan indebtedness incurred between 2021 and 2026. It excludes from student gross income, for income tax purposes, income from the discharge of student loans for postsecondary education expenses, private education loans, and loans from certain tax-exempt educational organizations. Subtitle H--Pensions (Sec. 9701) This section permits multiemployer pension plans to elect to retain their funding zone status from the previous year for either (1) the first plan year beginning during the period from March 1, 2020, through February 28, 2021; or (2) the next succeeding plan year, as designated by the plan sponsor. Further, if such a plan is in endangered or critical status for the plan year preceding the designated plan year, the plan is not required to update its funding improvement or rehabilitation plans or schedules until the plan year following such designated year. If an election has been made under this section, but the plan has been certified as in critical status for the designated plan year, the plan is treated as in critical status for the purpose of specified tax liability and contribution requirements. (Sec. 9702) This section permits a multiemployer pension plan to extend by five years the funding improvement or rehabilitation period if the plan is designated as in endangered or critical status for a plan year beginning in 2020 or 2021. (Sec. 9703) This section modifies the minimum funding standards for multiemployer pension plans to account for investment losses and other losses related to the COVID-19 pandemic. The section permits two years of experience losses to be amortized over 30 years instead of 15 years. This section does not apply to plans receiving special financial assistance. (Sec. 9704) This section expands the authority of, and provides funding for, the Pension Benefit Guaranty Corporation (PBGC) to provide special financial assistance to eligible multiemployer pension plans that are in various declining or critical statuses. The PBGC must issue application requirements for such assistance and may require, subject to certain limitations, reasonable conditions on plans receiving assistance.Plans approved for special financial assistance must be paid the amount sufficient for the plan to pay the full benefits due through the plan year ending in 2051. Plans receiving special assistance are deemed to be in critical status and must follow certain requirements such as reinstating any benefits that have been suspended.This section also increases the PBGC insurance premium for multiemployer pension plans. (Sec. 9705) This section revises the amortization rules for single employer pension plans. The section reduces shortfall amortization bases and the required shortfall amortization installments for specified plan years to zero. It also extends the shortfall amortization period from 7 years to 15 years. (Sec. 9706) This section extends and modifies the pension funding stabilization percentages for single employer pension plans. The percentages are used to determine the applicable interest rates for valuing single employer plan liabilities that affect a plan's minimum funding requirements. It also sets a floor of 5% on the average segment rate for any 25-year period. (Sec. 9707) This section expands the eligibility for special funding rules for pension plans operated by certain community newspapers. (Sec. 9708) This section expands the limitation on the tax deductibility of certain employees' annual compensation that is above $1 million to include an employer's five highest paid employees beginning in 2027. TITLE IX--COMMITTEE ON FINANCE Subtitle I--Child Care for Workers (Sec. 9801) This section provides permanent funding for the Child Care Entitlement to States and specifically makes this funding available to U.S. territories. Subtitle J--Medicaid (Sec. 9811) This section requires state Medicaid programs to cover vaccines, testing, and treatments for COVID-19 without cost-sharing until one year after the end of the public health emergency. The section applies a 100% federal matching rate, also known as the Federal Medical Assistance Percentage (FMAP), to COVID-19 vaccines during this period. States may also cover COVID-19 vaccines and treatments, in addition to testing, for uninsured individuals. The section also specifically includes drugs that are used to treat or prevent COVID-19 in the Medicaid Drug Rebate Program. (Sec. 9812) This section temporarily allows states to provide one year of postpartum coverage under Medicaid. Current law requires 60 days of postpartum coverage. (Sec. 9813) This section temporarily allows state Medicaid programs to cover certain community-based mobile crisis intervention services for individuals experiencing a mental health or substance-use disorder crisis outside of a facility setting. (Sec. 9814) This section temporarily increases the FMAP for states that elect to participate in Medicaid expansion (pursuant to the Patient Protection and Affordable Care Act) if they have not already done so. (Sec. 9815) This section temporarily applies a 100% FMAP to services provided through Urban Indian Organizations, Native Hawaiian Health Centers, and other specified entities. (Sec. 9816) This section terminates certain limitations regarding drug rebates under the Medicaid Drug Rebate Program. Currently, the maximum rebate that drug manufacturers must pay for single-source and innovator multiple-source drugs is 100% of the average manufacturer price of the drug. The section specifies that this limitation only applies to rebate periods that begin before January 1, 2024. (Sec. 9817) This section temporarily increases the FMAP for home- and community-based services. In order to receive the increase, states must implement activities that enhance, expand, or strengthen such services under their Medicaid programs. (Sec. 9818) This section provides funding for COVID-19 strike teams that can be deployed to Medicaid nursing facilities during, and for one year after, the public health emergency to help with clinical care, infection control, or staffing. (Sec. 9819) This section requires the Centers for Medicare & Medicaid Services (CMS) to recalculate Medicaid disproportionate share hospital (DSH) allotments for states so as to ensure that certain FMAP increases do not affect the total payments states can make during the COVID-19 public health emergency. (DSHs are hospitals that receive additional payment under Medicaid for treating a large share of low-income patients.) Subtitle K--Children's Health Insurance Program (Sec. 9821) This section requires Children's Health Insurance Program (CHIP) coverage of COVID-19 vaccines, testing, and treatments without cost-sharing until one year after the end of the public health emergency. The section applies a 100% enhanced FMAP to COVID-19 vaccines during this period. (Sec. 9822) This section temporarily allows states to provide one year of postpartum coverage under CHIP. Specifically, states that choose to provide one year of postpartum coverage under Medicaid (as authorized under this bill) must also extend the coverage period under CHIP. Subtitle L--Medicare (Sec. 9831) This section establishes an area wage adjustment floor for Medicare hospital payments in all-urban states (i.e., states that have no rural areas or rural hospitals) and excludes such adjustments from certain budget neutrality rules. The CMS must determine the floor using a specified methodology. (Sec. 9832) This section allows for Medicare payment of ground ambulance services that did not result in the actual transport of an individual to a permitted facility, if the lack of transport was due to community-wide COVID-19 protocols for emergency medical services during the public health emergency. (Sec. 9833) This section provides funding for the Office of the Inspector General of HHS to oversee the agency's COVID-19 activities. Subtitle M--Coronavirus State and Local Fiscal Recovery Funds (Sec. 9901) This section provides funding to states, territories, and tribal governments to mitigate the fiscal effects stemming from the COVID-19 public health emergency. A state, territory, or tribal government shall use the funds to cover costs incurred by December 31, 2024, to respond to the COVID-19 emergency or its negative economic impacts, including assistance to households, small businesses, and nonprofits or aid to impacted industries such as tourism, travel, and hospitality; provide premium pay to essential workers or provide grants to employers of essential workers during the COVID-19 emergency; provide government services to the extent of the reduction in revenue of such state, territory, or tribal government due to the COVID-19 emergency; or make necessary investments in water, sewer, or broadband infrastructure. The section prohibits (1) the use of funds to reduce or delay the imposition of a tax or tax increase, or (2) deposit of the funds into a pension fund. The section provides funding for payments to states, territories, and tribal governments to carry out critical capital projects directly enabling work, education, and health monitoring, including remote options, in response to the COVID-19 emergency. The section makes provides funding for tribal governments and certain local governments for FY2022-FY2023, to be allocated by Treasury, taking into account economic conditions. TITLE IX--COMMITTEE ON FINANCE Subtitle N--Other Provisions (Sec. 9911) This section provides funding for payments to Medicare, Medicaid, and CHIP health care providers in rural areas for health care expenses and lost revenues that are attributable to COVID-19. (Sec. 9912) This section extends the authority to collect certain customs user fees through FY2030. TITLE X--COMMITTEE ON FOREIGN RELATIONS (Sec. 10001) This section provides additional FY2021 funding for the Department of State, in conducting the foreign affairs of the United States, to prevent, prepare for, and respond to COVID-19 domestically or internationally. (Sec. 10002) This section provides additional FY2021 funding to the U.S. Agency for International Development (USAID) for its necessary expenses to prevent, prepare for, and respond to COVID-19 domestically or internationally. (Sec. 10003) This section provides additional FY2021 funding, to be allocated among the USAID and the State Department, for international economic support in the form of health programs to prevent, prepare for, and respond to COVID-19. (Sec. 10004) This section provides additional FY2021 funding for the State Department to prevent, prepare for, and respond to COVID-19 by assisting refugees and migrants, including through contributions to relevant international humanitarian organizations. (Sec. 10005) This section provides additional FY2021 funding for the State Department to support the priorities and objectives of the United Nations (U.N.) Global Humanitarian Response Plan COVID-19 through voluntary contributions to international organizations and programs administered by those organizations. This response plan, implemented by U.N. agencies, is a coordinated global humanitarian response plan to fight COVID-19 in vulnerable countries. TITLE XI--COMMITTEE ON INDIAN AFFAIRS (Sec. 11001) This section provides additional FY2021 funding for the Indian Health Service to address the impacts of COVID-19 on the operation of health and sanitation programs, including by replacing lost third-party reimbursements, improving health technology, distributing and administering vaccines, and increasing mental health and substance use prevention and treatment services, as well as for expenses relating to the delivery of potable water. (Sec. 11002) This section provides additional FY2021 funding for the Bureau of Indian Affairs to address the impacts of COVID-19 on social welfare and public safety programs, including by providing for tribal housing improvement, tribal government services and child welfare assistance, and delivery of potable water. These funds shall be excluded from the calculation of funds received by those tribal governments that participate in the Small and Needy program. (Sec. 11003) This section provides additional FY2021 funding to tribal communities for federal housing assistance through the Native American Housing Block Grant, Native Hawaiian Housing Block Grant, and Indian Community Development Block Grant programs. (Sec. 11004) This section provides additional FY2021 funding for the Administration for Native Americans to award emergency grants to tribal communities for Native American language preservation and maintenance. (Sec. 11005) This section provides additional FY2021 funding for the Bureau of Indian Education (BIE) to allocate,", "pending_committee_id": 0, "committee": [], "referrals": [], "history": [{"date": "2021-02-24", "action": "The House Committee on the Budget reported an original measure, H. Rept. 117-7, by Mr. Yarmuth.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2021-02-24", "action": "Placed on the Union Calendar, Calendar No. 1.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2021-02-26", "action": "Rules Committee Resolution H. Res. 166 Reported to House. Rule provides for consideration of H.R. 1319 with 1 hour of general debate. Motion to recommit allowed. The resolution provides that the amendment printed in the Rules Committee report shall be considered as adopted and the bill, as amended, shall be considered as read.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2021-02-26", "action": "Rule H. Res. 166 passed House.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2021-02-26", "action": "Considered under the provisions of rule H. Res. 166. (consideration: CR H773-853)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2021-02-26", "action": "Rule provides for consideration of H.R. 1319 with 1 hour of general debate. Motion to recommit allowed. The resolution provides that the amendment printed in the Rules Committee report shall be considered as adopted and the bill, as amended, shall be considered as read.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2021-02-26", "action": "DEBATE - The House proceeded with one hour of debate on H.R. 1319.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2021-02-27", "action": "The previous question was ordered pursuant to the rule.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2021-02-27", "action": "Mrs. Hinson moved to recommit to the Committee on the Budget. (text: CR H852)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2021-02-27", "action": "The previous question on the motion to recommit was ordered pursuant to clause 2(b) of rule XIX.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2021-02-27", "action": "On motion to recommit Failed by the Yeas and Nays: 205 - 218 (Roll no. 48).", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2021-02-27", "action": "On passage Passed by the Yeas and Nays: 219 - 212 (Roll no. 49). (text: CR H773-835)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2021-02-27", "action": "Motion to reconsider laid on the table Agreed to without objection.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2021-02-27", "action": "The Clerk was authorized to correct section numbers, punctuation, and cross references, and to make other necessary technical and conforming corrections in the engrossment of H.R. 1319.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2021-03-02", "action": "Received in the Senate. Read the first time. Placed on Senate Legislative Calendar under Read the First Time.", "chamber": "S", "chamber_id": 115, "importance": 1}, {"date": "2021-03-02", "action": "Read the second time. Placed on Senate Legislative Calendar under General Orders. Calendar No. 10.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2021-03-04", "action": "Motion to proceed to consideration of measure agreed to in Senate by Yea-Nay Vote. 51 - 50. Record Vote Number: 73. (CR S1051)", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2021-03-04", "action": "Measure laid before Senate by motion.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2021-03-04", "action": "S.Amdt.891 Amendment SA 891 proposed by Senator Schumer. (consideration: CR S1051-1117; text: CR S1051-1117) To improve the bill.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2021-03-05", "action": "Considered by Senate. (consideration: CR S1219-1269)", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2021-03-05", "action": "S.Amdt.891 Considered by Senate. (consideration: CR S1219)", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2021-03-05", "action": "S.Amdt.972 Amendment SA 972 proposed by Senator Sanders to Amendment SA 891. (consideration: CR S1219-1230; text: CR S1208-1209) To provide for increases in the Federal minimum wage.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2021-03-05", "action": "S.Amdt.972 Point of order that the amendment violates section 313(b)(1)(D) of the CBA raised in Senate with respect to amendment SA 972.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2021-03-05", "action": "S.Amdt.972 Motion to waive all applicable budgetary discipline with respect to amendment SA 972 rejected in Senate by Yea-Nay Vote. 42 - 58. Record Vote Number: 74.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2021-03-05", "action": "S.Amdt.972 Amendment SA 972 ruled out of order by the chair.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2021-03-05", "action": "S.Amdt.1092 Amendment SA 1092 proposed by Senator Portman to Amendment SA 891. (consideration: CR S1231-1233; text: CR S1231-1232) To reduce unemployment compensation provisions.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2021-03-05", "action": "S.Amdt.1092 Amendment SA 1092 agreed to in Senate by Yea-Nay Vote. 50 - 49. Record Vote Number: 76.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2021-03-06", "action": "S.Amdt.1242 Amendment SA 1242 proposed by Senator Collins to Amendment SA 891. (consideration: CR S1233; text: CR S1347-1354) In the nature of a substitute.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2021-03-06", "action": "S.Amdt.1242 Point of order that the amendment violates section 313(b)(1)(D) of the CBA raised in Senate with respect to amendment SA 1242.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2021-03-06", "action": "S.Amdt.1242 Motion to waive all applicable budgetary disciple with respect to amendment SA 1242 rejected in Senate by Yea-Nay Vote. 48 - 51. Record Vote Number: 77.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2021-03-06", "action": "S.Amdt.1242 Amendment SA 1242 ruled out of order by the chair.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2021-03-06", "action": "S.Amdt.1030 Amendment SA 1030 proposed by Senator Scott SC to Amendment SA 891. (consideration: CR S1233-1234; text: CR S1233) To improve the bill.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2021-03-06", "action": "S.Amdt.1030 Amendment SA 1030 not agreed to in Senate by Yea-Nay Vote. 49 - 50. Record Vote Number: 78.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2021-03-06", "action": "S.Amdt.1378 Amendment SA 1378 proposed by Senator Wyden to Amendment SA 891. (consideration: CR S1234-1235; text: CR S1388-1390) To improve the bill.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2021-03-06", "action": "S.Amdt.1378 Amendment SA 1378 agreed to in Senate by Yea-Nay Vote. 50 - 49. Record Vote Number: 79.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2021-03-06", "action": "S.Amdt.1026 Amendment SA 1026 proposed by Senator Rubio to Amendment SA 891. (consideration: CR S1235-1236; text: CR S1235-1236) To amend the Elementary and Secondary School Emergency Relief Fund.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2021-03-06", "action": "S.Amdt.1026 Amendment SA 1026 not agreed to in Senate by Yea-Nay Vote. 48 - 51. Record Vote Number: 80.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2021-03-06", "action": "S.Amdt.1344 Amendment SA 1344 proposed by Senator Hassan to Amendment SA 891. (consideration: CR S1236-1237; text: CR S1236) To provide for a safe return to in-person instruction.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2021-03-06", "action": "S.Amdt.1344 Amendment SA 1344 agreed to in Senate by Yea-Nay Vote. 51 - 48. Record Vote Number: 81.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2021-03-06", "action": "S.Amdt.1369 Amendment SA 1369 proposed by Senator Graham to Amendment SA 891. (consideration: CR S1237-1238; text: CR S1237-1238) To improve the bill.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2021-03-06", "action": "S.Amdt.1369 Amendment SA 1369 as modified not agreed to in Senate by Yea-Nay Vote. 48 - 51. Record Vote Number: 82.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2021-03-06", "action": "S.Amdt.1197 Amendment SA 1197 proposed by Senator Tester to Amendment SA 891. (consideration: CR S1238-1239; text: CR S1238) To require the President to review and approve the Keystone XL Pipeline to assist COVID-impacted communities.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2021-03-06", "action": "S.Amdt.1197 Point of order that the amendment violates section 305(b)(2) of the CBA raised in Senate with respect to amendment SA 1197.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2021-03-06", "action": "S.Amdt.1197 Motion to waive all applicable budgetary discipline with respect to amendment SA 1197 rejected in Senate by Yea-Nay Vote. 51 - 48. Record Vote Number: 83.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2021-03-06", "action": "S.Amdt.1197 Amendment SA 1197 ruled out of order by the chair.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2021-03-06", "action": "S.Amdt.1161 Amendment SA 1161 proposed by Senator Cassidy to Amendment SA 891. (consideration: CR S1239-1240; text: CR S1239) To improve the bill regarding emergency assistance to non-public schools.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2021-03-06", "action": "S.Amdt.1161 Amendment SA 1161 not agreed to in Senate by Yea-Nay Vote. 49 - 50. Record Vote Number: 84.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2021-03-06", "action": "Motion by Senator Grassley to commit to Senate Committee on Finance with instructions rejected in Senate by Yea-Nay Vote. 49 - 50. Record Vote Number: 85.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2021-03-06", "action": "S.Amdt.1010 Amendment SA 1010 proposed by Senator Toomey to Amendment SA 891. (consideration: CR S1240-1241; text: CR S1240) To strike a provision providing payments to farmers for purposes unrelated to COVID-19.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2021-03-06", "action": "S.Amdt.1010 Amendment SA 1010 not agreed to in Senate by Yea-Nay Vote. 49 - 50. Record Vote Number: 86.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2021-03-06", "action": "S.Amdt.944 Amendment SA 944 proposed by Senator Fischer for Senator Fischer to Amendment SA 891. (consideration: CR S1241-1242; text: CR S1199-1200) To distribute funds for public transportation urbanized area formula grants through the existing formulas.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2021-03-06", "action": "S.Amdt.944 Amendment SA 944 not agreed to in Senate by Yea-Nay Vote. 49 - 50. Record Vote Number: 87.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2021-03-06", "action": "S.Amdt.1014 Amendment SA 1014 proposed by Senator Paul to Amendment SA 891. (consideration: CR S1242; text: CR S1242) To strike provisions relating to nonprofit entities for the paycheck protection program.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2021-03-06", "action": "S.Amdt.1014 Amendment SA 1014 not agreed to in Senate by Yea-Nay Vote. 47 - 51. Record Vote Number: 88.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2021-03-06", "action": "S.Amdt.1383 Amendment SA 1383 proposed by Senator Young to Amendment SA 891. (consideration: CR S1242-1243; text: CR S1242) To strike the provision establishing the Emergency Federal Employee Leave Fund and appropriate $300,000,000 for chemical screening devices for U.S. Customs and Border Protection.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2021-03-06", "action": "S.Amdt.1383 Amendment SA 1383 not agreed to in Senate by Yea-Nay Vote. 48 - 50. Record Vote Number: 89.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2021-03-06", "action": "Motion by Senator Capito to commit to Senate Committee on Finance with instructions rejected in Senate by Yea-Nay Vote. 48 - 50. Record Vote Number: 90.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2021-03-06", "action": "S.Amdt.1395 Amendment SA 1395 proposed by Senator Scott FL to Amendment SA 891. (consideration: CR S1244-1245; text: CR S1244) To fund the procurement of HC-130J aircraft by the Coast Guard, and to provide an offset by striking National Railroad Passenger Corporation grant funding for the Northeast Corridor.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2021-03-06", "action": "S.Amdt.1395 Amendment SA 1395 not agreed to in Senate by Yea-Nay Vote. 47 - 51. Record Vote Number: 91.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2021-03-06", "action": "Motion by Senator Cotton to commit to Senate Committee on Finance with instructions rejected in Senate by Yea-Nay Vote. 48 - 50. Record Vote Number: 92.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2021-03-06", "action": "S.Amdt.1342 Amendment SA 1342 proposed by Senator Moran to Amendment SA 891. (consideration: CR S1245-1246; text: CR S1245) To provide an effective date for the modification of revenue requirements for proprietary institutions of higher education.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2021-03-06", "action": "S.Amdt.1342 Amendment SA 1342 agreed to in Senate by Voice Vote.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2021-03-06", "action": "S.Amdt.996 Amendment SA 996 proposed by Senator Blackburn to Amendment SA 891. (consideration: CR S1246-1247; text: CR S1246) To strike section 9831.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2021-03-06", "action": "S.Amdt.996 Amendment SA 996 not agreed to in Senate by Yea-Nay Vote. 49 - 50. Record Vote Number: 93.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2021-03-06", "action": "S.Amdt.1031 Amendment SA 1031 proposed by Senator Lankford to Amendment SA 891. (consideration: CR S1247; text: CR S1295-1300) To improve the bill.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2021-03-06", "action": "S.Amdt.1031 Point of order that the amendment violates section 313(b)(1)(D) of the CBA raised in Senate with respect to amendment SA 1031.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2021-03-06", "action": "S.Amdt.1031 Motion to waive all applicable budgetary discipline with respect to amendment SA 1031 rejected in Senate by Yea-Nay Vote. 52 - 47. Record Vote Number: 94.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2021-03-06", "action": "S.Amdt.1031 Amendment SA 1031 ruled out of order by the chair.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2021-03-06", "action": "S.Amdt.969 Amendment SA 969 proposed by Senator Cruz to Amendment SA 891. (consideration: CR S1247-1249; text: CR S1248) To provide children with an option for in-classroom education instruction if the child's local public school does not commit to re-opening to 5-day-a-week, in-classroom instruction for the remainder of the current school year and the 2021-2022 school year.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2021-03-06", "action": "S.Amdt.969 Amendment SA 969 not agreed to in Senate by Yea-Nay Vote. 49 - 50. Record Vote Number: 95.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2021-03-06", "action": "S.Amdt.1364 Amendment SA 1364 proposed by Senator Romney to Amendment SA 891. (consideration: CR S1249-1250; text: CR S1385-1386) To provide relief for State and local governments based on demonstrated need.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2021-03-06", "action": "S.Amdt.1364 Amendment SA 1364 not agreed to in Senate by Yea-Nay Vote. 49 - 50. Record Vote Number: 96.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2021-03-06", "action": "S.Amdt.1386 Amendment SA 1386 proposed by Senator Tuberville to Amendment SA 891. (consideration: CR S1250-1251; text: CR S1250) To prohibit funds made available under title II to States, local educational agencies, and institutions of higher education that permit any student whose biological sex is male to participate in an athletic program or activity designated for women or girls.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2021-03-06", "action": "S.Amdt.1386 Point of order that the amendment violates section 313(b)(1)(D) of the CBA raised in Senate with respect to amendment SA 1386.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2021-03-06", "action": "S.Amdt.1386 Motion to waive all applicable budgetary discipline with respect to amendment SA 1386 rejected in Senate by Yea-Nay Vote. 49 - 50. Record Vote Number: 97.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2021-03-06", "action": "S.Amdt.1386 Amendment SA 1386 ruled out of order by the chair.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2021-03-06", "action": "Motion by Senator Hagerty to commit to Senate Committee on Environment and Public Works with instructions made in Senate.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2021-03-06", "action": "Motion by Senator Hagerty to commit to Senate Committee on Agriculture, Nutrition, and Forestry with instructions made in Senate.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2021-03-06", "action": "Motion by Senator Hagerty to commit to Senate Committee on Health, Education, Labor, and Pensions with instructions made in Senate.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2021-03-06", "action": "Motion by Senator Hagerty to commit to Senate Committee on Banking, Housing, and Urban Affairs with instructions made in Senate.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2021-03-06", "action": "Motion by Senator Hagerty to commit to Senate Committee on Homeland Security and Governmental Affairs with instructions made in Senate.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2021-03-06", "action": "Motion by Senator Hagerty to commit to Senate Committee on Small Business and Entrepreneurship with instructions made in Senate.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2021-03-06", "action": "Motion by Senator Hagerty to commit to Senate Committee on Commerce, Science, and Transportation with instructions made in Senate.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2021-03-06", "action": "Motion by Senator Hagerty to commit to Senate Committee on Veterans' Affairs with instructions made in Senate.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2021-03-06", "action": "Motion by Senator Hagerty to commit to Senate Committee on Finance with instructions made in Senate.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2021-03-06", "action": "Motion by Senator Hagerty to commit to Senate Committee on Foreign Relations with instructions made in Senate.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2021-03-06", "action": "Motion by Senator Hagerty to commit to Senate Committee on Indian Affairs with instructions made in Senate.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2021-03-06", "action": "Motion by Senator Hagerty to commit to Senate Committees on Environment and Public Works; Agriculture, Nutrition, and Forestry; Health, Education, Labor, and Pensions; Banking, Housing, and Urban Affairs; Homeland Security and Governmental Affairs; Small Business and Entrepreneurship; Commerce, Science, and Transportation; Veterans' Affairs; Finance; Foreign Relations; Indian Affairs; each with instructions (11 motions considered en bloc) rejected in Senate by Yea-Nay Vote. 49 - 50. Record Vote Number: 98.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2021-03-06", "action": "Motion by Senator Kennedy to commit to Senate Committee on Small Business and Entrepreneurship with instructions rejected in Senate by Yea-Nay Vote. 48 - 50. Record Vote Number: 99.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2021-03-06", "action": "Motion by Senator Scott FL, to commit to Senate Committee on Homeland Security and Governmental Affairs with instructions rejected in Senate by Yea-Nay Vote. 48 - 51. Record Vote Number: 100.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2021-03-06", "action": "S.Amdt.1381 Amendment SA 1381 proposed by Senator Lee to Amendment SA 891. (consideration: CR S1255-1256; text: CR S1394-1398) To modify the provisions relating to the child tax credit and to strike the provisions relating to dependent care assistance.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2021-03-06", "action": "S.Amdt.1381 Amendment SA 1381 not agreed to in Senate by Yea-Nay Vote. 49 - 50. Record Vote Number: 101.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2021-03-06", "action": "Motion by Senator Cornyn to commit to Senate Committee on Health, Education, Labor, and Pensions with instructions rejected in Senate by Yea-Nay Vote. 49 - 50. Record Vote Number: 102.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2021-03-06", "action": "S.Amdt.1162 Amendment SA 1162 proposed by Senator Cassidy to Amendment SA 891. (consideration: CR S1256-1257; text: CR S1256) To ensure that the 2021 Recovery Rebates are not provided to prisoners.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2021-03-06", "action": "S.Amdt.1162 Amendment SA 1162 not agreed to in Senate by Yea-Nay Vote. 49 - 50. Record Vote Number: 103.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2021-03-06", "action": "S.Amdt.968 Amendment SA 968 proposed by Senator Cruz to Amendment SA 891. (consideration: CR S1257-1258; text: CR S1257) To ensure that the 2021 Recovery Rebates are not provided to illegal immigrants.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2021-03-06", "action": "S.Amdt.968 Amendment SA 968 not agreed to in Senate by Yea-Nay Vote. 49 - 50. Record Vote Number: 104.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2021-03-06", "action": "S.Amdt.1331 Amendment SA 1331 proposed by Senator Lee to Amendment SA 891. (consideration: CR S1258; text: CR S1258) To limit the expansion of premium assistance for households above 500 percent of the federal poverty line.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2021-03-06", "action": "S.Amdt.1331 Amendment SA 1331 not agreed to in Senate by Yea-Nay Vote. 49 - 50. Record Vote Number: 105.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2021-03-06", "action": "S.Amdt.902 Amendment SA 902 proposed by Senator Grassley. (consideration: CR S1258-1259; text: CR S1258-1259) To provide funding for payments for losses of crops due to disasters.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2021-03-06", "action": "S.Amdt.902 Amendment SA 902 not agreed to in Senate by Yea-Nay Vote. 45 - 54. Record Vote Number: 106.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2021-03-06", "action": "S.Amdt.1154 Amendment SA 1154 proposed by Senator Moran to Amendment SA 891. (consideration: CR S1259-1260; text: CR S1259) To increase the availability of amounts for the Veterans Community Care Program of the Department of Veterans Affairs.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2021-03-06", "action": "S.Amdt.1154 Amendment SA 1154 not agreed to in Senate by Yea-Nay Vote. 49 - 50. Record Vote Number: 107.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2021-03-06", "action": "S.Amdt.1233 Amendment SA 1233 proposed by Senator Murkowski to Amendment SA 891. (consideration: CR S1260; text: CR S1260) To use $800,000,000 of the Elementary and Secondary School Emergency Relief Fund to identify and provide homeless children and youth with wrap-around services in light of the challenges of COVID-19 and other assistance.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2021-03-06", "action": "S.Amdt.1233 Amendment SA 1233 agreed to in Senate by Voice Vote.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2021-03-06", "action": "Motion by Senator Daines to commit to Senate Committee on Foreign Relations with instructions rejected in Senate by Yea-Nay Vote. 49 - 50. Record Vote Number: 108.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2021-03-06", "action": "S.Amdt.1391 Amendment SA 1391 proposed by Senator Warner to Amendment SA 891. (consideration: CR S1261; text: CR S1261) To extend the authority for Federal contractors to reimburse employees unable to perform work due to the COVID-19 pandemic from March 31, 2021, to September 30, 2021.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2021-03-06", "action": "S.Amdt.1391 Amendment SA 1391 agreed to in Senate by Yea-Nay Vote. 93 - 6. Record Vote Number: 109.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2021-03-06", "action": "S.Amdt.1398 Amendment SA 1398 proposed by Senator Schumer to Amendment SA 891. (consideration: CR S1261-1262; text: CR S1401-1406) To improve the bill.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2021-03-06", "action": "S.Amdt.1398 Amendment SA 1398 agreed to in Senate by Voice Vote.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2021-03-06", "action": "S.Amdt.891 Amendment SA 891, as amended, agreed to in Senate by Voice Vote.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2021-03-06", "action": "Passed Senate with an amendment by Yea-Nay Vote. 50 - 49. Record Vote Number: 110.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2021-03-09", "action": "Message on Senate action sent to the House.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2021-03-10", "action": "Mr. Yarmuth moved that the House concur in the Senate amendment. (consideration: CR H1196-1286)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2021-03-10", "action": "DEBATE - Pursuant to the provisions of H. Res. 198, the House proceeded with 2 hours of debate on the motion to concur in the Senate amendment to H.R. 1319.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2021-03-10", "action": "The previous question was ordered pursuant to the rule.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2021-03-10", "action": "On motion that the House agree in the Senate amendment Agreed to by the Yeas and Nays: 220 - 211 (Roll no. 72). (text: CR H1196-1259)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2021-03-10", "action": "Motion to reconsider laid on the table Agreed to without objection.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2021-03-10", "action": "Presented to President.", "chamber": "H", "chamber_id": 114, "importance": 1}, {"date": "2021-03-11", "action": "Signed by President.", "chamber": "H", "chamber_id": 114, "importance": 1}, {"date": "2021-03-11", "action": "Became Public Law No: 117-2.", "chamber": "H", "chamber_id": 114, "importance": 1}], "sponsors": [{"people_id": 9150, "person_hash": "3qjpf56t", "party_id": "1", "state_id": 52, "party": "D", "role_id": 1, "role": "Rep", "name": "John Yarmuth", "first_name": "John", "middle_name": "A.", "last_name": "Yarmuth", "suffix": "", "nickname": "", "district": "HD-KY-3", "ftm_eid": 7155937, "votesmart_id": 58579, "opensecrets_id": "N00028073", "knowwho_pid": 248302, "ballotpedia": "John_Yarmuth", "sponsor_type_id": 1, "sponsor_order": 1, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}], "sasts": [{"type_id": 8, "type": "Related", "sast_bill_number": "HB325", "sast_bill_id": 1408708}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB603", "sast_bill_id": 1429388}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB637", "sast_bill_id": 1433327}, {"type_id": 8, "type": "Related", "sast_bill_number": "SB53", "sast_bill_id": 1424603}, {"type_id": 8, "type": "Related", "sast_bill_number": "SB134", "sast_bill_id": 1429163}, {"type_id": 8, "type": "Related", "sast_bill_number": "HR166", "sast_bill_id": 1469066}, {"type_id": 8, "type": "Related", "sast_bill_number": "HR176", "sast_bill_id": 1470437}, {"type_id": 2, "type": "Similar To", "sast_bill_number": "HR179", "sast_bill_id": 1470518}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB871", "sast_bill_id": 1439705}, {"type_id": 8, "type": "Related", "sast_bill_number": "HR198", "sast_bill_id": 1477210}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB919", "sast_bill_id": 1441618}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB926", "sast_bill_id": 1441678}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB934", "sast_bill_id": 1441685}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB942", "sast_bill_id": 1441586}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB952", "sast_bill_id": 1441793}, {"type_id": 8, "type": "Related", "sast_bill_number": "SB149", "sast_bill_id": 1434931}, {"type_id": 8, "type": "Related", "sast_bill_number": "SB369", "sast_bill_id": 1462535}, {"type_id": 8, "type": "Related", "sast_bill_number": "SB460", "sast_bill_id": 1466806}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB1139", "sast_bill_id": 1457055}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB1000", "sast_bill_id": 1450169}, {"type_id": 8, "type": "Related", "sast_bill_number": "SB496", "sast_bill_id": 1470436}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB1410", "sast_bill_id": 1469079}, {"type_id": 8, "type": "Related", "sast_bill_number": "SB639", "sast_bill_id": 1477228}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB1683", "sast_bill_id": 1477241}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB1609", "sast_bill_id": 1475868}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB1719", "sast_bill_id": 1477207}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB1720", "sast_bill_id": 1477274}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB1724", "sast_bill_id": 1477218}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB1725", "sast_bill_id": 1477244}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB1669", "sast_bill_id": 1477214}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB1682", "sast_bill_id": 1477278}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB1706", "sast_bill_id": 1477251}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB1668", "sast_bill_id": 1475941}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB1710", "sast_bill_id": 1477185}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB1708", "sast_bill_id": 1477236}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB2360", "sast_bill_id": 1491594}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB3254", "sast_bill_id": 1509444}], "subjects": [{"subject_id": 13124, "subject_name": "Economics and public finance"}, {"subject_id": 13126, "subject_name": "Administrative law and regulatory procedures"}, {"subject_id": 13348, "subject_name": "Adoption and foster care"}, {"subject_id": 13128, "subject_name": "Aging"}, {"subject_id": 13905, "subject_name": "Agricultural education"}, {"subject_id": 13818, "subject_name": "Agricultural prices, subsidies, credit"}, {"subject_id": 13612, "subject_name": "Agricultural trade"}, {"subject_id": 13780, "subject_name": "Alaska Natives and Hawaiians"}, {"subject_id": 13133, "subject_name": "American Samoa"}, {"subject_id": 13881, "subject_name": "Animal and plant health"}, {"subject_id": 13134, "subject_name": "Appropriations"}, {"subject_id": 13781, "subject_name": "Assault and harassment offenses"}, {"subject_id": 13783, "subject_name": "Cardiovascular and respiratory health"}, {"subject_id": 13489, "subject_name": "Caribbean area"}, {"subject_id": 13668, "subject_name": "Child care and development"}, {"subject_id": 13142, "subject_name": "Child health"}, {"subject_id": 13763, "subject_name": "Community life and organization"}, {"subject_id": 13144, "subject_name": "Computers and information technology"}, {"subject_id": 13638, "subject_name": "Consumer Product Safety Commission"}, {"subject_id": 13147, "subject_name": "Consumer affairs"}, {"subject_id": 13149, "subject_name": "Corporation for National and Community Service"}, {"subject_id": 13433, "subject_name": "Correctional facilities and imprisonment"}, {"subject_id": 13406, "subject_name": "Crime victims"}, {"subject_id": 13151, "subject_name": "Department of Agriculture"}, {"subject_id": 13152, "subject_name": "Department of Commerce"}, {"subject_id": 13156, "subject_name": "Department of Health and Human Services"}, {"subject_id": 13160, "subject_name": "Department of Labor"}, {"subject_id": 13166, "subject_name": "Disability and paralysis"}, {"subject_id": 13385, "subject_name": "Disability assistance"}, {"subject_id": 13439, "subject_name": "Disaster relief and insurance"}, {"subject_id": 13167, "subject_name": "District of Columbia"}, {"subject_id": 13660, "subject_name": "Domestic violence and child abuse"}, {"subject_id": 81058, "subject_name": "Drug therapy"}, {"subject_id": 13307, "subject_name": "Drug, alcohol, tobacco use"}, {"subject_id": 13170, "subject_name": "Education of the disadvantaged"}, {"subject_id": 13171, "subject_name": "Education programs funding"}, {"subject_id": 13172, "subject_name": "Educational facilities and institutions"}, {"subject_id": 13534, "subject_name": "Educational technology and distance education"}, {"subject_id": 13174, "subject_name": "Elementary and secondary education"}, {"subject_id": 13308, "subject_name": "Emergency medical services and trauma care"}, {"subject_id": 13175, "subject_name": "Employee benefits and pensions"}, {"subject_id": 13178, "subject_name": "Employment taxes"}, {"subject_id": 13179, "subject_name": "Energy assistance for the poor and aged"}, {"subject_id": 13740, "subject_name": "Environmental health"}, {"subject_id": 13184, "subject_name": "Executive agency funding and structure"}, {"subject_id": 13622, "subject_name": "Family planning and birth control"}, {"subject_id": 13634, "subject_name": "Federal Communications Commission (FCC)"}, {"subject_id": 13787, "subject_name": "Food and Drug Administration (FDA)"}, {"subject_id": 13190, "subject_name": "Food assistance and relief"}, {"subject_id": 13511, "subject_name": "Food industry and services"}, {"subject_id": 13521, "subject_name": "Food supply, safety, and labeling"}, {"subject_id": 13456, "subject_name": "Foreign aid and international relief"}, {"subject_id": 22689, "subject_name": "Foreign language and bilingual programs"}, {"subject_id": 22687, "subject_name": "Forests, forestry, trees"}, {"subject_id": 13506, "subject_name": "Genetics"}, {"subject_id": 13198, "subject_name": "Government employee pay, benefits, personnel management"}, {"subject_id": 13202, "subject_name": "Government lending and loan guarantees"}, {"subject_id": 22688, "subject_name": "Government studies and investigations"}, {"subject_id": 13203, "subject_name": "Government trust funds"}, {"subject_id": 13204, "subject_name": "Guam"}, {"subject_id": 13206, "subject_name": "Health care costs and insurance"}, {"subject_id": 13207, "subject_name": "Health care coverage and access"}, {"subject_id": 13209, "subject_name": "Health facilities and institutions"}, {"subject_id": 13210, "subject_name": "Health information and medical records"}, {"subject_id": 13211, "subject_name": "Health personnel"}, {"subject_id": 13212, "subject_name": "Health programs administration and funding"}, {"subject_id": 13213, "subject_name": "Health promotion and preventive care"}, {"subject_id": 13214, "subject_name": "Health technology, devices, supplies"}, {"subject_id": 13215, "subject_name": "Higher education"}, {"subject_id": 13216, "subject_name": "Home and outpatient care"}, {"subject_id": 13217, "subject_name": "Homelessness and emergency shelter"}, {"subject_id": 13219, "subject_name": "Housing and community development funding"}, {"subject_id": 13704, "subject_name": "Housing supply and affordability"}, {"subject_id": 13222, "subject_name": "Humanities programs funding"}, {"subject_id": 81056, "subject_name": "Immunology and vaccination"}, {"subject_id": 13228, "subject_name": "Indian social and development programs"}, {"subject_id": 13706, "subject_name": "Infectious and parasitic diseases"}, {"subject_id": 13232, "subject_name": "International organizations and cooperation"}, {"subject_id": 13233, "subject_name": "Internet and video services"}, {"subject_id": 13234, "subject_name": "Labor standards"}, {"subject_id": 327373, "subject_name": "Landlord and tenant"}, {"subject_id": 13236, "subject_name": "Law enforcement administration and funding"}, {"subject_id": 13469, "subject_name": "Law enforcement officers"}, {"subject_id": 13389, "subject_name": "Libraries and archives"}, {"subject_id": 13552, "subject_name": "Livestock"}, {"subject_id": 13237, "subject_name": "Long-term, rehabilitative, and terminal care"}, {"subject_id": 13238, "subject_name": "Low- and moderate-income housing"}, {"subject_id": 13607, "subject_name": "Meat"}, {"subject_id": 13239, "subject_name": "Medicaid"}, {"subject_id": 13240, "subject_name": "Medical education"}, {"subject_id": 13313, "subject_name": "Medical tests and diagnostic methods"}, {"subject_id": 13314, "subject_name": "Mental health"}, {"subject_id": 13484, "subject_name": "Military personnel and dependents"}, {"subject_id": 13485, "subject_name": "Military procurement, research, weapons development"}, {"subject_id": 13848, "subject_name": "Minority and disadvantaged businesses"}, {"subject_id": 13635, "subject_name": "Minority education"}, {"subject_id": 13560, "subject_name": "Museums, exhibitions, cultural centers"}, {"subject_id": 13250, "subject_name": "National Foundation on the Arts and the Humanities"}, {"subject_id": 13254, "subject_name": "National and community service"}, {"subject_id": 13255, "subject_name": "Northern Mariana Islands"}, {"subject_id": 13730, "subject_name": "Nursing"}, {"subject_id": 13315, "subject_name": "Nutrition and diet"}, {"subject_id": 13259, "subject_name": "Poverty and welfare assistance"}, {"subject_id": 13752, "subject_name": "Preschool education"}, {"subject_id": 13490, "subject_name": "Prescription drugs"}, {"subject_id": 13640, "subject_name": "Product safety and quality"}, {"subject_id": 13263, "subject_name": "Puerto Rico"}, {"subject_id": 13272, "subject_name": "Rural conditions and development"}, {"subject_id": 13878, "subject_name": "Seafood"}, {"subject_id": 13726, "subject_name": "Sex offenses"}, {"subject_id": 13276, "subject_name": "Small business"}, {"subject_id": 13280, "subject_name": "Social work, volunteer service, charitable organizations"}, {"subject_id": 13281, "subject_name": "Solid waste and recycling"}, {"subject_id": 13285, "subject_name": "State and local government operations"}, {"subject_id": 13286, "subject_name": "Student aid and college costs"}, {"subject_id": 13287, "subject_name": "Teaching, teachers, curricula"}, {"subject_id": 13288, "subject_name": "Telecommunication rates and fees"}, {"subject_id": 13491, "subject_name": "U.S. territories and protectorates"}, {"subject_id": 13646, "subject_name": "Urban and suburban affairs and development"}, {"subject_id": 13648, "subject_name": "User charges and fees"}, {"subject_id": 13296, "subject_name": "Virgin Islands"}, {"subject_id": 13297, "subject_name": "Wages and earnings"}, {"subject_id": 13299, "subject_name": "Water resources funding"}, {"subject_id": 13394, "subject_name": "Water use and supply"}, {"subject_id": 13302, "subject_name": "Women's health"}, {"subject_id": 13468, "subject_name": "Worker safety and health"}, {"subject_id": 13863, "subject_name": "World health"}, {"subject_id": 13384, "subject_name": "Administrative remedies"}, {"subject_id": 13874, "subject_name": "Adult day care"}, {"subject_id": 13400, "subject_name": "Advanced technology and technological innovations"}, {"subject_id": 13127, "subject_name": "Advisory bodies"}, {"subject_id": 13135, "subject_name": "Aviation and airports"}, {"subject_id": 21946, "subject_name": "Business expenses"}, {"subject_id": 13139, "subject_name": "Business investment and capital"}, {"subject_id": 21409, "subject_name": "Cemeteries and funerals"}, {"subject_id": 13322, "subject_name": "Civil actions and liability"}, {"subject_id": 13145, "subject_name": "Congressional agencies"}, {"subject_id": 13479, "subject_name": "Credit and credit markets"}, {"subject_id": 13154, "subject_name": "Department of Education"}, {"subject_id": 13157, "subject_name": "Department of Homeland Security"}, {"subject_id": 13158, "subject_name": "Department of Housing and Urban Development"}, {"subject_id": 13162, "subject_name": "Department of Transportation"}, {"subject_id": 13163, "subject_name": "Department of Veterans Affairs"}, {"subject_id": 13165, "subject_name": "Department of the Treasury"}, {"subject_id": 13169, "subject_name": "Economic performance and conditions"}, {"subject_id": 13502, "subject_name": "Employee leave"}, {"subject_id": 13176, "subject_name": "Employment and training programs"}, {"subject_id": 20754, "subject_name": "Family services"}, {"subject_id": 13810, "subject_name": "Federal Emergency Management Agency (FEMA)"}, {"subject_id": 13309, "subject_name": "Fraud offenses and financial crimes"}, {"subject_id": 13195, "subject_name": "Government Accountability Office (GAO)"}, {"subject_id": 13220, "subject_name": "Housing finance and home ownership"}, {"subject_id": 13408, "subject_name": "Human trafficking"}, {"subject_id": 13224, "subject_name": "Income tax credits"}, {"subject_id": 13226, "subject_name": "Income tax exclusion"}, {"subject_id": 13493, "subject_name": "Inflation and prices"}, {"subject_id": 13368, "subject_name": "Internal Revenue Service (IRS)"}, {"subject_id": 13701, "subject_name": "Manufacturing"}, {"subject_id": 13488, "subject_name": "Marriage and family status"}, {"subject_id": 13242, "subject_name": "Medicare"}, {"subject_id": 13774, "subject_name": "National Railroad Passenger Corporation (Amtrak)"}, {"subject_id": 13766, "subject_name": "Performing arts"}, {"subject_id": 13261, "subject_name": "Public housing"}, {"subject_id": 13262, "subject_name": "Public transit"}, {"subject_id": 13264, "subject_name": "Railroad Retirement Board"}, {"subject_id": 13265, "subject_name": "Railroads"}, {"subject_id": 13749, "subject_name": "Saint Lawrence Seaway"}, {"subject_id": 13274, "subject_name": "Separation, divorce, custody, support"}, {"subject_id": 13317, "subject_name": "Smuggling and trafficking"}, {"subject_id": 13284, "subject_name": "State and local finance"}, {"subject_id": 13319, "subject_name": "Tax administration and collection, taxpayers"}, {"subject_id": 13672, "subject_name": "Tax treatment of families"}, {"subject_id": 13801, "subject_name": "Temporary and part-time employment"}, {"subject_id": 13361, "subject_name": "Transportation employees"}, {"subject_id": 13291, "subject_name": "Transportation programs funding"}, {"subject_id": 13293, "subject_name": "Unemployment"}, {"subject_id": 13294, "subject_name": "Veterans' education, employment, rehabilitation"}, {"subject_id": 13295, "subject_name": "Veterans' medical care"}, {"subject_id": 81057, "subject_name": "Vocational and technical education"}, {"subject_id": 13131, "subject_name": "Air quality"}, {"subject_id": 21500, "subject_name": "Climate change and greenhouse gases"}, {"subject_id": 13641, "subject_name": "Environmental regulatory procedures"}, {"subject_id": 13424, "subject_name": "International law and treaties"}, {"subject_id": 13187, "subject_name": "Financial services and investments"}, {"subject_id": 13316, "subject_name": "Sales and excise taxes"}, {"subject_id": 13137, "subject_name": "Broadcasting, cable, digital technologies"}, {"subject_id": 13828, "subject_name": "Corporation for Public Broadcasting"}, {"subject_id": 13514, "subject_name": "Federal Trade Commission (FTC)"}, {"subject_id": 13253, "subject_name": "National Science Foundation"}, {"subject_id": 13421, "subject_name": "Navigation, waterways, harbors"}, {"subject_id": 13669, "subject_name": "Television and film"}, {"subject_id": 13260, "subject_name": "Public contracts and procurement"}, {"subject_id": 354151, "subject_name": "Internet, web applications, social media"}], "texts": [{"doc_id": 2311974, "date": "2021-02-25", "type": "Introduced", "type_id": 1, "mime": "application/pdf", "mime_id": 2, "url": "https://legiscan.com/US/text/HB1319/id/2311974", "state_link": "https://www.congress.gov/117/bills/hr1319/BILLS-117hr1319rh.pdf", "text_size": 1207964, "text_hash": "6900ede07d4dbf8d72464c61e5461c77"}, {"doc_id": 2320786, "date": "2021-03-03", "type": "Introduced", "type_id": 1, "mime": "application/pdf", "mime_id": 2, "url": "https://legiscan.com/US/text/HB1319/id/2320786", "state_link": "https://www.congress.gov/117/bills/hr1319/BILLS-117hr1319pcs.pdf", "text_size": 1236362, "text_hash": "3480de7ce0fc2c0a9c42b6a453867a81"}, {"doc_id": 2320787, "date": "2021-03-03", "type": "Engrossed", "type_id": 4, "mime": "application/pdf", "mime_id": 2, "url": "https://legiscan.com/US/text/HB1319/id/2320787", "state_link": "https://www.congress.gov/117/bills/hr1319/BILLS-117hr1319eh.pdf", "text_size": 1081154, "text_hash": "5b0be54b13404e4ac548586bdba1366b"}, {"doc_id": 2329142, "date": "2021-03-09", "type": "Amended", "type_id": 3, "mime": "application/pdf", "mime_id": 2, "url": "https://legiscan.com/US/text/HB1319/id/2329142", "state_link": "https://www.congress.gov/117/bills/hr1319/BILLS-117hr1319eas.pdf", "text_size": 1099878, "text_hash": "c4e44e2413aedd34bfc8b4b2d366e4b4"}, {"doc_id": 2331255, "date": "2021-03-11", "type": "Enrolled", "type_id": 5, "mime": "application/pdf", "mime_id": 2, "url": "https://legiscan.com/US/text/HB1319/id/2331255", "state_link": "https://www.congress.gov/117/bills/hr1319/BILLS-117hr1319enr.pdf", "text_size": 697694, "text_hash": "28d5dfef6de5ea3dc3966c12466369ff"}], "votes": [{"roll_call_id": 1017386, "date": "2021-02-27", "desc": "On motion to recommit", "yea": 205, "nay": 218, "nv": 0, "absent": 8, "total": 431, "passed": 0, "chamber": "H", "chamber_id": 114, "url": "https://legiscan.com/US/rollcall/HB1319/id/1017386", "state_link": "https://clerk.house.gov/Votes/202148"}, {"roll_call_id": 1017387, "date": "2021-02-27", "desc": "On passage", "yea": 219, "nay": 212, "nv": 0, "absent": 1, "total": 432, "passed": 1, "chamber": "H", "chamber_id": 114, "url": "https://legiscan.com/US/rollcall/HB1319/id/1017387", "state_link": "https://clerk.house.gov/Votes/202149"}, {"roll_call_id": 1022553, "date": "2021-03-04", "desc": "Motion to proceed to consideration of measure RC# 73", "yea": 50, "nay": 50, "nv": 0, "absent": 0, "total": 100, "passed": 1, "chamber": "S", "chamber_id": 115, "url": "https://legiscan.com/US/rollcall/HB1319/id/1022553", "state_link": "https://www.senate.gov/legislative/LIS/roll_call_votes/vote1171/vote_117_1_00073.xml"}, {"roll_call_id": 1023098, "date": "2021-03-05", "desc": "Amendment SA 1092 S.Amdt.1092 RC# 76", "yea": 50, "nay": 49, "nv": 0, "absent": 1, "total": 100, "passed": 1, "chamber": "S", "chamber_id": 115, "url": "https://legiscan.com/US/rollcall/HB1319/id/1023098", "state_link": "https://www.senate.gov/legislative/LIS/roll_call_votes/vote1171/vote_117_1_00076.xml"}, {"roll_call_id": 1023099, "date": "2021-03-05", "desc": "Motion to waive all applicable budgetary discipline with respect to amendment SA 972 rejected in Senate S.Amdt.972 RC# 74", "yea": 42, "nay": 58, "nv": 0, "absent": 0, "total": 100, "passed": 0, "chamber": "S", "chamber_id": 115, "url": "https://legiscan.com/US/rollcall/HB1319/id/1023099", "state_link": "https://www.senate.gov/legislative/LIS/roll_call_votes/vote1171/vote_117_1_00074.xml"}, {"roll_call_id": 1023100, "date": "2021-03-06", "desc": "Amendment SA 1010 S.Amdt.1010 RC# 86", "yea": 49, "nay": 50, "nv": 0, "absent": 1, "total": 100, "passed": 0, "chamber": "S", "chamber_id": 115, "url": "https://legiscan.com/US/rollcall/HB1319/id/1023100", "state_link": "https://www.senate.gov/legislative/LIS/roll_call_votes/vote1171/vote_117_1_00086.xml"}, {"roll_call_id": 1023101, "date": "2021-03-06", "desc": "Amendment SA 1014 S.Amdt.1014 RC# 88", "yea": 47, "nay": 51, "nv": 0, "absent": 2, "total": 100, "passed": 0, "chamber": "S", "chamber_id": 115, "url": "https://legiscan.com/US/rollcall/HB1319/id/1023101", "state_link": "https://www.senate.gov/legislative/LIS/roll_call_votes/vote1171/vote_117_1_00088.xml"}, {"roll_call_id": 1023102, "date": "2021-03-06", "desc": "Amendment SA 1026 S.Amdt.1026 RC# 80", "yea": 48, "nay": 51, "nv": 0, "absent": 1, "total": 100, "passed": 0, "chamber": "S", "chamber_id": 115, "url": "https://legiscan.com/US/rollcall/HB1319/id/1023102", "state_link": "https://www.senate.gov/legislative/LIS/roll_call_votes/vote1171/vote_117_1_00080.xml"}, {"roll_call_id": 1023103, "date": "2021-03-06", "desc": "Amendment SA 1030 S.Amdt.1030 RC# 78", "yea": 49, "nay": 50, "nv": 0, "absent": 1, "total": 100, "passed": 0, "chamber": "S", "chamber_id": 115, "url": "https://legiscan.com/US/rollcall/HB1319/id/1023103", "state_link": "https://www.senate.gov/legislative/LIS/roll_call_votes/vote1171/vote_117_1_00078.xml"}, {"roll_call_id": 1023104, "date": "2021-03-06", "desc": "Amendment SA 1154 S.Amdt.1154 RC# 107", "yea": 49, "nay": 50, "nv": 0, "absent": 1, "total": 100, "passed": 0, "chamber": "S", "chamber_id": 115, "url": "https://legiscan.com/US/rollcall/HB1319/id/1023104", "state_link": "https://www.senate.gov/legislative/LIS/roll_call_votes/vote1171/vote_117_1_00107.xml"}, {"roll_call_id": 1023105, "date": "2021-03-06", "desc": "Amendment SA 1161 S.Amdt.1161 RC# 84", "yea": 49, "nay": 50, "nv": 0, "absent": 1, "total": 100, "passed": 0, "chamber": "S", "chamber_id": 115, "url": "https://legiscan.com/US/rollcall/HB1319/id/1023105", "state_link": "https://www.senate.gov/legislative/LIS/roll_call_votes/vote1171/vote_117_1_00084.xml"}, {"roll_call_id": 1023106, "date": "2021-03-06", "desc": "Amendment SA 1162 S.Amdt.1162 RC# 103", "yea": 49, "nay": 50, "nv": 0, "absent": 1, "total": 100, "passed": 0, "chamber": "S", "chamber_id": 115, "url": "https://legiscan.com/US/rollcall/HB1319/id/1023106", "state_link": "https://www.senate.gov/legislative/LIS/roll_call_votes/vote1171/vote_117_1_00103.xml"}, {"roll_call_id": 1023107, "date": "2021-03-06", "desc": "Amendment SA 1331 S.Amdt.1331 RC# 105", "yea": 49, "nay": 50, "nv": 0, "absent": 1, "total": 100, "passed": 0, "chamber": "S", "chamber_id": 115, "url": "https://legiscan.com/US/rollcall/HB1319/id/1023107", "state_link": "https://www.senate.gov/legislative/LIS/roll_call_votes/vote1171/vote_117_1_00105.xml"}, {"roll_call_id": 1023108, "date": "2021-03-06", "desc": "Amendment SA 1344 S.Amdt.1344 RC# 81", "yea": 51, "nay": 48, "nv": 0, "absent": 1, "total": 100, "passed": 1, "chamber": "S", "chamber_id": 115, "url": "https://legiscan.com/US/rollcall/HB1319/id/1023108", "state_link": "https://www.senate.gov/legislative/LIS/roll_call_votes/vote1171/vote_117_1_00081.xml"}, {"roll_call_id": 1023109, "date": "2021-03-06", "desc": "Amendment SA 1364 S.Amdt.1364 RC# 96", "yea": 49, "nay": 50, "nv": 0, "absent": 1, "total": 100, "passed": 0, "chamber": "S", "chamber_id": 115, "url": "https://legiscan.com/US/rollcall/HB1319/id/1023109", "state_link": "https://www.senate.gov/legislative/LIS/roll_call_votes/vote1171/vote_117_1_00096.xml"}, {"roll_call_id": 1023110, "date": "2021-03-06", "desc": "Amendment SA 1369 as modified S.Amdt.1369 RC# 82", "yea": 48, "nay": 51, "nv": 0, "absent": 1, "total": 100, "passed": 0, "chamber": "S", "chamber_id": 115, "url": "https://legiscan.com/US/rollcall/HB1319/id/1023110", "state_link": "https://www.senate.gov/legislative/LIS/roll_call_votes/vote1171/vote_117_1_00082.xml"}, {"roll_call_id": 1023111, "date": "2021-03-06", "desc": "Amendment SA 1378 S.Amdt.1378 RC# 79", "yea": 50, "nay": 49, "nv": 0, "absent": 1, "total": 100, "passed": 1, "chamber": "S", "chamber_id": 115, "url": "https://legiscan.com/US/rollcall/HB1319/id/1023111", "state_link": "https://www.senate.gov/legislative/LIS/roll_call_votes/vote1171/vote_117_1_00079.xml"}, {"roll_call_id": 1023112, "date": "2021-03-06", "desc": "Amendment SA 1381 S.Amdt.1381 RC# 101", "yea": 49, "nay": 50, "nv": 0, "absent": 1, "total": 100, "passed": 0, "chamber": "S", "chamber_id": 115, "url": "https://legiscan.com/US/rollcall/HB1319/id/1023112", "state_link": "https://www.senate.gov/legislative/LIS/roll_call_votes/vote1171/vote_117_1_00101.xml"}, {"roll_call_id": 1023113, "date": "2021-03-06", "desc": "Amendment SA 1383 S.Amdt.1383 RC# 89", "yea": 48, "nay": 50, "nv": 0, "absent": 2, "total": 100, "passed": 0, "chamber": "S", "chamber_id": 115, "url": "https://legiscan.com/US/rollcall/HB1319/id/1023113", "state_link": "https://www.senate.gov/legislative/LIS/roll_call_votes/vote1171/vote_117_1_00089.xml"}, {"roll_call_id": 1023114, "date": "2021-03-06", "desc": "Amendment SA 1391 S.Amdt.1391 RC# 109", "yea": 93, "nay": 6, "nv": 0, "absent": 1, "total": 100, "passed": 1, "chamber": "S", "chamber_id": 115, "url": "https://legiscan.com/US/rollcall/HB1319/id/1023114", "state_link": "https://www.senate.gov/legislative/LIS/roll_call_votes/vote1171/vote_117_1_00109.xml"}, {"roll_call_id": 1023115, "date": "2021-03-06", "desc": "Amendment SA 1395 S.Amdt.1395 RC# 91", "yea": 47, "nay": 51, "nv": 0, "absent": 2, "total": 100, "passed": 0, "chamber": "S", "chamber_id": 115, "url": "https://legiscan.com/US/rollcall/HB1319/id/1023115", "state_link": "https://www.senate.gov/legislative/LIS/roll_call_votes/vote1171/vote_117_1_00091.xml"}, {"roll_call_id": 1023116, "date": "2021-03-06", "desc": "Amendment SA 902 S.Amdt.902 RC# 106", "yea": 45, "nay": 54, "nv": 0, "absent": 1, "total": 100, "passed": 0, "chamber": "S", "chamber_id": 115, "url": "https://legiscan.com/US/rollcall/HB1319/id/1023116", "state_link": "https://www.senate.gov/legislative/LIS/roll_call_votes/vote1171/vote_117_1_00106.xml"}, {"roll_call_id": 1023117, "date": "2021-03-06", "desc": "Amendment SA 944 S.Amdt.944 RC# 87", "yea": 49, "nay": 50, "nv": 0, "absent": 1, "total": 100, "passed": 0, "chamber": "S", "chamber_id": 115, "url": "https://legiscan.com/US/rollcall/HB1319/id/1023117", "state_link": "https://www.senate.gov/legislative/LIS/roll_call_votes/vote1171/vote_117_1_00087.xml"}, {"roll_call_id": 1023118, "date": "2021-03-06", "desc": "Amendment SA 968 S.Amdt.968 RC# 104", "yea": 49, "nay": 50, "nv": 0, "absent": 1, "total": 100, "passed": 0, "chamber": "S", "chamber_id": 115, "url": "https://legiscan.com/US/rollcall/HB1319/id/1023118", "state_link": "https://www.senate.gov/legislative/LIS/roll_call_votes/vote1171/vote_117_1_00104.xml"}, {"roll_call_id": 1023119, "date": "2021-03-06", "desc": "Amendment SA 969 S.Amdt.969 RC# 95", "yea": 49, "nay": 50, "nv": 0, "absent": 1, "total": 100, "passed": 0, "chamber": "S", "chamber_id": 115, "url": "https://legiscan.com/US/rollcall/HB1319/id/1023119", "state_link": "https://www.senate.gov/legislative/LIS/roll_call_votes/vote1171/vote_117_1_00095.xml"}, {"roll_call_id": 1023120, "date": "2021-03-06", "desc": "Amendment SA 996 S.Amdt.996 RC# 93", "yea": 49, "nay": 50, "nv": 0, "absent": 1, "total": 100, "passed": 0, "chamber": "S", "chamber_id": 115, "url": "https://legiscan.com/US/rollcall/HB1319/id/1023120", "state_link": "https://www.senate.gov/legislative/LIS/roll_call_votes/vote1171/vote_117_1_00093.xml"}, {"roll_call_id": 1023121, "date": "2021-03-06", "desc": "Motion by Senator Capito to commit to Senate Committee on Finance with instructions rejected in Senate RC# 90", "yea": 48, "nay": 50, "nv": 0, "absent": 2, "total": 100, "passed": 0, "chamber": "S", "chamber_id": 115, "url": "https://legiscan.com/US/rollcall/HB1319/id/1023121", "state_link": "https://www.senate.gov/legislative/LIS/roll_call_votes/vote1171/vote_117_1_00090.xml"}, {"roll_call_id": 1023122, "date": "2021-03-06", "desc": "Motion by Senator Cornyn to commit to Senate Committee on Health, Education, Labor, and Pensions with instructions rejected in Senate RC# 102", "yea": 49, "nay": 50, "nv": 0, "absent": 1, "total": 100, "passed": 0, "chamber": "S", "chamber_id": 115, "url": "https://legiscan.com/US/rollcall/HB1319/id/1023122", "state_link": "https://www.senate.gov/legislative/LIS/roll_call_votes/vote1171/vote_117_1_00102.xml"}, {"roll_call_id": 1023123, "date": "2021-03-06", "desc": "Motion by Senator Cotton to commit to Senate Committee on Finance with instructions rejected in Senate RC# 92", "yea": 48, "nay": 50, "nv": 0, "absent": 2, "total": 100, "passed": 0, "chamber": "S", "chamber_id": 115, "url": "https://legiscan.com/US/rollcall/HB1319/id/1023123", "state_link": "https://www.senate.gov/legislative/LIS/roll_call_votes/vote1171/vote_117_1_00092.xml"}, {"roll_call_id": 1023124, "date": "2021-03-06", "desc": "Motion by Senator Daines to commit to Senate Committee on Foreign Relations with instructions rejected in Senate RC# 108", "yea": 49, "nay": 50, "nv": 0, "absent": 1, "total": 100, "passed": 0, "chamber": "S", "chamber_id": 115, "url": "https://legiscan.com/US/rollcall/HB1319/id/1023124", "state_link": "https://www.senate.gov/legislative/LIS/roll_call_votes/vote1171/vote_117_1_00108.xml"}, {"roll_call_id": 1023125, "date": "2021-03-06", "desc": "Motion by Senator Grassley to commit to Senate Committee on Finance with instructions rejected in Senate RC# 85", "yea": 49, "nay": 50, "nv": 0, "absent": 1, "total": 100, "passed": 0, "chamber": "S", "chamber_id": 115, "url": "https://legiscan.com/US/rollcall/HB1319/id/1023125", "state_link": "https://www.senate.gov/legislative/LIS/roll_call_votes/vote1171/vote_117_1_00085.xml"}, {"roll_call_id": 1023126, "date": "2021-03-06", "desc": "Motion by Senator Hagerty to commit to Senate Committees on Environment and Public Works; Agriculture, Nutrition, and Forestry; Health, Education, Labor, and Pensions; Banking, Housing, and Urban Affairs; Homeland Security and Governmental Affairs; Small ", "yea": 49, "nay": 50, "nv": 0, "absent": 1, "total": 100, "passed": 0, "chamber": "S", "chamber_id": 115, "url": "https://legiscan.com/US/rollcall/HB1319/id/1023126", "state_link": "https://www.senate.gov/legislative/LIS/roll_call_votes/vote1171/vote_117_1_00098.xml"}, {"roll_call_id": 1023127, "date": "2021-03-06", "desc": "Motion by Senator Kennedy to commit to Senate Committee on Small Business and Entrepreneurship with instructions rejected in Senate RC# 99", "yea": 48, "nay": 50, "nv": 0, "absent": 2, "total": 100, "passed": 0, "chamber": "S", "chamber_id": 115, "url": "https://legiscan.com/US/rollcall/HB1319/id/1023127", "state_link": "https://www.senate.gov/legislative/LIS/roll_call_votes/vote1171/vote_117_1_00099.xml"}, {"roll_call_id": 1023128, "date": "2021-03-06", "desc": "Motion by Senator Scott FL, to commit to Senate Committee on Homeland Security and Governmental Affairs with instructions rejected in Senate RC# 100", "yea": 48, "nay": 51, "nv": 0, "absent": 1, "total": 100, "passed": 0, "chamber": "S", "chamber_id": 115, "url": "https://legiscan.com/US/rollcall/HB1319/id/1023128", "state_link": "https://www.senate.gov/legislative/LIS/roll_call_votes/vote1171/vote_117_1_00100.xml"}, {"roll_call_id": 1023129, "date": "2021-03-06", "desc": "Motion to waive all applicable budgetary disciple with respect to amendment SA 1242 rejected in Senate S.Amdt.1242 RC# 77", "yea": 48, "nay": 51, "nv": 0, "absent": 1, "total": 100, "passed": 0, "chamber": "S", "chamber_id": 115, "url": "https://legiscan.com/US/rollcall/HB1319/id/1023129", "state_link": "https://www.senate.gov/legislative/LIS/roll_call_votes/vote1171/vote_117_1_00077.xml"}, {"roll_call_id": 1023130, "date": "2021-03-06", "desc": "Motion to waive all applicable budgetary discipline with respect to amendment SA 1031 rejected in Senate S.Amdt.1031 RC# 94", "yea": 52, "nay": 47, "nv": 0, "absent": 1, "total": 100, "passed": 0, "chamber": "S", "chamber_id": 115, "url": "https://legiscan.com/US/rollcall/HB1319/id/1023130", "state_link": "https://www.senate.gov/legislative/LIS/roll_call_votes/vote1171/vote_117_1_00094.xml"}, {"roll_call_id": 1023131, "date": "2021-03-06", "desc": "Motion to waive all applicable budgetary discipline with respect to amendment SA 1197 rejected in Senate S.Amdt.1197 RC# 83", "yea": 51, "nay": 48, "nv": 0, "absent": 1, "total": 100, "passed": 0, "chamber": "S", "chamber_id": 115, "url": "https://legiscan.com/US/rollcall/HB1319/id/1023131", "state_link": "https://www.senate.gov/legislative/LIS/roll_call_votes/vote1171/vote_117_1_00083.xml"}, {"roll_call_id": 1023132, "date": "2021-03-06", "desc": "Motion to waive all applicable budgetary discipline with respect to amendment SA 1386 rejected in Senate S.Amdt.1386 RC# 97", "yea": 49, "nay": 50, "nv": 0, "absent": 1, "total": 100, "passed": 0, "chamber": "S", "chamber_id": 115, "url": "https://legiscan.com/US/rollcall/HB1319/id/1023132", "state_link": "https://www.senate.gov/legislative/LIS/roll_call_votes/vote1171/vote_117_1_00097.xml"}, {"roll_call_id": 1023133, "date": "2021-03-06", "desc": "Passed Senate with an amendment RC# 110", "yea": 50, "nay": 49, "nv": 0, "absent": 1, "total": 100, "passed": 1, "chamber": "S", "chamber_id": 115, "url": "https://legiscan.com/US/rollcall/HB1319/id/1023133", "state_link": "https://www.senate.gov/legislative/LIS/roll_call_votes/vote1171/vote_117_1_00110.xml"}, {"roll_call_id": 1026277, "date": "2021-03-10", "desc": "On motion that the House concur in the Senate amendment", "yea": 220, "nay": 211, "nv": 0, "absent": 1, "total": 432, "passed": 1, "chamber": "H", "chamber_id": 114, "url": "https://legiscan.com/US/rollcall/HB1319/id/1026277", "state_link": "https://clerk.house.gov/Votes/202172"}], "amendments": [], "supplements": [], "calendar": [{"type_id": 1, "type": "Hearing", "date": "2021-03-09", "time": "12:00", "location": "</span>", "description": "House Committee on Rules Hearing"}]}}