{"status": "OK", "bill": {"bill_id": 1524543, "change_hash": "e8df92baef97bdaea9bd98924ebdd79f", "session_id": 1823, "session": {"session_id": 1823, "state_id": 52, "year_start": 2021, "year_end": 2022, "prefile": 0, "sine_die": 0, "prior": 0, "special": 0, "session_tag": "Regular Session", "session_title": "2021-2022 Regular Session", "session_name": "117th Congress"}, "url": "https://legiscan.com/US/bill/HB5376/2021", "state_link": "https://www.congress.gov/bill/117th-congress/house-bill/5376/all-info", "completed": 1, "status": 4, "status_date": "2022-08-16", "progress": [{"date": "2021-09-27", "event": 1}, {"date": "2022-08-02", "event": 2}, {"date": "2022-08-15", "event": 3}, {"date": "2022-08-16", "event": 4}, {"date": "2022-08-16", "event": 8}, {"date": "2022-08-16", "event": 4}], "state": "US", "state_id": 52, "bill_number": "HB5376", "bill_type": "B", "bill_type_id": "1", "body": "H", "body_id": 114, "current_body": "H", "current_body_id": 114, "title": "To provide for reconciliation pursuant to title II of S. Con. Res. 14.", "description": "TITLE I--COMMITTEE ON FINANCE Subtitle A--Deficit Reduction Part 1--Corporate Tax Reform (Sec. 10101) This act imposes an alternative minimum tax of 15% of the average annual adjusted financial statement income of domestic corporations (excluding Subchapter S corporations, regulated investment companies, and real estate investment trusts) that exceeds $1 billion over a specified 3-year period. The tax is effective in taxable years beginning after December 31, 2022. Part 2--Excise Tax on Repurchase of Corporate Stock (Sec. 10201) The act imposes a non-deductible 1% excise tax on the fair market value of stock repurchased by a publicly traded domestic corporation after 2022, with certain exceptions, including for repurchases that are part of a reorganization, are less than $1 million, that are contributed to certain tax-exempt retirement plans, or that are treated as a dividend. The tax applies to purchases of corporate stock by certain corporate subsidiaries and foreign corporations. Part 3--Funding the Internal Revenue Service and Improving Taxpayer Compliance (Sec. 10301) The act provides additional funding for the Internal Revenue Service for taxpayer services and enforcement, including for operations support, business systems modernization, and the development of a free direct e-file tax return system. It also provides additional funding for the Department of the Treasury Inspector General for Tax Administration, the Office of Tax Policy, the Tax Court, and Treasury departmental offices. Subtitle B--Prescription Drug Pricing Reform Part 1--Lowering Prices Through Drug Price Negotiation (Sec. 11001) The act requires the Centers for Medicare & Medicaid Services (CMS) to negotiate the prices of certain prescription drugs under Medicare beginning in 2026. Specifically, the CMS must negotiate maximum prices for brand-name drugs that do not have other generic equivalents and that account for the greatest Medicare spending. The CMS must negotiate the prices of 10 drugs that are covered under the Medicare prescription drug benefit in 2026, 15 drugs that are covered under the Medicare prescription drug benefit in 2027, 15 drugs that are covered under the Medicare prescription drug benefit or under Medicare medical services in 2028, and 20 drugs that are covered under the Medicare prescription drug benefit or under Medicare medical services in 2029 and each year thereafter. The selected drugs must be among the 50 drugs with the highest total spending over the most recent 12-month period under the Medicare prescription drug benefit or Medicare medical services and must have had market approval for at least 7 years (for drug products) or 11 years (for biologics). The act excludes (1) orphan drugs that are approved to treat only one rare disease or condition, (2) plasma-derived products, and (3) drugs that account for less than $200 million in annual Medicare spending (adjusted annually for inflation). The CMS must enter into agreements with drug manufacturers to negotiate prices; manufacturers must submit information relating to costs and other data as part of the negotiation process. Manufacturers that fail to comply with negotiation requirements are subject to civil penalties. (Sec. 11002) The CMS may delay negotiations for certain biologics with pending biosimilars for up to two years upon manufacturer request. (Sec. 11003) Drug manufacturers are subject to excise taxes for failing to comply with negotiation requirements, such as failing to furnish required information during the negotiation process. (Sec. 11004) The act provides funds for FY2022 for the CMS to implement this program. Part 2--Prescription Drug Inflation Rebates (Sec. 11101) In addition, the act requires drug manufacturers to issue rebates to the CMS for brand-name drugs without generic equivalents under Medicare medical services that cost $100 or more per year per individual and for which prices increase faster than inflation. Manufacturers that fail to comply are subject to civil penalties. The act provides funds through FY2031 for the CMS to implement this rebate program. (Sec. 11102) The act similarly requires drug manufacturers to issue rebates to the CMS for brand-name drugs without generic equivalents under the Medicare prescription drug benefit that cost $100 or more per year per individual and for which prices increase faster than inflation. Manufacturers that fail to comply are subject to civil penalties. The act provides funds through FY2031 for the CMS to implement this rebate program. Part 3--Part D Improvements and Maximum Out-of-Pocket Cap for Medicare Beneficiaries (Sec. 11201) The act eliminates beneficiary cost-sharing above the annual out-of-pocket spending threshold under the Medicare prescription drug benefit beginning in 2024 and caps annual out-of-pocket spending at $2,000 in 2025 (with annual adjustments thereafter). It also establishes a program under which drug manufacturers provide discounts to beneficiaries who have incurred costs above the annual deductible beginning in 2025. The act also limits base premiums under the Medicare prescription drug benefit for 2024 through 2030 to a 6% annual increase or the amount that would otherwise apply under the prior methodology, whichever is less. The act provides funds through FY2031 for the CMS to implement these changes and requirements. (Sec. 11202) The act also establishes a process through which beneficiaries, including those eligible for low-income subsidies, may have their monthly out-of-pocket costs capped and paid in monthly installments beginning in 2025; it provides funds for FY2023 for the CMS to implement this process. Part 4--Continued Delay of Implementation of Prescription Drug Rebate Rule (Sec. 11301) The act further delays until 2032 implementation of a Department of Health and Human Services rule relating to the treatment of certain Medicare prescription drug benefit rebates from drug manufacturers for purposes of federal anti-kickback laws. Part 5--Miscellaneous The act establishes a series of additional programs and requirements relating to coverage under the Medicare prescription drug benefit and other programs. (Sec. 11401) The act eliminates cost-sharing under the Medicare prescription drug benefit for adult vaccines that are recommended by the Advisory Committee on Immunization Practices. (Sec. 11402) Beginning July 1, 2024, the act limits payment under Medicare medical services for biosimilars that do not have an initial average sales price to the payment amount for the reference biologic or the amount that would otherwise apply under the prior methodology, whichever is less. (Sec. 11403) The act also temporarily increases payment for other biosimilars under Medicare medical services. (Sec. 11404) Beginning in 2024, the act expands eligibility under the low-income subsidy program of the Medicare prescription drug benefit to allow those with income of up to 150% of the federal poverty line to receive full premium subsidies and a $0 deductible. (Sec. 11405) It also requires coverage, without cost-sharing, of adult vaccines that are recommended by the Advisory Committee on Immunization Practices under Medicaid and the Children's Health Insurance Program (CHIP). (Sec. 11406) In addition, the act caps cost-sharing under the Medicare prescription drug benefit for a month's supply of covered insulin products at (1) for 2023 through 2025, $35; and (2) beginning in 2026, $35, 25% of the government's negotiated price, or 25% of the plan's negotiated price, whichever is less. The act provides funds for FY2022 for the CMS to implement these provisions. (Sec. 11407) The act also waives the deductible for insulin furnished through covered durable medical equipment under Medicare medical services and limits coinsurance to $35 for a month's supply of such insulin beginning July 1, 2023. (Sec. 11408) The act provides that a health insurance plan may still be considered a high deductible health plan even if it does not have a deductible for insulin products. Subtitle C--Affordable Care Act Subsidies (Sec. 12001) The act extends through 2025 certain adjustments and expansions of the premium tax credit, including to allow taxpayers with income above 400% of the federal poverty line to qualify for the credit. Subtitle D--Energy Security Part 1--Clean Electricity and Reducing Carbon Emissions (Sec. 13101) The act modifies and extends through 2024 the tax credit for producing electricity from renewable resources, specifically wind, biomass, geothermal and solar, landfill gas, trash, qualified hydropower, and marine and hydrokinetic resources. The act allows additional credit amounts for facilities that pay prevailing wages and meet registered apprenticeship requirements. The act also allows a bonus credit amount for facilities that meet domestic content requirements for certain steel, iron, and manufactured projects and for facilities located in an energy community (i.e., a brownfield site or an area with significant employment related to oil, gas, or coal activities). The act reduces the credit amount for facilities financed with tax-exempt bonds. (Sec. 13102) The act extends through 2024 the tax credit for investment in certain energy properties (e.g., solar, fuel cells, waste energy recovery, combined heat and power, small wind property, and microturbine property). It extends through 2034 the credit for geothermal heat pumps. The act extends the credit to include as energy property energy storage technology, qualified biogas property, electrochromic glass, and microgrid controllers. The act allows an increased credit rate for projects that pay prevailing wages and meet registered apprenticeship requirements. The act also allows a bonus credit amount for facilities that meet domestic content requirements for steel, iron, and manufactured projects and for facilities located in an energy community. (Sec. 13103) The act modifies the energy tax credit to allocate 1.8 gigawatts for environmental justice solar and wind capacity credits in low-income communities and Indian lands in 2023 and 2024. Facilities receiving allocations must be placed in service within four years after the allocation date. (Sec. 13104) The act extends until December 31, 2032, the construction deadline date for carbon capture or direct air capture facilities under the tax credit for carbon oxide sequestration. It also modifies the capacity requirements and base credit amounts for the credit. (Sec. 13105) The act creates a new tax credit for qualifying zero-emission nuclear electrical power produced and sold after December 31, 2023, and before 2033. Part 2--Clean Fuels (Sec. 13201) The act extends through 2024 the income tax credit for biodiesel and renewable diesel used as fuel, the biodiesel excise tax credit, the alternative fuels tax credit, and the second generation biofuel producer tax credit. (Sec. 13203) The act creates a new tax credit through 2024 for the sale or mixture of sustainable aviation fuel. The base amount of the credit is $1.25 per gallon, with additional amounts for greenhouse gas emission reductions. Producers and importers of such fuel must register with the Department of the Treasury. (Sec. 13204) The act creates a new tax credit for the production of qualified clean hydrogen during a specified 10-year period. The act defines qualified clean hydrogen as hydrogen that is produced through a process that results in a lifecycle greenhouse gas emissions rate of not greater than 4 kilograms of CO2e per kilogram of hydrogen. Part 3--Clean Energy and Efficiency Incentives for Individuals (Sec. 13301) The act extends through 2032 the tax credit for nonbusiness (residential) energy property expenditures. It increases the rate of the credit to 30% and allows an annual $1,200 limitation of the credit amount in lieu of a lifetime limitation. The act also allows an annual $2,000 credit for geothermal heat pumps and biomass stoves and increases the credit for windows and doors. The act also allows a 30% credit, up to $150, for home energy audits. The credit is renamed the energy efficient home improvement credit. (Sec. 13302) The act extends through 2034 the tax credit for residential clean energy, modifies the phaseout for such credit, and extends the credit to include qualified battery storage technology expenditures. (Sec. 13303) The act modifies the tax deduction for energy efficient commercial buildings to revise the maximum amount of such deduction and energy efficiency requirements for such buildings. (Sec. 13304) The act extends the new energy efficient home tax credit through 2032. It increases the credit to allow a $2,500 credit for new homes that meet certain Energy Star efficiency standards and a $5,000 credit for new homes that are certified as zero-energy ready homes, and further allows a credit for energy efficient multifamily dwellings. Part 4--Clean Vehicles (Sec. 13401) The act modifies requirements for the refundable income tax credit for qualifying plug-in electric vehicles. The modified credit is $3,750 for any vehicle meeting certain critical minerals requirements and $3,750 for vehicles meeting certain battery component requirements. The maximum allowable credit remains $7,500 per vehicle. Vehicles eligible for the credit include those made by qualified U.S. manufacturers and excludes those manufactured or assembled by a hostile foreign entity. The credit is not available to taxpayers whose modified adjusted gross income exceeds $150,000 ($300,000 for married couples filing jointly) The credit is not allowed for vehicles that have a manufacturer's suggested retail price in excess of $80,000 for vans, sport utility vehicles (SUVs), or pickup trucks, and $55,000 for other vehicles. The credit does not apply to vehicles placed in service after 2032. (Sec. 13402) The act allows a new tax credit for buyers of previously-owned qualified clean plug-in and fuel cell vehicles. The credit is limited to the lesser of $4,000 or 30% of the vehicle purchase price. The credit is disallowed for taxpayers whose modified adjusted gross income exceeds certain levels and applies only to vehicles with a sales price not exceeding $25,000. It does not apply to vehicles acquired after 2032. (Sec. 13403) The act creates a new tax credit for qualified commercial clean vehicles. The amount of the credit is the lesser of 15% of the cost of the vehicle (30% for vehicles not powered by a gasoline or diesel internal combustion engine), or (2) the cost of the vehicle in relation to a comparable vehicle. The credit amount may not exceed $7,500 for vehicles weighing less than 14,000 pounds ($40,000 for other vehicles). Eligible vehicles must have a battery capacity of not less than 15 kilowatt hours and be capable of being recharged from an external source of electricity. The credit does not apply to vehicles acquired after 2032. (Sec. 13404) The act modifies and extends through 2032 the tax credit for alternative fuel refueling property. Beginning in 2023, charging or refueling property is eligible for the credit only if it is placed in service within a low-income or rural area. Part 5--Investment in Clean Energy Manufacturing and Energy Security (Sec. 13501) The act provides addition allocations of the 30% qualifying advanced energy project tax credit for investments in projects that reequip, expand, or establish certain energy manufacturing facilities for the production or recycling of renewable energy property, energy storage systems and components, or other energy property. (Sec. 13502) The act creates a new tax credit for the production and sale of solar and wind components, with a phaseout through 2032. Part 6--Superfund (Sec. 13601) The act permanently reinstates the Hazardous Substance Superfund financing rate on domestic crude oil and imported petroleum products at 16.4 cents per barrel in 2023, adjusted annually thereafter for inflation. Part 7--Incentives for Clean Electricity and Clean Transportation (Sec. 13701) The act creates a new tax credit for the production of clean electricity. The credit is for the sale of domestically produced electricity with a greenhouse gas emission rate not greater than zero. To qualify for the credit, electricity must be produced at a qualifying facility placed in service after 2024. (Sec. 13702) The act creates a new clean electricity investment tax credit for investment in qualifying zero-emissions electricity generation facilities or energy storage technology. (Sec. 13703) The act allows a five-year recovery period for the depreciation of clean electricity facilities placed in service after 2024. (Sec. 13704) The act establishes a new tax credit for domestic clean fuel production beginning in 2025. Part 8--Credit Monetization and Appropriations (Sec. 13801) The act allows certain tax-exempt entities, including state and local governments and Indian tribal governments, to treat certain energy-related tax credit amounts as direct payments of tax. Part 9--Other Provisions (Sec. 13901) The act makes permanent the increased coal excise tax rate for funding the Black Lung Disability Trust Fund. (Sec. 13902) The act allows an increased offset of research tax credit amounts against the Social Security payroll taxes of small businesses that are less than 5 years old with less than $5 million in gross receipts. (Sec. 13903) The act reinstates the current-law suspension of the tax deduction for state and local taxes (i.e., 2018 through 2025). It also extends the limitation on the excess business losses of noncorporate taxpayers. TITLE II--COMMITTEE ON AGRICULTURE, NUTRITION, AND FORESTRY Subtitle A--General Provisions The act provides funding to the Department of Agriculture (USDA) for a variety of programs related to conservation and renewable energy. The funds under this title shall remain available through FY2031. Subtitle B--Conservation (Sec. 21001) Specifically, the act provides funding, subject to conditions, to USDA for the following voluntary conservation programs: the environmental quality incentives program, the conservation stewardship program, the agricultural conservation easement program, and the regional conservation partnership program. (Sec. 21002) It also provides funding to USDA's Natural Resources Conservation Service for (1) conservation technical assistance; and (2) a program to quantify carbon sequestration and carbon dioxide, methane, and nitrous oxide emissions. Subtitle C--Rural Development and Agricultural Credit In addition, the act provides funding to USDA for several programs that support the generation, storage, and use of renewable energy in rural communities. (Sec. 22001) Specifically, the act provides funding for the cost of loans under the Rural Electrification Act of 1936 to generate electricity from renewable sources for resale to rural and nonrural residents, including projects that store electricity. (Sec. 22002) The act also provides funding for the Rural Energy for America Program, under which USDA must provide financial assistance to agricultural producers and rural small businesses for renewable energy systems and energy efficiency projects, including grants and loans guaranteed by USDA for underutilized, renewable-energy technologies. (Sec. 22003) The act revises the Farm Security and Rural Investment Act of 2002 to provide funding for grants to increase the sale and use of agricultural commodity-based fuels through infrastructure improvements for blending, storing, supplying, or distributing biofuels. (Sec. 22004) It also provides funding to USDA for assisting the long-term resiliency, reliability, and affordability of rural electric systems. For example, USDA may provide financial assistance to electric cooperatives and other eligible entities for purchasing or deploying (1) renewable energy systems, (2) zero-emission systems, or (3) carbon capture and storage systems. Further, it provides financial assistance to such entities for making energy efficiency improvements to electric generation and transmission systems. (Sec. 22005) Additionally, the act provides funding to USDA for rural development administrative costs. (Sec. 22006) The act appropriates funding to USDA for assisting borrowers of certain direct or guaranteed loans administered by the Farm Service Agency whose agricultural operations are at financial risk. (Sec. 22007) The act revises the American Rescue Plan Act of 2021 to provide additional support for underserved farmers, ranchers, or forest landowners. Subtitle D--Forestry The act also provides funding to USDA for public and private forests. (Sec. 23001) Specifically, the act provides funding for the National Forest System, including funding for forest restoration, wildfire prevention, environmental reviews, and related activities. (Sec. 23002) Further, the act provides funding to USDA for grant programs under the Cooperative Forestry Assistance Act of 1978 to carry out climate mitigation or forest resilience practices, support the participation of underserved forest landowners in emerging private markets for climate mitigation or forest resilience, support the participation of forest landowners who own less than 2,500 acres of forest land in emerging private markets for climate mitigation or forest resilience, and support states and other entities in providing payments to owners of private forest land for the implementation of carbon sequestration and storage practices. The act also provides funding to USDA to support the wood innovation grant program under the Agriculture Improvement Act of 2018. (Sec. 23003) It also provides funding to USDA for grants to states through the Forest Legacy Program for the acquisition of land and interests in land, such as conservation easements. It also provides grants to states, local governments, Indian tribes, and other eligible entities for tree planting and related activities. (Sec. 23004) The act prohibits USDA from using any other available funds to satisfy obligations made under this subtitle. (Sec. 23005) Finally, the act provides funding to USDA for administrative costs. TITLE III--COMMITTEE ON BANKING, HOUSING, AND URBAN AFFAIRS (Sec. 30001) The act provides additional funding for the President to carry out activities under the Defense Production Act of 1950. That act confers on the President a broad set of authorities to influence domestic industry in order to provide essential materials and goods for the national defense. The funds shall remain available through FY2024. (Sec. 30002) In addition, the act provides funding to the Department of Housing and Urban Development for loans and grants. The loans and grants must fund projects that address affordable housing and climate change issues. For example, it provides funding, which shall remain available through FY2028, for projects that improve energy or water efficiency, projects that enhance indoor air quality or sustainability, projects that implement the use of zero-emission electricity generation, low-emission building materials or processes, energy storage, or building electrification strategies, or projects that address climate resilience. It also provides funding, which shall remain available through FY2028, for energy and water benchmarking of eligible property along with associated data analysis and evaluation at the property. Eligible property includes low-income housing or housing for the elderly or disabled. TITLE IV--COMMITTEE ON COMMERCE, SCIENCE, AND TRANSPORTATION The act provides funding for coastal communities, coastal and marine habitats, weather forecasting, and aviation technology. The funding shall remain available through FY2026. (Sec. 40001) Specifically, the act provides funding to the National Oceanic and Atmospheric Administration (NOAA) to provide financial or technical assistance to coastal states and other eligible entities for the conservation, restoration, and protection of coastal habitat, marine habitats, and marine fisheries in order to enable coastal communities prepare for extreme storms and other changing climate conditions. (Sec. 40002) It also provides funding for NOAA facilities (e.g., piers, fisheries laboratories, and national marine sanctuaries facilities). (Sec. 40003) Additionally, it provides funding to enable NOAA to conduct efficient, accurate, and timely reviews for planning, permitting, and approval processes as specified by the act. (Sec. 40004) The act also provides funding to NOAA for weather research and forecasting innovations. Specifically, it provides funding to accelerate advances and improvements in research, observation systems, modeling, forecasting, assessments, and dissemination of information to the public as it pertains to ocean and atmospheric processes related to weather, coasts, oceans, and climate. It also provides funding to carry out weather research and forecasting program under the Weather Research and Forecasting Innovation Act of 2017. Further, it provides funding for grants that support climate research relating to weather, ocean, coastal, and atmospheric processes and conditions as well as impacts to marine species and coastal habitats. (Sec. 40005) It also provides funding to NOAA for the procurement of additional high-performance computing, data processing capacity, data management, and storage assets. In addition, the act provides funding for certain projects under the High-Performance Computing Act of 1991, transaction agreements authorized under the Weather Research and Forecasting Innovation Act of 2017, and related administrative expenses. (Sec. 40006) Further, it provides funding for NOAA to acquire a hurricane hunter aircraft as backup for the capabilities of other hurricane aircraft. (Sec. 40007) In addition, the act provides funding to the Department of Transportation for a program that awards grants for projects that (1) produce, transport, blend, or store sustainable aviation fuel as defined by the act; or (2) develop, demonstrate, or apply low-emission aviation technologies. TITLE V--COMMITTEE ON ENERGY AND NATURAL RESOURCESSubtitle A--Energy Part 1--General Provisions The act provides funding to the Department of Energy (DOE) for a variety of programs concerning energy rebates, energy efficiency in buildings, electric transmissions, advanced industrial facilities, and other energy matters. Part 2--Residential Efficiency and Electrification Rebates (Sec. 50121) For example, the act provides funding to DOE for a HOMES rebate program that awards grants to state energy offices. Under the program, states must provide rebates to homeowners and aggregators for certain whole-house energy saving retrofits made for low- and moderate-income households. A rebate provided under the program may not be combined with any other federal grant or rebate for the same single upgrade. (Sec. 50122) In addition, funding is provided to DOE for a high-efficiency electric home rebate program that awards grants to state energy offices and Indian tribes. Under the program, rebates must be given for qualified electrification projects in low- or moderate-income households. Qualified electrification projects includes the purchase and installation of certain heat pumps, electric stoves, electric ovens, electric load service centers, insulation, materials to improve ventilation, or electric wiring. (Sec. 50123) The act provides funds for a program to train and educate contractors involved in the installation of home energy efficiency and electrification improvements. Funding for this part shall remain available through FY2031. Part 3--Building Efficiency and Resilience (Sec. 50131) The act also provides funding to DOE for grants to states and local governments. Under the program, grants must be used to (1) adopt residential building codes for buildings that meet or exceed the 2021 International Energy Conservation Code, (2) adopt commercial building codes that meet or exceed the ANSI/ASHRAE/IES Standard 90.1--2019, or (3) implement plans for the jurisdiction to achieve full compliance with the codes. Funding shall remain available through FY2029. Part 4--DOE Loan and Grant Programs The act provides funding for specified DOE loan programs, including certain loans issued under the Energy Policy Act of 2005. The act also provides funding to support financing of energy infrastructure projects, including projects to replace energy infrastructure that is no longer operational or reduce the emissions of energy infrastructure. (Sec. 50141) For example, it provides funding for DOE's Energy Loan Program Office to guarantee loans for projects that (1) avoid, reduce, utilize, or sequester air pollutants or greenhouse gases; and (2) employ new or significantly improved technologies as compared to commercial technologies in service in the United States at the time the guarantee is issued. Funding for the program shall remain available through FY2026. (Sec. 50142) In addition, it appropriates funding, which shall remain available through FY2028, for DOE's program that provides loans to facilities that manufacture advanced vehicles that emit either a low amount of or no amount of greenhouse gas emissions. The act revises the program to eliminate the cap on the total amount of loans that may be provided under the program. (Sec. 50143) It also appropriates funding to provide grants for the domestic production of efficient hybrid, plug-in electric hybrid, plug-in electric drive, and hydrogen fuel cell electric vehicles. Funding for the grants shall remain available through FY2031. (Sec. 50144) The act also provides funding to support financing of energy infrastructure projects, including projects to replace energy infrastructure that is no longer in operation or reduce the emissions of energy infrastructure. The funding shall remain available through FY2026. (Sec. 50145) Finally, it provides funding for a DOE program that provides loans to Indian tribes for energy resource development. Funding for the program shall remain available through FY2028. Part 5--Electric Transmission (Sec. 50151) The act provides funding to DOE for a program that provides loans for the construction or modification of electric transmission facilities that are located within a national interest electric transmission corridor. Funding for the program shall remain available through FY2031. (Sec. 50152) Further, DOE is authorized to make grants to facilitate the siting of interstate electricity transmission lines. Funding for the grants shall remain available through FY2029. (Sec. 50153) In addition, the act provides funding to DOE to convene stakeholders and conduct analysis related to interregional electricity transmission and transmission of electricity that is generated by offshore wind. The funding shall remain available through FY2031. Part 6--Industrial (Sec. 50161) The act also provides funding for DOE's Office of Clean Energy Demonstrations to carry out the advanced industrial facilities deployment program. Under the program, the office must deploy advanced industrial technology to accelerate the reduction and elimination of greenhouse gas emissions at industrial facilities. Funding for the program shall remain available through FY2026. Part 7--Other Energy Matters In addition, the act provides funding for other energy matters. (Sec. 50171) Specifically, the act provides funding for the DOE Office of Inspector General to oversight of DOE activities funding by this act. Funding shall remain available through FY2031. (Sec. 50172) It also provides funding to DOE's Office of Science to implement activities related to science laboratory infrastructure projects, high energy physics construction, fusion energy science construction, nuclear physics construction, advanced scientific computing research facilities, basic energy sciences projects, and isotope research and development facilities. It also provide funding to the following offices for infrastructure and general projects: Office of Fossil Energy and Carbon Management, the Office of Nuclear Energy, and the Office of Energy Efficiency and Renewable Energy. The funding shall remain available through FY2027. (Sec. 50173) In addition, the act provides funding for a DOE program that supports the availability of high-assay low-enriched uranium, a fuel used in advanced nuclear reactors. The funding for the program shall remain available through FY2026. Subtitle B--Natural Resources Part 1--General Provisions The act provides funding for natural resources, water supplies, the Office of Insular Affairs, leases to develop energy on federal land, and other related issues. Part 2--Public Lands (Sec. 50221) The act provides funding, which shall remain available through FY2031, to the Department of the Interior to carry out projects for the conservation, protection, and resiliency of lands and resources administered by the National Park Service (NPS) and the Bureau of Land Management (BLM). (Sec. 50222) It also provides funding, which shall remain available through FY2031, for the conservation and ecosystem and habitat restoration projects on lands administered by the NPS and the BLM. (Sec. 50223) In addition, it provides funding to the NPS, which shall remain available through FY2030, to hire more employees. (Sec. 50224) Finally, it provides funding to the NPS for priority deferred maintenance projects. Funding shall remain available through FY2026. Part 3--Drought Response and Preparedness The act provides funding to the Bureau of Reclamation to address water supplies during drought. (Sec. 50231) The act provides funding, which shall remain available through FY2031, to Reclamation for water supply projects. Specifically, it provides funding for grants, contracts, or financial assistance agreements for disadvantaged communities to pay for the cost of the planning, design, or construction of water projects in communities or households that do not have reliable access to domestic water supplies. (Sec. 50232) It also provides funding for projects to cover water conveyance facilities with solar panels. Funding for the projects shall remain available through FY2031. (Sec. 50233) Finally, it provides funding for drought mitigation in western states, with priority given to the Colorado River Basin and other basins experiencing comparable levels of long-term drought. Funding shall remain available through FY2026. Part 4--Insular Affairs (Sec. 50241) The act provides funding to Interior's Office of Insular Affairs, which shall remain available through FY2026. The office must use the funding to provide technical assistance for climate change planning, mitigation, adaptation, and resilience to United States Insular Areas (i.e., American Samoa, Northern Mariana Islands, Guam, Puerto Rico, and the U.S. Virgin Islands). Part 5--Offshore Wind (Sec. 50251) The act allows the Department of the Interior to grant leases to develop energy on federal offshore land in the Outer Continental Shelf (OSC) in areas that were withdrawn from leasing in 2020. Thus, the act nullifies the presidential memorandum titled Memorandum on the Withdrawal of Certain Areas of the United States Outer Continental Shelf from Leasing Disposition published on September 8, 2020, as well as the Presidential Determination on the Withdrawal of Certain Areas of the United States Outer Continental Shelf from Leasing Disposition published on September 25, 2020. Further, it expands the definition of the OCS under the Outer Continental Shelf Lands Act to include land that is within the U.S. exclusive economic zone and adjacent to any territory of the United States, thus the act expands the submerged lands that are available for energy leases. Interior may also conduct wind lease sales that are in such areas if the leases meet specified criteria. Part 6--Fossil Fuel Resources In addition, the act modifies several provisions related to energy leases on public lands, including offshore land in the OSC. (Sec. 50261) For example, it increases the minimum royalty rates for bidding on offshore oil and gas leases. (Sec. 50262) The act revises the Mineral Leasing Act to revise requirements governing the lease of federal land for energy development. For example, it increases rental rates and minimum bidding standards for onshore oil and gas leases and establishes a new fee that must be paid by any person who nominates public lands for such leasing. (Sec. 50263) Further, it requires royalties to be paid for methane gas extracted from federal lands, including offshore lands as specified by the act. (Sec. 50264) Interior must accept the highest bid for oil and gas leases under the Gulf of Mexico Outer Continental Shelf Oil and Gas Lease Sale 257 within 30 days of the act's enactment. It must also conduct (1) Lease Sale 258 by the end of 2022, (2) Lease Sale 259 by March 31, 2023, and (3) Lease Sale 261 no later than the end of the FY2023. (Sec. 50265) The act limits Interior's authority to issue leases and rights-of-way to develop wind or solar energy on onshore or offshore land for 10 years. Interior may grant such rights-of-way and leases if it offers a certain amount of land for oil and gas leases and holds oil and gas lease sales. Part 7--United States Geological Survey (Sec. 50271) The act provides funding for the United States Geological Survey to produce, collect, disseminate, and use 3D elevation data. Funding for this part shall remain available through FY2031. Part 8--Other Natural Resources Matters (Sec. 50281) It also provides funding to Interior's Office of Inspector General for oversight of activities funded by this subtitle. Funding for this part shall remain available through FY2031. Subtitle C--Environmental Reviews (Sec. 50301) The act provides funding for DOE, the Federal Energy Regulatory Commission (FERC), and Interior to hire personnel, train personnel, develop programmatic environmental documents, procure technical or scientific services for environmental reviews, develop environmental data or information systems, engage stakeholders, and purchase new equipment for environmental analysis. Funding for DOE and FERC shall remain available through FY2031 while funding for Interior shall remain available through FY2026. TITLE VI--COMMITTEE ON ENVIRONMENT AND PUBLIC WORKS Subtitle A--Air Pollution The act provides funding to the Environmental Protection Agency (EPA) to establish a greenhouse gas reduction fund and to support several programs that provide financial incentives to reduce greenhouse gas emissions and other air pollution emissions. (Sec. 60101) Specifically, the act provides incentives to replace eligible medium-duty vehicles (e.g., school buses) and heavy-duty vehicles (e.g., garbage trucks) with zero-emission vehicles. For example, the act provides funding to the Environmental Protection Agency (EPA) so that it may make awards to replace such vehicles in communities located in areas designated as nonattainment areas under the Clean Air Act (e.g., areas that do not meet national air quality standards). It also provides funding for a program within EPA to award grants and rebates for replacing such vehicles with zero-emission vehicles. Funding shall remain available through FY2031. (Sec. 60102) Additionally, it provides incentives to reduce air pollution at ports, including by awarding rebates and grants to port authorities and other eligible entities to (1) purchase or install equipment and technology to reduce pollution at ports, (2) conduct any relevant planning or permitting in connection with those purchases, and (3) develop climate action plans. It also provides additional funding for rebates and grants for carrying out such activities in ports located in areas designed as nonattainment areas under the Clean Air Act. Funding shall remain available through FY2027. (Sec. 60103) Next, it establishes a greenhouse gas reduction fund for the deployment and use of zero-emission technologies, including financial and technical assistance to enable low-income and disadvantaged communities to deploy or benefit from zero-emission technologies. Funding for such assistance shall remain available through FY2024. Funding will remain available to the EPA through FY2031 for administrative costs. (Sec. 60104) The act appropriates funding for an EPA program that gives grants, rebates, and loans under the Energy Policy Act of 2005 to identify and reduce diesel emissions resulting from goods movement (e.g., distribution of raw materials and consumer products) facilities as well as vehicles servicing those facilities in low-income and disadvantaged communities. Funding for the program shall remain available through FY2031. (Sec. 60105) Additionally, it provides funding for a variety of programs that provide incentives to monitor and reduce air pollution and greenhouse gases, including funding for grants and other activities to deploy, integrate, support, and maintain stations, technology, and other methods to monitor air toxins; expand the national ambient air quality monitoring network with new multi-pollutant monitoring stations; replace, repair, operate, and maintain existing monitors; deploy, integrate, and operate air quality sensors in low-income and disadvantaged communities; address emissions from wood heaters; monitor emissions of methane; conduct research and development related to the prevention and control of air pollution; and encourage states to adopt and implement greenhouse gas and zero-emission standards for mobile sources. Funding under this section shall remain available through FY2031. (Sec. 60106) The act also appropriates funding for grants and other activities to monitor and reduce greenhouse gas emissions and other air pollutants at schools in low-income and disadvantaged communities. Further, it provides funding for technical assistance to schools in low-income and disadvantaged communities to (1) address environmental issues; (2) develop school environmental quality plans that include standards for school building, design, construction, and renovation; and (3) identify and mitigate ongoing air pollution hazards. Funding for the grants and activities shall remain available through FY2031. (Sec. 60107) It revises the Clean Air Act to provide funding for a low emissions electricity program that will provide education, technical assistance, and outreach to reduce greenhouse gas emissions that result from domestic electricity generation and use. The funding shall remain available through FY2031. (Sec. 60108) The act provides funding for the EPA to carry out the renewable fuel program. Specifically it provides funding for (1) the development and establishment of tests and protocols regarding the environmental and public health effects of a fuel or fuel additive; (2) the collection and analysis of data to update applicable regulations, guidance, and procedures for determining the amount of greenhouse gas emissions from a fuel over the fuel's life cycle (e.g., production, processing, transport); (3) the review, analysis, and evaluation of the impacts of all transportation fuels on the public as well as on low-income and disadvantaged communities; and (4) supporting investments in advanced biofuels. Funding for the program shall remain available through FY2031. (Sec. 60109) Additionally, it provides funding to implement the American Innovation and Manufacturing Act of 2020, which directs the EPA to address hydrofluorocarbons (HFC). Further, it provides funding for the EPA to deploy new implementation and compliance tools when carrying out the act. Finally, it provides funding to the EPA for grants under the act for certain innovative technologies that reclaim or destroy HFC. Funding for this section shall remain available through FY2026. (Sec. 60110) The act also provides funding for updating the EPA's Integrated Compliance Information System and any associated systems, necessary information technology infrastructure, or public access software tools to ensure access to compliance data and related information. Further, it provides funding for grants to states, Indian tribes, and air pollution control agencies to update their systems to ensure communication with the Integrated Compliance Information System. Finally, the act provides funding to the EPA to acquire or update inspection software or to acquire devices on which to run such software. The funding shall remain available through FY2031. (Sec. 60111) Additionally, it provides funding for the EPA to support (1) enhanced standardization and transparency of corporate climate action commitments and plans to reduce greenhouse gas emissions; (2) enhanced transparency regarding progress toward meeting such commitments and implementing such plans; and (3) progress toward meeting such commitments and implementing such plans. The funding shall remain available through FY2031. (Sec. 60112) The act provides funding, which shall remain available through FY2031, to develop and carry out a program that supports the development, enhanced standardization and transparency, and reporting criteria for environmental product declarations for construction materials and products. The declarations must include measurements of the greenhouse gases associated with all the relevant stages of production, use, and disposal of the construction materials and products. (Sec. 60113) The act revises the Clean Air Act to create and provide funding for a methane emissions reduction program and a methane emissions waste reduction program. Funding shall remain available through FY2028. Under the methane emissions reduction program, the EPA must provide financial incentives to encourage the reporting of greenhouse gases, the monitoring of methane, and the reduction of methane emissions from petroleum and natural gas systems. Further, the act provides funding to assist communities in increasing their resiliency to climate changes. The act also provides incentives to mitigate methane emissions from marginal conventional wells. Under the methane emissions waste reduction program, the EPA must impose and collect a charge on methane emissions from an owner or operator of a facility that emitted more than 25,000 metric tons of carbon dioxide equivalent of greenhouse gases per year. The act outlines how the fees are calculated as well as exemptions from charges. The program applies to facilities within the following industry segments: offshore and onshore petroleum and natural gas production, onshore natural gas processing, onshore natural gas transmission compression, underground natural gas storage, liquefied natural gas storage, liquefied natural gas import and export equipment, onshore petroleum and natural gas gathering and boosting, and onshore natural gas transmission pipeline. (Sec. 60114) The act establishes and provides funding for a program that awards grants to states, air pollution control agencies, municipalities, and Indian tribes for developing and implementing plans to reduce greenhouse gas air pollution. Funding for planning grants shall remain available through FY2031 and implementation grants shall remain available through FY2026. (Sec. 60115) Additionally, it appropriates funding, which shall remain available through FY2026, for the EPA to provide for developing efficient, accurate, and timely reviews for permitting and approval processes through the hiring and training of personnel; developing programmatic documents; procuring technical or scientific services for reviews; developing environmental data or information systems; engaging stakeholders; purchasing new equipment for environmental analysis, and developing geographic information systems and other analysis tools, techniques, and guidance to improve agency transparency, accountability, and public engagement. (Sec. 60116) Finally, the act provides funding to the EPA to develop and carry out a program to identify and label construction materials and products that have substantially lower levels of greenhouse gas emissions associated with all the relevant stages of production, use, and disposal of the materials and products. Funding for the program shall remain available through FY2026. Subtitle B--Hazardous Materials (Sec. 60201) In addition, the act provides funding to the EPA for environmental and climate justice block grants that benefit disadvantaged communities. Funding for the grants shall remain available through FY2026. Subtitle C--United States Fish and Wildlife Service (Sec. 60301) The act provides funding, which shall remain available through FY2026, to the United States Fish and Wildlife Service (USFWS) to develop and implement recovery plans for the conservation and survival of endangered species and threatened species. (Sec. 60302) It also provides funding to USFWS to rebuild and restore units of the National Wildlife Refuge System and state wildlife management areas by (1) addressing the threat of invasive species, (2) increasing the resiliency and capacity of habitats and infrastructure to withstand weather events, and (3) reducing the amount of damage caused by weather events. Subtitle D--Council on Environmental Quality (Sec. 60401) The act provides funding to the Council on Environmental Quality (CEQ), including funding for (1) collecting data related to environmental and climate issues, (2) tracking disproportionate burdens and cumulative impacts, and (3) supporting efforts to ensure that any mapping or screening tool is accessible to community-based organizations and community members. Funding to CEQ shall remain available through FY2026. (Sec. 60402) Additionally, it provides funding for CEQ to carry out its functions. It also provides funding for CEQ to (1) train personnel; (2) develop programmatic environmental documents; and (3) develop tools, guidance, and techniques to improve stakeholder and community engagement. Subtitle E--Transportation and Infrastructure This act provides funding to the Federal Highway Administration (FHWA) and to the General Services Administration (GSA). (Sec. 60501) Specifically, it provides funding to the FHWA for the neighborhood access and equity grant program. Funding shall remain available through FY2026. (Sec. 60502) In addition, it provides funding, which shall remain available through FY2031, to the Federal Building Fund for converting and constructing federal facilities into high-performance green buildings. (Sec. 60503) It also appropriates funding to the Federal Building Fund for acquiring and installing low-carbon materials and products in the construction of federal buildings. Funding shall remain available through FY2026. (Sec. 60504) Further, it provides funding to the Federal Building Fund for emerging and sustainable technologies as well as related sustainability and environmental programs. The funding shall remain available through FY2026. (Sec. 60505) The act provides funding to the FHWA to facilitate the development and review of documents related to the environmental review of proposed projects. It also limits the federal share of the costs of the environmental review process. The funding shall remain available through FY2026. (Sec. 60506) The act also provides funding to the FHWA for grants to support the use of low-carbon construction materials and products on federally funded transportation projects. The funding shall remain available through FY2026. TITLE VII--COMMITTEE ON HOMELAND SECURITY AND GOVERNMENTAL AFFAIRS This act provides funding to the Department of Homeland Security (DHS), the U.S. Postal Service (USPS), the Federal Emergency Management Agency (FEMA), the Government Accountability Office (GAO), and the Office of Management and Budget (OMB) for the oversight of this act as well as a variety of environmental programs. (Sec. 70001) Specifically, the act provides funding to DHS for implementing stainability and environmental programs. Funding shall remain available through FY2028. (Sec. 70002) It also provides funding, which shall remain available through FY2031, to the USPS for purchasing zero-emission delivery vehicles and installing related infrastructure. (Sec. 70003) Further, it provides funding to Office of Inspector General of the USPS for the oversight of such purchases and installation activities. (Sec. 70004) Additionally, the act provides funding to the GAO to support the oversight of the distribution and use of funds appropriated under this act as well as the economic, social, and environmental impacts of the funds. Funding shall remain available through FY2031. (Sec. 70005) It also provides funding to the OMB, which shall remain available through FY2026, for (1) overseeing the implementation of this act; and (2) tracking labor, equity, and environmental standards and performance. (Sec. 70006) The act provides funding to the Federal Emergency Management Agency so it may provide assistance under the Robert T. Stafford Disaster Relief and Emergency Assistance Act for costs associated with low-carbon building materials as well as incentives that encourage low-carbon and net-zero energy projects. Funding for the program shall remain through FY2026. (Sec. 70007) Finally, the act provides appropriations to the Federal Permitting Improvement Steering Council Environmental Review Improvement Fund, which shall remain available through FY2031. TITLE VIII--COMMITTEE ON INDIAN AFFAIRS This act provides funding to assist Indian tribes address climate change. (Sec. 80001) For example, the act provides funding to the Bureau of Indian Affairs (BIA) for (1) climate resilience and adaptation programs, and (2) fish hatchery operations and BIA maintenance programs. Funding shall remain available through FY2031. (Sec. 80002). It also provides funding, which shall remain available through FY2031, to the Office of Native Hawaiian Relations. The office must use the funding to carry out climate resilience and adaptation activities that serve the Native Hawaiian community. (Sec. 80003) In addition, the act provides funding to the BIA for a tribal electrification program that (1) provides electricity to unelectrified tribal homes through zero-emissions energy systems, (2) transitions electrified tribal homes to zero-emissions energy systems, and (3) provides home repairs necessary to install those systems. Funding for the program shall remain available through FY2031. (Sec. 80004) Finally, the act provides funding to the Bureau of Reclamation for near-term drought relief actions that mitigate drought impacts for Indian tribes that are impacted by the operation of a Reclamation water project, including through direct financial assistance to address drinking water shortages and mitigate the loss of tribal trust resources. Funding for the program shall remain available through FY2026.", "pending_committee_id": 0, "committee": [], "referrals": [], "history": [{"date": "2021-09-27", "action": "The House Committee on the Budget reported an original measure, H. Rept. 117-130, by Mr. Yarmuth.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2021-09-27", "action": "Placed on the Union Calendar, Calendar No. 94.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2021-11-05", "action": "Rules Committee Resolution H. Res. 774 Reported to House. Rule provides for consideration of H.R. 5376 with 2 hours of general debate. Previous question shall be considered as ordered without intervening motions except motion to recommit. Measure will be considered read. Bill is closed to amendments.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2021-11-06", "action": "Rule H. Res. 774 passed House.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2021-11-18", "action": "Considered under the provisions of rule H. Res. 774. (consideration: CR H6375-6595)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2021-11-18", "action": "Rule provides for consideration of H.R. 5376 with 2 hours of general debate. Previous question shall be considered as ordered without intervening motions except motion to recommit. Measure will be considered read. Bill is closed to amendments.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2021-11-18", "action": "DEBATE - The House proceeded with two hours of debate on H.R. 5376.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2021-11-18", "action": "POSTPONED PROCEEDINGS - Pursuant to clause 1(c) of Rule XIX, further consideration of H.R. 5376 is postponed.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2021-11-18", "action": "Considered as unfinished business. (consideration: CR H6615-6658)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2021-11-18", "action": "DEBATE - Pursuant to H.Res 774, the House proceeded with further debate on H.R. 5376.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2021-11-19", "action": "POSTPONED PROCEEDINGS - Pursuant to clause 1(c) of Rule XIX, further consideration of H.R. 5376 is postponed.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2021-11-19", "action": "Pursuant to clause 1(c) of Rule XIX, the House resumed consideration of H.R. 5376.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2021-11-19", "action": "Considered as unfinished business. (consideration: CR H6659-6667)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2021-11-19", "action": "DEBATE - Pursuant to H.Res. 774, the House proceeded with further debate on H.R. 5376.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2021-11-19", "action": "The previous question was ordered pursuant to the rule.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2021-11-19", "action": "Mr. Brady moved to recommit to the Committee on the Budget. (text: CR H6665)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2021-11-19", "action": "The previous question on the motion to recommit was ordered pursuant to clause 2(b) of rule XIX.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2021-11-19", "action": "On motion to recommit Failed by the Yeas and Nays: 208 - 220 (Roll no. 384).", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2021-11-19", "action": "On passage Passed by the Yeas and Nays: 220 - 213 (Roll no. 385). (text: 11/18/2021 CR H6375-6576)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2021-11-19", "action": "Motion to reconsider laid upon the table. Objection heard.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2021-11-19", "action": "Mr. Neal moved to reconsider the vote.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2021-11-19", "action": "Mr. McGovern moved to table the motion to reconsider the vote.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2021-11-19", "action": "On motion to table the motion to reconsider Agreed to by the Yeas and Nays: 217 - 105 (Roll no. 386).", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2021-11-19", "action": "Motion to reconsider laid on the table.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2022-08-02", "action": "Received in the Senate. Read the first time. Placed on Senate Legislative Calendar under Read the First Time.", "chamber": "S", "chamber_id": 115, "importance": 1}, {"date": "2022-08-03", "action": "Read the second time. Placed on Senate Legislative Calendar under General Orders. Calendar No. 464.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2022-08-04", "action": "Committee on Banking, Housing, and Urban Affairs. Hearings held.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2022-08-06", "action": "Motion to proceed to consideration of measure agreed to in Senate by Yea-Nay Vote. 51 - 50. Record Vote Number: 287. (CR S4070)", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2022-08-06", "action": "Measure laid before Senate by motion. (consideration: CR S4070-4152, S4154-4164, S4168-4201)", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2022-08-06", "action": "S.Amdt.5194 Amendment SA 5194 proposed by Senator Schumer. (consideration: CR S4070-4144, S4201; text: CR S4070-4144) In the nature of a substitute.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2022-08-06", "action": "S.Amdt.5210 Amendment SA 5210 proposed by Senator Sanders to Amendment SA 5194. (consideration: CR S4145, S4170; text: CR S4145) To establish a cap on costs for covered prescription drugs under Medicare parts B and D.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2022-08-06", "action": "S.Amdt.5210 Point of order that the amendment violates section 313(b)(1)(C) of the CBA raised in Senate with respect to amendment SA 5210.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2022-08-07", "action": "S.Amdt.5210 Motion to waive all applicable budgetary discipline with respect to amendment SA 5210 rejected in Senate by Yea-Nay Vote. 1 - 99. Record Vote Number: 288.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2022-08-07", "action": "S.Amdt.5210 Amendment SA 5210 ruled out of order by the chair.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2022-08-07", "action": "S.Amdt.5301 Amendment SA 5301 proposed by Senator Graham to Amendment SA 5194. (consideration: CR S4170-4171; text: CR S4170) To strike a tax increase that would result in higher consumer prices for gasoline, heating oil, and other energy sources for Americans earning less than $400,000 per year.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2022-08-07", "action": "S.Amdt.5301 Amendment SA 5301 not agreed to in Senate by Yea-Nay Vote. 50 - 50. Record Vote Number: 289.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2022-08-07", "action": "S.Amdt.5469 Amendment SA 5469 proposed by Senator Hassan to Amendment SA 5194. (consideration: CR S4171; text: CR S4171) To eliminate the reinstatement of Superfund taxes.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2022-08-07", "action": "S.Amdt.5469 Point of order that the amendment violates section 4106, H. Con. Res. 71, 115th Congress, raised in Senate with respect to amendment SA 5469.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2022-08-07", "action": "S.Amdt.5469 Motion to waive all applicable budgetary discipline with respect to amendment SA 5469 rejected in Senate by Yea-Nay Vote. 55 - 45. Record Vote Number: 290.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2022-08-07", "action": "S.Amdt.5469 Amendment SA 5469 ruled out of order by the chair.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2022-08-07", "action": "S.Amdt.5409 Amendment SA 5409 proposed by Senator Barrasso to Amendment SA 5194. (consideration: CR S4172; text: CR S4172) To require certain additional onshore oil and gas lease sales in certain states.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2022-08-07", "action": "S.Amdt.5409 Amendment SA 5409 not agreed to in Senate by Yea-Nay Vote. 50 - 50. Record Vote Number: 291.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2022-08-07", "action": "S.Amdt.5211 Amendment SA 5211 proposed by Senator Sanders to Amendment SA 5194. (consideration: CR S4172-4177; text: CR S4172-4177) To provide coverage for dental and oral health care, hearing care, and vision care under the Medicare program.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2022-08-07", "action": "S.Amdt.5211 Amendment SA 5211 not agreed to in Senate by Yea-Nay Vote. 3 - 97. Record Vote Number: 292.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2022-08-07", "action": "S.Amdt.5382 Amendment SA 5382 proposed by Senator Capito to Amendment SA 5194. (consideration: CR S4178; text: CR S4178) To strike provisions concerning funding for certain activities under the Clean Air Act.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2022-08-07", "action": "S.Amdt.5382 Amendment SA 5382 not agreed to in Senate by Yea-Nay Vote. 50 - 50. Record Vote Number: 293.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2022-08-07", "action": "S.Amdt.5384 Amendment SA 5384 proposed by Senator Lankford to Amendment SA 5194. (consideration: CR S4178-4179; text: CR S4179) To provide additional funding for implementation of title 42.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2022-08-07", "action": "S.Amdt.5384 Amendment SA 5384 not agreed to in Senate by Yea-Nay Vote. 50 - 50. Record Vote Number: 294.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2022-08-07", "action": "S.Amdt.5480 Amendment SA 5480 proposed by Senator Tester to Amendment SA 5194. (consideration: CR S4179-4180; text: CR S4179) To establish a procedure for terminating a determination by Surgeon General to suspend certain entries and imports from designated places.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2022-08-07", "action": "S.Amdt.5480 Point of order that the amendment violates section 313 (b)(1)(A) of the CBA raised in Senate with respect to amendment SA 5480.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2022-08-07", "action": "S.Amdt.5480 Motion to waive all applicable budgetary discipline with respect to amendment SA 5480 rejected in Senate by Yea-Nay Vote. 56 - 44. Record Vote Number: 295.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2022-08-07", "action": "S.Amdt.5480 Amendment SA 5480 ruled out of order by the chair.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2022-08-07", "action": "S.Amdt.5404 Amendment SA 5404 proposed by Senator Crapo to Amendment SA 5194. (consideration: CR S4180; text: CR S4180) To prevent the use of additional Internal Revenue Service Funds from being used for audits of taxpayers with taxable incomes below $400,000 in order to protect low- and middle-income earning American taxpayers from an onslaught of audits from an army of new Internal Revenue Service auditors funded by an unprecedented, nearly $80,000,000,000, infusion of new funds.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2022-08-07", "action": "S.Amdt.5404 Amendment SA 5404 not agreed to in Senate by Yea-Nay Vote. 50 - 50. Record Vote Number: 296.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2022-08-07", "action": "Motion by Senator Scott FL, to commit to Senate Committee on Finance with instructions rejected in Senate by Yea-Nay Vote. 50 - 50. Record Vote Number: 297. (CR S4180)", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2022-08-07", "action": "S.Amdt.5389 Amendment SA 5389 proposed by Senator Marshall to Amendment SA 5194. (consideration: CR S4181; text: CR S4181) To protect patient access to current and future treatments for a range of serious conditions, such as cancer, Alzheimer's disease, HIV/AIDS, Parkinson's disease, and sickle cell disease, among numerous others.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2022-08-07", "action": "S.Amdt.5389 Amendment SA 5389 not agreed to in Senate by Yea-Nay Vote. 50 - 50. Record Vote Number: 298.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2022-08-07", "action": "S.Amdt.5209 Amendment SA 5209 proposed by Senator Sanders to Amendment SA 5194. (consideration: CR S4181-4182; text: CR S4234-4237) To establish a Civilian Climate Corps.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2022-08-07", "action": "S.Amdt.5209 Amendment SA 5209 not agreed to in Senate by Yea-Nay Vote. 1 - 98. Record Vote Number: 299.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2022-08-07", "action": "S.Amdt.5383 Amendment SA 5383 proposed by Senator Capito to Amendment SA 5194. (consideration: CR S4182-4183; text: CR S4331-4334) To expedite consideration of permits and provide regulatory certainty for infrastructure and energy projects.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2022-08-07", "action": "S.Amdt.5383 Point of order that the amendment violates section 313(b)(1)(D) of the CBA raised in Senate with respect to amendment SA 5383.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2022-08-07", "action": "S.Amdt.5383 Motion to waive waive all applicable budgetary discipline with respect to amendment SA 5383 rejected in Senate by Yea-Nay Vote. 49 - 50. Record Vote Number: 300.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2022-08-07", "action": "S.Amdt.5383 Amendment SA 5383 ruled out of order by the chair.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2022-08-07", "action": "S.Amdt.5421 Amendment SA 5421 proposed by Senator Grassley to Amendment SA 5194. (consideration: CR S4183; text: CR S4339-4341) To amend the Internal Revenue Code of 1986 to modify the maximum capital gains tax rate, to provide a partial exclusion for interest received by individuals, to provide inflation adjustments for certain tax benefits, and for other purposes.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2022-08-07", "action": "S.Amdt.5421 Amendment SA 5421 not agreed to in Senate by Yea-Nay Vote. 49 - 51. Record Vote Number: 301.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2022-08-07", "action": "Motion by Senator Collins to commit to Senate Committee on Finance with instructions rejected in Senate by Yea-Nay Vote. 50 - 50. Record Vote Number: 302. (CR S4183-4184)", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2022-08-07", "action": "S.Amdt.5387 Amendment SA 5387 proposed by Senator Kennedy to Amendment SA 5194. (consideration: CR S4184; text: CR S4184) To require oil and gas lease sales in the outer Continental Shelf.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2022-08-07", "action": "S.Amdt.5387 Amendment SA 5387 not agreed to in Senate by Yea-Nay Vote. 50 - 50. Record Vote Number: 303.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2022-08-07", "action": "Motion by Senator Rubio to commit to Senate Committee on the Judiciary with instructions rejected in Senate by Yea-Nay Vote. 50 - 50. Record Vote Number: 304. (CR S4184-4185)", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2022-08-07", "action": "S.Amdt.5316 Amendment SA 5316 proposed by Senator Lee to Amendment SA 5194. (consideration: CR S4185-4186; text: CR S4185) To reduce funding for home energy performance-based, whole-house rebates and to provide funding for supplemental payments under the payments in lieu of taxes program.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2022-08-07", "action": "S.Amdt.5316 Amendment SA 5316 not agreed to in Senate by Yea-Nay Vote. 49 - 51. Record Vote Number: 305.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2022-08-07", "action": "S.Amdt.5418 Amendment SA 5418 proposed by Senator Shelby to Amendment SA 5194. (consideration: CR S4186; text: CR S4186) To end the President's War on Coal through the approval of coal leases.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2022-08-07", "action": "S.Amdt.5418 Amendment SA 5418 not agreed to in Senate by Yea-Nay Vote. 50 - 50. Record Vote Number: 306.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2022-08-07", "action": "Motion by Senator Scott SC, to commit to Senate Committee on Finance with instructions rejected in Senate by Yea-Nay Vote. 50 - 50. Record Vote Number: 307. (CR S4186)", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2022-08-07", "action": "S.Amdt.5208 Amendment SA 5208 proposed by Senator Sanders to Amendment SA 5194. (consideration: CR S4187-4190; text: CR S4187-4189) To extend the special rules for the child tax credit that applied for 2021 and to increase the corporate tax rate.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2022-08-07", "action": "S.Amdt.5208 Amendment SA 5208 not agreed to in Senate by Yea-Nay Vote. 1 - 97. Record Vote Number: 308.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2022-08-07", "action": "S.Amdt.5263 Amendment SA 5263 proposed by Senator Cruz to Amendment SA 5194. (consideration: CR S4190; text: CR S4190) To strike the $80,000,000,000 slush fund for the Internal Revenue Service to prevent the hiring of 87,000 new Internal Revenue Service employees that will surveil and audit the private account information and transaction data of innocent Americans and small businesses.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2022-08-07", "action": "S.Amdt.5263 Amendment SA 5263 not agreed to in Senate by Yea-Nay Vote. 50 - 50. Record Vote Number: 309.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2022-08-07", "action": "S.Amdt.5262 Amendment SA 5262 proposed by Senator Warnock to Amendment SA 5194. (consideration: CR S4190-4191; text: CR S4250-4252) To make health care coverage available to low-income adults in States that have not expanded Medicaid.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2022-08-07", "action": "S.Amdt.5262 Point of order that the amendment violates section 313(b)(1)(C) of the CBA raised in Senate with respect to amendment SA 5262.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2022-08-07", "action": "S.Amdt.5262 Motion to waive all applicable budgetary discipline with respect to amendment SA 5262 rejected in Senate by Yea-Nay Vote. 5 - 94. Record Vote Number: 310.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2022-08-07", "action": "S.Amdt.5262 Amendment SA 5262 ruled out of order by the chair.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2022-08-07", "action": "S.Amdt.5265 Amendment SA 5265 proposed by Senator Cruz to Amendment SA 5194. (consideration: CR S4191-4192; text: CR S4191) To provide for certain conditions on the export to China of crude oil from the Strategic Petroleum Reserve.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2022-08-07", "action": "S.Amdt.5265 Point of order that the amendment violates section 4106, H. Con. Res. 71, 115th Congress, raised in Senate with respect to amendment SA 5265.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2022-08-07", "action": "S.Amdt.5265 Motion to waive all applicable budgetary discipline with respect to amendment SA 5265 rejected in Senate by Yea-Nay Vote. 54 - 46. Record Vote Number: 311.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2022-08-07", "action": "S.Amdt.5265 Amendment SA 5265 ruled out of order by the chair.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2022-08-07", "action": "S.Amdt.5281 Amendment SA 5281 proposed by Senator Sanders to Amendment SA 5194. (consideration: CR S4192; text: CR S4257-4292) To modify the bill.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2022-08-07", "action": "S.Amdt.5281 Amendment SA 5281 not agreed to in Senate by Yea-Nay Vote. 1 - 99. Record Vote Number: 312.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2022-08-07", "action": "S.Amdt.5385 Amendment SA 5385 proposed by Senator Kennedy to Amendment SA 5194. (consideration: CR S4192-4193; text: CR S4192-4193) To provide for discounted insulin for low- and middle-income Americans.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2022-08-07", "action": "S.Amdt.5385 Amendment SA 5385 not agreed to in Senate by Yea-Nay Vote. 50 - 50. Record Vote Number: 313.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2022-08-07", "action": "S.Amdt.5194 Point of order that the language on page 744, line 7, through page 755, line 4, violates 313(b)(1)(D) of the CBA raised in Senate with respect to amendment SA 5194, as modified.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2022-08-07", "action": "S.Amdt.5194 Motion to waive all applicable budgetary discipline with respect to amendment SA 5194, as modified, rejected in Senate by Yea-Nay Vote. 57 - 43. Record Vote Number: 314.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2022-08-07", "action": "S.Amdt.5194 Senate struck the language on page 744, line 7, through page 755, line 4, of amendment SA 5194, as modified.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2022-08-07", "action": "Motion by Senator Cruz to commit to Senate Committee on Homeland Security and Governmental Affairs with instructions rejected in Senate by Yea-Nay Vote. 49 - 51. Record Vote Number: 315. (CR S4194)", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2022-08-07", "action": "Motion by Senator Cruz to commit to Senate Committee on the Judiciary with instructions rejected in Senate by Yea-Nay Vote. 50 - 50. Record Vote Number: 316. (CR S4194-4195)", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2022-08-07", "action": "Motion by Senator Hoeven to commit to Senate Committee on Finance with instructions rejected in Senate by Yea-Nay Vote. 50 - 50. Record Vote Number: 317. (CR S4195)", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2022-08-07", "action": "Motion by Senator Blackburn to commit to Senate Committee on Agriculture, Nutrition, and Forestry with instructions rejected in Senate by Yea-Nay Vote. 50 - 50. Record Vote Number: 318. (CR S4196)", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2022-08-07", "action": "Motion by Senator Rubio to commit to Senate Committee on Health, Education, Labor, and Pensions with instructions rejected in Senate by Yea-Nay Vote. 50 - 50. Record Vote Number: 319. (CR S4196-4197)", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2022-08-07", "action": "S.Amdt.5194 Point of order en bloc: page 43, lines 3-8, page 1, lines 3-5, and page 547, line 18 through page 548, line 25, violate section 313(b)(1)(A). Page 689, lines 8-16 violates section 313(b)(1)(D) raised in Senate with respect to amendment SA 5194, as modified.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2022-08-07", "action": "S.Amdt.5194 Amendment SA 5194, as modified, 4 points of order en bloc that: page 43, lines 3-8, page 1, lines 3-5, and page 547, line 18 through page 548, line 25, violates section 313(b)(1)(A), and page 689, lines 8-16 violates section 313(b)(1)(D) ruled out of order by the chair.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2022-08-07", "action": "S.Amdt.5194 Senate struck the language on page 43, lines 3-8, page 1, lines 3-5, page 547, line 18 through page 548, line 25, and page 689, lines 8-16 of amendment SA 5194, as modified.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2022-08-07", "action": "S.Amdt.5435 Amendment SA 5435 proposed by Senator Sullivan to Amendment SA 5194. (consideration: CR S4197; text: CR S4197) To replace the funding for the Office of the Chief Readiness Support Officer with a $500,000,000 appropriation for the construction or improvement of primary pedestrian fencing and barriers along the southwest border.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2022-08-07", "action": "S.Amdt.5435 Amendment SA 5435 not agreed to in Senate by Yea-Nay Vote. 50 - 50. Record Vote Number: 320.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2022-08-07", "action": "S.Amdt.5487 Amendment SA 5487 proposed by Senator Daines for Senator Graham to Amendment SA 5194. (consideration: CR S4198-4199; text: CR S4397-4399) Of a perfecting nature.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2022-08-07", "action": "S.Amdt.5487 Amendment SA 5487 not agreed to in Senate by Yea-Nay Vote. 50 - 50. Record Vote Number: 321.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2022-08-07", "action": "Motion by Senator Hagerty to commit to Senate Committee on the Judiciary with instructions rejected in Senate by Yea-Nay Vote. 50 - 50. Record Vote Number: 322. (CR S4199)", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2022-08-07", "action": "S.Amdt.5472 Amendment SA 5472 proposed by Senator Thune to Amendment SA 5194. (consideration: CR S4199-4200; text: CR S4199) To remove harmful small business taxes, and for other purposes.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2022-08-07", "action": "S.Amdt.5472 Amendment SA 5472 agreed to in Senate by Yea-Nay Vote. 57 - 43. Record Vote Number: 323.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2022-08-07", "action": "S.Amdt.5488 Amendment SA 5488 proposed by Senator Warner to Amendment SA 5194. (consideration: CR S4200-4201; text: CR S4200) To strike the extension of the limitation on State and local taxes and extend the limitation on excess business losses of noncorporate taxpayers, and for other purposes.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2022-08-07", "action": "S.Amdt.5488 Amendment SA 5488 agreed to in Senate by Yea-Nay Vote. 51 - 50. Record Vote Number: 324.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2022-08-07", "action": "S.Amdt.5194 Amendment SA 5194 as modified agreed to in Senate by Voice Vote.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2022-08-07", "action": "Passed Senate with an amendment by Yea-Nay Vote. 51 - 50. Record Vote Number: 325.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2022-08-08", "action": "Message on Senate action sent to the House.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2022-08-12", "action": "Mr. Yarmuth moved that the House agree to the Senate amendment. (consideration: CR H7577-7704)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2022-08-12", "action": "Pursuant to the provisions of H.Res.1316, House proceeded with 3 hours of debate on the Yarmuth motion to agree to the Senate amendment to H.R. 5376.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2022-08-12", "action": "The previous question was ordered pursuant to the rule.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2022-08-12", "action": "On motion that the House agree to the Senate amendment Agreed to by the Yeas and Nays: 220 - 207 (Roll no. 420). (text: CR H7577-7646)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2022-08-12", "action": "Motion to reconsider laid on the table Agreed to without objection.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2022-08-15", "action": "Presented to President.", "chamber": "H", "chamber_id": 114, "importance": 1}, {"date": "2022-08-16", "action": "Signed by President.", "chamber": "H", "chamber_id": 114, "importance": 1}, {"date": "2022-08-16", "action": "Became Public Law No: 117-169.", "chamber": "H", "chamber_id": 114, "importance": 1}], "sponsors": [{"people_id": 9150, "person_hash": "3qjpf56t", "party_id": "1", "state_id": 52, "party": "D", "role_id": 1, "role": "Rep", "name": "John Yarmuth", "first_name": "John", "middle_name": "A.", "last_name": "Yarmuth", "suffix": "", "nickname": "", "district": "HD-KY-3", "ftm_eid": 7155937, "votesmart_id": 58579, "opensecrets_id": "N00028073", "knowwho_pid": 248302, "ballotpedia": "John_Yarmuth", "sponsor_type_id": 1, "sponsor_order": 1, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}], "sasts": [{"type_id": 8, "type": "Related", "sast_bill_number": "HB1791", "sast_bill_id": 1480401}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB1878", "sast_bill_id": 1482319}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB1945", "sast_bill_id": 1483655}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB2288", "sast_bill_id": 1489607}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB2634", "sast_bill_id": 1501205}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB2737", "sast_bill_id": 1502699}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB3633", "sast_bill_id": 1513351}, {"type_id": 8, "type": "Related", "sast_bill_number": "SB2797", "sast_bill_id": 1524194}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB369", "sast_bill_id": 1412054}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB2294", "sast_bill_id": 1490780}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB2706", "sast_bill_id": 1502176}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB3486", "sast_bill_id": 1512260}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB3324", "sast_bill_id": 1510222}, {"type_id": 8, "type": "Related", "sast_bill_number": "SB2877", "sast_bill_id": 1524673}, {"type_id": 8, "type": "Related", "sast_bill_number": "SB2883", "sast_bill_id": 1524805}, {"type_id": 8, "type": "Related", "sast_bill_number": "HR774", "sast_bill_id": 1532456}, {"type_id": 8, "type": "Related", "sast_bill_number": "HR803", "sast_bill_id": 1534384}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB4422", "sast_bill_id": 1519210}, {"type_id": 8, "type": "Related", "sast_bill_number": "SB3217", "sast_bill_id": 1534230}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB66", "sast_bill_id": 1393418}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB537", "sast_bill_id": 1429157}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB1161", "sast_bill_id": 1457089}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB1364", "sast_bill_id": 1466739}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB1717", "sast_bill_id": 1477206}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB1880", "sast_bill_id": 1482300}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB2170", "sast_bill_id": 1487517}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB2815", "sast_bill_id": 1503162}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB2847", "sast_bill_id": 1503858}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB4010", "sast_bill_id": 1516840}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB4205", "sast_bill_id": 1518029}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB4417", "sast_bill_id": 1519174}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB4647", "sast_bill_id": 1519823}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB4675", "sast_bill_id": 1519804}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB5005", "sast_bill_id": 1521522}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB5024", "sast_bill_id": 1521701}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB5175", "sast_bill_id": 1522914}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB5181", "sast_bill_id": 1522981}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB5183", "sast_bill_id": 1522984}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB5185", "sast_bill_id": 1522980}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB5187", "sast_bill_id": 1522979}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB5219", "sast_bill_id": 1523171}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB5233", "sast_bill_id": 1523172}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB6049", "sast_bill_id": 1534376}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB6833", "sast_bill_id": 1597853}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB7497", "sast_bill_id": 1615072}, {"type_id": 8, "type": "Related", "sast_bill_number": "SB581", "sast_bill_id": 1472840}, {"type_id": 8, "type": "Related", "sast_bill_number": "SB752", "sast_bill_id": 1483676}, {"type_id": 8, "type": "Related", "sast_bill_number": "SB1806", "sast_bill_id": 1512323}, {"type_id": 8, "type": "Related", "sast_bill_number": "SB2014", "sast_bill_id": 1515584}, {"type_id": 8, "type": "Related", "sast_bill_number": "SB2430", "sast_bill_id": 1519864}, {"type_id": 8, "type": "Related", "sast_bill_number": "SB2432", "sast_bill_id": 1519881}, {"type_id": 8, "type": "Related", "sast_bill_number": "SB3125", "sast_bill_id": 1528610}, {"type_id": 8, "type": "Related", "sast_bill_number": "SB3140", "sast_bill_id": 1531975}, {"type_id": 8, "type": "Related", "sast_bill_number": "SB3188", "sast_bill_id": 1532303}, {"type_id": 8, "type": "Related", "sast_bill_number": "SB3189", "sast_bill_id": 1532320}, {"type_id": 8, "type": "Related", "sast_bill_number": "SB3393", "sast_bill_id": 1541164}, {"type_id": 8, "type": "Related", "sast_bill_number": "SB4011", "sast_bill_id": 1614513}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB2464", "sast_bill_id": 1495829}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB5180", "sast_bill_id": 1522976}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB5188", "sast_bill_id": 1522963}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB5267", "sast_bill_id": 1523512}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB8559", "sast_bill_id": 1627534}, {"type_id": 8, "type": "Related", "sast_bill_number": "SB975", "sast_bill_id": 1488650}, {"type_id": 8, "type": "Related", "sast_bill_number": "SB2291", "sast_bill_id": 1517780}, {"type_id": 8, "type": "Related", "sast_bill_number": "SB2327", "sast_bill_id": 1519222}, {"type_id": 8, "type": "Related", "sast_bill_number": "SB2758", "sast_bill_id": 1523859}, {"type_id": 8, "type": "Related", "sast_bill_number": "SB2962", "sast_bill_id": 1525609}, {"type_id": 8, "type": "Related", "sast_bill_number": "HR1316", "sast_bill_id": 1628116}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB4449", "sast_bill_id": 1519455}, {"type_id": 8, "type": "Related", "sast_bill_number": "SB4804", "sast_bill_id": 1628571}], "subjects": [{"subject_id": 13124, "subject_name": "Economics and public finance"}, {"subject_id": 13126, "subject_name": "Administrative law and regulatory procedures"}, {"subject_id": 13400, "subject_name": "Advanced technology and technological innovations"}, {"subject_id": 13127, "subject_name": "Advisory bodies"}, {"subject_id": 13630, "subject_name": "Afghanistan"}, {"subject_id": 13128, "subject_name": "Aging"}, {"subject_id": 13129, "subject_name": "Agricultural conservation and pollution"}, {"subject_id": 13905, "subject_name": "Agricultural education"}, {"subject_id": 13818, "subject_name": "Agricultural prices, subsidies, credit"}, {"subject_id": 13130, "subject_name": "Agricultural research"}, {"subject_id": 13612, "subject_name": "Agricultural trade"}, {"subject_id": 13131, "subject_name": "Air quality"}, {"subject_id": 20687, "subject_name": "Alcoholic beverages"}, {"subject_id": 13132, "subject_name": "Alternative and renewable resources"}, {"subject_id": 13133, "subject_name": "American Samoa"}, {"subject_id": 13134, "subject_name": "Appropriations"}, {"subject_id": 13331, "subject_name": "Aquatic ecology"}, {"subject_id": 22127, "subject_name": "Arctic and polar regions"}, {"subject_id": 13536, "subject_name": "Arizona"}, {"subject_id": 13405, "subject_name": "Asia"}, {"subject_id": 13135, "subject_name": "Aviation and airports"}, {"subject_id": 13681, "subject_name": "Building construction"}, {"subject_id": 13139, "subject_name": "Business investment and capital"}, {"subject_id": 13391, "subject_name": "California"}, {"subject_id": 13498, "subject_name": "Capital gains tax"}, {"subject_id": 13783, "subject_name": "Cardiovascular and respiratory health"}, {"subject_id": 13489, "subject_name": "Caribbean area"}, {"subject_id": 13141, "subject_name": "Centers for Disease Control and Prevention (CDC)"}, {"subject_id": 81061, "subject_name": "Charitable contributions"}, {"subject_id": 13668, "subject_name": "Child care and development"}, {"subject_id": 13142, "subject_name": "Child health"}, {"subject_id": 13376, "subject_name": "Child safety and welfare"}, {"subject_id": 13322, "subject_name": "Civil actions and liability"}, {"subject_id": 21500, "subject_name": "Climate change and greenhouse gases"}, {"subject_id": 13690, "subject_name": "Coal"}, {"subject_id": 13813, "subject_name": "Coast guard"}, {"subject_id": 13763, "subject_name": "Community life and organization"}, {"subject_id": 13786, "subject_name": "Commuting"}, {"subject_id": 20565, "subject_name": "Computer security and identity theft"}, {"subject_id": 13146, "subject_name": "Congressional oversight"}, {"subject_id": 13148, "subject_name": "Corporate finance and management"}, {"subject_id": 327521, "subject_name": "Cosmetics and personal care"}, {"subject_id": 13406, "subject_name": "Crime victims"}, {"subject_id": 13373, "subject_name": "Criminal investigation, prosecution, interrogation"}, {"subject_id": 13306, "subject_name": "Dental care"}, {"subject_id": 13151, "subject_name": "Department of Agriculture"}, {"subject_id": 13152, "subject_name": "Department of Commerce"}, {"subject_id": 13154, "subject_name": "Department of Education"}, {"subject_id": 13156, "subject_name": "Department of Health and Human Services"}, {"subject_id": 13157, "subject_name": "Department of Homeland Security"}, {"subject_id": 13158, "subject_name": "Department of Housing and Urban Development"}, {"subject_id": 13162, "subject_name": "Department of Transportation"}, {"subject_id": 13163, "subject_name": "Department of Veterans Affairs"}, {"subject_id": 13165, "subject_name": "Department of the Treasury"}, {"subject_id": 13323, "subject_name": "Disability and health-based discrimination"}, {"subject_id": 13439, "subject_name": "Disaster relief and insurance"}, {"subject_id": 13167, "subject_name": "District of Columbia"}, {"subject_id": 13593, "subject_name": "Drug safety, medical device, and laboratory regulation"}, {"subject_id": 13345, "subject_name": "Drug trafficking and controlled substances"}, {"subject_id": 13307, "subject_name": "Drug, alcohol, tobacco use"}, {"subject_id": 13542, "subject_name": "Ecology"}, {"subject_id": 13168, "subject_name": "Economic development"}, {"subject_id": 13170, "subject_name": "Education of the disadvantaged"}, {"subject_id": 13171, "subject_name": "Education programs funding"}, {"subject_id": 13172, "subject_name": "Educational facilities and institutions"}, {"subject_id": 13534, "subject_name": "Educational technology and distance education"}, {"subject_id": 13173, "subject_name": "Electric power generation and transmission"}, {"subject_id": 13174, "subject_name": "Elementary and secondary education"}, {"subject_id": 13495, "subject_name": "Emergency communications systems"}, {"subject_id": 13308, "subject_name": "Emergency medical services and trauma care"}, {"subject_id": 13472, "subject_name": "Emergency planning and evacuation"}, {"subject_id": 13175, "subject_name": "Employee benefits and pensions"}, {"subject_id": 20685, "subject_name": "Employee hiring"}, {"subject_id": 13502, "subject_name": "Employee leave"}, {"subject_id": 13176, "subject_name": "Employment and training programs"}, {"subject_id": 13178, "subject_name": "Employment taxes"}, {"subject_id": 13179, "subject_name": "Energy assistance for the poor and aged"}, {"subject_id": 13180, "subject_name": "Energy efficiency and conservation"}, {"subject_id": 13520, "subject_name": "Energy storage, supplies, demand"}, {"subject_id": 13182, "subject_name": "Environmental Protection Agency (EPA)"}, {"subject_id": 13740, "subject_name": "Environmental health"}, {"subject_id": 13528, "subject_name": "Environmental technology"}, {"subject_id": 13184, "subject_name": "Executive agency funding and structure"}, {"subject_id": 13492, "subject_name": "Farmland"}, {"subject_id": 13810, "subject_name": "Federal Emergency Management Agency (FEMA)"}, {"subject_id": 13187, "subject_name": "Financial services and investments"}, {"subject_id": 13188, "subject_name": "Fires"}, {"subject_id": 20790, "subject_name": "First responders and emergency personnel"}, {"subject_id": 13189, "subject_name": "Floods and storm protection"}, {"subject_id": 13365, "subject_name": "Foreign and international corporations"}, {"subject_id": 22687, "subject_name": "Forests, forestry, trees"}, {"subject_id": 13309, "subject_name": "Fraud offenses and financial crimes"}, {"subject_id": 13506, "subject_name": "Genetics"}, {"subject_id": 321582, "subject_name": "Geography and mapping"}, {"subject_id": 13196, "subject_name": "Government buildings, facilities, and property"}, {"subject_id": 13200, "subject_name": "Government information and archives"}, {"subject_id": 13202, "subject_name": "Government lending and loan guarantees"}, {"subject_id": 22688, "subject_name": "Government studies and investigations"}, {"subject_id": 13203, "subject_name": "Government trust funds"}, {"subject_id": 13352, "subject_name": "Great Lakes"}, {"subject_id": 13605, "subject_name": "HIV/AIDS"}, {"subject_id": 13205, "subject_name": "Hazardous wastes and toxic substances"}, {"subject_id": 13206, "subject_name": "Health care costs and insurance"}, {"subject_id": 13207, "subject_name": "Health care coverage and access"}, {"subject_id": 13209, "subject_name": "Health facilities and institutions"}, {"subject_id": 13210, "subject_name": "Health information and medical records"}, {"subject_id": 13211, "subject_name": "Health personnel"}, {"subject_id": 13212, "subject_name": "Health programs administration and funding"}, {"subject_id": 13213, "subject_name": "Health promotion and preventive care"}, {"subject_id": 13214, "subject_name": "Health technology, devices, supplies"}, {"subject_id": 13608, "subject_name": "Hearing, speech, and vision care"}, {"subject_id": 13215, "subject_name": "Higher education"}, {"subject_id": 13219, "subject_name": "Housing and community development funding"}, {"subject_id": 22125, "subject_name": "Housing discrimination"}, {"subject_id": 13220, "subject_name": "Housing finance and home ownership"}, {"subject_id": 13221, "subject_name": "Housing for the elderly and disabled"}, {"subject_id": 13704, "subject_name": "Housing supply and affordability"}, {"subject_id": 13402, "subject_name": "Human rights"}, {"subject_id": 13519, "subject_name": "Hybrid, electric, and advanced technology vehicles"}, {"subject_id": 81056, "subject_name": "Immunology and vaccination"}, {"subject_id": 13224, "subject_name": "Income tax credits"}, {"subject_id": 13225, "subject_name": "Income tax deductions"}, {"subject_id": 13226, "subject_name": "Income tax exclusion"}, {"subject_id": 13227, "subject_name": "Income tax rates"}, {"subject_id": 13228, "subject_name": "Indian social and development programs"}, {"subject_id": 13706, "subject_name": "Infectious and parasitic diseases"}, {"subject_id": 13493, "subject_name": "Inflation and prices"}, {"subject_id": 13229, "subject_name": "Infrastructure development"}, {"subject_id": 13487, "subject_name": "Insurance industry and regulation"}, {"subject_id": 13230, "subject_name": "Interest, dividends, interest rates"}, {"subject_id": 13368, "subject_name": "Internal Revenue Service (IRS)"}, {"subject_id": 13233, "subject_name": "Internet and video services"}, {"subject_id": 13234, "subject_name": "Labor standards"}, {"subject_id": 13425, "subject_name": "Land use and conservation"}, {"subject_id": 13342, "subject_name": "Lawyers and legal services"}, {"subject_id": 321502, "subject_name": "Lighting, heating, cooling"}, {"subject_id": 13237, "subject_name": "Long-term, rehabilitative, and terminal care"}, {"subject_id": 13238, "subject_name": "Low- and moderate-income housing"}, {"subject_id": 13701, "subject_name": "Manufacturing"}, {"subject_id": 13360, "subject_name": "Marine and inland water transportation"}, {"subject_id": 13240, "subject_name": "Medical education"}, {"subject_id": 13241, "subject_name": "Medical research"}, {"subject_id": 13313, "subject_name": "Medical tests and diagnostic methods"}, {"subject_id": 13242, "subject_name": "Medicare"}, {"subject_id": 13314, "subject_name": "Mental health"}, {"subject_id": 13244, "subject_name": "Military facilities and property"}, {"subject_id": 13619, "subject_name": "Mining"}, {"subject_id": 13635, "subject_name": "Minority education"}, {"subject_id": 20700, "subject_name": "Minority employment"}, {"subject_id": 13245, "subject_name": "Minority health"}, {"subject_id": 13247, "subject_name": "Motor fuels"}, {"subject_id": 13442, "subject_name": "Natural disasters"}, {"subject_id": 13421, "subject_name": "Navigation, waterways, harbors"}, {"subject_id": 13563, "subject_name": "New Mexico"}, {"subject_id": 13600, "subject_name": "New York City"}, {"subject_id": 13806, "subject_name": "News media and reporting"}, {"subject_id": 13730, "subject_name": "Nursing"}, {"subject_id": 13256, "subject_name": "Oil and gas"}, {"subject_id": 13569, "subject_name": "Outdoor recreation"}, {"subject_id": 13257, "subject_name": "Parks, recreation areas, trails"}, {"subject_id": 13620, "subject_name": "Pedestrians and bicycling"}, {"subject_id": 13426, "subject_name": "Pollution liability"}, {"subject_id": 13259, "subject_name": "Poverty and welfare assistance"}, {"subject_id": 13490, "subject_name": "Prescription drugs"}, {"subject_id": 13260, "subject_name": "Public contracts and procurement"}, {"subject_id": 13261, "subject_name": "Public housing"}, {"subject_id": 13262, "subject_name": "Public transit"}, {"subject_id": 13474, "subject_name": "Public utilities and utility rates"}, {"subject_id": 13263, "subject_name": "Puerto Rico"}, {"subject_id": 324652, "subject_name": "Radio spectrum allocation"}, {"subject_id": 13265, "subject_name": "Railroads"}, {"subject_id": 13508, "subject_name": "Real estate business"}, {"subject_id": 13267, "subject_name": "Research administration and funding"}, {"subject_id": 13268, "subject_name": "Research and development"}, {"subject_id": 13269, "subject_name": "Residential rehabilitation and home repair"}, {"subject_id": 13270, "subject_name": "Right of privacy"}, {"subject_id": 13271, "subject_name": "Roads and highways"}, {"subject_id": 13272, "subject_name": "Rural conditions and development"}, {"subject_id": 13316, "subject_name": "Sales and excise taxes"}, {"subject_id": 13721, "subject_name": "School administration"}, {"subject_id": 13273, "subject_name": "Securities"}, {"subject_id": 13504, "subject_name": "Self-employed"}, {"subject_id": 13349, "subject_name": "Sex and reproductive health"}, {"subject_id": 13276, "subject_name": "Small business"}, {"subject_id": 13279, "subject_name": "Social security and elderly assistance"}, {"subject_id": 13280, "subject_name": "Social work, volunteer service, charitable organizations"}, {"subject_id": 13281, "subject_name": "Solid waste and recycling"}, {"subject_id": 13761, "subject_name": "Sound recording"}, {"subject_id": 13283, "subject_name": "Special education"}, {"subject_id": 13286, "subject_name": "Student aid and college costs"}, {"subject_id": 13319, "subject_name": "Tax administration and collection, taxpayers"}, {"subject_id": 13672, "subject_name": "Tax treatment of families"}, {"subject_id": 13370, "subject_name": "Taxation of foreign income"}, {"subject_id": 13287, "subject_name": "Teaching, teachers, curricula"}, {"subject_id": 13288, "subject_name": "Telecommunication rates and fees"}, {"subject_id": 13289, "subject_name": "Telephone and wireless communication"}, {"subject_id": 13431, "subject_name": "Terrorism"}, {"subject_id": 13573, "subject_name": "Texas"}, {"subject_id": 13290, "subject_name": "Trade adjustment assistance"}, {"subject_id": 13371, "subject_name": "Transfer and inheritance taxes"}, {"subject_id": 13291, "subject_name": "Transportation programs funding"}, {"subject_id": 13292, "subject_name": "Transportation safety and security"}, {"subject_id": 13491, "subject_name": "U.S. territories and protectorates"}, {"subject_id": 13293, "subject_name": "Unemployment"}, {"subject_id": 13382, "subject_name": "Veterans' loans, housing, homeless programs"}, {"subject_id": 13295, "subject_name": "Veterans' medical care"}, {"subject_id": 13362, "subject_name": "Veterans' pensions and compensation"}, {"subject_id": 13343, "subject_name": "Violent crime"}, {"subject_id": 13297, "subject_name": "Wages and earnings"}, {"subject_id": 13298, "subject_name": "Water quality"}, {"subject_id": 13394, "subject_name": "Water use and supply"}, {"subject_id": 13300, "subject_name": "Watersheds"}, {"subject_id": 13302, "subject_name": "Women's health"}, {"subject_id": 13468, "subject_name": "Worker safety and health"}, {"subject_id": 13303, "subject_name": "Youth employment and child labor"}, {"subject_id": 13780, "subject_name": "Alaska Natives and Hawaiians"}, {"subject_id": 13332, "subject_name": "Atmospheric science and weather"}, {"subject_id": 22782, "subject_name": "Business education"}, {"subject_id": 13732, "subject_name": "China"}, {"subject_id": 13539, "subject_name": "Colorado"}, {"subject_id": 13144, "subject_name": "Computers and information technology"}, {"subject_id": 13145, "subject_name": "Congressional agencies"}, {"subject_id": 13433, "subject_name": "Correctional facilities and imprisonment"}, {"subject_id": 13541, "subject_name": "Dams and canals"}, {"subject_id": 13155, "subject_name": "Department of Energy"}, {"subject_id": 13159, "subject_name": "Department of Justice"}, {"subject_id": 13164, "subject_name": "Department of the Interior"}, {"subject_id": 13543, "subject_name": "Endangered and threatened species"}, {"subject_id": 13181, "subject_name": "Energy research"}, {"subject_id": 13417, "subject_name": "Energy revenues and royalties"}, {"subject_id": 13333, "subject_name": "Environmental assessment, monitoring, research"}, {"subject_id": 13634, "subject_name": "Federal Communications Commission (FCC)"}, {"subject_id": 13514, "subject_name": "Federal Trade Commission (FTC)"}, {"subject_id": 13415, "subject_name": "Fishes"}, {"subject_id": 13511, "subject_name": "Food industry and services"}, {"subject_id": 13521, "subject_name": "Food supply, safety, and labeling"}, {"subject_id": 13191, "subject_name": "Foreign labor"}, {"subject_id": 13194, "subject_name": "General Services Administration"}, {"subject_id": 13195, "subject_name": "Government Accountability Office (GAO)"}, {"subject_id": 13397, "subject_name": "Government liability"}, {"subject_id": 13204, "subject_name": "Guam"}, {"subject_id": 13353, "subject_name": "Gulf of Mexico"}, {"subject_id": 13310, "subject_name": "Hawaii"}, {"subject_id": 13516, "subject_name": "Historic sites and heritage areas"}, {"subject_id": 13547, "subject_name": "Historical and cultural resources"}, {"subject_id": 13403, "subject_name": "Immigration status and procedures"}, {"subject_id": 13379, "subject_name": "Indian lands and resources rights"}, {"subject_id": 20694, "subject_name": "Insects"}, {"subject_id": 13420, "subject_name": "Lakes and rivers"}, {"subject_id": 13236, "subject_name": "Law enforcement administration and funding"}, {"subject_id": 13312, "subject_name": "Licensing and registrations"}, {"subject_id": 13335, "subject_name": "Marine and coastal resources, fisheries"}, {"subject_id": 13239, "subject_name": "Medicaid"}, {"subject_id": 13848, "subject_name": "Minority and disadvantaged businesses"}, {"subject_id": 13249, "subject_name": "National Aeronautics and Space Administration"}, {"subject_id": 13386, "subject_name": "National Archives and Records Administration"}, {"subject_id": 13253, "subject_name": "National Science Foundation"}, {"subject_id": 13255, "subject_name": "Northern Mariana Islands"}, {"subject_id": 13693, "subject_name": "Nuclear power"}, {"subject_id": 13679, "subject_name": "Office of Management and Budget (OMB)"}, {"subject_id": 13354, "subject_name": "Pacific Ocean"}, {"subject_id": 13392, "subject_name": "Pipelines"}, {"subject_id": 13752, "subject_name": "Preschool education"}, {"subject_id": 13475, "subject_name": "Refugees, asylum, displaced persons"}, {"subject_id": 13878, "subject_name": "Seafood"}, {"subject_id": 13680, "subject_name": "Seashores and lakeshores"}, {"subject_id": 13275, "subject_name": "Small Business Administration"}, {"subject_id": 13647, "subject_name": "Spacecraft and satellites"}, {"subject_id": 13285, "subject_name": "State and local government operations"}, {"subject_id": 13357, "subject_name": "U.S. Postal Service"}, {"subject_id": 13648, "subject_name": "User charges and fees"}, {"subject_id": 13294, "subject_name": "Veterans' education, employment, rehabilitation"}, {"subject_id": 13296, "subject_name": "Virgin Islands"}, {"subject_id": 13527, "subject_name": "Visas and passports"}, {"subject_id": 13299, "subject_name": "Water resources funding"}, {"subject_id": 13427, "subject_name": "Wetlands"}, {"subject_id": 13301, "subject_name": "Wilderness and natural areas, wildlife refuges, wild rivers, habitats"}, {"subject_id": 13337, "subject_name": "Wildlife conservation and habitat protection"}, {"subject_id": 13548, "subject_name": "Horticulture and plants"}, {"subject_id": 354151, "subject_name": "Internet, web applications, social media"}], "texts": [{"doc_id": 2434613, "date": "2021-09-28", "type": "Introduced", "type_id": 1, "mime": "application/pdf", "mime_id": 2, "url": "https://legiscan.com/US/text/HB5376/id/2434613", "state_link": "https://www.congress.gov/117/bills/hr5376/BILLS-117hr5376rh.pdf", "text_size": 4143981, "text_hash": "5bef93a8a5165c2f355b25aa7bbc2095"}, {"doc_id": 2602775, "date": "2022-08-03", "type": "Engrossed", "type_id": 4, "mime": "application/pdf", "mime_id": 2, "url": "https://legiscan.com/US/text/HB5376/id/2602775", "state_link": "https://www.congress.gov/117/bills/hr5376/BILLS-117hr5376eh.pdf", "text_size": 3295527, "text_hash": "bc546dfe7d3d74a09e893d769197fc1a"}, {"doc_id": 2602874, "date": "2022-08-04", "type": "Introduced", "type_id": 1, "mime": "application/pdf", "mime_id": 2, "url": "https://legiscan.com/US/text/HB5376/id/2602874", "state_link": "https://www.congress.gov/117/bills/hr5376/BILLS-117hr5376pcs.pdf", "text_size": 3549848, "text_hash": "9180b5a8470cfa87750817ea950ffd0c"}, {"doc_id": 2603130, "date": "2022-08-09", "type": "Amended", "type_id": 3, "mime": "application/pdf", "mime_id": 2, "url": "https://legiscan.com/US/text/HB5376/id/2603130", "state_link": "https://www.congress.gov/117/bills/hr5376/BILLS-117hr5376eas.pdf", "text_size": 975403, "text_hash": "4dc0b5ba87c02dd4c3166e897730d6bd"}, {"doc_id": 2603670, "date": "2022-08-13", "type": "Enrolled", "type_id": 5, "mime": "application/pdf", "mime_id": 2, "url": "https://legiscan.com/US/text/HB5376/id/2603670", "state_link": "https://www.congress.gov/117/bills/hr5376/BILLS-117hr5376enr.pdf", "text_size": 729457, "text_hash": "5f45b89ac1609e6a114d5719a7cfd4c4"}], "votes": [{"roll_call_id": 1116336, "date": "2021-11-19", "desc": "On motion to recommit", "yea": 208, "nay": 220, "nv": 0, "absent": 6, "total": 434, "passed": 0, "chamber": "H", "chamber_id": 114, "url": "https://legiscan.com/US/rollcall/HB5376/id/1116336", "state_link": "https://clerk.house.gov/Votes/2021384"}, {"roll_call_id": 1116337, "date": "2021-11-19", "desc": "On motion to table the motion to reconsider", "yea": 217, "nay": 105, "nv": 0, "absent": 112, "total": 434, "passed": 1, "chamber": "H", "chamber_id": 114, "url": "https://legiscan.com/US/rollcall/HB5376/id/1116337", "state_link": "https://clerk.house.gov/Votes/2021386"}, {"roll_call_id": 1116338, "date": "2021-11-19", "desc": "On passage", "yea": 220, "nay": 213, "nv": 0, "absent": 1, "total": 434, "passed": 1, "chamber": "H", "chamber_id": 114, "url": "https://legiscan.com/US/rollcall/HB5376/id/1116338", "state_link": "https://clerk.house.gov/Votes/2021385"}, {"roll_call_id": 1223104, "date": "2022-08-06", "desc": "Motion to proceed to consideration of measure", "yea": 50, "nay": 50, "nv": 0, "absent": 0, "total": 100, "passed": 1, "chamber": "S", "chamber_id": 115, "url": "https://legiscan.com/US/rollcall/HB5376/id/1223104", "state_link": "https://www.senate.gov/legislative/LIS/roll_call_votes/vote1172/vote_117_2_00287.xml"}, {"roll_call_id": 1223105, "date": "2022-08-07", "desc": "Amendment SA 5208 S.Amdt.5208", "yea": 1, "nay": 97, "nv": 0, "absent": 2, "total": 100, "passed": 0, "chamber": "S", "chamber_id": 115, "url": "https://legiscan.com/US/rollcall/HB5376/id/1223105", "state_link": "https://www.senate.gov/legislative/LIS/roll_call_votes/vote1172/vote_117_2_00308.xml"}, {"roll_call_id": 1223106, "date": "2022-08-07", "desc": "Amendment SA 5209 S.Amdt.5209", "yea": 1, "nay": 98, "nv": 0, "absent": 1, "total": 100, "passed": 0, "chamber": "S", "chamber_id": 115, "url": "https://legiscan.com/US/rollcall/HB5376/id/1223106", "state_link": "https://www.senate.gov/legislative/LIS/roll_call_votes/vote1172/vote_117_2_00299.xml"}, {"roll_call_id": 1223107, "date": "2022-08-07", "desc": "Amendment SA 5211 S.Amdt.5211", "yea": 3, "nay": 97, "nv": 0, "absent": 0, "total": 100, "passed": 0, "chamber": "S", "chamber_id": 115, "url": "https://legiscan.com/US/rollcall/HB5376/id/1223107", "state_link": "https://www.senate.gov/legislative/LIS/roll_call_votes/vote1172/vote_117_2_00292.xml"}, {"roll_call_id": 1223108, "date": "2022-08-07", "desc": "Amendment SA 5263 S.Amdt.5263", "yea": 50, "nay": 50, "nv": 0, "absent": 0, "total": 100, "passed": 0, "chamber": "S", "chamber_id": 115, "url": "https://legiscan.com/US/rollcall/HB5376/id/1223108", "state_link": "https://www.senate.gov/legislative/LIS/roll_call_votes/vote1172/vote_117_2_00309.xml"}, {"roll_call_id": 1223109, "date": "2022-08-07", "desc": "Amendment SA 5281 S.Amdt.5281", "yea": 1, "nay": 99, "nv": 0, "absent": 0, "total": 100, "passed": 0, "chamber": "S", "chamber_id": 115, "url": "https://legiscan.com/US/rollcall/HB5376/id/1223109", "state_link": "https://www.senate.gov/legislative/LIS/roll_call_votes/vote1172/vote_117_2_00312.xml"}, {"roll_call_id": 1223110, "date": "2022-08-07", "desc": "Amendment SA 5301 S.Amdt.5301", "yea": 50, "nay": 50, "nv": 0, "absent": 0, "total": 100, "passed": 0, "chamber": "S", "chamber_id": 115, "url": "https://legiscan.com/US/rollcall/HB5376/id/1223110", "state_link": "https://www.senate.gov/legislative/LIS/roll_call_votes/vote1172/vote_117_2_00289.xml"}, {"roll_call_id": 1223111, "date": "2022-08-07", "desc": "Amendment SA 5316 S.Amdt.5316", "yea": 49, "nay": 51, "nv": 0, "absent": 0, "total": 100, "passed": 0, "chamber": "S", "chamber_id": 115, "url": "https://legiscan.com/US/rollcall/HB5376/id/1223111", "state_link": "https://www.senate.gov/legislative/LIS/roll_call_votes/vote1172/vote_117_2_00305.xml"}, {"roll_call_id": 1223112, "date": "2022-08-07", "desc": "Amendment SA 5382 S.Amdt.5382", "yea": 50, "nay": 50, "nv": 0, "absent": 0, "total": 100, "passed": 0, "chamber": "S", "chamber_id": 115, "url": "https://legiscan.com/US/rollcall/HB5376/id/1223112", "state_link": "https://www.senate.gov/legislative/LIS/roll_call_votes/vote1172/vote_117_2_00293.xml"}, {"roll_call_id": 1223113, "date": "2022-08-07", "desc": "Amendment SA 5384 S.Amdt.5384", "yea": 50, "nay": 50, "nv": 0, "absent": 0, "total": 100, "passed": 0, "chamber": "S", "chamber_id": 115, "url": "https://legiscan.com/US/rollcall/HB5376/id/1223113", "state_link": "https://www.senate.gov/legislative/LIS/roll_call_votes/vote1172/vote_117_2_00294.xml"}, {"roll_call_id": 1223114, "date": "2022-08-07", "desc": "Amendment SA 5385 S.Amdt.5385", "yea": 50, "nay": 50, "nv": 0, "absent": 0, "total": 100, "passed": 0, "chamber": "S", "chamber_id": 115, "url": "https://legiscan.com/US/rollcall/HB5376/id/1223114", "state_link": "https://www.senate.gov/legislative/LIS/roll_call_votes/vote1172/vote_117_2_00313.xml"}, {"roll_call_id": 1223115, "date": "2022-08-07", "desc": "Amendment SA 5387 S.Amdt.5387", "yea": 50, "nay": 50, "nv": 0, "absent": 0, "total": 100, "passed": 0, "chamber": "S", "chamber_id": 115, "url": "https://legiscan.com/US/rollcall/HB5376/id/1223115", "state_link": "https://www.senate.gov/legislative/LIS/roll_call_votes/vote1172/vote_117_2_00303.xml"}, {"roll_call_id": 1223116, "date": "2022-08-07", "desc": "Amendment SA 5389 S.Amdt.5389", "yea": 50, "nay": 50, "nv": 0, "absent": 0, "total": 100, "passed": 0, "chamber": "S", "chamber_id": 115, "url": "https://legiscan.com/US/rollcall/HB5376/id/1223116", "state_link": "https://www.senate.gov/legislative/LIS/roll_call_votes/vote1172/vote_117_2_00298.xml"}, {"roll_call_id": 1223117, "date": "2022-08-07", "desc": "Amendment SA 5404 S.Amdt.5404", "yea": 50, "nay": 50, "nv": 0, "absent": 0, "total": 100, "passed": 0, "chamber": "S", "chamber_id": 115, "url": "https://legiscan.com/US/rollcall/HB5376/id/1223117", "state_link": "https://www.senate.gov/legislative/LIS/roll_call_votes/vote1172/vote_117_2_00296.xml"}, {"roll_call_id": 1223118, "date": "2022-08-07", "desc": "Amendment SA 5409 S.Amdt.5409", "yea": 50, "nay": 50, "nv": 0, "absent": 0, "total": 100, "passed": 0, "chamber": "S", "chamber_id": 115, "url": "https://legiscan.com/US/rollcall/HB5376/id/1223118", "state_link": "https://www.senate.gov/legislative/LIS/roll_call_votes/vote1172/vote_117_2_00291.xml"}, {"roll_call_id": 1223119, "date": "2022-08-07", "desc": "Amendment SA 5418 S.Amdt.5418", "yea": 50, "nay": 50, "nv": 0, "absent": 0, "total": 100, "passed": 0, "chamber": "S", "chamber_id": 115, "url": "https://legiscan.com/US/rollcall/HB5376/id/1223119", "state_link": "https://www.senate.gov/legislative/LIS/roll_call_votes/vote1172/vote_117_2_00306.xml"}, {"roll_call_id": 1223120, "date": "2022-08-07", "desc": "Amendment SA 5421 S.Amdt.5421", "yea": 49, "nay": 51, "nv": 0, "absent": 0, "total": 100, "passed": 0, "chamber": "S", "chamber_id": 115, "url": "https://legiscan.com/US/rollcall/HB5376/id/1223120", "state_link": "https://www.senate.gov/legislative/LIS/roll_call_votes/vote1172/vote_117_2_00301.xml"}, {"roll_call_id": 1223121, "date": "2022-08-07", "desc": "Amendment SA 5435 S.Amdt.5435", "yea": 50, "nay": 50, "nv": 0, "absent": 0, "total": 100, "passed": 0, "chamber": "S", "chamber_id": 115, "url": "https://legiscan.com/US/rollcall/HB5376/id/1223121", "state_link": "https://www.senate.gov/legislative/LIS/roll_call_votes/vote1172/vote_117_2_00320.xml"}, {"roll_call_id": 1223122, "date": "2022-08-07", "desc": "Amendment SA 5472 S.Amdt.5472", "yea": 57, "nay": 43, "nv": 0, "absent": 0, "total": 100, "passed": 1, "chamber": "S", "chamber_id": 115, "url": "https://legiscan.com/US/rollcall/HB5376/id/1223122", "state_link": "https://www.senate.gov/legislative/LIS/roll_call_votes/vote1172/vote_117_2_00323.xml"}, {"roll_call_id": 1223123, "date": "2022-08-07", "desc": "Amendment SA 5487 S.Amdt.5487", "yea": 50, "nay": 50, "nv": 0, "absent": 0, "total": 100, "passed": 0, "chamber": "S", "chamber_id": 115, "url": "https://legiscan.com/US/rollcall/HB5376/id/1223123", "state_link": "https://www.senate.gov/legislative/LIS/roll_call_votes/vote1172/vote_117_2_00321.xml"}, {"roll_call_id": 1223124, "date": "2022-08-07", "desc": "Amendment SA 5488 S.Amdt.5488", "yea": 50, "nay": 50, "nv": 0, "absent": 0, "total": 100, "passed": 1, "chamber": "S", "chamber_id": 115, "url": "https://legiscan.com/US/rollcall/HB5376/id/1223124", "state_link": "https://www.senate.gov/legislative/LIS/roll_call_votes/vote1172/vote_117_2_00324.xml"}, {"roll_call_id": 1223125, "date": "2022-08-07", "desc": "Motion by Senator Blackburn to commit to Senate Committee on Agriculture, Nutrition, and Forestry with instructions rejected in Senate", "yea": 50, "nay": 50, "nv": 0, "absent": 0, "total": 100, "passed": 0, "chamber": "S", "chamber_id": 115, "url": "https://legiscan.com/US/rollcall/HB5376/id/1223125", "state_link": "https://www.senate.gov/legislative/LIS/roll_call_votes/vote1172/vote_117_2_00318.xml"}, {"roll_call_id": 1223126, "date": "2022-08-07", "desc": "Motion by Senator Collins to commit to Senate Committee on Finance with instructions rejected in Senate", "yea": 50, "nay": 50, "nv": 0, "absent": 0, "total": 100, "passed": 0, "chamber": "S", "chamber_id": 115, "url": "https://legiscan.com/US/rollcall/HB5376/id/1223126", "state_link": "https://www.senate.gov/legislative/LIS/roll_call_votes/vote1172/vote_117_2_00302.xml"}, {"roll_call_id": 1223127, "date": "2022-08-07", "desc": "Motion by Senator Cruz to commit to Senate Committee on Homeland Security and Governmental Affairs with instructions rejected in Senate", "yea": 49, "nay": 51, "nv": 0, "absent": 0, "total": 100, "passed": 0, "chamber": "S", "chamber_id": 115, "url": "https://legiscan.com/US/rollcall/HB5376/id/1223127", "state_link": "https://www.senate.gov/legislative/LIS/roll_call_votes/vote1172/vote_117_2_00315.xml"}, {"roll_call_id": 1223128, "date": "2022-08-07", "desc": "Motion by Senator Cruz to commit to Senate Committee on the Judiciary with instructions rejected in Senate", "yea": 50, "nay": 50, "nv": 0, "absent": 0, "total": 100, "passed": 0, "chamber": "S", "chamber_id": 115, "url": "https://legiscan.com/US/rollcall/HB5376/id/1223128", "state_link": "https://www.senate.gov/legislative/LIS/roll_call_votes/vote1172/vote_117_2_00316.xml"}, {"roll_call_id": 1223129, "date": "2022-08-07", "desc": "Motion by Senator Hagerty to commit to Senate Committee on the Judiciary with instructions rejected in Senate", "yea": 50, "nay": 50, "nv": 0, "absent": 0, "total": 100, "passed": 0, "chamber": "S", "chamber_id": 115, "url": "https://legiscan.com/US/rollcall/HB5376/id/1223129", "state_link": "https://www.senate.gov/legislative/LIS/roll_call_votes/vote1172/vote_117_2_00322.xml"}, {"roll_call_id": 1223130, "date": "2022-08-07", "desc": "Motion by Senator Hoeven to commit to Senate Committee on Finance with instructions rejected in Senate", "yea": 50, "nay": 50, "nv": 0, "absent": 0, "total": 100, "passed": 0, "chamber": "S", "chamber_id": 115, "url": "https://legiscan.com/US/rollcall/HB5376/id/1223130", "state_link": "https://www.senate.gov/legislative/LIS/roll_call_votes/vote1172/vote_117_2_00317.xml"}, {"roll_call_id": 1223131, "date": "2022-08-07", "desc": "Motion by Senator Rubio to commit to Senate Committee on Health, Education, Labor, and Pensions with instructions rejected in Senate", "yea": 50, "nay": 50, "nv": 0, "absent": 0, "total": 100, "passed": 0, "chamber": "S", "chamber_id": 115, "url": "https://legiscan.com/US/rollcall/HB5376/id/1223131", "state_link": "https://www.senate.gov/legislative/LIS/roll_call_votes/vote1172/vote_117_2_00319.xml"}, {"roll_call_id": 1223132, "date": "2022-08-07", "desc": "Motion by Senator Rubio to commit to Senate Committee on the Judiciary with instructions rejected in Senate", "yea": 50, "nay": 50, "nv": 0, "absent": 0, "total": 100, "passed": 0, "chamber": "S", "chamber_id": 115, "url": "https://legiscan.com/US/rollcall/HB5376/id/1223132", "state_link": "https://www.senate.gov/legislative/LIS/roll_call_votes/vote1172/vote_117_2_00304.xml"}, {"roll_call_id": 1223133, "date": "2022-08-07", "desc": "Motion by Senator Scott FL, to commit to Senate Committee on Finance with instructions rejected in Senate", "yea": 50, "nay": 50, "nv": 0, "absent": 0, "total": 100, "passed": 0, "chamber": "S", "chamber_id": 115, "url": "https://legiscan.com/US/rollcall/HB5376/id/1223133", "state_link": "https://www.senate.gov/legislative/LIS/roll_call_votes/vote1172/vote_117_2_00297.xml"}, {"roll_call_id": 1223134, "date": "2022-08-07", "desc": "Motion by Senator Scott SC, to commit to Senate Committee on Finance with instructions rejected in Senate", "yea": 50, "nay": 50, "nv": 0, "absent": 0, "total": 100, "passed": 0, "chamber": "S", "chamber_id": 115, "url": "https://legiscan.com/US/rollcall/HB5376/id/1223134", "state_link": "https://www.senate.gov/legislative/LIS/roll_call_votes/vote1172/vote_117_2_00307.xml"}, {"roll_call_id": 1223135, "date": "2022-08-07", "desc": "Motion to waive all applicable budgetary discipline with respect to amendment SA 5194, as modified, rejected in Senate S.Amdt.5194", "yea": 57, "nay": 43, "nv": 0, "absent": 0, "total": 100, "passed": 0, "chamber": "S", "chamber_id": 115, "url": "https://legiscan.com/US/rollcall/HB5376/id/1223135", "state_link": "https://www.senate.gov/legislative/LIS/roll_call_votes/vote1172/vote_117_2_00314.xml"}, {"roll_call_id": 1223136, "date": "2022-08-07", "desc": "Motion to waive all applicable budgetary discipline with respect to amendment SA 5210 rejected in Senate S.Amdt.5210", "yea": 1, "nay": 99, "nv": 0, "absent": 0, "total": 100, "passed": 0, "chamber": "S", "chamber_id": 115, "url": "https://legiscan.com/US/rollcall/HB5376/id/1223136", "state_link": "https://www.senate.gov/legislative/LIS/roll_call_votes/vote1172/vote_117_2_00288.xml"}, {"roll_call_id": 1223137, "date": "2022-08-07", "desc": "Motion to waive all applicable budgetary discipline with respect to amendment SA 5262 rejected in Senate S.Amdt.5262", "yea": 5, "nay": 94, "nv": 0, "absent": 1, "total": 100, "passed": 0, "chamber": "S", "chamber_id": 115, "url": "https://legiscan.com/US/rollcall/HB5376/id/1223137", "state_link": "https://www.senate.gov/legislative/LIS/roll_call_votes/vote1172/vote_117_2_00310.xml"}, {"roll_call_id": 1223138, "date": "2022-08-07", "desc": "Motion to waive all applicable budgetary discipline with respect to amendment SA 5265 rejected in Senate S.Amdt.5265", "yea": 54, "nay": 46, "nv": 0, "absent": 0, "total": 100, "passed": 0, "chamber": "S", "chamber_id": 115, "url": "https://legiscan.com/US/rollcall/HB5376/id/1223138", "state_link": "https://www.senate.gov/legislative/LIS/roll_call_votes/vote1172/vote_117_2_00311.xml"}, {"roll_call_id": 1223139, "date": "2022-08-07", "desc": "Motion to waive all applicable budgetary discipline with respect to amendment SA 5469 rejected in Senate S.Amdt.5469", "yea": 55, "nay": 45, "nv": 0, "absent": 0, "total": 100, "passed": 0, "chamber": "S", "chamber_id": 115, "url": "https://legiscan.com/US/rollcall/HB5376/id/1223139", "state_link": "https://www.senate.gov/legislative/LIS/roll_call_votes/vote1172/vote_117_2_00290.xml"}, {"roll_call_id": 1223140, "date": "2022-08-07", "desc": "Motion to waive all applicable budgetary discipline with respect to amendment SA 5480 rejected in Senate S.Amdt.5480", "yea": 56, "nay": 44, "nv": 0, "absent": 0, "total": 100, "passed": 0, "chamber": "S", "chamber_id": 115, "url": "https://legiscan.com/US/rollcall/HB5376/id/1223140", "state_link": "https://www.senate.gov/legislative/LIS/roll_call_votes/vote1172/vote_117_2_00295.xml"}, {"roll_call_id": 1223141, "date": "2022-08-07", "desc": "Motion to waive waive all applicable budgetary discipline with respect to amendment SA 5383 rejected in Senate S.Amdt.5383", "yea": 49, "nay": 50, "nv": 0, "absent": 1, "total": 100, "passed": 0, "chamber": "S", "chamber_id": 115, "url": "https://legiscan.com/US/rollcall/HB5376/id/1223141", "state_link": "https://www.senate.gov/legislative/LIS/roll_call_votes/vote1172/vote_117_2_00300.xml"}, {"roll_call_id": 1223142, "date": "2022-08-07", "desc": "Passed Senate with an amendment", "yea": 50, "nay": 50, "nv": 0, "absent": 0, "total": 100, "passed": 1, "chamber": "S", "chamber_id": 115, "url": "https://legiscan.com/US/rollcall/HB5376/id/1223142", "state_link": "https://www.senate.gov/legislative/LIS/roll_call_votes/vote1172/vote_117_2_00325.xml"}, {"roll_call_id": 1224057, "date": "2022-08-12", "desc": "On motion that the House agree to the Senate amendment", "yea": 220, "nay": 207, "nv": 0, "absent": 4, "total": 431, "passed": 1, "chamber": "H", "chamber_id": 114, "url": "https://legiscan.com/US/rollcall/HB5376/id/1224057", "state_link": "https://clerk.house.gov/Votes/2022420"}], "amendments": [], "supplements": [], "calendar": [{"type_id": 1, "type": "Hearing", "date": "2021-10-28", "time": "15:00", "location": "H-313 CAPITOL", "description": "House Committee on Rules Hearing"}, {"type_id": 1, "type": "Hearing", "date": "2021-11-18", "time": "17:30", "location": "H-313 CAPITOL", "description": "House Committee on Rules Hearing"}, {"type_id": 1, "type": "Hearing", "date": "2022-04-27", "time": "14:30", "location": "SR-428A", "description": "Senate Small Business and Entrepreneurship Hearing"}, {"type_id": 1, "type": "Hearing", "date": "2022-08-04", "time": "10:00", "location": "SD-538", "description": "Senate Banking, Housing, and Urban Affairs Hearing"}, {"type_id": 1, "type": "Hearing", "date": "2022-08-10", "time": "14:00", "location": "H-313 CAPITOL", "description": "House Committee on Rules Hearing"}]}}