{"status": "OK", "bill": {"bill_id": 203591, "change_hash": "468ffad7ccf68d22937aa7b8649c1699", "session_id": 77, "session": {"session_id": 77, "state_id": 52, "year_start": 2009, "year_end": 2010, "prefile": 0, "sine_die": 1, "prior": 1, "special": 0, "session_tag": "Regular Session", "session_title": "2009-2010 Regular Session", "session_name": "111th Congress"}, "url": "https://legiscan.com/US/bill/SB3033/2009", "state_link": "https://www.congress.gov/bill/111th-congress/senate-bill/3033/all-info", "completed": 0, "status": 1, "status_date": "2010-02-24", "progress": [{"date": "2010-02-24", "event": 1}, {"date": "2010-02-24", "event": 9}], "state": "US", "state_id": 52, "bill_number": "SB3033", "bill_type": "B", "bill_type_id": "1", "body": "S", "body_id": 115, "current_body": "S", "current_body_id": 115, "title": "Protecting Employees and Retirees in Business Bankruptcies Act of 2010", "description": "Protecting Employees and Retirees in Business Bankruptcies Act of 2010 - Amends federal bankruptcy law governing expenses and claims to increase to $20,000: (1) allowed unsecured claims in the fourth order of priority (wages, salaries, or commissions); and (2) the factor multiplied by the number of employees covered with respect to employee benefit plan contributions in the fifth order of priority. Includes within the scope of a claim in bankruptcy certain equity securities held in a defined contribution plan for the benefit of certain individuals, but only if an employer or plan sponsor who has commenced a case in bankruptcy has committed fraud regarding the plan or has otherwise breached a duty to the participant that has proximately caused the loss of value. Allows as an administrative expense: (1) severance pay owed to certain employees of the debtor for layoff or termination (which pay shall be deemed earned in full); and (2) damages as a result of violation of law by the debtor. Includes among prerequisites for confirmation of a business reorganization bankruptcy plan (Chapter 11) provision for: (1) recovery of damages payable for the rejection of a collective bargaining agreement, or other financial returns as negotiated by the debtor and the authorized representative; (2) continued payment of retiree benefits maintained or established by the debtor before the petition filing date if no modifications are made before confirmation of the plan; and (3) recovery of claims arising from the modification of retiree benefits or for certain financial returns, as negotiated by the debtor and the authorized representative. Revises requirements governing: (1) rejection of collective bargaining agreements; (2) payment of insurance benefits to retired employees, including benefit modifications proposed by the trustee; and (3) a trustee's administrative power to dispose of property. Requires the court, in approving a sale of business assets, to consider the extent to which a bidder has offered to maintain existing jobs, preserve terms and conditions of employment, and assume or match pension and retiree health benefit obligations in determining whether an offer constitutes the highest or best offer for such property. Requires the bankruptcy court to allow certain claims asserted by an active or retired participant, or by a labor organization representing such participant, for any shortfall in pension benefits accrued as a result of the termination of the plan and limitations upon the payment of certain statutory benefits. States that, if employees have not received wages and benefits for services rendered on and after the date of the commencement of the case in bankruptcy, such unpaid obligations shall be deemed necessary costs and expenses of preserving, or disposing of, property securing an allowed secured claim and shall be recovered even if the trustee has otherwise waived certain provisions under an agreement with the holder of the allowed secured claim. Allows reduction of a debtor's time frame for filing a Chapter 11 bankruptcy plan in the event of: (1) the filing of a motion seeking rejection of a collective bargaining agreement if a plan based upon an alternative proposal by the labor organization is reasonably likely to be confirmed within a reasonable time; or (2) the proposed filing of a plan by a proponent other than the debtor, which incorporates the terms of a settlement with a labor organization, if such plan is reasonably likely to be confirmed within a reasonable time. Modifies requirements for confirmation of a Chapter 11 bankruptcy plan to prohibit approval of: (1) payments or other distributions for the benefit of insiders, senior executive officers, and certain highly compensated employees or consultants providing services to the debtor, except as part of those generally applicable to the debtor's employees if the court determines that such payments are not excessive or disproportionate compared to distributions to the debtor's nonmanagement workforce; and (2) insider compensation unless approved by the court as reasonable according to specified criteria. Restricts: (1) certain executive compensation enhancements as part of the allowance of administrative expenses; (2) trustee assumption of certain deferred compensation arrangements for the benefit of insiders, senior executive officers, or certain highly compensated employees of the debtor; and (3) trustee assumption of retiree benefits for insiders, senior executive officers, or certain highly compensated employees of the debtor if the debtor has obtained relief to impose reductions in retiree benefits, or health benefits of active employees of the debtor, or has reduced or eliminated health benefits for active or retired employees within 180 days before the date of the commencement of the case.  Requires the court, where a debtor has obtained relief by which it reduces the cost of its obligations under a collective bargaining agreement or a retiree plan, fund, or program of retiree benefits, to determine before granting relief the percentage diminution in the value of the obligations when compared to the debtor's obligations under the collective bargaining agreement, or with respect to retiree benefits. Authorizes the trustee in bankruptcy to avoid a transfer made in anticipation of bankruptcy to or for the benefit of an insider, including certain consultants who were formerly insiders and who are retained to provide services to an entity that becomes a debtor. Grants a labor organization creditor status for purposes of filing a proof of claim. Declares that the filing of a petition for relief does not operate as an automatic stay of the commencement or continuation of a dispute resolution proceeding established by a collective bargaining agreement that was or could have been commenced against the debtor before the filing of a petition, including payment or enforcement of an award or settlement under such proceeding.", "pending_committee_id": 0, "committee": [], "referrals": [], "history": [{"date": "2010-02-24", "action": "Read twice and referred to the Committee on the Judiciary. (text of measure as introduced: CR S746-749)", "chamber": "", "chamber_id": 0, "importance": 1}], "sponsors": [{"people_id": 9402, "person_hash": "bsdo1kgr", "party_id": "1", "state_id": 52, "party": "D", "role_id": 2, "role": "Sen", "name": "Sherrod Brown", "first_name": "Sherrod", "middle_name": "", "last_name": "Brown", "suffix": "", "nickname": "", "district": "SD-OH", "ftm_eid": 3439679, "votesmart_id": 27018, "opensecrets_id": "N00003535", "knowwho_pid": 159013, "ballotpedia": "Sherrod_Brown", "sponsor_type_id": 0, "sponsor_order": 0, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 9405, "person_hash": "i4x14koe", "party_id": "1", "state_id": 52, "party": "D", "role_id": 2, "role": "Sen", "name": "Richard Durbin", "first_name": "Richard", "middle_name": "", "last_name": "Durbin", "suffix": "", "nickname": "", "district": "SD-IL", "ftm_eid": 3414130, "votesmart_id": 26847, "opensecrets_id": "N00004981", "knowwho_pid": 165219, "ballotpedia": "Dick_Durbin", "sponsor_type_id": 0, "sponsor_order": 0, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 9419, "person_hash": "75ev2noc", "party_id": "1", "state_id": 52, "party": "D", "role_id": 2, "role": "Sen", "name": "Tom Harkin", "first_name": "Tom", "middle_name": "", "last_name": "Harkin", "suffix": "", "nickname": "", "district": "SD-IA", "ftm_eid": 0, "votesmart_id": 53294, "opensecrets_id": "N00004207", "knowwho_pid": 165216, "ballotpedia": "Tom_Harkin", "sponsor_type_id": 0, "sponsor_order": 0, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 9443, "person_hash": "jgbb1oef", "party_id": "1", "state_id": 52, "party": "D", "role_id": 2, "role": "Sen", "name": "Sheldon Whitehouse", "first_name": "Sheldon", "middle_name": "", "last_name": "Whitehouse", "suffix": "", "nickname": "", "district": "SD-RI", "ftm_eid": 373538, "votesmart_id": 2572, "opensecrets_id": "N00027533", "knowwho_pid": 248425, "ballotpedia": "Sheldon_Whitehouse", "sponsor_type_id": 0, "sponsor_order": 0, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 9453, "person_hash": "j02i0ny9", "party_id": "1", "state_id": 52, "party": "D", "role_id": 2, "role": "Sen", "name": "Russell Feingold", "first_name": "Russell", "middle_name": "D.", "last_name": "Feingold", "suffix": "", "nickname": "", "district": "SD-WI", "ftm_eid": 0, "votesmart_id": 53361, "opensecrets_id": "N00000036", "knowwho_pid": 165288, "ballotpedia": "Russ_Feingold", "sponsor_type_id": 0, "sponsor_order": 0, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 9476, "person_hash": "3us9m996", "party_id": "1", "state_id": 52, "party": "D", "role_id": 2, "role": "Sen", "name": "Al Franken", "first_name": "Al", "middle_name": "", "last_name": "Franken", "suffix": "", "nickname": "", "district": "SD-MN", "ftm_eid": 1646379, "votesmart_id": 108924, "opensecrets_id": "N00029016", "knowwho_pid": 266864, "ballotpedia": "Al_Franken", "sponsor_type_id": 0, "sponsor_order": 0, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}], "sasts": [{"type_id": 1, "type": "Same As", "sast_bill_number": "HB4677", "sast_bill_id": 198767}], "subjects": [{"subject_id": 13372, "subject_name": "Bankruptcy"}, {"subject_id": 13148, "subject_name": "Corporate finance and management"}, {"subject_id": 13175, "subject_name": "Employee benefits and pensions"}, {"subject_id": 13206, "subject_name": "Health care costs and insurance"}, {"subject_id": 13551, "subject_name": "Labor-management relations"}, {"subject_id": 13273, "subject_name": "Securities"}, {"subject_id": 13293, "subject_name": "Unemployment"}, {"subject_id": 13297, "subject_name": "Wages and earnings"}, {"subject_id": 20709, "subject_name": ""}], "texts": [{"doc_id": 448211, "date": "2010-11-24", "type": "Introduced", "type_id": 1, "mime": "application/pdf", "mime_id": 2, "url": "https://legiscan.com/US/text/SB3033/id/448211", "state_link": "https://www.congress.gov/111/bills/s3033/BILLS-111s3033is.pdf", "text_size": 172604, "text_hash": "b353fc228fc2c6ebf4269c96c1f9bd03"}], "votes": [], "amendments": [], "supplements": [], "calendar": []}}