{"status": "OK", "bill": {"bill_id": 339068, "change_hash": "aa3feb28e4a48d2a6a279fb9cbfae04e", "session_id": 84, "session": {"session_id": 84, "state_id": 52, "year_start": 2011, "year_end": 2012, "prefile": 0, "sine_die": 1, "prior": 1, "special": 0, "session_tag": "Regular Session", "session_title": "2011-2012 Regular Session", "session_name": "112th Congress"}, "url": "https://legiscan.com/US/bill/SB1258/2011", "state_link": "https://www.congress.gov/bill/112th-congress/senate-bill/1258/all-info", "completed": 0, "status": 1, "status_date": "2011-06-22", "progress": [{"date": "2011-06-22", "event": 1}, {"date": "2011-06-22", "event": 9}], "state": "US", "state_id": 52, "bill_number": "SB1258", "bill_type": "B", "bill_type_id": "1", "body": "S", "body_id": 115, "current_body": "S", "current_body_id": 115, "title": "Comprehensive Immigration Reform Act of 2011", "description": "Comprehensive Immigration Reform Act of 2011 - Creates a lawful prospective immigrant status for a qualifying alien present in the United States, as well as for such alien's qualifying spouse and children who may be outside the United States. Provides for status adjustment to lawful permanent resident. Development, Relief, and Education for Alien Minors Act of 2011 or the DREAM Act of 2011 - Authorizes the Secretary of Homeland Security (DHS) to cancel the removal of, and adjust to the status of an alien lawfully admitted for permanent residence on a conditional basis, an alien who: (1) entered the United States on or before his or her 15th birthday and has been present in the United States for five years preceding this Act's enactment; (2) is a person of good moral character; (3) is not inadmissible under specified grounds of the Immigration and Nationality Act; (4) has not participated in the persecution of any person on account of race, religion, nationality, membership in a particular social group, or political opinion; (5) has not been convicted of certain offenses under federal or state law; (6) has been admitted to an institution of higher education (IHE) in the United States or has earned a high school diploma or general education development certificate in the United States; and (7) was age 35 or younger on the date of this Act's enactment. Provides for status adjustment to lawful permanent resident. Directs the Attorney General (DOJ) to stay the removal proceedings of an alien who meets certain requirements and who is at least five years of age and enrolled full-time in a primary or secondary school. Limits the eligibility of an alien in conditional permanent resident status for higher education assistance. Amends the Illegal Immigration Reform and Immigrant Responsibility Act of 1996 to repeal the denial of an unlawful alien's eligibility for higher education benefits based on state residence unless a U.S. national is similarly eligible without regard to such state residence. Agricultural Job Opportunities, Benefits, and Security Act of 2011 or the AgJOBS Act of 2011 - Confers \"blue card status\" upon an alien who has fulfilled specified periods of agricultural employment in the United States, is otherwise admissible, and has not been convicted of specified crimes. Provides for adjustment to permanent resident status if the alien has fulfilled other specified periods of agricultural employment in the United States. Amends the Immigration and Nationality Act to revise H-2A visa (agricultural labor or temporary or seasonal services) provisions.  Establishes the Commission on Agricultural Wage Standards under the H-2A program. Revises unlawful presence inadmissibility provisions, including family-unity based exceptions. Establishes in the Treasury: (1) the Department of Homeland Security Legalization Program Account, and (2) the Immigration Reform Penalty Account. Sets forth immigration-related worksite enforcement provisions, including provisions regarding: (1) unlawful employment of aliens, (2) document verification, (3) the employment verification system, and (4) responsibilities of the Social Security Administration (SSA). Permits the disclosure of certain taxpayer information to DHS. Requires the issuance of: (1) fraud-, tamper-, and wear-resistant Social Security cards; and (2) machine-readable, tamper-resistant employment authorization documents with biometric identifiers. Makes it an unfair immigration employment practice to discriminate based on national origin or citizenship status. Revises immigration-related activities of the SSA and the Internal Revenue Service (IRS). Authorizes appropriations for responsibilities under this Act for: (1) DHS, (2) SSA, (3) the DOJ, and (4) the Department of State. Prohibits the adjustment of an alien in lawful prospective immigrant status to the status of an alien lawfully admitted for permanent residence until specified border related enhancements in personnel and resources are established, funded, and operational. Provides for additional: (1) Customs and Border Protection (CBP) personnel; (2) Immigration and Custom Enforcement (ICE) personnel; (3) DHS personnel assigned to investigate alien smuggling; (4) immigration litigation attorneys; (5) ports of entry along the northern and southern borders; and (6) equipment and assets along the borders, including unmanned aerial systems, cameras, sensors, satellites, and radar coverage.  Directs the Secretary of State to report annually regarding the exchange of North American immigration, law enforcement, and security information among the United States, Canada, and Mexico. Provides for: (1) increased border-related cooperation with Mexico, and (2) expansion of Customs-Trade Partnership Against Terrorism programs. Provides reimbursement for state and county prosecutors in border states for prosecuting federally initiated and referred drug cases. Authorizes border relief grants for tribal, state, or local law enforcement and related agencies in proximity to the border or in a designated High Intensity Drug Trafficking Area. Establishes the Immigration and United States-Mexico Border Enforcement Commission. Amends the Immigration and Nationality Act to set out the scope of state and local immigration-related enforcement authority. Directs the Secretaries of Homeland Security, Interior, Agriculture, Defense, and Commerce to develop a border protection strategy.  Directs the Secretary of Homeland Security to establish a Border Communities Liaison Office in every Border Patrol sector on the southern or northern border. Directs the Secretary of Homeland Security to: (1) establish a visa exit tracking system, and (2) equip all U.S. ports of entry with the United States-Visitor and Immigrant Status Indicator Technology system (US-VISIT). Increases: (1) civil penalties for illegal entry; (2) fines and penalties for the reentry of previously removed aliens; and (3) penalties concerning stowaways, vessels, and aircraft. Revises voluntary departure provisions. Authorizes appropriations for the state criminal alien assistance program (SCAAP). Sets forth provisions regarding issuance of detainers by DHS personnel for aliens apprehended by state or local law enforcement officials for controlled substance violations.  Revises passport, visa, and immigration fraud provisions. Directs: (1) the United States Sentencing Commission to promulgate or amend passport fraud sentencing guidelines, and (2) the Attorney General to develop immigration fraud prosecution guidelines. Expands the definition of conveyances subject to forfeiture for smuggling.  Requires commercial vehicles transporting passengers from outside the United States to a U.S. airport or seaport to provide arrival/departure manifests. Authorizes DHS to share manifest and passenger name information with other government authorities, including foreign governments. Subjects an operator of a vessel or motor vehicle to fine and/or imprisonment for evading a federal checkpoint. Authorizes grants for Indian tribes adversely affected by illegal immigration. Authorizes Department of State and Foreign Service special agents to investigate: (1) illegal passport or visa issuance or use, (2) Department-related identity theft and document fraud, and (3) federal offenses committed in the special maritime and territorial jurisdictions (nonmilitary) of the United States. Makes inadmissible and deportable convicted alien: (1) sex offenders who fail to register, and (2) street gang members. Sets forth, with respect to immigration-related enforcement activities: (1) protections for vulnerable populations, (2) apprehension procedures of more than 10 people involving children, and (3) detention procedures for families with children. Requires the creation of secure alternatives to detention (excluding alien terrorists). Enumerates humane detention conditions, including conditions for children and vulnerable populations. Requires the appointment of a detention commission. Authorizes access to counsel for aliens in removal proceedings. Directs the Attorney General to establish a National Legal Orientation Support and Training Center to ensure quality and consistent implementation of group legal orientation programs nationwide. Sets forth protections for: (1) refugees, including designation of refugee groups; and (2) stateless persons in the United States, including mechanisms for regularizing status. Establishes in DHS a position of Immigration and Customs Enforcement Ombudsman. Eliminates the one-year time limit for filing an asylum claim. Establishes the Standing Commission on Foreign Workers, Labor Markets, and the National Interest to establish employment-based immigration policies that promote economic growth while minimizing job displacement, wage depression, and unauthorized employment in the United States. Revises family and employment based immigrant visa provisions. Recaptures unused FY1992-FY2007 visas.  Increases immigration visas for: (1) sons and daughters of U.S. citizens, and (2) brothers and sisters of U.S. citizens. Provides a specified visa allocation for the unmarried sons and unmarried daughters of permanent resident aliens.  Exempts certain aliens with extraordinary ability in the sciences, arts, education, business, or athletics from numerical limits. Revises the definition of \"immediate relative\" to include the spouse and child of a lawful permanent resident. Establishes a status adjustment process for certain military family members.  Redefines \"child\" to include a stepchild under 21 years old.  Provides specified relief for orphans and widows/widowers.  Authorizes the status adjustment of a fiance/fiancee or alien spouse and any minor children (K-visa) to conditional permanent resident status if such alien marries a petitioner within three months after U.S. admission. Exempts children of certain naturalized Filipino World War II veterans from worldwide or numerical immigrant limitations. Permits workers who are eligible for permanent resident status adjustment but for whom a visa number is unavailable to apply for adjustment. Uniting American Families Act of 2011 - Includes a \"permanent partner\" within the scope of the Immigration and Nationality Act. Defines a \"permanent partner\" as an individual 18 or older who: (1) is in a committed, intimate relationship with another individual 18 or older in which both individuals intend a lifelong commitment; (2) is financially interdependent with the other individual; (3) is not married to, or in a permanent partnership with, anyone other than the individual; (4) is unable to contract with the other individual a marriage cognizable under this Act; and (5) is not a first, second, or third degree blood relation of the other individual. Creating American Jobs Through Foreign Capital Investment Act - Amends the Departments of Commerce, Justice, and State, the Judiciary, and Related Agencies Appropriations Act, 1993 to make the EB-5 visa (alien investor) regional center program permanent. Eliminates sunset provisions for: (1) the J-1 visa waiver (Conrad state 30/medical services in underserved areas) program, and (2) the special immigrant nonminister religious worker program. Extends the H-1C visa program providing nonimmigrant nurses in health professional shortage areas. Revises entry provisions for H-1B visa foreign medical graduates and provides for an increase under specified conditions in the annual per-state cap of 30 foreign doctors. Exempts from worldwide immigration numerical limitations alien physicians who have completed state waiver or exemption service requirements, including alien physicians who completed such service before the date of enactment of this Act. Includes nationals of Ireland coming to the United States under a treaty of commerce to perform specialty occupation services in the nonimmigrant E-3 visa category. Authorizes: (1) temporary workers (E, H, I, L O, or P visas) who have not violated their status to renew their same category visa from within the United States; and (2) alien spouses of nonimmigrant H-visa aliens to work in the United States. Gives an alien who ceases to be employed by his or her petitioning employer 60 days to leave the United States or apply for a change of status. Protect Our Workers from Exploitation and Retaliation Act or the POWER Act - Excludes from the definition of \"immigrant\" a nonimmigrant alien who files a petition for status if the Secretary of Homeland Security determines that the alien: (1) has suffered abuse or harm as a result of having been a victim of criminal activity, (2) has suffered substantial abuse or harm related to specified labor or employment violations related to a workplace claim (workplace violation), (3) is a victim of specified criminal activity and would suffer extreme hardship upon removal, (4) has suffered a workplace violation and would suffer extreme hardship upon removal, (5) has been helpful to specified authorities investigating a workplace violation, or (6) is a material witness or is likely to be helpful in the investigation of a workplace claim and fears retaliatory activities by the employer.  Sets forth provisions governing procedural requirements and protections in an enforcement action leading to a removal proceeding taken against an alien: (1) as a result of information provided to DHS in retaliation against an individual for exercising employment or other legal rights, (2) at a facility about which a workplace claim has been filed, or (3) who has filed a workplace claim or who is a material witness in any proceeding involving a workplace claim. Amends the Adult Education and Family Literacy Act to allow state leadership activity grants to be used to provide technical assistance to faith and community-based organizations. Directs the National Institute for Literacy to disseminate information regarding integrated English literacy, U.S. history, and civics education programs. Provides grants to states for integrated English literacy, U.S. history, and civics education programs. Amends the Internal Revenue Code to provide: (1) tax credits to teachers of English language learners, (2) tax deductions for the expenses of becoming certified as such teachers, and (3) tax credits for employers' expenses in making adult education and literacy services available to their employees. Requires the Commissioner for Education Research of the National Center for Education Research to establish a national research and development center for adult education and literacy.  Establishes the Presidential Award for Business Leadership in Promoting United States Citizenship to be awarded to companies and other organizations that make extraordinary efforts in assisting their employees and members to learn English and increase their understanding of U.S. history and civics. Renames the Office of Citizenship of DHS as the Office of Citizenship and New Americans. Authorizes the Office to make grants to states and subgrants to local governments to assist them in integrating immigrants.  Establishes the New Citizens Award program.  Provides for the status adjustment to lawful permanent resident of certain: (1) Haitian orphans, and (2) Liberian nationals. Provides grants to state courts for programs to assist individuals with limited English proficiency to access and understand state court proceedings. Provides permanent resident status adjustment for a qualifying alien who was, on September 10, 2001, the spouse, child, or unmarried son or daughter of an alien who died as a direct result of the September 11, 2001, terrorist activity against the United States. Makes such provisions inapplicable to an alien who is inadmissible or deportable under criminal or security grounds, including September 11, 2001, terrorist activity. Directs the U.S. Agency for International Development (USAID) to expand programming that prioritizes alternatives to emigration from countries with the highest rates of irregular migration to the United States. Expresses the sense of Congress that the Secretary of State should review U.S. policy toward Latin America in order to strengthen hemispheric security through the reduction of poverty, expansion of equitable trade, and support for democratic institutions, citizen security, and the rule of law.", "pending_committee_id": 2330, "committee": {"committee_id": 2330, "chamber": "S", "chamber_id": 115, "name": "Judiciary"}, "referrals": [{"date": "2011-06-22", "committee_id": 2330, "chamber": "S", "chamber_id": 115, "name": "Judiciary"}], "history": [{"date": "2011-06-22", "action": "Read twice and referred to the Committee on the Judiciary.", "chamber": "S", "chamber_id": 115, "importance": 1}], "sponsors": [{"people_id": 9413, "person_hash": "fpzplzoq", "party_id": "1", "state_id": 52, "party": "D", "role_id": 2, "role": "Sen", "name": "Robert Menendez", "first_name": "Robert", "middle_name": "", "last_name": "Menendez", "suffix": "", "nickname": "", "district": "SD-NJ", "ftm_eid": 17659015, "votesmart_id": 26961, "opensecrets_id": "N00000699", "knowwho_pid": 158964, "ballotpedia": "Bob_Menendez", "sponsor_type_id": 1, "sponsor_order": 1, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 9421, "person_hash": "0ofa6kmm", "party_id": "1", "state_id": 52, "party": "D", "role_id": 2, "role": "Sen", "name": "Daniel Akaka", "first_name": "Daniel", "middle_name": "K.", "last_name": "Akaka", "suffix": "", "nickname": "", "district": "SD-HI", "ftm_eid": 0, "votesmart_id": 53286, "opensecrets_id": "N00007653", "knowwho_pid": 165214, "ballotpedia": "Daniel_Akaka", "sponsor_type_id": 2, "sponsor_order": 2, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 11199, "person_hash": "crmbr7rg", "party_id": "1", "state_id": 52, "party": "D", "role_id": 2, "role": "Sen", "name": "Richard Blumenthal", "first_name": "Richard", "middle_name": "", "last_name": "Blumenthal", "suffix": "", "nickname": "", "district": "SD-CT", "ftm_eid": 6378136, "votesmart_id": 1568, "opensecrets_id": "N00031685", "knowwho_pid": 218586, "ballotpedia": "Richard_Blumenthal", "sponsor_type_id": 2, "sponsor_order": 3, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 9401, "person_hash": "528jrj6c", "party_id": "1", "state_id": 52, "party": "D", "role_id": 2, "role": "Sen", "name": "Barbara Boxer", "first_name": "Barbara", "middle_name": "", "last_name": "Boxer", "suffix": "", "nickname": "", "district": "SD-CA", "ftm_eid": 2545581, "votesmart_id": 53274, "opensecrets_id": "N00006692", "knowwho_pid": 165202, "ballotpedia": "Barbara_Boxer", "sponsor_type_id": 2, "sponsor_order": 4, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 9405, "person_hash": "i4x14koe", "party_id": "1", "state_id": 52, "party": "D", "role_id": 2, "role": "Sen", "name": "Richard Durbin", "first_name": "Richard", "middle_name": "", "last_name": "Durbin", "suffix": "", "nickname": "", "district": "SD-IL", "ftm_eid": 3414130, "votesmart_id": 26847, "opensecrets_id": "N00004981", "knowwho_pid": 165219, "ballotpedia": "Dick_Durbin", "sponsor_type_id": 2, "sponsor_order": 5, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 9047, "person_hash": "qm3c1xjn", "party_id": "1", "state_id": 52, "party": "D", "role_id": 2, "role": "Sen", "name": "Kirsten Gillibrand", "first_name": "Kirsten", "middle_name": "E.", "last_name": "Gillibrand", "suffix": "", "nickname": "", "district": "HD-NY-20", "ftm_eid": 1577524, "votesmart_id": 65147, "opensecrets_id": "N00027658", "knowwho_pid": 248345, "ballotpedia": "Kirsten_Gillibrand", "sponsor_type_id": 2, "sponsor_order": 6, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 9420, "person_hash": "unng73t7", "party_id": "1", "state_id": 52, "party": "D", "role_id": 2, "role": "Sen", "name": "Daniel Inouye", "first_name": "Daniel", "middle_name": "K.", "last_name": "Inouye", "suffix": "", "nickname": "", "district": "SD-HI", "ftm_eid": 9693740, "votesmart_id": 53285, "opensecrets_id": "N00001762", "knowwho_pid": 165213, "ballotpedia": "Daniel_Inouye", "sponsor_type_id": 2, "sponsor_order": 7, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 9407, "person_hash": "09ahs9g6", "party_id": "1", "state_id": 52, "party": "D", "role_id": 2, "role": "Sen", "name": "John Kerry", "first_name": "John", "middle_name": "F.", "last_name": "Kerry", "suffix": "", "nickname": "", "district": "SD-MA", "ftm_eid": 3557076, "votesmart_id": 53306, "opensecrets_id": "N00000245", "knowwho_pid": 165230, "ballotpedia": "John_Kerry", "sponsor_type_id": 2, "sponsor_order": 8, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 9424, "person_hash": "6qelz58n", "party_id": "1", "state_id": 52, "party": "D", "role_id": 2, "role": "Sen", "name": "Patrick Leahy", "first_name": "Patrick", "middle_name": "J.", "last_name": "Leahy", "suffix": "", "nickname": "", "district": "SD-VT", "ftm_eid": 19890007, "votesmart_id": 53353, "opensecrets_id": "N00009918", "knowwho_pid": 165283, "ballotpedia": "Patrick_Leahy_(Vermont)", "sponsor_type_id": 2, "sponsor_order": 9, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 9431, "person_hash": "y4pijgni", "party_id": "1", "state_id": 52, "party": "D", "role_id": 2, "role": "Sen", "name": "Patty Murray", "first_name": "Patty", "middle_name": "", "last_name": "Murray", "suffix": "", "nickname": "", "district": "SD-WA", "ftm_eid": 18930579, "votesmart_id": 53358, "opensecrets_id": "N00007876", "knowwho_pid": 165286, "ballotpedia": "Patty_Murray", "sponsor_type_id": 2, "sponsor_order": 10, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 9398, "person_hash": "53dynib3", "party_id": "1", "state_id": 52, "party": "D", "role_id": 2, "role": "Sen", "name": "Harry Reid", "first_name": "Harry", "middle_name": "", "last_name": "Reid", "suffix": "", "nickname": "", "district": "SD-NV", "ftm_eid": 18930590, "votesmart_id": 53320, "opensecrets_id": "N00009922", "knowwho_pid": 165257, "ballotpedia": "Harry_Reid", "sponsor_type_id": 2, "sponsor_order": 11, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 9414, "person_hash": "5pzkxb3w", "party_id": "1", "state_id": 52, "party": "D", "role_id": 2, "role": "Sen", "name": "Charles Schumer", "first_name": "Charles", "middle_name": "E.", "last_name": "Schumer", "suffix": "", "nickname": "Chuck", "district": "SD-NY", "ftm_eid": 19890086, "votesmart_id": 26976, "opensecrets_id": "N00001093", "knowwho_pid": 165260, "ballotpedia": "Chuck_Schumer", "sponsor_type_id": 2, "sponsor_order": 12, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}], "sasts": [{"type_id": 8, "type": "Related", "sast_bill_number": "HB1293", "sast_bill_id": 300182}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB2169", "sast_bill_id": 336090}, {"type_id": 8, "type": "Related", "sast_bill_number": "SB656", "sast_bill_id": 315889}, {"type_id": 8, "type": "Related", "sast_bill_number": "SB952", "sast_bill_id": 332339}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB3017", "sast_bill_id": 341605}, {"type_id": 8, "type": "Related", "sast_bill_number": "SB3365", "sast_bill_id": 432052}], "subjects": [{"subject_id": 13126, "subject_name": "Administrative law and regulatory procedures"}, {"subject_id": 13384, "subject_name": "Administrative remedies"}, {"subject_id": 13496, "subject_name": "Adult education and literacy"}, {"subject_id": 13127, "subject_name": "Advisory bodies"}, {"subject_id": 13682, "subject_name": "Africa"}, {"subject_id": 13405, "subject_name": "Asia"}, {"subject_id": 13136, "subject_name": "Border security and unlawful immigration"}, {"subject_id": 13742, "subject_name": "Canada"}, {"subject_id": 13489, "subject_name": "Caribbean area"}, {"subject_id": 13376, "subject_name": "Child safety and welfare"}, {"subject_id": 13305, "subject_name": "Citizenship and naturalization"}, {"subject_id": 13146, "subject_name": "Congressional oversight"}, {"subject_id": 13406, "subject_name": "Crime victims"}, {"subject_id": 13157, "subject_name": "Department of Homeland Security"}, {"subject_id": 13159, "subject_name": "Department of Justice"}, {"subject_id": 13444, "subject_name": "Detention of persons"}, {"subject_id": 13345, "subject_name": "Drug trafficking and controlled substances"}, {"subject_id": 13171, "subject_name": "Education programs funding"}, {"subject_id": 13176, "subject_name": "Employment and training programs"}, {"subject_id": 13177, "subject_name": "Employment discrimination and employee rights"}, {"subject_id": 13454, "subject_name": "Europe"}, {"subject_id": 13184, "subject_name": "Executive agency funding and structure"}, {"subject_id": 13470, "subject_name": "Family relationships"}, {"subject_id": 13456, "subject_name": "Foreign aid and international relief"}, {"subject_id": 13191, "subject_name": "Foreign labor"}, {"subject_id": 13309, "subject_name": "Fraud offenses and financial crimes"}, {"subject_id": 13200, "subject_name": "Government information and archives"}, {"subject_id": 13532, "subject_name": "Haiti"}, {"subject_id": 13207, "subject_name": "Health care coverage and access"}, {"subject_id": 13211, "subject_name": "Health personnel"}, {"subject_id": 13215, "subject_name": "Higher education"}, {"subject_id": 13311, "subject_name": "Immigrant health and welfare"}, {"subject_id": 13403, "subject_name": "Immigration status and procedures"}, {"subject_id": 13224, "subject_name": "Income tax credits"}, {"subject_id": 13225, "subject_name": "Income tax deductions"}, {"subject_id": 13379, "subject_name": "Indian lands and resources rights"}, {"subject_id": 13843, "subject_name": "Ireland"}, {"subject_id": 13606, "subject_name": "Judicial procedure and administration"}, {"subject_id": 13656, "subject_name": "Juvenile crime and gang violence"}, {"subject_id": 13235, "subject_name": "Latin America"}, {"subject_id": 13469, "subject_name": "Law enforcement officers"}, {"subject_id": 13342, "subject_name": "Lawyers and legal services"}, {"subject_id": 13909, "subject_name": "Liberia"}, {"subject_id": 13488, "subject_name": "Marriage and family status"}, {"subject_id": 13243, "subject_name": "Mexico"}, {"subject_id": 13484, "subject_name": "Military personnel and dependents"}, {"subject_id": 13730, "subject_name": "Nursing"}, {"subject_id": 13724, "subject_name": "Philippines"}, {"subject_id": 13260, "subject_name": "Public contracts and procurement"}, {"subject_id": 13475, "subject_name": "Refugees, asylum, displaced persons"}, {"subject_id": 13726, "subject_name": "Sex offenses"}, {"subject_id": 13317, "subject_name": "Smuggling and trafficking"}, {"subject_id": 13279, "subject_name": "Social security and elderly assistance"}, {"subject_id": 13708, "subject_name": "State and local courts"}, {"subject_id": 13287, "subject_name": "Teaching, teachers, curricula"}, {"subject_id": 13431, "subject_name": "Terrorism"}, {"subject_id": 13648, "subject_name": "User charges and fees"}, {"subject_id": 13527, "subject_name": "Visas and passports"}, {"subject_id": 13174, "subject_name": "Elementary and secondary education"}, {"subject_id": 13899, "subject_name": "Migrant, seasonal, agricultural labor"}, {"subject_id": 13270, "subject_name": "Right of privacy"}, {"subject_id": 13286, "subject_name": "Student aid and college costs"}, {"subject_id": 13533, "subject_name": "Travel and tourism"}, {"subject_id": 13468, "subject_name": "Worker safety and health"}, {"subject_id": 20565, "subject_name": "Computer security and identity theft"}, {"subject_id": 13135, "subject_name": "Aviation and airports"}, {"subject_id": 13187, "subject_name": "Financial services and investments"}, {"subject_id": 13402, "subject_name": "Human rights"}, {"subject_id": 13232, "subject_name": "International organizations and cooperation"}, {"subject_id": 13360, "subject_name": "Marine and inland water transportation"}, {"subject_id": 13266, "subject_name": "Religion"}, {"subject_id": 13868, "subject_name": "Rule of law and government transparency"}, {"subject_id": 13297, "subject_name": "Wages and earnings"}, {"subject_id": 22689, "subject_name": "Foreign language and bilingual programs"}, {"subject_id": 22688, "subject_name": "Government studies and investigations"}, {"subject_id": 22690, "subject_name": "Language arts"}, {"subject_id": 13346, "subject_name": "Immigration"}], "texts": [{"doc_id": 344182, "date": "2011-07-11", "type": "Introduced", "type_id": 1, "mime": "application/pdf", "mime_id": 2, "url": "https://legiscan.com/US/text/SB1258/id/344182", "state_link": "https://www.congress.gov/112/bills/s1258/BILLS-112s1258is.pdf", "text_size": 1268021, "text_hash": "d2917faf2423812d07aa3f805dfe371d"}], "votes": [], "amendments": [], "supplements": [], "calendar": []}}