{"status": "OK", "bill": {"bill_id": 345848, "change_hash": "994af4f832ebb713dd6638fe248b8772", "session_id": 84, "session": {"session_id": 84, "state_id": 52, "year_start": 2011, "year_end": 2012, "prefile": 0, "sine_die": 1, "prior": 1, "special": 0, "session_tag": "Regular Session", "session_title": "2011-2012 Regular Session", "session_name": "112th Congress"}, "url": "https://legiscan.com/US/bill/HB3634/2011", "state_link": "https://www.congress.gov/bill/112th-congress/house-bill/3634/all-info", "completed": 0, "status": 1, "status_date": "2011-12-12", "progress": [{"date": "2011-12-12", "event": 1}, {"date": "2011-12-12", "event": 9}, {"date": "2012-01-06", "event": 9}], "state": "US", "state_id": 52, "bill_number": "HB3634", "bill_type": "B", "bill_type_id": "1", "body": "H", "body_id": 114, "current_body": "H", "current_body_id": 114, "title": "Federal Prison Industries Competition in Contracting Act of 2011", "description": "Federal Prison Industries Competition in Contracting Act of 2011 - Amends federal criminal code provisions relating to Federal Prison Industries (FPI) to establish governmentwide procurement policies for purchases from FPI based upon competitive procedures. Authorizes contract awards on a noncompetitive basis if the Attorney General determines that FPI cannot reasonably expect fair consideration to receive a contract award on a competitive basis and the contract award is necessary to maintain inmate work opportunities.  Specifies conditions under which a contract award may be made to FPI using other than competitive procedures. Provides that a timely offer received from FPI to furnish a product or service to a federal agency shall be considered for award without limitation as to the dollar value of the proposed purchase, unless the contract opportunity has been reserved for competition for small businesses under the Small Business Act and its regulations.  Allows FPI to exclude from its bids certain costs relating to security, educating and training inmates, and excess capital costs of machinery and inventories used in prisons. Makes decisions by a federal contracting officer regarding the award of a contract to FPI or the performance of such contract final, unless reversed on appeal. Requires federal agencies to report purchases from FPI to the Federal Procurement Data System. Requires FPI to publish and maintain a catalogue of its products and services.  Imposes federal occupational, health, and safety standards on FPI with respect to its industrial operations. Revises rulemaking procedures for approving new FPI products or services. Requires the Chief Operating Officer of FPI to submit a proposal to the Board of Directors of FPI with a detailed analysis of the probable impact on the private sector of a proposed expansion of sales from such new products or services. Requires a federal agency that has a requirement for a product that is authorized for sale by FPI and is listed in its catalog to first solicit an offer from FPI and make purchases on a noncompetitive basis. Requires, subject to specified limitations, a contract award to be made on a noncompetitive basis to FPI if the contracting officer determines that: (1) the FPI product will meet the procurement requirements, (2) timely performance of the contract by FPI can be reasonably expected, and (3) the negotiated price does not exceed a fair and reasonable price.  Requires that the terms and conditions of a procurement contract and the price to be paid to FPI be determined by negotiation between FPI and the federal agency making the purchase. Prohibits the negotiated price from exceeding a fair and reasonable price as determined by the Federal Acquisition Regulation.  Prohibits the total dollar value of FPI sales to the federal government in FY2012-FY2016 from exceeding specified percentages of FPI sales for the base period. Sets limits on FPI sales within various business sectors, relating to specific products, and arising from changes in design specifications. Prohibits the use of such preferential contracting authorities on or after October 1, 2015. Requires the Attorney General to make specified findings on the effect of such percentage limitations.  Amends the Federal Property and Administrative Services Act of 1949 to require the head of an executive agency, before purchasing a product listed in the latest FPI catalog, to conduct market research to determine whether the FPI product is comparable to products available from the private sector that best meet the agency's needs in terms of price, quality, and time of delivery. Prohibits the head of an executive agency from entering into a contract with FPI under which an inmate would have access to sensitive or classified information. Authorizes FPI to enter into a contract with a federal contractor or subcontractor to produce products as a subcontractor or supplier, but restricts FPI products or services from a subcontractor from entering the commercial market or infringing on procurement preferences for the blind or disabled or on certain Buy America requirements. Specifies that use of FPI as a subcontractor or supplier cannot be imposed upon prospective or actual federal prime contractors or subcontractors. Requires the Board of Directors of FPI to prescribe hourly wage rates for inmates performing work for or through FPI. Requires an hourly minimum rate of $2.50 for inmates whose term of imprisonment will expire in two years or less. Requires a biannual review of inmate wage rates.  Directs the Board of Directors of FPI, not later than September 30, 2012, to increase the maximum wage rate for inmates to 50% of the minimum wage rate under the Fair Labor Standards Act of 1938, and to 100% of such wage rate not later than September 30, 2017. Limits to 80% the maximum amount of deductions from inmates' gross.  Includes services furnished by such convicts or prisoners within the prohibition against the transportation or importation of goods produced by prisoners or convicts in interstate or foreign commerce. Allows for the completion of existing contracts and programs involving federal inmates who are furnishing services in commerce.  Provides that nothing in this Act shall establish: (1) an entitlement of any federal prison inmate to employment in a FPI facility or any particular wage or benefit, (2) inmates as employees for purposes of any law or program, or (3) any cause of action against the United States. Establishes within the Federal Bureau of Prisons (FBP) the Enhanced In-Prison Educational and Vocational Assessment and Training Program to provide: (1) in-prison assessments of inmates' needs and aptitudes, (2) a full range of educational opportunities, (3) vocational training and apprenticeships, and (4) comprehensive release-readiness preparation. Authorizes appropriations for fiscal years after FY2011. Expresses the sense of Congress that FPI should use some of its net earnings to accomplish the purposes of this program. Phases in the implementation of the program in all federal prisons within eight years.  Amends the federal criminal code to authorize inmates with work assignments within FPI to perform work for a tax-exempt charity, religious organization, or local governmental unit or school district (eligible entities) that have an agreement with FPI. Establishes the position of Inmate Work Training Administrator to create alternative inmate work opportunities with eligible entities. Sets forth requirements for proposals by eligible entities for participation in inmate work programs, including certain representations regarding the charitable nature of the entities' work, protections for non-inmate workers, wage rates for inmates, and deductions from inmate wages.  Directs the Chief Operating Officer of FPI to develop proposals to have FPI donate products and services to charitable entities that provide goods or services to low-income individuals.  Establishes with the FBP the Cognitive Abilities Assessment Demonstration Program to assess the cognitive abilities and perceptual skills of inmates to prepare such inmates to return to society and reduce recidivism. Requires such demonstration program to be conducted for three consecutive fiscal years beginning during FY2012 at 12 federal correctional institutions and to be offered to 6,000 inmates who are within five years of release.  Requires the Director of the FBP to offer prerelease employment assistance to inmates upon release. Authorizes private for-profit business entities to participate in work-based training and apprenticeship programs for federal prison inmates. Sets forth requirements relating to training and wage rates for inmates.  Prohibits FPI from offering for commercial sale products produced or services furnished by federal inmates. Terminates authority for programs after September 30, 2020, and requires all agreements relating to programs to be performed before October 1, 2025.  Requires the Attorney General to meet with officials of FPI to review inmate work-based training programs and report to specified congressional committees on program progress. Directs the Comptroller General to: (1) undertake an on-going assessment of inmate work-based training programs; (2) provide an opportunity for public comment on the scope and methodology of such assessment; and (3) make interim and final reports to Congress on such assessment. Revises the membership structure and terms of the Board of Directors of FPI.  Permits FPI to: (1) locate more than one workshop at a federal correctional facility, and (2) operate a workshop outside a facility if all inmates working in such workshop are classified as minimum security inmates. Directs FPI to establish a cost accounting system. Directs that correctional officers or other employees of FPI who are separated from employment due to reductions in FPI revenues be: (1) eligible for appointment in the competitive civil service, (2) registered on a Bureau of Prisons reemployment priority list, and (3) given priority for appropriate positions in the Bureau of Prisons.  Revises and expands FPI annual reporting requirements to Congress. Requires copies of FPI's annual reports to be made available to the public. Provides for proposed revisions to the Governmentwide Federal Acquisition Regulation for implementing this Act and final regulations within 180 days of enactment of this Act.  Requires the Board of Directors of FPI to issue regulations defining \"prison-made product,\" \"prison-furnished service,\" \" specific product,\" and \"specific service.\" Requires the Board of Directors to use means designed to most effectively solicit public comment on proposed regulations, procedures, and policies and to conduct open meetings.  Requires the Secretary of Labor to establish an inmate training wage pursuant to the Fair Labor Standards Act of 1938. States that provisions of this Act relating to FPI bid protests are not intended to alter the protest rights of any other offeror of a federal contract bid. States that nothing in this Act is intended to modify the Javits-Wagner-O'Day Act (concerning procurement from persons who are blind or severely disabled).", "pending_committee_id": 2349, "committee": {"committee_id": 2349, "chamber": "H", "chamber_id": 114, "name": "Subcommittee on Crime, Terrorism, and Homeland Security"}, "referrals": [{"date": "2011-12-12", "committee_id": 2309, "chamber": "H", "chamber_id": 114, "name": "Judiciary"}, {"date": "2012-01-06", "committee_id": 2349, "chamber": "H", "chamber_id": 114, "name": "Subcommittee on Crime, Terrorism, and Homeland Security"}], "history": [{"date": "2011-12-12", "action": "Referred to the House Committee on the Judiciary.", "chamber": "H", "chamber_id": 114, "importance": 1}, {"date": "2012-01-06", "action": "Referred to the Subcommittee on Crime, Terrorism, and Homeland Security.", "chamber": "H", "chamber_id": 114, "importance": 1}], "sponsors": [{"people_id": 11058, "person_hash": "aw6szgk2", "party_id": "2", "state_id": 52, "party": "R", "role_id": 1, "role": "Rep", "name": "Bill Huizenga", "first_name": "Bill", "middle_name": "", "last_name": "Huizenga", "suffix": "", "nickname": "", "district": "HD-MI-2", "ftm_eid": 6574786, "votesmart_id": 38351, "opensecrets_id": "N00030673", "knowwho_pid": 288017, "ballotpedia": "Bill_Huizenga", "sponsor_type_id": 1, "sponsor_order": 1, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 9206, "person_hash": "4cnl1bxy", "party_id": "2", "state_id": 52, "party": "R", "role_id": 1, "role": "Rep", "name": "Roscoe Bartlett", "first_name": "Roscoe", "middle_name": "G.", "last_name": "Bartlett", "suffix": "", "nickname": "", "district": "HD-MD-6", "ftm_eid": 17658041, "votesmart_id": 26891, "opensecrets_id": "N00002017", "knowwho_pid": 158890, "ballotpedia": "Roscoe_Bartlett", "sponsor_type_id": 2, "sponsor_order": 2, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 11122, "person_hash": "ecjsnb1t", "party_id": "2", "state_id": 52, "party": "R", "role_id": 1, "role": "Rep", "name": "Dan Benishek", "first_name": "Dan", "middle_name": "", "last_name": "Benishek", "suffix": "", "nickname": "", "district": "HD-MI-1", "ftm_eid": 15406839, "votesmart_id": 123056, "opensecrets_id": "N00031934", "knowwho_pid": 286706, "ballotpedia": "Dan_Benishek", "sponsor_type_id": 2, "sponsor_order": 3, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 9350, "person_hash": "blbygmnv", "party_id": "2", "state_id": 52, "party": "R", "role_id": 1, "role": "Rep", "name": "Judy Biggert", "first_name": "Judy", "middle_name": "", "last_name": "Biggert", "suffix": "", "nickname": "", "district": "HD-IL-13", "ftm_eid": 2949538, "votesmart_id": 6298, "opensecrets_id": "N00004762", "knowwho_pid": 158840, "ballotpedia": "Judy_Biggert", "sponsor_type_id": 2, "sponsor_order": 4, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 9172, "person_hash": "e1pw64ek", "party_id": "2", "state_id": 52, "party": "R", "role_id": 1, "role": "Rep", "name": "Marsha Blackburn", "first_name": "Marsha", "middle_name": "", "last_name": "Blackburn", "suffix": "", "nickname": "", "district": "SD-TN", "ftm_eid": 6654369, "votesmart_id": 25186, "opensecrets_id": "N00003105", "knowwho_pid": 198986, "ballotpedia": "Marsha_Blackburn", "sponsor_type_id": 2, "sponsor_order": 5, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 9251, "person_hash": "ixnygja4", "party_id": "2", "state_id": 52, "party": "R", "role_id": 1, "role": "Rep", "name": "Dave Camp", "first_name": "Dave", "middle_name": "", "last_name": "Camp", "suffix": "", "nickname": "", "district": "HD-MI-4", "ftm_eid": 376005, "votesmart_id": 26911, "opensecrets_id": "N00008086", "knowwho_pid": 158898, "ballotpedia": "Dave_Camp", "sponsor_type_id": 2, "sponsor_order": 6, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 9260, "person_hash": "1nelsd4s", "party_id": "2", "state_id": 52, "party": "R", "role_id": 1, "role": "Rep", "name": "Howard Coble", "first_name": "Howard", "middle_name": "", "last_name": "Coble", "suffix": "", "nickname": "", "district": "HD-NC-6", "ftm_eid": 5947078, "votesmart_id": 27001, "opensecrets_id": "N00002247", "knowwho_pid": 158939, "ballotpedia": "Howard_Coble", "sponsor_type_id": 2, "sponsor_order": 7, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 9225, "person_hash": "hu6t0h6j", "party_id": "2", "state_id": 52, "party": "R", "role_id": 1, "role": "Rep", "name": "Mike Coffman", "first_name": "Mike", "middle_name": "", "last_name": "Coffman", "suffix": "", "nickname": "", "district": "HD-CO-6", "ftm_eid": 12998053, "votesmart_id": 1535, "opensecrets_id": "N00024753", "knowwho_pid": 251692, "ballotpedia": "Mike_Coffman_(Colorado)", "sponsor_type_id": 2, "sponsor_order": 8, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 11049, "person_hash": "tzdxxeto", "party_id": "2", "state_id": 52, "party": "R", "role_id": 1, "role": "Rep", "name": "Jeff Duncan", "first_name": "Jeff", "middle_name": "", "last_name": "Duncan", "suffix": "", "nickname": "", "district": "HD-SC-3", "ftm_eid": 8045191, "votesmart_id": 47967, "opensecrets_id": "N00030752", "knowwho_pid": 213970, "ballotpedia": "Jeff_Duncan_(South_Carolina)", "sponsor_type_id": 2, "sponsor_order": 9, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 9181, "person_hash": "vdr779wu", "party_id": "2", "state_id": 52, "party": "R", "role_id": 1, "role": "Rep", "name": "John Duncan", "first_name": "John", "middle_name": "J.", "last_name": "Duncan", "suffix": "Jr.", "nickname": "", "district": "HD-TN-2", "ftm_eid": 9391265, "votesmart_id": 27069, "opensecrets_id": "N00003209", "knowwho_pid": 159063, "ballotpedia": "John_Duncan_Jr.", "sponsor_type_id": 2, "sponsor_order": 10, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 8948, "person_hash": "d680o5vw", "party_id": "1", "state_id": 52, "party": "D", "role_id": 1, "role": "Rep", "name": "Barney Frank", "first_name": "Barney", "middle_name": "", "last_name": "Frank", "suffix": "", "nickname": "", "district": "HD-MA-4", "ftm_eid": 1827967, "votesmart_id": 26897, "opensecrets_id": "N00000275", "knowwho_pid": 158878, "ballotpedia": "Barney_Frank", "sponsor_type_id": 2, "sponsor_order": 11, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 9359, "person_hash": "nb21e5ki", "party_id": "2", "state_id": 52, "party": "R", "role_id": 1, "role": "Rep", "name": "Trent Franks", "first_name": "Trent", "middle_name": "", "last_name": "Franks", "suffix": "", "nickname": "", "district": "HD-AZ-8", "ftm_eid": 1448924, "votesmart_id": 28399, "opensecrets_id": "N00006423", "knowwho_pid": 211720, "ballotpedia": "Trent_Franks", "sponsor_type_id": 2, "sponsor_order": 12, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 11059, "person_hash": "ckst1sva", "party_id": "2", "state_id": 52, "party": "R", "role_id": 1, "role": "Rep", "name": "Bill Johnson", "first_name": "Bill", "middle_name": "", "last_name": "Johnson", "suffix": "", "nickname": "", "district": "HD-OH-6", "ftm_eid": 17657550, "votesmart_id": 120649, "opensecrets_id": "N00032088", "knowwho_pid": 287357, "ballotpedia": "Bill_Johnson_(Ohio)", "sponsor_type_id": 2, "sponsor_order": 13, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 9282, "person_hash": "7kag8ron", "party_id": "2", "state_id": 52, "party": "R", "role_id": 1, "role": "Rep", "name": "Walter Jones", "first_name": "Walter", "middle_name": "B.", "last_name": "Jones", "suffix": "Jr.", "nickname": "", "district": "HD-NC-3", "ftm_eid": 17658130, "votesmart_id": 21785, "opensecrets_id": "N00002299", "knowwho_pid": 158936, "ballotpedia": "Walter_Jones", "sponsor_type_id": 2, "sponsor_order": 14, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 9293, "person_hash": "y4smjdzr", "party_id": "2", "state_id": 52, "party": "R", "role_id": 1, "role": "Rep", "name": "Frank LoBiondo", "first_name": "Frank", "middle_name": "A.", "last_name": "LoBiondo", "suffix": "", "nickname": "", "district": "HD-NJ-2", "ftm_eid": 17658180, "votesmart_id": 21890, "opensecrets_id": "N00000851", "knowwho_pid": 158953, "ballotpedia": "Frank_LoBiondo", "sponsor_type_id": 2, "sponsor_order": 15, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 9082, "person_hash": "szvfzye6", "party_id": "1", "state_id": 52, "party": "D", "role_id": 1, "role": "Rep", "name": "David Loebsack", "first_name": "David", "middle_name": "", "last_name": "Loebsack", "suffix": "", "nickname": "", "district": "HD-IA-2", "ftm_eid": 6321205, "votesmart_id": 68964, "opensecrets_id": "N00027741", "knowwho_pid": 248296, "ballotpedia": "Dave_Loebsack", "sponsor_type_id": 2, "sponsor_order": 16, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 9086, "person_hash": "1ztgbts1", "party_id": "1", "state_id": 52, "party": "D", "role_id": 1, "role": "Rep", "name": "Carolyn Maloney", "first_name": "Carolyn", "middle_name": "B.", "last_name": "Maloney", "suffix": "", "nickname": "", "district": "HD-NY-12", "ftm_eid": 17658243, "votesmart_id": 26978, "opensecrets_id": "N00000078", "knowwho_pid": 158983, "ballotpedia": "Carolyn_Maloney", "sponsor_type_id": 2, "sponsor_order": 17, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 9297, "person_hash": "tbdidoow", "party_id": "2", "state_id": 52, "party": "R", "role_id": 1, "role": "Rep", "name": "Donald Manzullo", "first_name": "Donald", "middle_name": "A.", "last_name": "Manzullo", "suffix": "", "nickname": "", "district": "HD-IL-16", "ftm_eid": 17657453, "votesmart_id": 26843, "opensecrets_id": "N00004905", "knowwho_pid": 158843, "ballotpedia": "Donald_Manzullo", "sponsor_type_id": 2, "sponsor_order": 18, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 9302, "person_hash": "toay0ur1", "party_id": "2", "state_id": 52, "party": "R", "role_id": 1, "role": "Rep", "name": "Candice Miller", "first_name": "Candice", "middle_name": "S.", "last_name": "Miller", "suffix": "", "nickname": "", "district": "HD-MI-10", "ftm_eid": 13010776, "votesmart_id": 2062, "opensecrets_id": "N00009795", "knowwho_pid": 211716, "ballotpedia": "Candice_Miller", "sponsor_type_id": 2, "sponsor_order": 19, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 11064, "person_hash": "2vhr1egn", "party_id": "2", "state_id": 52, "party": "R", "role_id": 1, "role": "Rep", "name": "Mick Mulvaney", "first_name": "Mick", "middle_name": "", "last_name": "Mulvaney", "suffix": "", "nickname": "", "district": "HD-SC-5", "ftm_eid": 6670008, "votesmart_id": 60348, "opensecrets_id": "N00031412", "knowwho_pid": 249811, "ballotpedia": "Mick_Mulvaney", "sponsor_type_id": 2, "sponsor_order": 20, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 9306, "person_hash": "582p738j", "party_id": "2", "state_id": 52, "party": "R", "role_id": 1, "role": "Rep", "name": "Sue Myrick", "first_name": "Sue", "middle_name": "Wilkins", "last_name": "Myrick", "suffix": "", "nickname": "", "district": "HD-NC-9", "ftm_eid": 6726648, "votesmart_id": 21789, "opensecrets_id": "N00002327", "knowwho_pid": 158942, "ballotpedia": "Sue_Wilkins_Myrick", "sponsor_type_id": 2, "sponsor_order": 21, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 9099, "person_hash": "zf6x4xdf", "party_id": "1", "state_id": 52, "party": "D", "role_id": 1, "role": "Rep", "name": "Jerrold Nadler", "first_name": "Jerrold", "middle_name": "", "last_name": "Nadler", "suffix": "", "nickname": "", "district": "HD-NY-10", "ftm_eid": 17658246, "votesmart_id": 26980, "opensecrets_id": "N00000939", "knowwho_pid": 158977, "ballotpedia": "Jerrold_Nadler", "sponsor_type_id": 2, "sponsor_order": 22, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 9102, "person_hash": "2ad3f5wt", "party_id": "1", "state_id": 52, "party": "D", "role_id": 1, "role": "Rep", "name": "John Olver", "first_name": "John", "middle_name": "W.", "last_name": "Olver", "suffix": "", "nickname": "", "district": "HD-MA-1", "ftm_eid": 36943, "votesmart_id": 26894, "opensecrets_id": "N00000143", "knowwho_pid": 158875, "ballotpedia": "John_Olver", "sponsor_type_id": 2, "sponsor_order": 23, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 8987, "person_hash": "1narqjxv", "party_id": "1", "state_id": 52, "party": "D", "role_id": 1, "role": "Rep", "name": "Bill Pascrell", "first_name": "Bill", "middle_name": "", "last_name": "Pascrell", "suffix": "Jr.", "nickname": "", "district": "HD-NJ-9", "ftm_eid": 16580040, "votesmart_id": 478, "opensecrets_id": "N00000751", "knowwho_pid": 158959, "ballotpedia": "Bill_Pascrell", "sponsor_type_id": 2, "sponsor_order": 24, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 11163, "person_hash": "kuapkzdj", "party_id": "2", "state_id": 52, "party": "R", "role_id": 1, "role": "Rep", "name": "Martha Roby", "first_name": "Martha", "middle_name": "", "last_name": "Roby", "suffix": "", "nickname": "", "district": "HD-AL-2", "ftm_eid": 17657350, "votesmart_id": 71604, "opensecrets_id": "N00030768", "knowwho_pid": 283894, "ballotpedia": "Martha_Roby", "sponsor_type_id": 2, "sponsor_order": 25, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 9231, "person_hash": "rfh7xn1x", "party_id": "2", "state_id": 52, "party": "R", "role_id": 1, "role": "Rep", "name": "Edward Royce", "first_name": "Edward", "middle_name": "R.", "last_name": "Royce", "suffix": "", "nickname": "", "district": "HD-CA-39", "ftm_eid": 390709, "votesmart_id": 70848, "opensecrets_id": "N00008264", "knowwho_pid": 158756, "ballotpedia": "Edward_Royce", "sponsor_type_id": 2, "sponsor_order": 26, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 9232, "person_hash": "aiyghgq9", "party_id": "2", "state_id": 52, "party": "R", "role_id": 1, "role": "Rep", "name": "James Sensenbrenner", "first_name": "F. James", "middle_name": "", "last_name": "Sensenbrenner", "suffix": "Jr.", "nickname": "", "district": "HD-WI-5", "ftm_eid": 3273057, "votesmart_id": 27142, "opensecrets_id": "N00004291", "knowwho_pid": 159134, "ballotpedia": "Jim_Sensenbrenner", "sponsor_type_id": 2, "sponsor_order": 27, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 9200, "person_hash": "69y137x9", "party_id": "2", "state_id": 52, "party": "R", "role_id": 1, "role": "Rep", "name": "Pete Sessions", "first_name": "Pete", "middle_name": "", "last_name": "Sessions", "suffix": "", "nickname": "", "district": "HD-TX-32", "ftm_eid": 10838573, "votesmart_id": 288, "opensecrets_id": "N00005681", "knowwho_pid": 159075, "ballotpedia": "Pete_Sessions", "sponsor_type_id": 2, "sponsor_order": 28, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 9155, "person_hash": "3kteqgg0", "party_id": "1", "state_id": 52, "party": "D", "role_id": 1, "role": "Rep", "name": "Heath Shuler", "first_name": "Heath", "middle_name": "", "last_name": "Shuler", "suffix": "", "nickname": "", "district": "HD-NC-11", "ftm_eid": 19890141, "votesmart_id": 57781, "opensecrets_id": "N00027655", "knowwho_pid": 248353, "ballotpedia": "Heath_Shuler", "sponsor_type_id": 2, "sponsor_order": 29, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 9332, "person_hash": "v8k1jqbe", "party_id": "2", "state_id": 52, "party": "R", "role_id": 1, "role": "Rep", "name": "Patrick Tiberi", "first_name": "Patrick", "middle_name": "J.", "last_name": "Tiberi", "suffix": "", "nickname": "", "district": "HD-OH-12", "ftm_eid": 2781461, "votesmart_id": 8404, "opensecrets_id": "N00009699", "knowwho_pid": 197859, "ballotpedia": "Patrick_Tiberi", "sponsor_type_id": 2, "sponsor_order": 30, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 9334, "person_hash": "ivqb9ymw", "party_id": "2", "state_id": 52, "party": "R", "role_id": 1, "role": "Rep", "name": "Fred Upton", "first_name": "Fred", "middle_name": "", "last_name": "Upton", "suffix": "", "nickname": "", "district": "HD-MI-6", "ftm_eid": 2001367, "votesmart_id": 26906, "opensecrets_id": "N00004133", "knowwho_pid": 158900, "ballotpedia": "Fred_Upton", "sponsor_type_id": 2, "sponsor_order": 31, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 11077, "person_hash": "lsiiin3b", "party_id": "2", "state_id": 52, "party": "R", "role_id": 1, "role": "Rep", "name": "Tim Walberg", "first_name": "Tim", "middle_name": "", "last_name": "Walberg", "suffix": "", "nickname": "", "district": "HD-MI-7", "ftm_eid": 200642, "votesmart_id": 8618, "opensecrets_id": "N00026368", "knowwho_pid": 248304, "ballotpedia": "Tim_Walberg", "sponsor_type_id": 2, "sponsor_order": 32, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 11078, "person_hash": "km57c96q", "party_id": "2", "state_id": 52, "party": "R", "role_id": 1, "role": "Rep", "name": "Joe Walsh", "first_name": "Joe", "middle_name": "", "last_name": "Walsh", "suffix": "", "nickname": "", "district": "HD-IL-8", "ftm_eid": 6624786, "votesmart_id": 116545, "opensecrets_id": "N00004723", "knowwho_pid": 284437, "ballotpedia": "Joe_Walsh_(Illinois)", "sponsor_type_id": 2, "sponsor_order": 33, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 11099, "person_hash": "wdolqnr4", "party_id": "2", "state_id": 52, "party": "R", "role_id": 1, "role": "Rep", "name": "Steve Womack", "first_name": "Steve", "middle_name": "", "last_name": "Womack", "suffix": "", "nickname": "", "district": "HD-AR-3", "ftm_eid": 9604218, "votesmart_id": 71815, "opensecrets_id": "N00031857", "knowwho_pid": 285713, "ballotpedia": "Steve_Womack", "sponsor_type_id": 2, "sponsor_order": 34, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}], "sasts": [], "subjects": [{"subject_id": 13125, "subject_name": "Academic performance and assessments"}, {"subject_id": 13126, "subject_name": "Administrative law and regulatory procedures"}, {"subject_id": 13384, "subject_name": "Administrative remedies"}, {"subject_id": 13642, "subject_name": "Competition and antitrust"}, {"subject_id": 13146, "subject_name": "Congressional oversight"}, {"subject_id": 13148, "subject_name": "Corporate finance and management"}, {"subject_id": 13433, "subject_name": "Correctional facilities and imprisonment"}, {"subject_id": 13176, "subject_name": "Employment and training programs"}, {"subject_id": 13177, "subject_name": "Employment discrimination and employee rights"}, {"subject_id": 13184, "subject_name": "Executive agency funding and structure"}, {"subject_id": 13837, "subject_name": "Federal Prison Industries, Inc."}, {"subject_id": 13197, "subject_name": "Government corporations and government-sponsored enterprises"}, {"subject_id": 13260, "subject_name": "Public contracts and procurement"}, {"subject_id": 13535, "subject_name": "Vocational education"}, {"subject_id": 13297, "subject_name": "Wages and earnings"}, {"subject_id": 13340, "subject_name": "Crime and law enforcement"}, {"subject_id": 22688, "subject_name": "Government studies and investigations"}], "texts": [{"doc_id": 500522, "date": "2011-12-20", "type": "Introduced", "type_id": 1, "mime": "application/pdf", "mime_id": 2, "url": "https://legiscan.com/US/text/HB3634/id/500522", "state_link": "https://www.congress.gov/112/bills/hr3634/BILLS-112hr3634ih.pdf", "text_size": 262100, "text_hash": "48698d9797d470aa6b5b73a01e0fdbae"}], "votes": [], "amendments": [], "supplements": [], "calendar": []}}