{"status": "OK", "bill": {"bill_id": 515472, "change_hash": "a28b9360d1ce6cdbc2d86904232f5a3d", "session_id": 1026, "session": {"session_id": 1026, "state_id": 52, "year_start": 2013, "year_end": 2014, "prefile": 0, "sine_die": 1, "prior": 1, "special": 0, "session_tag": "Regular Session", "session_title": "2013-2014 Regular Session", "session_name": "113th Congress"}, "url": "https://legiscan.com/US/bill/HB803/2013", "state_link": "https://www.congress.gov/bill/113th-congress/house-bill/803/all-info", "completed": 1, "status": 4, "status_date": "2014-07-22", "progress": [{"date": "2013-02-25", "event": 1}, {"date": "2013-02-25", "event": 9}, {"date": "2013-02-25", "event": 9}, {"date": "2013-02-25", "event": 9}, {"date": "2013-02-25", "event": 9}, {"date": "2013-02-25", "event": 9}, {"date": "2013-02-25", "event": 9}, {"date": "2013-02-25", "event": 9}, {"date": "2013-02-26", "event": 9}, {"date": "2013-03-01", "event": 9}, {"date": "2013-03-01", "event": 9}, {"date": "2013-03-06", "event": 10}, {"date": "2013-03-18", "event": 2}, {"date": "2014-07-15", "event": 3}, {"date": "2014-07-22", "event": 8}, {"date": "2014-07-22", "event": 4}], "state": "US", "state_id": 52, "bill_number": "HB803", "bill_type": "B", "bill_type_id": "1", "body": "H", "body_id": 114, "current_body": "S", "current_body_id": 115, "title": "Workforce Innovation and Opportunity Act", "description": "Supporting Knowledge and Investing in Lifelong Skills Act or SKILLS Act - Amends the Workforce Investment Act of 1998 (WIA) to revise requirements and reauthorize appropriations for: (1) WIA title I, workforce investment systems for job training and employment services; and (2) WIA title II, adult education and family literacy education programs. Title I: Amendments to the Workforce Investment Act of 2012 - Subtitle A: Workforce Investment Definitions - (Sec. 101) Defines \"accrued expenditures,\" \"administrative costs,\" \"at-risk youth,\" \"industry or sector partnership,\" \"industry-recognized credential,\" \"recognized postsecondary credential,\" and \"pay-for-performance contract strategy.\" Revises other specified definitions. Subtitle B: Statewide and Local Workforce Investment Systems - (Sec. 103) Revises requirements for membership on a state workforce investment board (state board). Requires a state board to assist the state governor by developing: (1) policies and programs that support a comprehensive statewide workforce development system, and (2) a statewide workforce and labor market information system. (Sec. 104) Revises requirements for a state workforce development plan. Requires a plan to outline a three-year (currently five-year) strategy for the statewide workforce investment system. Requires a plan, in addition to current specified contents, to describe: (1) strategies and services to more fully engage employers and meet their needs, as well as those to assist at-risk youth and out-of-school youth in acquiring education, skills, credentials, and employment experience; (2) how the state board will convene industry or sector partnerships that lead to collaborative planning, resource alignment, and training efforts across multiple firms for a range of workers currently or potentially employed by a targeted industry cluster; (3) how the state will use technology to facilitate access to services in remote areas; (4) state actions to foster communication, coordination, and partnerships with non-profit organizations that provide employment-related, training, and complementary services; and (5) the process and methodology for determining one-stop partner program contributions for the cost of the infrastructure of one-stop centers, as well as the formula for allocating such infrastructure funds to local areas. Requires the state plan also to describe: (1) how the state will furnish employment, training, including training in advanced manufacturing, supportive, and placement services to veterans, including disabled and homeless veterans; and (2) the strategies and services that will be used to assist and expedite reintegration of homeless veterans into the labor force.  (Sec. 105) Revises requirements for the designation of local workforce investment areas. Repeals the requirement that the state governor designate such areas. Requires the state, through the state board, to establish a process to make such designations. Requires a local or regional board, under such a process, to submit for state board approval an application for designation as a local area containing specified information. Eliminates automatic designations by a state governor upon the request of any area meeting certain criteria or on recommendation of a state board.  Authorizes the state board to designate a state as a single state local area regardless of whether it was a single state service delivery area under the Job Training Partnership Act as of July 1, 1998. Allows a state to require the local boards for a designated region to prepare a single regional plan that incorporates the elements of the local plan and is approved in lieu of separate local plans. (Sec. 106) Revises requirements for local workforce investment boards. Repeals the requirement that representatives of labor organizations be included on a board. Changes from mandatory to discretionary, at the option of the chief elected official in the local area, the inclusion on a board of representatives of community-based organizations and of specified representatives of the local secondary school system, a postsecondary educational institution, or entities providing adult education and literacy activities. Adds representatives of veterans service organizations as possible board members at the discretion of the chief elected official in the local area. Requires a two-thirds majority of the board members to represent local area businesses. Repeals the requirement that the governing body of the concentrated employment program involved act in consultation with the chief elected official in the local workforce investment area to appoint members of the local board. Revises requirements for the functions of the local board. Requires the local board to conduct, and regularly update, a workforce research and regional labor market analysis and assist the governor in developing a statewide workforce and labor market information system. Renames core services a local board may provide through a one-stop delivery system as work ready services. (Sec. 107) Revises requirements for the comprehensive local plan and its contents, contracting its range from five years to three years. (Sec. 108) Revises requirements for the roles and responsibilities of one-stop partners in one-stop delivery systems. Removes from a one-stop delivery system any activities under the national system of public employment offices, welfare-to-work grants, and Older American community service employment program. Adds to the one-stop delivery system any activities of the Temporary Assistance for Needy Families (TANF) grant program under under part A of title IV of the Social Security Act. Requires each entity carrying out TANF activities to carry out the required one-stop partner activities, unless the state governor determines that they shall not.  Removes from the list of human resource programs a one-stop partner may carry out any activities under a state employment and training program assisting members of households participating in the supplemental nutrition assistance program. Adds to the list of human resource programs a one-stop partner may carry out, however, other specified employment and training programs. Revises requirements for the provisions of a memorandum of understanding between the local board and a one-stop partner. Prescribes requirements for one-stop delivery systems. Requires the state board to establish objective procedures and criteria for certifying one-stop centers at least once every three years for the purpose of awarding one-stop infrastructure funding.  (Sec. 109) Revises requirements for identification of eligible providers of training services. Requires a state governor to establish eligibility criteria and procedures for providers of training services in the state, taking into account specified factors. (Sec. 110) Eliminates specific funding for adult and dislocated worker employment and training. (Sec. 111) Revises requirements for reservations of federal appropriations for allotment to states. Specifies state use of federal funds to set up a Workforce Investment Fund.  (Sec. 112) Revises requirements for within-state allocations of funds. (Sec. 113) Revises requirements for the use of funds for state and local employment and training activities, including statewide rapid response and grants for individuals with barriers to employment. Authorizes a local board to use funds allocated to a local area to carry out incumbent worker training programs to assist incumbent workers in obtaining the skills necessary to retain employment and avert layoffs. Requires the state and local board, when providing employment and training activities, to give priority to placing participants in jobs in the private sector. Requires a local board (or the state at the request of the local board) to employ one or more veteran employment specialists in a local area to: (1) conduct outreach to local area employers to assist veterans, including disabled veterans, in gaining employment; and (2) facilitate employment, training, supportive, and placement services furnished to veterans, including disabled and homeless veterans, in the local area. (Sec. 114) Revises requirements for the performance accountability system, including core indicators of performance. Eliminates customer satisfaction indicators. Authorizes a state to establish an incentive system for local boards to implement pay-for-performance contract strategies for the delivery of employment and training services in a local area. (Sec. 115) Authorizes appropriations for employment and training activities for FY2014-FY2020. Subtitle C: Job Corps - (Sec. 116) Revises the principal purpose of the Job Corps to limit it to assisting at-risk youth to connect to the workforce by providing them with intensive academic, career and technical education, and service-learning opportunities to enable them to obtain regular secondary school diplomas and recognized postsecondary credentials leading to successful careers in in-demand industries that will result in opportunities for advancement. (Sec. 118) Raises the maximum age of individuals eligible for the Job Corps from 21 to 24. (Sec. 119) Eliminates from the sources with which implementation of standards and procedures for the recruitment, screening, and selection of eligible Job Corps applicants must be arranged community action agencies, business organizations, and labor organizations, and agencies and individuals that have contact with youth over substantial periods of time and are able to offer reliable information about the needs and problems of youth. Limits such arrangements to organizations that have a demonstrated record of effectiveness in placing at-risk youth into employment. Renders ineligible for enrollment in the Job Corps any individual who: (1) makes a false statement in connection with a criminal background check; (2) is registered or is required to be registered on a state sex offender registry or the National Sex Offender Registry; or (3) has been convicted of a felony consisting of homicide, child abuse or neglect, a crime against children, including child pornography, a crime involving rape or sexual assault, or physical assault, battery, or a drug-related offense committed within the past five years. (Sec. 120) Prohibits the Secretary of Labor (Secretary) from renewing the agreement for an entity to operate a Job Corps center if the center is ranked in the bottom quintile of centers for any program year. Allows such an entity to submit a new application only if it has shown significant improvement in performance indicators over the last program year. Specifies elements of systemic or substantial material failure that disqualify an entity from operating a Job Corps center. (Sec. 121) Makes completing secondary education and receiving a regular secondary school diploma one of the purposes of targeted Job Corps activities. Requires any operator seeking to enroll additional enrollees in an advanced career training program each year to demonstrate beforehand that: (1) program participants have achieved a satisfactory rate of completion and placement in training-related jobs, and (2) the operator has met or exceeded specified performance indicators for the previous year. (Sec. 122) Repeals the authority of the Secretary to provide counseling and job placement to former Job Corps enrollees. (Sec. 123) Replaces readjustment allowances for Job Corps graduates and former enrollees with transition allowances to graduates only. Requires the transition allowance to be incentive-based to reflect a graduate's completion of academic, career and technical education or training, and attainment of a recognized postsecondary credential, including an industry-recognized credential. (Sec. 124) Repeals the authority of the Secretary to require the operator of a Job Corps center to submit additional information, to become part of the center's operating plan, in order to remain eligible to operate the center. Prohibits a Job Corps center operator from using more than 10% of funds allotted to it for administrative costs. (Sec. 125) Revises requirements for Job Corps center participation in the community. Eliminates the requirement that each center have a Business and Community Liaison. Requires instead that the director of each Job Corps center encourage and cooperate in activities to establish a mutually beneficial relationship between Job Corps centers in the state and nearby communities, which may include use of any local workforce development boards to provide a mechanism for joint discussion of common problems and for planning programs of mutual interest. (Sec. 126) Changes the industry council, appointed by the center director, each Job Corps center is required to have to a workforce council appointed by the state governor. Revises requirements for council composition and responsibilities. (Sec. 127) Repeals the authority of the Secretary to carry out experimental, research, or demonstration projects relating to the Job Corps program. Directs the Secretary instead to provide technical assistance and training for the Job Corps program to improve its quality. (Sec. 129) Directs the Secretary to establish procedures to ensure that each Job Corps center operator, and each service provider, maintains a performance accountability system meeting certain criteria (in addition to the financial management information system required by current law). Prescribes primary and secondary performance indicators.Subtitle D: National Programs - (Sec. 130) Eliminates authority and requirements with respect to technical assistance to states that do not meet state performance measures with respect to employment and training activities for dislocated workers. Requires the Secretary to establish a system through which states may share information regarding best practices with regard to the operation of workforce investment activities. (Sec. 131) Requires the Secretary, through grants, contracts, or cooperative agreements, to conduct an independent evaluation of national programs and funded activities at least once every five years. Revises the requirement that such an evaluation cover the impact of the programs and activities on the community and participants involved to specify the impact of receiving services and not receiving services under such programs and activities on the community, businesses, and individuals. Adds quasi-experimental methods, impact analysis, and the use of administrative data to the list of research designs such evaluations must use. Reduces authorized appropriations by 10% for the fiscal year (and by an additional 10% for each subsequent fiscal year) in which the final results of an evaluation are not reported to Congress. Subtitle E: Administration - (Sec. 132) Changes from mandatory to discretionary the Secretary's authority to investigate an allegation of a violation of the requirements of federal labor law made by participants and other interested or affected parties. Revises limitations of the use of funds to prohibit their use for specified activities that are not directly related to the entry into employment, retention in employment, or increases in earnings of (currently, training for) eligible individuals. Prohibits the use of funds by a recipient or subrecipient to pay the salary and bonuses of an individual, either as direct costs or indirect costs, at a rate in excess of Level II of the Federal Executive Pay Schedule. Directs the Employment and Training Administration (ETA) of the Department of Labor, headed by an Assistant Secretary appointed by the President by and with the advice and consent of the Senate, to administer all workforce investment systems programs for job training and employment services and title III (Job Corps). Requires the Assistant Secretary to have substantial experience in workforce development and in workforce development management. (Sec. 134) Revises the requirement that funds made available to a state for administration of statewide workforce investment activities be allocable to the overall administration of workforce investment activities. Repeals the declaration that such funds need not be specifically allocable to: (1) the administration of adult employment and training activities; (2) the administration of dislocated worker employment and training activities; or (3) the administration of youth activities. (Sec. 135) Requires that each state, each local board, and each recipient (other than a subrecipient, subgrantee, or contractor of a recipient) receiving funds have the option to submit or disseminate electronically any reports, records, plans, or any other data required to be collected or disseminated. Requires the Secretary to submit to Congress all quarterly financial reports of local boards on programs and activities received from each state. (Sec. 136) Changes from July 1 to October 1 the start of a workforce investment systems program year. Repeals special rules for: (1) designation of service delivery areas for the delivery of workforce investment activities, and (2) state sanctioning of such areas for failure to meet performance measures for such activities.  Authorizes the Secretary to establish, in lieu of current requirements for waiver requests and for conditions on waivers, an expedited procedure for the purpose of extending to additional states the waiver of statutory or regulatory requirements that have been approved for a state pursuant to a request. Prohibits the Secretary from requiring or imposing new or additional requirements, not specified under this Act, on a state in exchange for providing a waiver to the state or a local area in it. (Sec. 138) Exempts certain funds received by a public or private nonprofit entity, such as those raised privately from philanthropic foundations, businesses, or other private entities, from consideration as income with respect to the requirement that a public or private nonprofit entity may retain income from any program it administers only if it is used to continue to carry out the program. Prohibits the use of funds to establish or operate stand-alone fee-for-service enterprises, except one-stop centers, that compete with private sector employment agencies. (Sec. 139) Requires the Director of the Office of Management and Budget (OMB) to: (1) identify the number of federal government employees who work on or administer each of the workforce investment system programs authorized or repealed under this Act, (2) identify the number of full-time equivalent (FTE) employees who work on or administer any such programs that have been repealed or consolidated, and (3) reduce the federal government workforce by that number of FTE employees. Prohibits the use of funds for lobbying (with specified exceptions) and political activities (including voter registration activities). Subtitle F: State Unified Plan - (Sec. 140) Revises the kinds of programs and activities, including workforce investment system and adult education and literacy programs, that may be covered by a state unified plan.  Grants the Secretary of Education the authority to approve state unified plans. (Currently, such plans are approved by the appropriate Secretary of the federal agency who exercises administrative authority over such programs or activities.) Prescribes requirements for the Secretary's approval of such plans. Authorizes a state, in developing a state unified plan, to consolidate additional federal employment and training funds allotted to it into the Workforce Investment Fund to improve the administration of state and local employment and training programs. Prohibits consolidation of funds, however, allocated to the state under the Carl D. Perkins Career and Technical Education Act of 2006 and the Rehabilitation Act of 1973. Title II: Adult Education and Family Literacy Education - (Sec. 201) Revises the entire Adult Education and Family Literacy Education Act (while retaining most of it as is). Defines \"adult education and family literacy education programs\" as a sequence of academic instruction and educational services below the postsecondary level that increase an individual's ability to read, write, and speak English and perform mathematical computations leading to a level of proficiency equivalent to at least a secondary school completion. Targets these programs to individuals who are at least age 16 and are not enrolled or required to be enrolled in secondary school under state law and who also: (1) lack sufficient mastery of basic reading, writing, speaking, and math skills to enable them to function effectively in society; (2) do not have a secondary school diploma or its equivalent and have not achieved an equivalent level of education; or (3) are English learners. Changes the term \"individual of limited English proficiency\" to \"English learner.\" Extends the authorization of appropriations through FY2014-FY2020. Increases from 1.5% to 2% the mandatory reservation of funds for national activities involved in adult education, English language acquisition, and family literacy education programs. Replaces current requirements for a performance accountability system with a referral to specified other performance accountability requirements. Contracts from five years to three years the length of the mandatory state plan. Authorizes the eligible agency to submit the state plan as part of a state unified plan (as indicated in Sec. 140). Revises requirements for plan contents. Requires the Secretary to approve a state plan within 90 days after receiving it. Reduces from 90 days to 30 days the deadline for rejecting a plan for failing to meet requirements. Requires the Secretary, however, to provide technical assistance to assist the eligible agency to meet such requirements if its plan fails to receive approval. Revises requirements for local activities the eligible agency must require eligible providers receiving a grant or contract to establish or operate. Requires the eligible agency to require eligible providers to demonstrate measurable goals for participant outcomes and other specified program elements. Repeals the condition on an eligible agency's receipt of federal funds for any fiscal year that the Secretary find that the agency's fiscal effort per student or its aggregate expenditures for adult education and literacy activities, in the second preceding fiscal year, was not less than 90% of the fiscal effort per student or the agency's aggregate expenditures for adult education and literacy activities, in the third preceding fiscal year. Repeals the mandate for a National Institute for Literacy. Revises requirements for national activities (currently, national leadership activities), especially discretionary technical assistance, upon request, to eligible entities. Title III: Amendments to the Wagner-Peyser Act - (Sec. 301) Amends the Wagner-Peyser Act to replace the nationwide employment statistics system, which the Secretary is required to oversee, with a nationwide workforce and labor market information system. Eliminates the requirement for an annual plan to achieve cooperative management of the nationwide system. Authorizes the Secretary to assist in the development of national electronic tools that may be used to: (1) facilitate the delivery of work ready services, and (2) provide workforce information to individuals through one-stop delivery systems and through other appropriate delivery systems. Authorizes appropriations for FY2014-FY2020. Title IV: Repeals and Conforming Amendments - (Sec. 401) Amends the Older Americans Act of 1965 to repeal authorities for training projects for the specialized training of persons employed or preparing for employment in carrying out programs related to the purposes of such Act.  Repeals the Twenty-First Century Workforce Commission Act, the Youth Conservation Corps Act of 1970, and the Women in Apprenticeship and Nontraditional Occupations Act. Amends the Higher Education Amendments of 1998 to repeal the authorization for grants to states for workplace and community transition training for incarcerated individuals. Repeals the disabled veterans' outreach program and the mandate for local veterans' employment representatives. (Sec. 402) Amends the Comprehensive Environmental Response, Compensation, and Liability Act of 1980 (CERCLA) to repeal the authority of the Administrator of the Environmental Protection Agency (EPA) to provide training to individuals and organizations to facilitate the inventory of brownfield sites, site assessments, remediation of brownfield sites, community involvement, or site preparation. (Sec. 403) Amends the Food and Nutrition Act of 2008 to require that employment and training services to eligible members of households participating in the supplemental nutrition assistance program be provided through the statewide workforce development system, including the one-stop delivery system. Deems a state workforce investment board to be the state agency designing and implementing the program providing such services.  Requires the state workforce investment board to provide payments or reimbursement to participants for: (1) the actual costs of transportation and other actual costs reasonably necessary and directly related to the individual participating in employment and training services; and (2) the actual costs of such dependent care expenses, which may, at board option, be arranged through providers by the purchase of service contracts or vouchers or by providing vouchers to the household. Requires the Secretary of Agriculture to monitor the state workforce investment board administering employment and training services in conjunction with the Secretary of Labor to ensure that funds are being spent effectively and efficiently. Repeals the authority of the Secretary of Agriculture to conduct demonstration projects to test improved consistency or coordination between the supplemental nutrition assistance program employment and training program and the Job Opportunities and Basic Skills program under title IV of the Social Security Act. (Sec. 404) Amends the Immigration and Nationality Act to require employment and training services for refugees to be provided through the statewide workforce development system. (Sec. 405) Amends the Second Chance Act of 2007 as well as the Omnibus Crime Control and Safe Streets Act of 1968 to require that all prisoner reentry program services be provided through statewide workforce investment systems. Title V: Amendments to the Rehabilitation Act of 1973 - (Sec. 502) Amends the Rehabilitation Act of 1973 (RA73) to redesignate the Commissioner of the Rehabilitation Services Administration (RSA) the Director. (Sec. 503) Defines \"student with a disability\" as an individual with a disability who: (1) is between ages 16 and 21, (2) has been determined eligible for vocational rehabilitation assistance, and (3) is also eligible for and is receiving special education under the Individuals with Disabilities Education Act. (Sec. 504) Requires the state vocational rehabilitation plan to assure that the designated state unit and the lead agency or implementing entity responsible for carrying out duties under the Assistive Technology Act of 1998 have developed working relationships and coordinate their activities. Requires the state plan also to include an assessment of: (1) the transition services provided under RA73, and coordinated with transition services under the Individuals with Disabilities Education Act, as to those services meeting the needs of individuals with disabilities; and (2) describe the methods to be used to improve and expand vocational rehabilitation services for students with disabilities, including the coordination of services designed to facilitate student transition from receipt of educational services in school to receipt of vocational rehabilitation services or to postsecondary education or employment. Requires the state plan also to: (1) describe criteria the designated state agency will use to award collaboration with industry grants; and (2) provide satisfactory assurance that the state has developed and implemented strategies, and shall carry out programs or activities, to address the vocational rehabilitation needs of individuals with disabilities identified in the mandatory comprehensive triennial statewide assessment, especially vocational rehabilitation services for students with disabilities. (Sec. 505) Includes among vocational rehabilitation services establishment, development, or improvement of assistive technology demonstration, loan, reutilization, or financing programs in coordination with activities authorized under the Assistive Technology Act of 1998 to promote access to assistive technology for individuals with disabilities and employers. (Sec. 506) Repeals the requirement that the RSA Commissioner (now Director) establish evaluation standards and performance indicators for the vocational rehabilitation program. Subjects such standards and indicators to specified requirements of the Workforce Investment Act of 1998. (Sec. 507) Requires a state to use a certain percentage of the federal share of the cost of vocational rehabilitation services to award five-year grants to for-profit businesses, alone or in partnership with community rehabilitation program providers, Indian tribes, or tribal organizations, to create practical job and career readiness and training programs for individuals with disabilities, and provide job placements and career advancement for them. (Sec. 508) Requires each state to reserve at least 10% of its funds allotted for vocational rehabilitation services to carry out transition services. (Sec. 509) Directs the Secretary of Education to make grants to the protection and advocacy system serving the American Indian Consortium to provide assistance under a client assistance program in informing and advising all clients and client applicants of all available benefits under RA73. (Sec. 510) Repeals the authority of the RSA Commissioner (now Director) to make grants and contracts for: (1) vocational rehabilitation services to individuals with disabilities who are migrant or seasonal farmworkers, (2) recreational programs for such individuals, and (3) in-service training of vocational rehabilitation personnel. Revises eligibility requirements for nonprofit organizations to receive grants to establish training and information programs to assist individuals with disabilities and others in meeting the vocational, independent living, and rehabilitation needs of the disabled. Reserves 20% or $500,000, whichever is less, for coordination of such programs. (Sec. 511) Repeals title VI (Employment Opportunities for Individuals with Disabilities) of RA73. (Sec. 512) Revises requirements for selection of a chairperson for the Statewide Independent Living Council to repeal the requirement that, in states in which the governor does not have veto power under state law, the appointing authority designate a voting member of the Council to serve as chairperson or require the Council to so designate such a voting member. (Sec. 513) Revises requirements and reauthorizes appropriations for FY2014-FY2020 for vocational rehabilitation services under RA73. Title VI: Studies by the Comptroller General - (Sec. 601) Directs the Comptroller General (GAO) to report to Congress on whether, before receiving workforce investment system training services, adults and dislocated workers have first exhausted funds received through the Federal Pell Grant program under title IV of the Higher Education Act of 1965. (Sec. 602) Directs the Comptroller General to report to Congress a determination of the amount of administrative costs savings at the federal and state levels as a result of workforce investment system programs repealed or consolidated under this Act.", "pending_committee_id": 0, "committee": [], "referrals": [{"date": "2013-02-25", "committee_id": 2301, "chamber": "H", "chamber_id": 114, "name": "Education And The Workforce"}, {"date": "2013-02-26", "committee_id": 2551, "chamber": "H", "chamber_id": 114, "name": "Subcommittee on Water Resources and Environment"}, {"date": "2013-03-01", "committee_id": 2598, "chamber": "H", "chamber_id": 114, "name": "Subcommittee on Economic Opportunity"}, {"date": "2013-03-18", "committee_id": 2328, "chamber": "S", "chamber_id": 115, "name": "Health, Education, Labor, And Pensions"}], "history": [{"date": "2013-02-25", "action": "Referred to the Committee on Education and the Workforce, and in addition to the Committees on the Judiciary, Agriculture, Veterans' Affairs, Energy and Commerce, and Transportation and Infrastructure, for a period to be subsequently determined by the Speaker, in each case for consideration of such provisions as fall within the jurisdiction of the committee concerned.", "chamber": "H", "chamber_id": 114, "importance": 1}, {"date": "2013-02-25", "action": "Referred to House Education and the Workforce", "chamber": "H", "chamber_id": 114, "importance": 1}, {"date": "2013-02-25", "action": "Referred to House Judiciary", "chamber": "H", "chamber_id": 114, "importance": 1}, {"date": "2013-02-25", "action": "Referred to House Agriculture", "chamber": "H", "chamber_id": 114, "importance": 1}, {"date": "2013-02-25", "action": "Referred to House Veterans' Affairs", "chamber": "H", "chamber_id": 114, "importance": 1}, {"date": "2013-02-25", "action": "Referred to House Energy and Commerce", "chamber": "H", "chamber_id": 114, "importance": 1}, {"date": "2013-02-25", "action": "Referred to House Transportation and Infrastructure", "chamber": "H", "chamber_id": 114, "importance": 1}, {"date": "2013-02-26", "action": "Referred to the Subcommittee on Water Resources and Environment.", "chamber": "H", "chamber_id": 114, "importance": 1}, {"date": "2013-03-01", "action": "Referred to the Subcommittee on Economic Opportunity.", "chamber": "H", "chamber_id": 114, "importance": 1}, {"date": "2013-03-01", "action": "Referred to the Subcommittee on Environment and the Economy.", "chamber": "H", "chamber_id": 114, "importance": 1}, {"date": "2013-03-06", "action": "Committee Consideration and Mark-up Session Held.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2013-03-06", "action": "Ordered to be Reported (Amended) by the Yeas and Nays: 23 Yeas and 18 not voting.", "chamber": "H", "chamber_id": 114, "importance": 1}, {"date": "2013-03-06", "action": "Sponsor introductory remarks on measure. (CR H1317)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2013-03-12", "action": "Reported (Amended) by the Committee on Education and the Workforce. H. Rept. 113-14, Part I.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2013-03-12", "action": "Committee on Judiciary discharged.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2013-03-12", "action": "Committee on Agriculture discharged.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2013-03-12", "action": "Committee on Veterans' Affairs discharged.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2013-03-12", "action": "Committee on Energy and Commerce discharged.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2013-03-12", "action": "Committee on Transportation discharged.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2013-03-12", "action": "Placed on the Union Calendar, Calendar No. 9.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2013-03-13", "action": "Rules Committee Resolution H. Res. 113 Reported to House. Rule provides for consideration of H.R. 803 with 1 hour of general debate. Motion to recommit with or without instructions allowed. Measure will be considered read. Specified amendments are in order. The resolution waives all points of order against consideration of the bill. The resolution makes in order as original text for purpose of amendment an amendment in the nature of a substitute consisting of the text of Rules Committee Print 113-4. The resolution makes in order only those amendments printed in this report.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2013-03-14", "action": "Rule H. Res. 113 passed House.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2013-03-15", "action": "Considered under the provisions of rule H. Res. 113. (consideration: CR H1435-1530)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2013-03-15", "action": "Rule provides for consideration of H.R. 803 with 1 hour of general debate. Motion to recommit with or without instructions allowed. Measure will be considered read. Specified amendments are in order. The resolution waives all points of order against consideration of the bill. The resolution makes in order as original text for purpose of amendment an amendment in the nature of a substitute consisting of the text of Rules Committee Print 113-4. The resolution makes in order only those amendments printed in this report.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2013-03-15", "action": "House resolved itself into the Committee of the Whole House on the state of the Union pursuant to H. Res. 113 and Rule XVIII.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2013-03-15", "action": "The Speaker designated the Honorable Ileana Ros-Lehtinen to act as Chairwoman of the Committee.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2013-03-15", "action": "GENERAL DEBATE - The Committee of the Whole proceeded with one hour of general debate on H.R. 803.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2013-03-15", "action": "H.AMDT.26 Amendment (A001) offered by Ms. Foxx. (consideration: CR H1469-1472; text: CR H1469-1470)Amendment provides an application process for local or regional boards to be designated as a local workforce investment area; authorizes GAO to complete two studies related to Workforce Investment Act programs and makes technical and clarifying changes.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2013-03-15", "action": "DEBATE - Pursuant to the provisions of H. Res. 113, the Committee of the Whole proceeded with 10 minutes of debate on the Foxx amendment No. 1.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2013-03-15", "action": "H.AMDT.26 On agreeing to the Foxx amendment (A001) Agreed to by voice vote.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2013-03-15", "action": "H.AMDT.27 Amendment (A002) offered by Mr. Gallego. (consideration: CR H1472; text: CR H1472)Amendment advances manufacturing in the state and local plans sections to assist American Veterans in obtaining better job opportunities in that field.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2013-03-15", "action": "DEBATE - Pursuant to the provisions of H. Res. 113, the Committee of the Whole proceeded with 10 minutes of debate on the Gallego amendment No. 2.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2013-03-15", "action": "H.AMDT.27 On agreeing to the Gallego amendment (A002) Agreed to by voice vote.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2013-03-15", "action": "H.AMDT.28 Amendment (A003) offered by Mr. Young (AK). (consideration: CR H1472-1473; text: CR H1472)Amendment changes the percentage of the authorized State Allotment funding set aside for American Indian, Alaska Native, and Native Hawaiian employment and training grants by replacing a provision that limits the set aside to no more than 1 percent of total funding with a fixed 1 percent guarantee.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2013-03-15", "action": "DEBATE - Pursuant to the provisions of H. Res. 113, the Committee of the Whole proceeded with 10 minutes of debate on the Young (AK) amendment No. 3.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2013-03-15", "action": "H.AMDT.28 On agreeing to the Young (AK) amendment (A003) Agreed to by voice vote.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2013-03-15", "action": "H.AMDT.29 Amendment (A004) offered by Mrs. Black. (consideration: CR H1473-1474; text: CR H1473)An amendment numbered 4 printed in House Report 113-16 to express a sense of Congress that any administrative costs to federal, state, or local entities as a result of this act be off-set by funds currently being used for marketing and outreach at the United States Department of Agriculture.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2013-03-15", "action": "DEBATE - Pursuant to the provisions of H. Res. 113, the Committee of the Whole proceeded with 10 minutes of debate on the Black amendment No. 4.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2013-03-15", "action": "H.AMDT.29 By unanimous consent, the Black amendment was withdrawn.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2013-03-15", "action": "H.AMDT.30 Amendment (A005) offered by Mr. Garrett. (consideration: CR H1474-1475; text: CR H1474)Amendment requires that, if reports due to Congress which evaluate the programs that are covered by this legislation are not transmitted on or before the time period specified for that report, amounts authorized to be appropriated under this title shall be reduced by 10 percent for the next fiscal year and reduced by an additional 10 percent for each subsequent fiscal year until such report is transmitted to Congress.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2013-03-15", "action": "DEBATE - Pursuant to the provisions of H. Res. 113, the Committee of the Whole proceeded with 10 minutes of debate on the Garrett amendment No. 5.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2013-03-15", "action": "H.AMDT.30 On agreeing to the Garrett amendment (A005) Agreed to by voice vote.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2013-03-15", "action": "H.AMDT.31 Amendment (A006) in the nature of a substitute offered by Mr. Tierney. (consideration: CR H1475-1527; text: CR H1475-1523)Amendment in the nature of a substitute sought to reauthorize the Workforce Investment Act in such a way that workers can be assured of obtaining jobs and building careers through strategic partnerships and that businesses are more easily enabled to identify and hire qualified personnel in order to further facilitate the economic recovery.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2013-03-15", "action": "DEBATE - Pursuant to the provisions of H. Res. 113, the Committee of the Whole proceeded with 20 minutes of debate on the Tierney substitute amendment No. 6.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2013-03-15", "action": "H.AMDT.31 On agreeing to the Tierney amendment (A006) Failed by recorded vote: 192 - 227 (Roll no. 73).", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2013-03-15", "action": "The House rose from the Committee of the Whole House on the state of the Union to report H.R. 803.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2013-03-15", "action": "The previous question was ordered pursuant to the rule. (consideration: CR H1527)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2013-03-15", "action": "The House adopted the amendment in the nature of a substitute as agreed to by the Committee of the Whole House on the state of the Union. (text of amendment in the nature of a substitute: CR H1444-1469)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2013-03-15", "action": "Mr. Miller, George moved to recommit with instructions to Education and the Workforce. (consideration: CR H1527-1529; text: CR H1527-1528)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2013-03-15", "action": "DEBATE - The House proceeded with 10 minutes of debate on the George Miller (CA) motion to recommit with instructions. The instructions contained in the motion seek to require the bill to be reported back to the House with an amendment to ensure that nothing in the underlying bill repeals, denies, or weakens the wages, employment protections, employment or training opportunities for seniors, disabled veterans, women in nontraditional occupations, youth, or people with disabilities. The Motion would also raise the minimum wage, in increments over the course of two years, to $10.10 and increase the minimum wage for tipped employees to 70% of the minimum wage.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2013-03-15", "action": "The previous question on the motion to recommit with instructions was ordered without objection. (consideration: CR H1528)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2013-03-15", "action": "On motion to recommit with instructions Failed by the Yeas and Nays: 184 - 233 (Roll no. 74).", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2013-03-15", "action": "Motion to reconsider laid on the table Agreed to without objection.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2013-03-15", "action": "On passage Passed by the Yeas and Nays: 215 - 202 (Roll no. 75).", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2013-03-18", "action": "Received in the Senate and Read twice and referred to the Committee on Health, Education, Labor, and Pensions.", "chamber": "S", "chamber_id": 115, "importance": 1}, {"date": "2014-06-25", "action": "Senate Committee on Health, Education, Labor, and Pensions discharged by Unanimous Consent.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2014-06-25", "action": "Measure laid before Senate by unanimous consent. (consideration: CR S3964-3991)", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2014-06-25", "action": "S.AMDT.3378 Amendment SA 3378 proposed by Senator Murray. (consideration: CR S3964-3972, S3982)In the nature of a substitute.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2014-06-25", "action": "S.AMDT.3381 Amendment SA 3381 proposed by Senator Harkin for Senator Murray to Amendment SA 3378. (consideration: CR S3972-3975, S3982; text: CR S3972-3973)To improve the bill.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2014-06-25", "action": "S.AMDT.3379 Amendment SA 3379 proposed by Senator Flake to Amendment SA 3378. (consideration: CR S3975-3979, S3982; text: CR S3975)To make the appointment and certification of a new local board permissible instead of required.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2014-06-25", "action": "S.AMDT.3380 Amendment SA 3380 proposed by Senator Lee to Amendment SA 3378. (consideration: CR S3979-3982, S3982; text: CR S3979)To require that evaluation reports are due every fourth year, to establish a reservation of funds in a fiscal year in which a report is due, and to establish a reduction in funds if a report is not submitted.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2014-06-25", "action": "S.AMDT.3379 Amendment SA 3379 not agreed to in Senate by Yea-Nay Vote. 33 - 63. Record Vote Number: 212.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2014-06-25", "action": "S.AMDT.3380 Amendment SA 3380 not agreed to in Senate by Yea-Nay Vote. 40 - 58. Record Vote Number: 213.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2014-06-25", "action": "S.AMDT.3381 Amendment SA 3381 agreed to in Senate by Voice Vote.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2014-06-25", "action": "S.AMDT.3378 Amendment SA 3378 agreed to in Senate by Unanimous Consent.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2014-06-25", "action": "S.AMDT.3382 Amendment SA 3382 proposed by Senator Murray. (consideration: CR S3991; text: CR S3991)To amend the title.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2014-06-25", "action": "S.AMDT.3382 Amendment SA 3382 agreed to in Senate by Unanimous Consent.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2014-06-25", "action": "Passed Senate with an amendment and an amendment to the Title by Yea-Nay Vote. 95 - 3. Record Vote Number: 214.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2014-06-26", "action": "Message on Senate action sent to the House.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2014-07-09", "action": "Mr. Kline moved that the House suspend the rules and agree to the Senate amendments. (consideration: CR H5887-5971)", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2014-07-09", "action": "DEBATE - The House proceeded with forty minutes of debate on agreeing to the Senate amendments to H.R. 803.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2014-07-09", "action": "At the conclusion of debate, the Yeas and Nays were demanded and ordered. Pursuant to the provisions of clause 8, rule XX, the chair announced that further proceedings on the motion would be postponed.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2014-07-09", "action": "Considered as unfinished business. (consideration: CR H6009-6010)", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2014-07-09", "action": "On motion that the House suspend the rules and agree to the Senate amendments Agreed to by the Yeas and Nays: (2/3 required): 415 - 6 (Roll no. 378). (text as House agreed to Senate amendment: CR H5887-5962)", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2014-07-09", "action": "Motion to reconsider laid on the table Agreed to without objection.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2014-07-15", "action": "Presented to President.", "chamber": "S", "chamber_id": 115, "importance": 1}, {"date": "2014-07-22", "action": "Signed by President.", "chamber": "S", "chamber_id": 115, "importance": 0}, {"date": "2014-07-22", "action": "Became Public Law No: 113-128.", "chamber": "S", "chamber_id": 115, "importance": 1}], "sponsors": [{"people_id": 9269, "person_hash": "swa3u5tf", "party_id": "2", "state_id": 52, "party": "R", "role_id": 1, "role": "Rep", "name": "Virginia Foxx", "first_name": "Virginia", "middle_name": "", "last_name": "Foxx", "suffix": "", "nickname": "", "district": "HD-NC-5", "ftm_eid": 6285984, "votesmart_id": 6051, "opensecrets_id": "N00026166", "knowwho_pid": 196515, "ballotpedia": "Virginia_Foxx", "sponsor_type_id": 1, "sponsor_order": 1, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 15213, "person_hash": "01n0nehx", "party_id": "2", "state_id": 52, "party": "R", "role_id": 1, "role": "Rep", "name": "Susan Brooks", "first_name": "Susan", "middle_name": "", "last_name": "Brooks", "suffix": "", "nickname": "", "district": "HD-IN-5", "ftm_eid": 17657978, "votesmart_id": 135988, "opensecrets_id": "N00033495", "knowwho_pid": 378487, "ballotpedia": "Susan_Brooks", "sponsor_type_id": 2, "sponsor_order": 2, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 11042, "person_hash": "q6aavo7l", "party_id": "2", "state_id": 52, "party": "R", "role_id": 1, "role": "Rep", "name": "Larry Bucshon", "first_name": "Larry", "middle_name": "", "last_name": "Bucshon", "suffix": "", "nickname": "", "district": "HD-IN-8", "ftm_eid": 7004017, "votesmart_id": 120335, "opensecrets_id": "N00031227", "knowwho_pid": 284631, "ballotpedia": "Larry_Bucshon", "sponsor_type_id": 2, "sponsor_order": 3, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 11124, "person_hash": "u7i7b4fl", "party_id": "2", "state_id": 52, "party": "R", "role_id": 1, "role": "Rep", "name": "Scott DesJarlais", "first_name": "Scott", "middle_name": "", "last_name": "DesJarlais", "suffix": "", "nickname": "", "district": "HD-TN-4", "ftm_eid": 16586618, "votesmart_id": 123473, "opensecrets_id": "N00030957", "knowwho_pid": 285129, "ballotpedia": "Scott_DesJarlais", "sponsor_type_id": 2, "sponsor_order": 4, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 11050, "person_hash": "n8muhkwf", "party_id": "2", "state_id": 52, "party": "R", "role_id": 1, "role": "Rep", "name": "Renee Ellmers", "first_name": "Renee", "middle_name": "L.", "last_name": "Ellmers", "suffix": "", "nickname": "", "district": "HD-NC-2", "ftm_eid": 5877139, "votesmart_id": 120897, "opensecrets_id": "N00031513", "knowwho_pid": 286876, "ballotpedia": "Renee_Ellmers", "sponsor_type_id": 2, "sponsor_order": 5, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 11051, "person_hash": "pwa0zkhc", "party_id": "2", "state_id": 52, "party": "R", "role_id": 1, "role": "Rep", "name": "Bill Flores", "first_name": "Bill", "middle_name": "", "last_name": "Flores", "suffix": "", "nickname": "", "district": "HD-TX-17", "ftm_eid": 17657601, "votesmart_id": 116906, "opensecrets_id": "N00031545", "knowwho_pid": 287157, "ballotpedia": "Bill_Flores", "sponsor_type_id": 2, "sponsor_order": 6, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 11131, "person_hash": "fbqcqzux", "party_id": "2", "state_id": 52, "party": "R", "role_id": 1, "role": "Rep", "name": "Tim Griffin", "first_name": "Tim", "middle_name": "", "last_name": "Griffin", "suffix": "", "nickname": "", "district": "HD-AR-2", "ftm_eid": 698205, "votesmart_id": 119213, "opensecrets_id": "N00031297", "knowwho_pid": 283916, "ballotpedia": "Tim_Griffin", "sponsor_type_id": 2, "sponsor_order": 7, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 9274, "person_hash": "e9i9kjv8", "party_id": "2", "state_id": 52, "party": "R", "role_id": 1, "role": "Rep", "name": "Brett Guthrie", "first_name": "Brett", "middle_name": "", "last_name": "Guthrie", "suffix": "", "nickname": "", "district": "HD-KY-2", "ftm_eid": 6573540, "votesmart_id": 18829, "opensecrets_id": "N00029675", "knowwho_pid": 194385, "ballotpedia": "Brett_Guthrie", "sponsor_type_id": 2, "sponsor_order": 8, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 11806, "person_hash": "bu8842dx", "party_id": "2", "state_id": 52, "party": "R", "role_id": 1, "role": "Rep", "name": "Joseph Heck", "first_name": "Joseph", "middle_name": "J.", "last_name": "Heck", "suffix": "", "nickname": "", "district": "HD-NV-3", "ftm_eid": 6665883, "votesmart_id": 44082, "opensecrets_id": "N00031244", "knowwho_pid": 227661, "ballotpedia": "Joe_Heck", "sponsor_type_id": 2, "sponsor_order": 9, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 14084, "person_hash": "lqvkdn2d", "party_id": "2", "state_id": 52, "party": "R", "role_id": 1, "role": "Rep", "name": "Richard Hudson", "first_name": "Richard", "middle_name": "", "last_name": "Hudson", "suffix": "", "nickname": "", "district": "HD-NC-8", "ftm_eid": 6611759, "votesmart_id": 136448, "opensecrets_id": "N00033630", "knowwho_pid": 161542, "ballotpedia": "Richard_Hudson", "sponsor_type_id": 2, "sponsor_order": 10, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 11057, "person_hash": "bpu1tsbi", "party_id": "2", "state_id": 52, "party": "R", "role_id": 1, "role": "Rep", "name": "Tim Huelskamp", "first_name": "Tim", "middle_name": "", "last_name": "Huelskamp", "suffix": "", "nickname": "", "district": "HD-KS-1", "ftm_eid": 6625753, "votesmart_id": 12571, "opensecrets_id": "N00027649", "knowwho_pid": 194590, "ballotpedia": "Tim_Huelskamp", "sponsor_type_id": 2, "sponsor_order": 11, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 11137, "person_hash": "3ixm419p", "party_id": "2", "state_id": 52, "party": "R", "role_id": 1, "role": "Rep", "name": "Mike Kelly", "first_name": "Mike", "middle_name": "", "last_name": "Kelly", "suffix": "", "nickname": "", "district": "HD-PA-3", "ftm_eid": 5007914, "votesmart_id": 119463, "opensecrets_id": "N00031647", "knowwho_pid": 286955, "ballotpedia": "Mike_Kelly_(Pennsylvania)", "sponsor_type_id": 2, "sponsor_order": 12, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 9287, "person_hash": "1wwr9g35", "party_id": "2", "state_id": 52, "party": "R", "role_id": 1, "role": "Rep", "name": "John Kline", "first_name": "John", "middle_name": "", "last_name": "Kline", "suffix": "", "nickname": "", "district": "HD-MN-2", "ftm_eid": 17658796, "votesmart_id": 20311, "opensecrets_id": "N00004436", "knowwho_pid": 211681, "ballotpedia": "John_Kline", "sponsor_type_id": 2, "sponsor_order": 13, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 9191, "person_hash": "ejlhf6n6", "party_id": "2", "state_id": 52, "party": "R", "role_id": 1, "role": "Rep", "name": "Kenny Marchant", "first_name": "Kenny", "middle_name": "", "last_name": "Marchant", "suffix": "", "nickname": "", "district": "HD-TX-24", "ftm_eid": 13007002, "votesmart_id": 5549, "opensecrets_id": "N00026710", "knowwho_pid": 199221, "ballotpedia": "Kenny_Marchant", "sponsor_type_id": 2, "sponsor_order": 14, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 9373, "person_hash": "vs7yu7rm", "party_id": "2", "state_id": 52, "party": "R", "role_id": 1, "role": "Rep", "name": "Howard McKeon", "first_name": "Howard", "middle_name": "P.", "last_name": "McKeon", "suffix": "", "nickname": "Buck", "district": "HD-CA-25", "ftm_eid": 17657731, "votesmart_id": 26755, "opensecrets_id": "N00006882", "knowwho_pid": 158742, "ballotpedia": "Buck_McKeon", "sponsor_type_id": 2, "sponsor_order": 15, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 15230, "person_hash": "3q8iw3qm", "party_id": "2", "state_id": 52, "party": "R", "role_id": 1, "role": "Rep", "name": "Luke Messer", "first_name": "Luke", "middle_name": "", "last_name": "Messer", "suffix": "", "nickname": "", "district": "HD-IN-6", "ftm_eid": 6659146, "votesmart_id": 33997, "opensecrets_id": "N00012546", "knowwho_pid": 216650, "ballotpedia": "Luke_Messer", "sponsor_type_id": 2, "sponsor_order": 16, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 9311, "person_hash": "8n9jgluy", "party_id": "2", "state_id": 52, "party": "R", "role_id": 1, "role": "Rep", "name": "Ted Poe", "first_name": "Ted", "middle_name": "", "last_name": "Poe", "suffix": "", "nickname": "", "district": "HD-TX-2", "ftm_eid": 16584997, "votesmart_id": 49198, "opensecrets_id": "N00026457", "knowwho_pid": 226545, "ballotpedia": "Ted_Poe", "sponsor_type_id": 2, "sponsor_order": 17, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 14908, "person_hash": "uz2jg1au", "party_id": "2", "state_id": 52, "party": "R", "role_id": 1, "role": "Rep", "name": "Trey Radel", "first_name": "Trey", "middle_name": "", "last_name": "Radel", "suffix": "", "nickname": "", "district": "HD-FL-19", "ftm_eid": 16253105, "votesmart_id": 137658, "opensecrets_id": "N00034017", "knowwho_pid": 401528, "ballotpedia": "Trey_Radel", "sponsor_type_id": 2, "sponsor_order": 18, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 11163, "person_hash": "kuapkzdj", "party_id": "2", "state_id": 52, "party": "R", "role_id": 1, "role": "Rep", "name": "Martha Roby", "first_name": "Martha", "middle_name": "", "last_name": "Roby", "suffix": "", "nickname": "", "district": "HD-AL-2", "ftm_eid": 17657350, "votesmart_id": 71604, "opensecrets_id": "N00030768", "knowwho_pid": 283894, "ballotpedia": "Martha_Roby", "sponsor_type_id": 2, "sponsor_order": 19, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 9315, "person_hash": "fcd7bhsu", "party_id": "2", "state_id": 52, "party": "R", "role_id": 1, "role": "Rep", "name": "David Roe", "first_name": "David", "middle_name": "P.", "last_name": "Roe", "suffix": "", "nickname": "", "district": "HD-TN-1", "ftm_eid": 2886736, "votesmart_id": 65306, "opensecrets_id": "N00028463", "knowwho_pid": 267171, "ballotpedia": "Phil_Roe", "sponsor_type_id": 2, "sponsor_order": 20, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 11072, "person_hash": "ixc04lfw", "party_id": "2", "state_id": 52, "party": "R", "role_id": 1, "role": "Rep", "name": "Todd Rokita", "first_name": "Todd", "middle_name": "", "last_name": "Rokita", "suffix": "", "nickname": "", "district": "HD-IN-4", "ftm_eid": 6592215, "votesmart_id": 34167, "opensecrets_id": "N00031741", "knowwho_pid": 218889, "ballotpedia": "Todd_Rokita", "sponsor_type_id": 2, "sponsor_order": 21, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 14915, "person_hash": "y7sp0ab3", "party_id": "2", "state_id": 52, "party": "R", "role_id": 1, "role": "Rep", "name": "Matt Salmon", "first_name": "Matt", "middle_name": "", "last_name": "Salmon", "suffix": "", "nickname": "", "district": "HD-AZ-5", "ftm_eid": 16631721, "votesmart_id": 22184, "opensecrets_id": "N00006446", "knowwho_pid": 158712, "ballotpedia": "Matt_Salmon", "sponsor_type_id": 2, "sponsor_order": 22, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 11143, "person_hash": "u6jyo8ie", "party_id": "2", "state_id": 52, "party": "R", "role_id": 1, "role": "Rep", "name": "Steve Stivers", "first_name": "Steve", "middle_name": "", "last_name": "Stivers", "suffix": "", "nickname": "", "district": "HD-OH-15", "ftm_eid": 3672534, "votesmart_id": 45333, "opensecrets_id": "N00029574", "knowwho_pid": 213916, "ballotpedia": "Steve_Stivers", "sponsor_type_id": 2, "sponsor_order": 23, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 9335, "person_hash": "izjd30j2", "party_id": "2", "state_id": 52, "party": "R", "role_id": 1, "role": "Rep", "name": "Greg Walden", "first_name": "Greg", "middle_name": "", "last_name": "Walden", "suffix": "", "nickname": "", "district": "HD-OR-2", "ftm_eid": 3106417, "votesmart_id": 2979, "opensecrets_id": "N00007690", "knowwho_pid": 159027, "ballotpedia": "Greg_Walden", "sponsor_type_id": 2, "sponsor_order": 24, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}], "sasts": [{"type_id": 8, "type": "Related", "sast_bill_number": "HR113", "sast_bill_id": 533644}, {"type_id": 8, "type": "Related", "sast_bill_number": "SB1911", "sast_bill_id": 581799}, {"type_id": 8, "type": "Related", "sast_bill_number": "SB2038", "sast_bill_id": 628159}], "subjects": [{"subject_id": 13496, "subject_name": "Adult education and literacy"}, {"subject_id": 13134, "subject_name": "Appropriations"}, {"subject_id": 13476, "subject_name": "Census and government statistics"}, {"subject_id": 13433, "subject_name": "Correctional facilities and imprisonment"}, {"subject_id": 13443, "subject_name": "Crimes against children"}, {"subject_id": 13374, "subject_name": "Criminal justice information and records"}, {"subject_id": 13154, "subject_name": "Department of Education"}, {"subject_id": 13160, "subject_name": "Department of Labor"}, {"subject_id": 13166, "subject_name": "Disability and paralysis"}, {"subject_id": 13385, "subject_name": "Disability assistance"}, {"subject_id": 13307, "subject_name": "Drug, alcohol, tobacco use"}, {"subject_id": 13171, "subject_name": "Education programs funding"}, {"subject_id": 13174, "subject_name": "Elementary and secondary education"}, {"subject_id": 13176, "subject_name": "Employment and training programs"}, {"subject_id": 13184, "subject_name": "Executive agency funding and structure"}, {"subject_id": 13190, "subject_name": "Food assistance and relief"}, {"subject_id": 13191, "subject_name": "Foreign labor"}, {"subject_id": 13198, "subject_name": "Government employee pay, benefits, personnel management"}, {"subject_id": 13200, "subject_name": "Government information and archives"}, {"subject_id": 22688, "subject_name": "Government studies and investigations"}, {"subject_id": 13215, "subject_name": "Higher education"}, {"subject_id": 13551, "subject_name": "Labor-management relations"}, {"subject_id": 13425, "subject_name": "Land use and conservation"}, {"subject_id": 13237, "subject_name": "Long-term, rehabilitative, and terminal care"}, {"subject_id": 13899, "subject_name": "Migrant, seasonal, agricultural labor"}, {"subject_id": 13484, "subject_name": "Military personnel and dependents"}, {"subject_id": 13251, "subject_name": "National Guard and reserves"}, {"subject_id": 13799, "subject_name": "Oceania"}, {"subject_id": 13800, "subject_name": "Palau"}, {"subject_id": 13258, "subject_name": "Performance measurement"}, {"subject_id": 13259, "subject_name": "Poverty and welfare assistance"}, {"subject_id": 13652, "subject_name": "Public participation and lobbying"}, {"subject_id": 13671, "subject_name": "Public-private cooperation"}, {"subject_id": 13726, "subject_name": "Sex offenses"}, {"subject_id": 13285, "subject_name": "State and local government operations"}, {"subject_id": 13286, "subject_name": "Student aid and college costs"}, {"subject_id": 13801, "subject_name": "Temporary and part-time employment"}, {"subject_id": 13293, "subject_name": "Unemployment"}, {"subject_id": 13648, "subject_name": "User charges and fees"}, {"subject_id": 13294, "subject_name": "Veterans' education, employment, rehabilitation"}, {"subject_id": 13343, "subject_name": "Violent crime"}, {"subject_id": 13303, "subject_name": "Youth employment and child labor"}, {"subject_id": 13781, "subject_name": "Assault and harassment offenses"}, {"subject_id": 13146, "subject_name": "Congressional oversight"}, {"subject_id": 13309, "subject_name": "Fraud offenses and financial crimes"}, {"subject_id": 13205, "subject_name": "Hazardous wastes and toxic substances"}, {"subject_id": 13701, "subject_name": "Manufacturing"}, {"subject_id": 13475, "subject_name": "Refugees, asylum, displaced persons"}, {"subject_id": 13283, "subject_name": "Special education"}, {"subject_id": 13382, "subject_name": "Veterans' loans, housing, homeless programs"}, {"subject_id": 81057, "subject_name": "Vocational and technical education"}, {"subject_id": 13328, "subject_name": "Labor and employment"}], "texts": [{"doc_id": 767764, "date": "2013-03-01", "type": "Introduced", "type_id": 1, "mime": "application/pdf", "mime_id": 2, "url": "https://legiscan.com/US/text/HB803/id/767764", "state_link": "https://www.congress.gov/113/bills/hr803/BILLS-113hr803ih.pdf", "text_size": 639054, "text_hash": "86eb26b0081807ed08e0d88935a87886"}, {"doc_id": 786585, "date": "2013-03-13", "type": "Introduced", "type_id": 1, "mime": "application/pdf", "mime_id": 2, "url": "https://legiscan.com/US/text/HB803/id/786585", "state_link": "https://www.congress.gov/113/bills/hr803/BILLS-113hr803rh.pdf", "text_size": 643857, "text_hash": "aebf0abff1dcaed81604342ce3c3927b"}, {"doc_id": 792458, "date": "2013-03-18", "type": "Engrossed", "type_id": 4, "mime": "application/pdf", "mime_id": 2, "url": "https://legiscan.com/US/text/HB803/id/792458", "state_link": "https://www.congress.gov/113/bills/hr803/BILLS-113hr803eh.pdf", "text_size": 415987, "text_hash": "155f4476ea028878f6f4e5d5704a1c0a"}, {"doc_id": 1037488, "date": "2014-06-26", "type": "Amended", "type_id": 3, "mime": "application/pdf", "mime_id": 2, "url": "https://legiscan.com/US/text/HB803/id/1037488", "state_link": "https://www.congress.gov/113/bills/hr803/BILLS-113hr803eas.pdf", "text_size": 1311306, "text_hash": "060386159d5423099317d6369068bf77"}, {"doc_id": 1039249, "date": "2014-07-11", "type": "Enrolled", "type_id": 5, "mime": "application/pdf", "mime_id": 2, "url": "https://legiscan.com/US/text/HB803/id/1039249", "state_link": "https://www.congress.gov/113/bills/hr803/BILLS-113hr803enr.pdf", "text_size": 693874, "text_hash": "e36dd4e09c8278df5d0b9e89d3d1d13a"}], "votes": [{"roll_call_id": 249376, "date": "2013-03-15", "desc": "On Agreeing to the Amendment", "yea": 192, "nay": 227, "nv": 12, "absent": 0, "total": 431, "passed": 0, "chamber": "H", "chamber_id": 114, "url": "https://legiscan.com/US/rollcall/HB803/id/249376", "state_link": "https://clerk.house.gov/Votes/201373"}, {"roll_call_id": 249377, "date": "2013-03-15", "desc": "On Motion to Recommit with Instructions", "yea": 184, "nay": 233, "nv": 14, "absent": 0, "total": 431, "passed": 0, "chamber": "H", "chamber_id": 114, "url": "https://legiscan.com/US/rollcall/HB803/id/249377", "state_link": "https://clerk.house.gov/Votes/201374"}, {"roll_call_id": 249378, "date": "2013-03-15", "desc": "On Passage", "yea": 215, "nay": 202, "nv": 15, "absent": 0, "total": 432, "passed": 1, "chamber": "H", "chamber_id": 114, "url": "https://legiscan.com/US/rollcall/HB803/id/249378", "state_link": "https://clerk.house.gov/Votes/201375"}, {"roll_call_id": 374484, "date": "2014-06-25", "desc": "On the Amendment S.Amdt. 3379 to S.Amdt. 3378 to H.R. 803 (SKILLS Act)", "yea": 33, "nay": 63, "nv": 4, "absent": 0, "total": 100, "passed": 0, "chamber": "S", "chamber_id": 115, "url": "https://legiscan.com/US/rollcall/HB803/id/374484", "state_link": "https://www.senate.gov/legislative/LIS/roll_call_votes/vote1132/vote_113_2_00212.xml"}, {"roll_call_id": 374485, "date": "2014-06-25", "desc": "On the Amendment S.Amdt. 3380 to S.Amdt. 3378 to H.R. 803 (SKILLS Act)", "yea": 40, "nay": 58, "nv": 2, "absent": 0, "total": 100, "passed": 0, "chamber": "S", "chamber_id": 115, "url": "https://legiscan.com/US/rollcall/HB803/id/374485", "state_link": "https://www.senate.gov/legislative/LIS/roll_call_votes/vote1132/vote_113_2_00213.xml"}, {"roll_call_id": 374486, "date": "2014-06-25", "desc": "On Passage of the Bill H.R. 803", "yea": 95, "nay": 3, "nv": 2, "absent": 0, "total": 100, "passed": 1, "chamber": "S", "chamber_id": 115, "url": "https://legiscan.com/US/rollcall/HB803/id/374486", "state_link": "https://www.senate.gov/legislative/LIS/roll_call_votes/vote1132/vote_113_2_00214.xml"}, {"roll_call_id": 375740, "date": "2014-07-09", "desc": "On Motion to Suspend the Rules and Concur in the Senate Amendments", "yea": 415, "nay": 6, "nv": 11, "absent": 0, "total": 432, "passed": 1, "chamber": "H", "chamber_id": 114, "url": "https://legiscan.com/US/rollcall/HB803/id/375740", "state_link": "https://clerk.house.gov/Votes/2014378"}], "amendments": [], "supplements": [], "calendar": []}}