{"status": "OK", "bill": {"bill_id": 651685, "change_hash": "49e30d9afac707a025e8e57d2dec5b58", "session_id": 1026, "session": {"session_id": 1026, "state_id": 52, "year_start": 2013, "year_end": 2014, "prefile": 0, "sine_die": 1, "prior": 1, "special": 0, "session_tag": "Regular Session", "session_title": "2013-2014 Regular Session", "session_name": "113th Congress"}, "url": "https://legiscan.com/US/bill/SB2418/2013", "state_link": "https://www.congress.gov/bill/113th-congress/senate-bill/2418/all-info", "completed": 0, "status": 1, "status_date": "2014-06-03", "progress": [{"date": "2014-06-03", "event": 1}, {"date": "2014-06-03", "event": 9}], "state": "US", "state_id": 52, "bill_number": "SB2418", "bill_type": "B", "bill_type_id": "1", "body": "S", "body_id": 115, "current_body": "S", "current_body_id": 115, "title": "Bankruptcy Fairness and Employee Benefits Protection Act of 2014", "description": "Bankruptcy Fairness and Employee Benefits Protection Act of 2014 - Amends federal bankruptcy law to require the debtor in possession, prior to filing an application seeking rejection of a collective bargaining agreement, to propose only those minimum modifications to employee and retiree benefits and protections (including health insurance) that are necessary to prevent liquidation of the debtor.  Requires a proposal which modifies employee or retired employee health insurance benefits to modify also the health insurance benefits of the debtor's officers and directors so that their benefits are not more generous than those of debtor's employees.  Requires a proposal which modifies other employee benefits, including wages and pension benefits, also to modify such benefits of the debtor's officers and directors by an amount that, at a minimum, is equal to the percentage by which the employees' benefits are modified.  Conditions court approval of an application for rejection of a collective bargaining agreement upon a finding that the debtor has established by clear and convincing evidence that modification of employee benefits and protections is the minimum modification necessary to prevent the debtor's liquidation.  Declares that rejection of a collective bargaining agreement constitutes a breach of the agreement that entitles debtor's employees to a claim for damages. Grants any retirees whose benefits are modified by a court according to certain procedures a claim equal to the value of benefits lost as a result of the modification. Requires a debtor to pay cash to a retired employee making a claim in an amount equal to the two-year cost of premiums for: (1) continuation coverage; or (2) a comparable health insurance plan offered through a health care exchange established under the Patient Protection and Affordable Care Act.  Authorizes the court to require the debtor to pay such retiree claim in an amount equal to the cost of premiums for continuation of coverage, or for such a health insurance plan, for more than two years.  Prohibits allowance or payment of a bonus payment to an insider of the debtor, including an incentive-based bonus payment.   Increases the priority claim amount for employee wages and benefits.  Authorizes the court to prohibit a transfer of compensation made to an insider of the debtor within one year before the petition is filed if it finds that the transfer: (1) was not made in the ordinary course of business, or (2) resulted in unjust enrichment.  Amends the Judicial Code to require that a case under bankruptcy law be commenced in the district court for the district in which the largest share of employees, retired employees, physical assets, and operations of the person or entity that is the subject of the case were located in the year immediately preceding commencement of the case.  Requires a debtor in possession that sponsors a pension plan or is a member of the controlled group with respect to such a plan, or the trustee of the debtor in possession, to make all required pension contributions that fall due after filing the petition in bankruptcy.  Amends the Employee Retirement Income Security Act of 1974 (ERISA) to require the mandatory summary description of a group health plan to declare: (1) whether the plan permits either the plan sponsor or any participating employer to unilaterally modify or terminate plan benefits affecting employees, retirees, and beneficiaries; and (2) when and to what extent plan benefits are fully vested with respect to these individuals. Presumes that retiree health benefits cannot be modified or terminated as of the date an employee retires or completes 20 years of service with the employer. Allows this presumption to be overcome only upon a showing, by clear and convincing evidence, that the employee, before becoming a plan participant, was made aware, in clear and unambiguous terms, that the plan allowed for such a modification or termination of benefits.  Amends the National Labor Relations Act to make it an unfair labor practice for a labor organization and employer to enter into a contract or agreement to modify a previous agreement in a manner that results in a reduction or termination of retiree health insurance benefits, if the modification occurs after the retiree's retirement date.  Directs the Comptroller General (GAO) to report to Congress on strategies used by corporations to avoid obligations to pay promised employee and retiree benefits.", "pending_committee_id": 2330, "committee": {"committee_id": 2330, "chamber": "S", "chamber_id": 115, "name": "Judiciary"}, "referrals": [{"date": "2014-06-03", "committee_id": 2330, "chamber": "S", "chamber_id": 115, "name": "Judiciary"}], "history": [{"date": "2014-06-03", "action": "Read twice and referred to the Committee on the Judiciary.", "chamber": "S", "chamber_id": 115, "importance": 1}], "sponsors": [{"people_id": 9433, "person_hash": "ueg7gyml", "party_id": "1", "state_id": 52, "party": "D", "role_id": 2, "role": "Sen", "name": "John Rockefeller", "first_name": "John", "middle_name": "D.", "last_name": "Rockefeller", "suffix": "IV", "nickname": "", "district": "SD-WV", "ftm_eid": 5613984, "votesmart_id": 53360, "opensecrets_id": "N00001685", "knowwho_pid": 165290, "ballotpedia": "Jay_Rockefeller", "sponsor_type_id": 1, "sponsor_order": 1, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 15350, "person_hash": "18701e4h", "party_id": "1", "state_id": 52, "party": "D", "role_id": 2, "role": "Sen", "name": "Elizabeth Warren", "first_name": "Elizabeth", "middle_name": "", "last_name": "Warren", "suffix": "", "nickname": "", "district": "SD-MA", "ftm_eid": 1789719, "votesmart_id": 141272, "opensecrets_id": "N00033492", "knowwho_pid": 309189, "ballotpedia": "Elizabeth_Warren", "sponsor_type_id": 2, "sponsor_order": 2, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}], "sasts": [{"type_id": 8, "type": "Related", "sast_bill_number": "HB5523", "sast_bill_id": 656764}], "subjects": [{"subject_id": 13372, "subject_name": "Bankruptcy"}, {"subject_id": 13322, "subject_name": "Civil actions and liability"}, {"subject_id": 13146, "subject_name": "Congressional oversight"}, {"subject_id": 13148, "subject_name": "Corporate finance and management"}, {"subject_id": 13175, "subject_name": "Employee benefits and pensions"}, {"subject_id": 22688, "subject_name": "Government studies and investigations"}, {"subject_id": 13206, "subject_name": "Health care costs and insurance"}, {"subject_id": 13551, "subject_name": "Labor-management relations"}, {"subject_id": 13284, "subject_name": "State and local finance"}, {"subject_id": 13297, "subject_name": "Wages and earnings"}, {"subject_id": 13328, "subject_name": "Labor and employment"}], "texts": [{"doc_id": 1033111, "date": "2014-06-09", "type": "Introduced", "type_id": 1, "mime": "application/pdf", "mime_id": 2, "url": "https://legiscan.com/US/text/SB2418/id/1033111", "state_link": "https://www.congress.gov/113/bills/s2418/BILLS-113s2418is.pdf", "text_size": 270114, "text_hash": "2bfc8fe14b727022877c57b7a0434b9b"}], "votes": [], "amendments": [], "supplements": [], "calendar": []}}