{"status": "OK", "bill": {"bill_id": 669879, "change_hash": "fdd54d6d6cf7486010dd154341993c04", "session_id": 1156, "session": {"session_id": 1156, "state_id": 52, "year_start": 2015, "year_end": 2016, "prefile": 0, "sine_die": 1, "prior": 1, "special": 0, "session_tag": "Regular Session", "session_title": "2015-2016 Regular Session", "session_name": "114th Congress"}, "url": "https://legiscan.com/US/bill/HB185/2015", "state_link": "https://www.congress.gov/bill/114th-congress/house-bill/185/all-info", "completed": 0, "status": 2, "status_date": "2015-01-16", "progress": [{"date": "2015-01-07", "event": 1}, {"date": "2015-01-07", "event": 9}, {"date": "2015-01-12", "event": 9}, {"date": "2015-01-16", "event": 2}], "state": "US", "state_id": 52, "bill_number": "HB185", "bill_type": "B", "bill_type_id": "1", "body": "H", "body_id": 114, "current_body": "S", "current_body_id": 115, "title": "Regulatory Accountability Act of 2015", "description": "Regulatory Accountability Act of 2015 (Sec. 2) Defines \"major rule\" and \"major guidance\" for purposes of this Act as a rule or guidance that the Administrator of the Office of Information and Regulatory Affairs of the Office of Management and Budget (OMB) determines is likely to impose: (1) an annual cost on the economy of $100 million or more, adjusted annually for inflation; (2) a major increase in costs or prices; (3) significant adverse effects on competition, employment, investment, productivity, innovation, or the ability of U.S. enterprises to compete with foreign-based enterprises; or (4) significant impacts on multiple sectors of the economy. Defines: (1) \"high-impact rule\" as a rule that the Administrator determines is likely to have an annual cost on the economy of $1 billion or more, adjusted annually for inflation; and (2) \"negative-impact on jobs and wages rule\" as any rule likely to reduce employment or wages in certain economic sectors or industry areas by specified amounts over specified periods. (Sec. 3) Revises procedures for rule making under the Administrative Procedure Act (APA) to require a federal agency, in the rule making process, to make all preliminary and final factual determinations based on evidence and to consider: (1) the legal authority under which a rule may be proposed; (2) the specific nature and significance of the problem the agency may address with a rule; (3) whether existing rules have created or contributed to the problem the agency may address with a rule and whether such rules may be amended or rescinded; (4) any reasonable alternatives for a new rule; and (5) the potential costs and benefits associated with potential alternative rules, including impacts on low-income populations. Revises rule making notice requirements to require an agency to: publish in the Federal Register advance notice of proposed rule making involving a major or high-impact rule, a negative impact on jobs and wages rule, or a rule that involves a novel legal or policy issue arising out of statutory mandates; consult with the Administrator before issuing a proposed rule and after the issuance of an advance notice of proposed rule making; provide interested persons an opportunity to participate in the rule making process; hold a hearing before the adoption of any high-impact rule; expand requirements for the adoption of a final rule, including requiring that the agency adopt a rule only on the basis of the best evidence and at the least cost; and grant any interested person the right to petition for the issuance, amendment, or repeal of a rule. Specifies the minimum amount of information that must be included in an advance notice of a proposed rule making. Requires the Administrator to issue guidelines to promote coordination, simplification, and harmonization of agency rules during the rule making process. Exempts from such revised procedures rule makings that concern monetary policy proposed or implemented by the Board of Governors of the Federal Reserve System or the Federal Open Market Committee. (Sec. 4) Imposes new requirements for issuing any major guidance or guidance that involves a novel legal or policy issue arising out of statutory mandates. Authorizes the Administrator to issue guidelines for agencies in issuing major guidance or other guidance. (Sec. 5) Provides for electronic access to transcripts of testimony and exhibits and other papers filed in a rule making proceeding. Requires the record of decision in a rule making proceeding to include information from a hearing under the Information Quality Act or on a high-impact rule. Requires an agency to grant a petition for a hearing in the case of a major rule, unless the agency reasonably determines that a hearing would not advance consideration of the rule or would unreasonably delay completion of the rule making. Exempts from this requirement rule makings that concern monetary policy proposed or implemented by the Board of Governors of the Federal Reserve System or the Federal Open Market Committee. (Sec. 6) Provides that an agency's denial of an Information Quality Act petition, or a failure to grant or deny such petition within 90 days, is reviewable by a court as a final action. Allows immediate judicial review of interim rules, other than in cases involving national security interests, issued without compliance with the notice requirements of this Act. (Sec. 7) Revises standards for the scope of judicial review of agency rule making to prohibit a court from deferring to an agency's: (1) interpretation of a rule if the agency did not comply with APA requirements, (2) determination of the costs and benefits or other economic or risk assessment if the agency failed to conform to guidelines on such determinations and assessments established by the Administrator, (3) determinations made in the adoption of an interim rule, or (4) guidance. (Sec. 8) Defines \"substantial evidence\" for purposes of evaluating agency adjudications and for rule making under APA as such relevant evidence as a reasonable mind might accept as adequate to support a conclusion in light of the record considered as a whole, taking into account whatever in the record fairly detracts from the weight of the evidence relied upon by the agency to support its decision. (Sec. 9) Provides that the amendments made by this Act to specified provisions of federal law shall not apply to any rule makings pending or completed on the enactment date of this Act.", "pending_committee_id": 2329, "committee": {"committee_id": 2329, "chamber": "S", "chamber_id": 115, "name": "Homeland Security And Governmental Affairs"}, "referrals": [{"date": "2015-01-07", "committee_id": 2309, "chamber": "H", "chamber_id": 114, "name": "Judiciary"}, {"date": "2015-01-12", "committee_id": 2853, "chamber": "H", "chamber_id": 114, "name": "Subcommittee on Regulatory Reform, Commercial And Antitrust Law"}, {"date": "2015-01-16", "committee_id": 2329, "chamber": "S", "chamber_id": 115, "name": "Homeland Security And Governmental Affairs"}], "history": [{"date": "2015-01-07", "action": "Introduced in House", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2015-01-07", "action": "Referred to the House Committee on the Judiciary.", "chamber": "H", "chamber_id": 114, "importance": 1}, {"date": "2015-01-12", "action": "Referred to the Subcommittee on Regulatory Reform, Commercial And Antitrust Law.", "chamber": "H", "chamber_id": 114, "importance": 1}, {"date": "2015-01-12", "action": "Rules Committee Resolution H. Res. 27 Reported to House. All points of order against consideration of the bills are waived. H.R. 37 H.R. 185 shall be debatable for 1 hour, and H.R. 240 shall be debatable for 2 hours the previous question considered ordered without intervening motions except one motion to recommit. For H.R. 185, only those amendments printed in Part A of the report shall be in order. For H.R. 240, only those amendments printed in Part B of the report shall be in order. in Part B of the report shall be in order.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2015-01-13", "action": "Considered under the provisions of rule H. Res. 27. (consideration: CR H249-272; text of measure as introduced: CR H256-260)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2015-01-13", "action": "All points of order against consideration of the bills are waived. H.R. 37 H.R. 185 shall be debatable for 1 hour, and H.R. 240 shall be debatable for 2 hours the previous question considered orderedwithout intervening motions except one motion to recommit. For H.R. 185, only those amendments printed in Part A of the report shall be in order. For H.R. 240, only those amendments printed in Part B of the report shall be in order.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2015-01-13", "action": "House resolved itself into the Committee of the Whole House on the state of the Union pursuant to H. Res. 27 and Rule XVIII.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2015-01-13", "action": "The Speaker designated the Honorable Lynn A. Westmoreland to act as Chairman of the Committee.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2015-01-13", "action": "GENERAL DEBATE - The Committee of the Whole proceeded with one hour of general debate on H.R. 185.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2015-01-13", "action": "H.Amdt.2 Amendment (A001) offered by Mr. McKinley. (consideration: CR H260-262, H267-268; text: CR H260)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2015-01-13", "action": "DEBATE - Pursuant to the provisions of H. Res. 27, the Committee of the Whole proceeded with 10 minutes of debate on the McKinley Part A amendment No. 1.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2015-01-13", "action": "POSTPONED PROCEEDINGS - At the conclusion of debate on the McKinley amendment, the Chair put the question on adoption of the amendment and by voice vote announced that the ayes had prevailed. Mr. McKinely demanded a recorded vote and the Chair postponed further proceedings on adoption of the amendment until later in the legislative day.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2015-01-13", "action": "H.Amdt.3 Amendment (A002) offered by Mr. Johnson (GA). (consideration: CR H262-263, H268; text: CR H262)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2015-01-13", "action": "DEBATE - Pursuant to the provisions of H. Res. 27, the Committee of the Whole proceeded with 10 minutes of debate on the Johnson (GA) Part A amendment No. 2.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2015-01-13", "action": "POSTPONED PROCEEDINGS - At the conclusion of debate on the Johnson (GA) amendment, the Chair put the question on adoption of the amendment and by voice vote announced that the noes had prevailed. Mr. Johnson (GA) demanded a recorded vote and the Chair postponed further proceedings on adoption of the amendment until later in the legislative day.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2015-01-13", "action": "H.Amdt.4 Amendment (A003) offered by Ms. Jackson Lee. (consideration: CR H263-266, H268-269; text: CR H263-264)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2015-01-13", "action": "DEBATE - Pursuant to the provisions of H. Res. 27, the Committee of the Whole proceeded with 10 minutes of debate on the Jackson Lee Part A amendment No. 3.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2015-01-13", "action": "POSTPONED PROCEEDINGS - At the conclusion of debate on the Jackson Lee amendment, the Chair put the question on adoption of the amendment and by voice vote announced that the noes had prevailed. Ms. Jackson Lee demanded a recorded vote and the Chair postponed further proceedings on adoption of the amendment until later in the legislative day.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2015-01-13", "action": "H.Amdt.5 Amendment (A004) offered by Mr. Connolly. (consideration: CR H266-267, H269-270; text: CR H266)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2015-01-13", "action": "DEBATE - Pursuant to the provisions of H. Res. 27, the Committee of the Whole proceeded with 10 minutes of debate on the Connolly Part A amendment No. 4.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2015-01-13", "action": "POSTPONED PROCEEDINGS - At the conclusion of debate on the Connolly amendment, the Chair put t he question on adoption of the amendment and by voice vote announced that the noes had prevailed. Mr. Connolly demanded a recorded vote and the Chair postponed further proceedings on adoption of the amendment until later in the legislative day.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2015-01-13", "action": "UNFINISHED BUSINESS - The Chair announced that the unfinished business was on adoption of amendments, which had been debated earlier, and on which further proceedings had been postponed.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2015-01-13", "action": "H.Amdt.2 On agreeing to the McKinley amendment (A001) Agreed to by recorded vote: 254 - 168 (Roll no. 23).", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2015-01-13", "action": "H.Amdt.3 On agreeing to the Johnson (GA) amendment (A002) Failed by recorded vote: 178 - 247 (Roll no. 24).", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2015-01-13", "action": "H.Amdt.4 On agreeing to the Jackson Lee amendment (A003) Failed by recorded vote: 176 - 249 (Roll no. 25).", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2015-01-13", "action": "H.Amdt.5 On agreeing to the Connolly amendment (A004) Failed by recorded vote: 178 - 248 (Roll no. 26).", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2015-01-13", "action": "The House rose from the Committee of the Whole House on the state of the Union to report H.R. 185.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2015-01-13", "action": "The House adopted the amendment as agreed to by the Committee of the Whole House on the state of the Union.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2015-01-13", "action": "Miss Rice (NY) moved to recommit with instructions to the Committee on the Judiciary. (consideration: CR H270-271; text: CR H270)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2015-01-13", "action": "DEBATE - The House proceeded with 10 minutes of debate on the Rice (NY) motion to recommit with instructions. The instructions contained in the motion seek to require the bill to be reported back to the House with an amendment to add a section to the bill prohibiting the application of any rules or guidance by the Act or amendments that prevent terrorism and crime; protect wages of workers; save tax dollars; provide assistance to small business; or prevent discrimination.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2015-01-13", "action": "The previous question on the motion to recommit with instructions was ordered without objection. (consideration: CR H271)", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2015-01-13", "action": "On motion to recommit with instructions Failed by recorded vote: 180 - 245 (Roll no. 27).", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2015-01-13", "action": "On passage Passed by recorded vote: 250 - 175 (Roll no. 28).", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2015-01-13", "action": "Motion to reconsider laid on the table Agreed to without objection.", "chamber": "H", "chamber_id": 114, "importance": 0}, {"date": "2015-01-16", "action": "Received in the Senate and Read twice and referred to the Committee on Homeland Security and Governmental Affairs.", "chamber": "S", "chamber_id": 115, "importance": 1}], "sponsors": [{"people_id": 9362, "person_hash": "pa98l4t4", "party_id": "2", "state_id": 52, "party": "R", "role_id": 1, "role": "Rep", "name": "Bob Goodlatte", "first_name": "Bob", "middle_name": "", "last_name": "Goodlatte", "suffix": "", "nickname": "", "district": "HD-VA-6", "ftm_eid": 17658523, "votesmart_id": 27116, "opensecrets_id": "N00009154", "knowwho_pid": 159109, "ballotpedia": "Bob_Goodlatte", "sponsor_type_id": 1, "sponsor_order": 1, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 9154, "person_hash": "0gala4ad", "party_id": "1", "state_id": 52, "party": "D", "role_id": 1, "role": "Rep", "name": "Collin Peterson", "first_name": "Collin", "middle_name": "C.", "last_name": "Peterson", "suffix": "", "nickname": "", "district": "HD-MN-7", "ftm_eid": 16588347, "votesmart_id": 26926, "opensecrets_id": "N00004558", "knowwho_pid": 158917, "ballotpedia": "Collin_Peterson", "sponsor_type_id": 2, "sponsor_order": 2, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 9202, "person_hash": "b8bd2nw1", "party_id": "2", "state_id": 52, "party": "R", "role_id": 1, "role": "Rep", "name": "Lamar Smith", "first_name": "Lamar", "middle_name": "", "last_name": "Smith", "suffix": "", "nickname": "", "district": "HD-TX-21", "ftm_eid": 17658727, "votesmart_id": 27097, "opensecrets_id": "N00001811", "knowwho_pid": 159091, "ballotpedia": "Lamar_Smith", "sponsor_type_id": 2, "sponsor_order": 3, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 11139, "person_hash": "spfe69xa", "party_id": "2", "state_id": 52, "party": "R", "role_id": 1, "role": "Rep", "name": "Tom Marino", "first_name": "Tom", "middle_name": "", "last_name": "Marino", "suffix": "", "nickname": "", "district": "HD-PA-10", "ftm_eid": 17657570, "votesmart_id": 119478, "opensecrets_id": "N00031777", "knowwho_pid": 286966, "ballotpedia": "Tom_Marino", "sponsor_type_id": 2, "sponsor_order": 4, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 9200, "person_hash": "69y137x9", "party_id": "2", "state_id": 52, "party": "R", "role_id": 1, "role": "Rep", "name": "Pete Sessions", "first_name": "Pete", "middle_name": "", "last_name": "Sessions", "suffix": "", "nickname": "", "district": "HD-TX-32", "ftm_eid": 10838573, "votesmart_id": 288, "opensecrets_id": "N00005681", "knowwho_pid": 159075, "ballotpedia": "Pete_Sessions", "sponsor_type_id": 2, "sponsor_order": 5, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 9359, "person_hash": "nb21e5ki", "party_id": "2", "state_id": 52, "party": "R", "role_id": 1, "role": "Rep", "name": "Trent Franks", "first_name": "Trent", "middle_name": "", "last_name": "Franks", "suffix": "", "nickname": "", "district": "HD-AZ-8", "ftm_eid": 1448924, "votesmart_id": 28399, "opensecrets_id": "N00006423", "knowwho_pid": 211720, "ballotpedia": "Trent_Franks", "sponsor_type_id": 2, "sponsor_order": 6, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 16037, "person_hash": "ncwbj52d", "party_id": "2", "state_id": 52, "party": "R", "role_id": 1, "role": "Rep", "name": "Jason Smith", "first_name": "Jason", "middle_name": "T.", "last_name": "Smith", "suffix": "", "nickname": "", "district": "HD-MO-8", "ftm_eid": 6669122, "votesmart_id": 59318, "opensecrets_id": "N00035282", "knowwho_pid": 243054, "ballotpedia": "Jason_Smith_(Missouri_representative)", "sponsor_type_id": 2, "sponsor_order": 7, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 14083, "person_hash": "77upbgbj", "party_id": "2", "state_id": 52, "party": "R", "role_id": 1, "role": "Rep", "name": "Doug Collins", "first_name": "Doug", "middle_name": "", "last_name": "Collins", "suffix": "", "nickname": "", "district": "HD-GA-9", "ftm_eid": 6671754, "votesmart_id": 67851, "opensecrets_id": "N00033518", "knowwho_pid": 249158, "ballotpedia": "Doug_Collins", "sponsor_type_id": 2, "sponsor_order": 8, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 11136, "person_hash": "7reo0yzw", "party_id": "2", "state_id": 52, "party": "R", "role_id": 1, "role": "Rep", "name": "Randy Hultgren", "first_name": "Randy", "middle_name": "", "last_name": "Hultgren", "suffix": "", "nickname": "", "district": "HD-IL-14", "ftm_eid": 2767639, "votesmart_id": 18199, "opensecrets_id": "N00031104", "knowwho_pid": 194314, "ballotpedia": "Randy_Hultgren", "sponsor_type_id": 2, "sponsor_order": 9, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 16478, "person_hash": "xvz4yc8k", "party_id": "2", "state_id": 52, "party": "R", "role_id": 1, "role": "Rep", "name": "David Trott", "first_name": "David", "middle_name": "", "last_name": "Trott", "suffix": "", "nickname": "", "district": "HD-MI-11", "ftm_eid": 14515774, "votesmart_id": 152477, "opensecrets_id": "N00035607", "knowwho_pid": 468215, "ballotpedia": "David_Trott", "sponsor_type_id": 2, "sponsor_order": 10, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 11047, "person_hash": "73ahm40c", "party_id": "2", "state_id": 52, "party": "R", "role_id": 1, "role": "Rep", "name": "Eric Crawford", "first_name": "Eric", "middle_name": "A.", "last_name": "Crawford", "suffix": "", "nickname": "Rick", "district": "HD-AR-1", "ftm_eid": 17657353, "votesmart_id": 119208, "opensecrets_id": "N00030770", "knowwho_pid": 283914, "ballotpedia": "Rick_Crawford_(Arkansas)", "sponsor_type_id": 2, "sponsor_order": 11, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 15206, "person_hash": "vn5bue1y", "party_id": "2", "state_id": 52, "party": "R", "role_id": 1, "role": "Rep", "name": "Rodney Davis", "first_name": "Rodney", "middle_name": "", "last_name": "Davis", "suffix": "", "nickname": "", "district": "HD-IL-13", "ftm_eid": 3054746, "votesmart_id": 9622, "opensecrets_id": "N00034784", "knowwho_pid": 160440, "ballotpedia": "Rodney_Davis_(Illinois)", "sponsor_type_id": 2, "sponsor_order": 12, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 11066, "person_hash": "q3g8iddo", "party_id": "2", "state_id": 52, "party": "R", "role_id": 1, "role": "Rep", "name": "Stevan Pearce", "first_name": "Stevan", "middle_name": "", "last_name": "Pearce", "suffix": "", "nickname": "", "district": "HD-NM-2", "ftm_eid": 6638679, "votesmart_id": 10655, "opensecrets_id": "N00012672", "knowwho_pid": 310708, "ballotpedia": "Steve_Pearce", "sponsor_type_id": 2, "sponsor_order": 13, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 14897, "person_hash": "wofpia36", "party_id": "2", "state_id": 52, "party": "R", "role_id": 1, "role": "Rep", "name": "George Holding", "first_name": "George", "middle_name": "", "last_name": "Holding", "suffix": "", "nickname": "", "district": "HD-NC-13", "ftm_eid": 6367035, "votesmart_id": 136462, "opensecrets_id": "N00033399", "knowwho_pid": 316283, "ballotpedia": "George_Holding", "sponsor_type_id": 2, "sponsor_order": 14, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 9358, "person_hash": "xwge2rs1", "party_id": "2", "state_id": 52, "party": "R", "role_id": 1, "role": "Rep", "name": "Randy Forbes", "first_name": "J. Randy", "middle_name": "", "last_name": "Forbes", "suffix": "", "nickname": "", "district": "HD-VA-4", "ftm_eid": 17658520, "votesmart_id": 5146, "opensecrets_id": "N00013799", "knowwho_pid": 199396, "ballotpedia": "Randy_Forbes", "sponsor_type_id": 2, "sponsor_order": 15, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 11803, "person_hash": "5hwt8cll", "party_id": "2", "state_id": 52, "party": "R", "role_id": 1, "role": "Rep", "name": "Kristi Noem", "first_name": "Kristi", "middle_name": "L.", "last_name": "Noem", "suffix": "", "nickname": "", "district": "HD-SD", "ftm_eid": 6669590, "votesmart_id": 58189, "opensecrets_id": "N00032022", "knowwho_pid": 250197, "ballotpedia": "Kristi_Noem", "sponsor_type_id": 2, "sponsor_order": 16, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 9287, "person_hash": "1wwr9g35", "party_id": "2", "state_id": 52, "party": "R", "role_id": 1, "role": "Rep", "name": "John Kline", "first_name": "John", "middle_name": "", "last_name": "Kline", "suffix": "", "nickname": "", "district": "HD-MN-2", "ftm_eid": 17658796, "votesmart_id": 20311, "opensecrets_id": "N00004436", "knowwho_pid": 211681, "ballotpedia": "John_Kline", "sponsor_type_id": 2, "sponsor_order": 17, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 14888, "person_hash": "00ti0jne", "party_id": "2", "state_id": 52, "party": "R", "role_id": 1, "role": "Rep", "name": "Kevin Cramer", "first_name": "Kevin", "middle_name": "", "last_name": "Cramer", "suffix": "", "nickname": "", "district": "SD-ND", "ftm_eid": 13010662, "votesmart_id": 444, "opensecrets_id": "N00004614", "knowwho_pid": 240471, "ballotpedia": "Kevin_Cramer", "sponsor_type_id": 2, "sponsor_order": 18, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 16476, "person_hash": "fds8xyci", "party_id": "2", "state_id": 52, "party": "R", "role_id": 1, "role": "Rep", "name": "David Rouzer", "first_name": "David", "middle_name": "", "last_name": "Rouzer", "suffix": "", "nickname": "", "district": "HD-NC-7", "ftm_eid": 5876933, "votesmart_id": 102964, "opensecrets_id": "N00033527", "knowwho_pid": 164497, "ballotpedia": "David_Rouzer", "sponsor_type_id": 2, "sponsor_order": 19, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 16458, "person_hash": "3z9mh67s", "party_id": "2", "state_id": 52, "party": "R", "role_id": 1, "role": "Rep", "name": "Tom Emmer", "first_name": "Tom", "middle_name": "", "last_name": "Emmer", "suffix": "", "nickname": "", "district": "HD-MN-6", "ftm_eid": 12996955, "votesmart_id": 38894, "opensecrets_id": "N00035440", "knowwho_pid": 227769, "ballotpedia": "Tom_Emmer", "sponsor_type_id": 2, "sponsor_order": 20, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 14909, "person_hash": "yggb6yb5", "party_id": "2", "state_id": 52, "party": "R", "role_id": 1, "role": "Rep", "name": "Tom Rice", "first_name": "Tom", "middle_name": "", "last_name": "Rice", "suffix": "", "nickname": "", "district": "HD-SC-7", "ftm_eid": 17658351, "votesmart_id": 11763, "opensecrets_id": "N00033832", "knowwho_pid": 392043, "ballotpedia": "Tom_Rice_(South_Carolina)", "sponsor_type_id": 2, "sponsor_order": 21, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 9179, "person_hash": "v6jqdids", "party_id": "2", "state_id": 52, "party": "R", "role_id": 1, "role": "Rep", "name": "John Culberson", "first_name": "John", "middle_name": "Abney", "last_name": "Culberson", "suffix": "", "nickname": "", "district": "HD-TX-7", "ftm_eid": 6646293, "votesmart_id": 5488, "opensecrets_id": "N00009738", "knowwho_pid": 199253, "ballotpedia": "John_Culberson", "sponsor_type_id": 2, "sponsor_order": 22, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}], "sasts": [{"type_id": 8, "type": "Related", "sast_bill_number": "HR27", "sast_bill_id": 674538}, {"type_id": 8, "type": "Related", "sast_bill_number": "SB1820", "sast_bill_id": 787924}], "subjects": [{"subject_id": 13126, "subject_name": "Administrative law and regulatory procedures"}, {"subject_id": 13384, "subject_name": "Administrative remedies"}, {"subject_id": 13169, "subject_name": "Economic performance and conditions"}, {"subject_id": 13467, "subject_name": "Evidence and witnesses"}, {"subject_id": 13200, "subject_name": "Government information and archives"}, {"subject_id": 13418, "subject_name": "Judicial review and appeals"}, {"subject_id": 13679, "subject_name": "Office of Management and Budget (OMB)"}, {"subject_id": 13356, "subject_name": "Government operations and politics"}], "texts": [{"doc_id": 1062502, "date": "2015-01-07", "type": "Introduced", "type_id": 1, "mime": "application/pdf", "mime_id": 2, "url": "https://legiscan.com/US/text/HB185/id/1062502", "state_link": "https://www.congress.gov/114/bills/hr185/BILLS-114hr185ih.pdf", "text_size": 300128, "text_hash": "90569f05f3b3a80560342b2a38a360c4"}, {"doc_id": 1073139, "date": "2015-01-14", "type": "Engrossed", "type_id": 4, "mime": "application/pdf", "mime_id": 2, "url": "https://legiscan.com/US/text/HB185/id/1073139", "state_link": "https://www.congress.gov/114/bills/hr185/BILLS-114hr185eh.pdf", "text_size": 159041, "text_hash": "683ef8171dd511a4d87d72e25739361c"}], "votes": [{"roll_call_id": 384038, "date": "2015-01-13", "desc": "On Agreeing to the Amendment", "yea": 254, "nay": 168, "nv": 10, "absent": 0, "total": 432, "passed": 1, "chamber": "H", "chamber_id": 114, "url": "https://legiscan.com/US/rollcall/HB185/id/384038", "state_link": "https://clerk.house.gov/Votes/201523"}, {"roll_call_id": 384039, "date": "2015-01-13", "desc": "On Agreeing to the Amendment", "yea": 178, "nay": 247, "nv": 7, "absent": 0, "total": 432, "passed": 0, "chamber": "H", "chamber_id": 114, "url": "https://legiscan.com/US/rollcall/HB185/id/384039", "state_link": "https://clerk.house.gov/Votes/201524"}, {"roll_call_id": 384040, "date": "2015-01-13", "desc": "On Agreeing to the Amendment", "yea": 176, "nay": 249, "nv": 7, "absent": 0, "total": 432, "passed": 0, "chamber": "H", "chamber_id": 114, "url": "https://legiscan.com/US/rollcall/HB185/id/384040", "state_link": "https://clerk.house.gov/Votes/201525"}, {"roll_call_id": 384041, "date": "2015-01-13", "desc": "On Agreeing to the Amendment", "yea": 178, "nay": 248, "nv": 6, "absent": 0, "total": 432, "passed": 0, "chamber": "H", "chamber_id": 114, "url": "https://legiscan.com/US/rollcall/HB185/id/384041", "state_link": "https://clerk.house.gov/Votes/201526"}, {"roll_call_id": 384042, "date": "2015-01-13", "desc": "On Motion to Recommit with Instructions", "yea": 180, "nay": 245, "nv": 7, "absent": 0, "total": 432, "passed": 0, "chamber": "H", "chamber_id": 114, "url": "https://legiscan.com/US/rollcall/HB185/id/384042", "state_link": "https://clerk.house.gov/Votes/201527"}, {"roll_call_id": 384043, "date": "2015-01-13", "desc": "On Passage", "yea": 250, "nay": 175, "nv": 7, "absent": 0, "total": 432, "passed": 1, "chamber": "H", "chamber_id": 114, "url": "https://legiscan.com/US/rollcall/HB185/id/384043", "state_link": "https://clerk.house.gov/Votes/201528"}], "amendments": [], "supplements": [], "calendar": []}}