{"status": "OK", "bill": {"bill_id": 724449, "change_hash": "fda3b2c55462cb2b1ee08df44ee76f55", "session_id": 1156, "session": {"session_id": 1156, "state_id": 52, "year_start": 2015, "year_end": 2016, "prefile": 0, "sine_die": 1, "prior": 1, "special": 0, "session_tag": "Regular Session", "session_title": "2015-2016 Regular Session", "session_name": "114th Congress"}, "url": "https://legiscan.com/US/bill/SB473/2015", "state_link": "https://www.congress.gov/bill/114th-congress/senate-bill/473/all-info", "completed": 0, "status": 1, "status_date": "2015-02-12", "progress": [{"date": "2015-02-12", "event": 1}, {"date": "2015-02-12", "event": 9}], "state": "US", "state_id": 52, "bill_number": "SB473", "bill_type": "B", "bill_type_id": "1", "body": "S", "body_id": 115, "current_body": "S", "current_body_id": 115, "title": "SONG Act Saving Our Next Generation Act", "description": "SONG Act Saving Our Next Generation Act Expresses the sense of the Senate that the federal programs most critical to improving child well-being should be fully funded. Establishes the President's Commission on Children. Directs the Secretary of Health and Human Services (HHS) to contract with the Institute of Medicine to study evidence-based best practices and innovations for fostering safe and stable families, including implementing mentoring programs. Requires the Secretary to award grants to eligible entities to implement best practices and innovations identified in the study. Amends the Fair Labor Standards Act of 1938 to increase the federal minimum wage for employees to: (1) $8.20 an hour six months after enactment of this Act; (2) $9.15 an hour one year later; (3) $10.10 an hour two years later; and (4) amounts determined three years later and annually thereafter based on increases in the Consumer Price Index. Increases the federal minimum wage for tipped employees to $3.00 an hour for one year six months after enactment of this Act, with a formula for subsequent annual adjustments to ensure that it remains equal to 70% of the wage in effect under FLSA for other employees. Amends the Internal Revenue Code to: (1) make permanent the reduction in the income eligibility threshold (from $10,000 to $3,000) for determining the refundable portion of the child tax credit, (2) eliminate the inflation adjustment to such amount, but (3) require an annual inflation adjustment to the allowable amount of such credit (i.e., $1,000) after 2014. Modifies the earned income tax credit to: (1) make permanent the increase in the rate of such credit for taxpayers with three or more children; (2) increase the earned income amount, phaseout amounts, and the credit for taxpayers with no qualifying children; (3) reduce from 25 to 21 the qualifying age for such credit for individuals without a qualifying child; (4) revise eligibility rules for married individuals living apart and qualifying children claimed by another family member; and (5) repeal the denial of such credit for taxpayers with excess investment income. Reauthorizes the Assets for Independence Act through FY2020, and prescribes requirements under it for newborn development account demonstration projects. Amends the Community Services Block Grant Act to reauthorize the Community Services Block Grant Program through FY2014. Directs HHS to award: (1) community service block grants to states to establish Governors Working Groups on Children; and (2) national technical assistance grants to certain institutions of higher education, national nonprofit organizations, or foundations to provide technical assistance to states and Indian tribes to identify best practices for improving the health status of children and improve efforts at capacity building. Amends part A (Temporary Assistance for Needy Families) (TANF) of title IV of the Social Security Act (SSAct), SSAct title XVI (Supplemental Security Income) (SSI), the Food and Nutrition Act of 2008 (for the supplemental nutrition assistance program), and the Low Income Home Energy Assistance Act of 1981 to exclude interest in, and distribution from, a qualified tuition program or a child savings account from income resources for eligibility purposes under their respective programs. Amends the Family and Medical Leave Act of 1993 (FMLA) to provide eligible employees leave to care for a domestic partner or his or her child, parent-in-law, adult child, sibling, grandparent, grandchild, son-in-law, or daughter-in-law (as well as for a spouse, child, or parent), if such person has a serious health condition. Includes within the FMLA purview a same-sex spouse. Amends federal civil service law to apply the same leave allowance to federal employees. Allows an eligible employee during any 12-month period to take up to 24 hours of parental involvement leave to: participate in an academic activity of his or her child's school, such as a parent-teacher conference or an interview for a school; participate in an extracurricular activity at, or sponsored by, the child's school; or transport or accompany his or her spouse, son or daughter, or parent to a medical or dental appointment. Allows an employee to elect, or an employer to require, substitution of any of the employee's paid or family leave for such parental involvement leave. Extends an eligible employee's entitlement to family leave to situations where: it is necessary to care for a son, daughter, or parent, if the individual is addressing domestic violence and its effects; or the employee is unable to perform the functions of his or her position because the employee is addressing these issues. Entitles eligible employees to bereavement leave because of the death of a son, daughter, parent, or sibling. Allows the employee to substitute any available paid leave for bereavement leave. Applies the same leave allowances for parental involvement and bereavement to federal employees. Amends SSAct title XX (Block Grants to States for Social Services and Elder Justice) and SSAct title V (Maternal and Child Health Services) with respect to demonstration projects addressing health professions workforce needs and maternal, infant, and early childhood home visiting programs. Amends the Public Health Service Act (PHSA) to direct HHS to implement a program to enable dental hygienists and nurses to be National Health Service Corps members if they serve in a health professional shortage area that is a school. Directs HHS to award grants to eligible entities to enable such entities to provide behavioral health screening and behavioral health services, including to students. Requires each state plan approved under SSAct title XIX (Medicaid) to make a direct certification for medical assistance and school meals of supplemental nutrition-eligible children and Head Start and early Head Start-eligible children. Directs the Government Accountability Office (GAO) to report to Congress on the feasibility of creating a public health insurance pathway for children who do not receive health insurance coverage through an employer plan maintained by a family member. Assures Medicaid coverage continuity for former foster care children up to age 26. Authorizes comprehensive mental health assessments under the state Medicaid plan of juveniles without regard to whether they are inmates of a public institution. Directs GAO to identify evidence-based intervention strategies that divert juveniles from incarceration to community behavioral health assessment and treatment. Directs the Attorney General to establish a coordinated grant program to enable states, territories, and tribes to implement such diversion programs. Reauthorizes mental health courts and drug courts through FY2019 under the Omnibus Crime Control and Safe Streets Act of 1968. Directs HHS to issue regulations to ensure continuity of care for children undergoing an active course of treatment who involuntarily change coverage under health insurance, the state plan under Medicaid, or the state child health plan under SSAct title XXI (CHIP) during such course of treatment for any reason. Amends SSAct title XIX to allow, at state option, the Medicaid plan to continue for up to 12 months the benefit eligibility of a child or a non-elderly adult. Requires that managed care organizations provide language services to enrollees. Covers specified preventive health services under Medicaid and CHIP, subject to certain cost-sharing prohibitions. Reauthorizes maternal, infant, and early childhood home visiting programs through FY2019. Reauthorizes the Pediatric Accountable Care Organization Demonstration Project through calendar 2019. Includes therapeutic foster care as medical assistance under Medicaid. Directs HHS to establish a child welfare innovation grant program. Amends part B (Child and Family Services) of SSAct title IV to prohibit federal payment or reimbursement to a state under such part unless it is for state expenditures for evidence-based child welfare programs or their services. Amends SSAct title XI to declare that there shall be no limit on the number of demonstration projects authorized by the Secretary of HHS for any fiscal year after FY2014. Directs HHS to recommend to Congress legislative or administrative action necessary to eliminate the requirement that a child be deemed to be a recipient of TANF (Temporary Assistance for Needy Families) under SSAct title IV (as in effect as of July 16, 1996) for purposes of foster care maintenance payments under SSAct title IV part E (Foster Care and Adoption Assistance). Establishes the Presidential Task Force on K-12 Education to advise the President regarding methods to improve graduation rates. Directs the Secretary of Education (Secretary, for the rest of this bill) to award competitive grants to local educational agencies (LEAs) or nonprofit childhood education program providers to improve parental support for preschool home learning. Directs the Secretary to award competitive grants to states to plan, develop, and provide free, voluntary, high-quality prekindergarten programs to children whose family income does not exceed a specified amount. Requires those programs to be offered to other children for a fee that is based on their family income. Requires the Secretary to allot matching grants to states and, through them, subgrants to LEAs to offer free or reduced-price high-quality prekindergarten programs to low-income children. Amends the Head Start Act to direct HHS to develop and implement a plan to provide Head Start and Early Head Start services to children from states or communities that provide sustained access to high-quality prekindergarten programs to children whose family income does not exceed 200% of the poverty line. Amends the Elementary and Secondary Education Act of 1965 (ESEA) to reauthorize appropriations for the William F. Goodling Even Start Family Literacy programs through FY2021. Directs the Secretary to award competitive grants to enable states to expand the school calendar for their public elementary and secondary schools. Authorizes the Secretary to make formula grants to states and, through them, competitive subgrants to LEAs to establish or enhance educational programs and related services that enable pregnant and parenting students to enroll in, attend, and succeed in school. Requires subgrantees to: provide academic support services to pregnant and parenting students; assist such students in accessing quality, affordable child care, and early childhood education services; provide transportation services or assistance to such students and their children; educate students, parents, and community members regarding the educational rights of such students; train school personnel regarding the challenges facing pregnant and parenting students and their educational rights; revise school policies and practices that hinder or discourage such students from continuing their education; provide student parents with training and support in parenting, healthy relationship skills, unplanned pregnancy prevention strategies, and other life skills; and provide educational and career mentoring services and peer groups to pregnant and parenting students. Amends the school improvement program under part A of title I of the ESEA to require states to include in their annual state report cards data regarding their pregnant and parenting students. Adds physical education and health education as \"core academic subjects\" under the ESEA. Allows funding under the Carol M. White Physical Education Program for instruction in healthy eating habits and good nutrition to be used to train healthy food chefs who serve as innovative cooks, as chef trainers, and as a nutrition resource for public elementary and secondary schools and their communities. Amends the Richard B. Russell National School Lunch Act to direct the Department of Agriculture to establish a program that awards competitive grants to school food authorities and child care providers to provide family meals during non-school hours to households that have at least one child who is: (1) enrolled with the grantee, and (2) eligible to receive free or reduced price meals under the school lunch or breakfast program. Amends part A (Teacher and Principal Training and Recruiting Fund) of title II of the ESEA to allow LEAs to use their part A subgrants to train teachers in the topics of nutrition, fitness, and wellness. Directs the Secretary to provide technical assistance and award competitive grants to LEAs to replicate the best practices in enabling elementary and secondary school students to achieve grade-level work, graduate from secondary school on a timely basis, and obtain employment. Requires the Secretary to conduct a study of extended learning time models. Amends the Carl D. Perkins Career and Technical Education Act of 2006 to include among the uses of funds to support career and technical education programs: (1) school adoption, mentoring, or entrepreneurship programs for students; and (2) mentoring programs that connect school leaders with local business representatives. Reauthorizes appropriations through FY2020 for the programs under the Carl D. Perkins Career and Technical Education Act of 2006. Directs the Secretary and the Secretary of Labor to establish jointly an interagency committee to coordinate programs, activities, and services under the Workforce Innovation and Opportunity Act with those carried out under the Carl D. Perkins Career and Technical Education Act of 2006. Requires the Secretary to award competitive grants to states and local educational agencies to support parents of children in prekindergarten programs or elementary schools by: (1) building parents' capacity to evaluate and select appropriate childcare, (2) building parents' capacity to serve as partners with school teachers and administrators, and (3) providing parents with access to the job skills and training needed for successful employment. Amends title IV (Student Assistance) of the Higher Education Act of 1965 (HEA) to direct the Secretary to establish a program to refinance: (1) the William D. Ford Federal Direct Loans (DLs) of qualified borrowers if the DLs were first disbursed or, in the case of Direct Consolidation Loans, applied for before July 1, 2013; and (2) the Federal Family Education Loans (FFELs) of qualified borrowers as DLs. Refinances the FFELs as Federal Direct Stafford, Unsubsidized Stafford, PLUS, or Consolidated Loans depending on the categorization of the FFEL. Sets the interest rate on the refinanced loans, other than the Federal Direct Consolidation Loans, at the rate for the 12 months beginning on July 1, 2013, based on: (1) the DL's categorization; and (2) in the case of Stafford Loans, whether the loan was issued to an undergraduate or graduate student. Establishes a formula for determining the interest rate on refinanced Consolidation Loans. Fixes the interest rate on the refinanced loans for the period of such loans. Directs the Secretary to establish eligibility requirements that are based on a borrower's income or debt-to-income ratio and that take into consideration providing access to refinancing for borrowers who have the greatest financial need. Requires the Secretary to establish a program to refinance as Federal Direct Refinanced Private Loans private education loans that were first disbursed to qualified borrowers before July 1, 2013, for postsecondary educational expenses. Sets the interest rate on Federal Direct Refinanced Private Loans at the rate applicable for the 12 months beginning on July 1, 2013, to: (1) Direct Stafford and Unsubsidized Stafford Loans issued to undergraduates if the private education loan was issued for undergraduate expenses, (2) Direct Unsubsidized Stafford Loans issued to graduate or professional students if the private education loan was issued for graduate or professional studies, or (3) Direct PLUS Loans if the private education loan was issued for undergraduate and graduate or professional studies. Fixes the interest rate for the period of such loans. Directs the Secretary to establish eligibility requirements that: (1) are based on a borrower's income or debt-to-income ratio and take into consideration providing access to refinancing for borrowers who have the greatest financial need, (2) ensure eligibility only for borrowers in good standing, (3) minimize inequities between Federal Direct Refinanced Private Loans and other federal student loans, and (4) preclude windfall profits for private educational lenders. Requires qualified borrowers of such loans to undergo loan counseling before their private education loan is refinanced. Requires private educational lenders to report specified loan information to the Secretary, Congress, the Secretary of the Treasury, and the Director of the Consumer Financial Protection Bureau in order to allow for an assessment of the private education loan market. Directs the Secretary to undertake a campaign to alert borrowers that they may be eligible for refinancing. Requires the Secretary to increase publicity about the DL repayment plan for public service employees that allows for the cancellation of the remaining principal and interest due on such loans if 120 monthly payments are made on such loans after October 1, 2007. Revises federal bankruptcy law to make the hardship exception to the exemption of educational debts from discharge in bankruptcy applicable to: (1) private education loans; (2) an educational benefit overpayment or loan made, insured, or guaranteed by a governmental unit or made under any program funded in whole or in part by a governmental unit; and (3) an obligation to repay funds received from a governmental unit as an educational benefit, scholarship, or stipend. Amends the Truth in Lending Act to require a private educational lender to include in a private education loan for which the cosigner is jointly liable a process for releasing the cosigner from obligations on such loan. States that neither the estate of the borrower nor any cosigner of such private education loan shall be obligated to repay the outstanding principle and interest on the loan in the event of the borrower's death, disability, or inability to engage in any substantial gainful activity. Amends the Fair Credit Reporting Act to prohibit: (1) consumer reporting agencies from making any consumer report containing information on a default on a private education loan resulting from accelerated repayment terms of the loan after the death, disability, inability to engage in any substantial gainful activity, or bankruptcy of a jointly liable cosigner, and (2) the lender or servicer of a private education loan from furnishing loan information to a consumer reporting agency if the consumer defaulted on the loan due to accelerated repayment terms after the death, disability, inability to engage in any substantial gainful activity, or bankruptcy of such a cosigner. Amends title IV of the HEA to require IHEs to ensure that a student completes an assessment demonstrating the student's understanding of the terms and conditions of a DL before certifying the loan for disbursement to the student. Directs the Secretary to award competitive grants to nonprofit or educational entities to develop and pilot measures of accountability for value and cost-effectiveness in higher education.", "pending_committee_id": 2326, "committee": {"committee_id": 2326, "chamber": "S", "chamber_id": 115, "name": "Finance"}, "referrals": [{"date": "2015-02-12", "committee_id": 2326, "chamber": "S", "chamber_id": 115, "name": "Finance"}], "history": [{"date": "2015-02-12", "action": "Read twice and referred to the Committee on Finance.", "chamber": "S", "chamber_id": 115, "importance": 1}], "sponsors": [{"people_id": 9472, "person_hash": "4c2m8lz3", "party_id": "1", "state_id": 52, "party": "D", "role_id": 2, "role": "Sen", "name": "Tom Udall", "first_name": "Tom", "middle_name": "", "last_name": "Udall", "suffix": "", "nickname": "", "district": "SD-NM", "ftm_eid": 1864753, "votesmart_id": 22658, "opensecrets_id": "N00006561", "knowwho_pid": 158967, "ballotpedia": "Tom_Udall", "sponsor_type_id": 1, "sponsor_order": 1, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}], "sasts": [{"type_id": 8, "type": "Related", "sast_bill_number": "HB835", "sast_bill_id": 719403}, {"type_id": 8, "type": "Related", "sast_bill_number": "SB416", "sast_bill_id": 719354}, {"type_id": 8, "type": "Related", "sast_bill_number": "SB429", "sast_bill_id": 719407}, {"type_id": 8, "type": "Related", "sast_bill_number": "SB729", "sast_bill_id": 755811}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB2260", "sast_bill_id": 778613}, {"type_id": 8, "type": "Related", "sast_bill_number": "SB1302", "sast_bill_id": 778646}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB3641", "sast_bill_id": 791842}, {"type_id": 8, "type": "Related", "sast_bill_number": "SB1852", "sast_bill_id": 788043}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB5214", "sast_bill_id": 877741}], "subjects": [{"subject_id": 13125, "subject_name": "Academic performance and assessments"}, {"subject_id": 13126, "subject_name": "Administrative law and regulatory procedures"}, {"subject_id": 13348, "subject_name": "Adoption and foster care"}, {"subject_id": 13127, "subject_name": "Advisory bodies"}, {"subject_id": 13812, "subject_name": "Allied health services"}, {"subject_id": 13497, "subject_name": "Bank accounts, deposits, capital"}, {"subject_id": 13372, "subject_name": "Bankruptcy"}, {"subject_id": 13668, "subject_name": "Child care and development"}, {"subject_id": 13142, "subject_name": "Child health"}, {"subject_id": 13376, "subject_name": "Child safety and welfare"}, {"subject_id": 13763, "subject_name": "Community life and organization"}, {"subject_id": 13146, "subject_name": "Congressional oversight"}, {"subject_id": 13524, "subject_name": "Consumer credit"}, {"subject_id": 13433, "subject_name": "Correctional facilities and imprisonment"}, {"subject_id": 13406, "subject_name": "Crime victims"}, {"subject_id": 13306, "subject_name": "Dental care"}, {"subject_id": 13154, "subject_name": "Department of Education"}, {"subject_id": 13160, "subject_name": "Department of Labor"}, {"subject_id": 13166, "subject_name": "Disability and paralysis"}, {"subject_id": 13660, "subject_name": "Domestic violence and child abuse"}, {"subject_id": 13170, "subject_name": "Education of the disadvantaged"}, {"subject_id": 13171, "subject_name": "Education programs funding"}, {"subject_id": 13174, "subject_name": "Elementary and secondary education"}, {"subject_id": 13502, "subject_name": "Employee leave"}, {"subject_id": 13179, "subject_name": "Energy assistance for the poor and aged"}, {"subject_id": 13184, "subject_name": "Executive agency funding and structure"}, {"subject_id": 13470, "subject_name": "Family relationships"}, {"subject_id": 13190, "subject_name": "Food assistance and relief"}, {"subject_id": 22689, "subject_name": "Foreign language and bilingual programs"}, {"subject_id": 13198, "subject_name": "Government employee pay, benefits, personnel management"}, {"subject_id": 13200, "subject_name": "Government information and archives"}, {"subject_id": 13202, "subject_name": "Government lending and loan guarantees"}, {"subject_id": 22688, "subject_name": "Government studies and investigations"}, {"subject_id": 13206, "subject_name": "Health care costs and insurance"}, {"subject_id": 13207, "subject_name": "Health care coverage and access"}, {"subject_id": 13209, "subject_name": "Health facilities and institutions"}, {"subject_id": 13211, "subject_name": "Health personnel"}, {"subject_id": 13212, "subject_name": "Health programs administration and funding"}, {"subject_id": 13213, "subject_name": "Health promotion and preventive care"}, {"subject_id": 13215, "subject_name": "Higher education"}, {"subject_id": 13216, "subject_name": "Home and outpatient care"}, {"subject_id": 13224, "subject_name": "Income tax credits"}, {"subject_id": 13226, "subject_name": "Income tax exclusion"}, {"subject_id": 13493, "subject_name": "Inflation and prices"}, {"subject_id": 13230, "subject_name": "Interest, dividends, interest rates"}, {"subject_id": 13656, "subject_name": "Juvenile crime and gang violence"}, {"subject_id": 13234, "subject_name": "Labor standards"}, {"subject_id": 13237, "subject_name": "Long-term, rehabilitative, and terminal care"}, {"subject_id": 13488, "subject_name": "Marriage and family status"}, {"subject_id": 13239, "subject_name": "Medicaid"}, {"subject_id": 13240, "subject_name": "Medical education"}, {"subject_id": 13313, "subject_name": "Medical tests and diagnostic methods"}, {"subject_id": 13314, "subject_name": "Mental health"}, {"subject_id": 13635, "subject_name": "Minority education"}, {"subject_id": 13730, "subject_name": "Nursing"}, {"subject_id": 13315, "subject_name": "Nutrition and diet"}, {"subject_id": 13258, "subject_name": "Performance measurement"}, {"subject_id": 13623, "subject_name": "Physical fitness and lifestyle"}, {"subject_id": 13259, "subject_name": "Poverty and welfare assistance"}, {"subject_id": 13752, "subject_name": "Preschool education"}, {"subject_id": 13721, "subject_name": "School administration"}, {"subject_id": 13280, "subject_name": "Social work, volunteer service, charitable organizations"}, {"subject_id": 13285, "subject_name": "State and local government operations"}, {"subject_id": 13286, "subject_name": "Student aid and college costs"}, {"subject_id": 81062, "subject_name": "Student records"}, {"subject_id": 13672, "subject_name": "Tax treatment of families"}, {"subject_id": 13287, "subject_name": "Teaching, teachers, curricula"}, {"subject_id": 13729, "subject_name": "Teenage pregnancy"}, {"subject_id": 13644, "subject_name": "Transportation costs"}, {"subject_id": 81057, "subject_name": "Vocational and technical education"}, {"subject_id": 13297, "subject_name": "Wages and earnings"}, {"subject_id": 13769, "subject_name": "Women's education"}, {"subject_id": 13302, "subject_name": "Women's health"}, {"subject_id": 13383, "subject_name": "Social welfare"}], "texts": [{"doc_id": 1151127, "date": "2015-03-02", "type": "Introduced", "type_id": 1, "mime": "application/pdf", "mime_id": 2, "url": "https://legiscan.com/US/text/SB473/id/1151127", "state_link": "https://www.congress.gov/114/bills/s473/BILLS-114s473is.pdf", "text_size": 614458, "text_hash": "c937fa078214550e8d0ffb5614b3f0ec"}], "votes": [], "amendments": [], "supplements": [], "calendar": []}}