{"votes": {"No": [["Edward  J. 'Ed'  Price", "134641", "Democratic", "LA", "2"], ["Joseph 'Joe'  Bouie\n                  Jr.", "155407", "Democratic", "LA", "3"], ["James 'Jimmy'  Harris\n                  III", "165594", "Democratic", "LA", "4"], ["Troy  A. 'C'  Carter", "35462", "Democratic", "LA", "7"], ["Patrick  Connick", "93757", "Republican", "LA", "8"], ["J. Rogers  Pope", "93682", "Republican", "LA", "13"], ["Regina  Ashford  Barrow", "56506", "Democratic", "LA", "15"], ["Franklin  J.  Foil", "93673", "Republican", "LA", "16"], ["Richard 'Rick'  Ward\n                  III", "134589", "Republican", "LA", "17"], ["Eddie  J.  Lambert", "35405", "Republican", "LA", "18"], ["Gary  L.  Smith\n                  Jr.", "35485", "Democratic", "LA", "19"], ["Mark  T.  Abraham", "93547", "Republican", "LA", "25"], ["Jay  Luneau", "165587", "Democratic", "LA", "29"], ["Katrina  R.  Jackson", "134647", "Democratic", "LA", "34"], ["John  C. 'Jay'  Morris\n                  III", "134583", "Republican", "LA", "35"]], "Yes": [["Sharon  W.  Hewitt", "165534", "Republican", "LA", "1"], ["Mack  A. 'Bodi'  White\n                  Jr.", "35350", "Republican", "LA", "6"], ["J.  Cameron  Henry\n                  Jr.", "93747", "Republican", "LA", "9"], ["Kirk  Talbot", "93725", "Republican", "LA", "10"], ["Patrick  McMath", "186901", "Republican", "LA", "11"], ["Beth  Sherman  Mizell", "134643", "Republican", "LA", "12"], ["Michael  A. 'Big Mike'  Fesi\n                  Sr.", "165570", "Republican", "LA", "20"], ["Robert  L. 'Bret'  Allain\n                  II", "134577", "Republican", "LA", "21"], ["Fred  H. 'T-Fred'  Mills\n                  Jr.", "86619", "Republican", "LA", "22"], ["Patrick 'Page'  Cortez", "93829", "Republican", "LA", "23"], ["Bob  Hensgens", "129992", "Republican", "LA", "26"], ["Ronnie  Johns", "9009", "Republican", "LA", "27"], ["Heather  M.  Cloud", "185789", "Republican", "LA", "28"], ["Mike  Reese", "186912", "Republican", "LA", "30"], ["Louie  Bernard", "186913", "Republican", "LA", "31"], ["Glen  D.  Womack", "186919", "Republican", "LA", "32"], ["Stewart  Cathey\n                  Jr.", "165589", "Republican", "LA", "33"], ["Robert  M.  Mills", "186921", "Republican", "LA", "36"], ["Russell  Barrow  Peacock", "35649", "Republican", "LA", "37"], ["Barry  Milligan", "186925", "Republican", "LA", "38"]], "Did Not Vote": [["Karen  Carter  Peterson", "35376", "Democratic", "LA", "5"], ["Cleo  Fields", "26878", "Democratic", "LA", "14"], ["Gerald  Boudreaux", "165574", "Democratic", "LA", "24"], ["Gregory  Williams  Tarver\n                  Sr.", "4488", "Democratic", "LA", "39"]], "NA": []}, "synopsis": "Vote to pass a bill that limits the ability of localities to file environmental lawsuits against oil and gas companies.", "link": "https://justfacts.votesmart.org/bill/28054/72695/limits-environmental-lawsuits-against-oil-and-gas-companies", "name": "SB 440 - Limits Environmental Lawsuits Against Oil and Gas Companies - Louisiana Key Vote", "pg": "Highlights: Authorizes a court to impose civil liability, assess damages, order the payment of the restoration costs, require actual restoration of areas disturbed, and otherwise impose reasonable and proper sanctions for uses conducted within the coastal zone without a coastal use permit where a permit is required, or which are not in accordance with the terms and conditions of a coastal use permit (Sec. 1). Requires that the money collected by the state under this bill be deposited as follows (Sec. 1): The money collected for violations relating to use of state concern must be used for the following purposes only: 50 percent of the money collected must be used to reimburse the Department of Natural Resources for the cost of enforcing the provisions of this bill and will be deposited in the Coastal Resources Trust Fund; and 25 percent of the money collected must be placed in a restricted fund administered by the parish governing authority of the parish in which the adverse impact related to the use in located; The money collected for violations relating to a use of local concern will be placed in a restricted fund administered by the parish governing authority or the parish in which the adverse impact related to the use is located, and such funds can only be used for projects within or for the benefit of areas within the geographic borders of that local government; Any money received in settlement or by final judgement for assessed damages, restoration costs, the actual restoration of areas disturbed, or reasonable and proper sanctions or any money received in settlement or by final judgement will be distributed based on the type of use of the coastal zone involved in the action as follows: For uses of state concern, the money will be deposited as follows: 50 percent of the money collected will be placed in the Coastal Protection and Restoration Fund; 25 percent of the money collected will be placed in a restricted fund administered by the parish governing authority of the parish in which the adverse impact related to the use is located, and such funds can only be sued for projects selected by the local governing and authorizes preferences to be given to local contractors for planning projects, permitting, and implementing such projects; and The remaining 25 percent of the money collected will be placed in the Coastal Protection and Restoration Fund to be used to match funding for projects selected by local governing authorities; and For uses of local concern, all money collected will be deposited in a restricted fund administered by the parish governing authority of the parish in which the adverse impact related to the use is located."}