{"votes": {"No": [["Mike  Testa", "186423", "Republican", "NJ", "1"], ["Chris  A.  Brown", "129795", "Republican", "NJ", "2"], ["Christopher  J.  Connors", "4186", "Republican", "NJ", "9"], ["James  W. 'Jim'  Holzapfel", "4437", "Republican", "NJ", "10"], ["Vin  Gopal", "129810", "Democratic", "NJ", "11"], ["Samuel  D. 'Sam'  Thompson", "24777", "Republican", "NJ", "12"], ["Declan  Joseph  O'Scanlon\n                  Jr.", "58171", "Republican", "NJ", "13"], ["Thomas  H. 'Tom'  Kean\n                  Jr.", "43250", "Republican", "NJ", "21"], ["Michael  J.  Doherty", "22500", "Republican", "NJ", "23"], ["Steven  V. 'Steve'  Oroho", "69682", "Republican", "NJ", "24"], ["Anthony  M.  Bucco\n                  Jr.", "122157", "Republican", "NJ", "25"], ["Joseph 'Joe'  Pennacchio", "55025", "Republican", "NJ", "26"], ["Robert  W.  Singer", "4471", "Republican", "NJ", "30"], ["Nicholas  J. 'Nick'  Sacco", "4467", "Democratic", "NJ", "32"], ["Paul  A.  Sarlo", "55139", "Democratic", "NJ", "36"], ["Gerald 'Gerry'  Cardinale", "4165", "Republican", "NJ", "39"], ["Kristin  M.  Corrado", "176310", "Republican", "NJ", "40"]], "Yes": [["Stephen  M. 'Steve'  Sweeney", "55120", "Democratic", "NJ", "3"], ["Fred  H.  Madden\n                  Jr.", "43313", "Democratic", "NJ", "4"], ["Nilsa  I.  Cruz-Perez", "4472", "Democratic", "NJ", "5"], ["James 'Jim'  Beach", "110944", "Democratic", "NJ", "6"], ["Troy  Singleton", "129802", "Democratic", "NJ", "7"], ["Dawn  Marie  Addiego", "69709", "Democratic", "NJ", "8"], ["Linda  R.  Greenstein", "22544", "Democratic", "NJ", "14"], ["Shirley  K.  Turner", "4452", "Democratic", "NJ", "15"], ["Christopher 'Kip'  Bateman", "4194", "Republican", "NJ", "16"], ["Robert  G. 'Bob'  Smith", "4201", "Democratic", "NJ", "17"], ["Patrick  J.  Diegnan\n                  Jr.", "55104", "Democratic", "NJ", "18"], ["Joseph  F.  Vitale", "24731", "Democratic", "NJ", "19"], ["Joseph  P. 'Joe'  Cryan", "55122", "Democratic", "NJ", "20"], ["Nicholas  P.  Scutari", "43083", "Democratic", "NJ", "22"], ["Richard  J.  Codey", "4172", "Democratic", "NJ", "27"], ["Ronald  L.  Rice", "4174", "Democratic", "NJ", "28"], ["M.  Teresa  Ruiz", "69688", "Democratic", "NJ", "29"], ["Sandra  Bolden  Cunningham", "69701", "Democratic", "NJ", "31"], ["Brian  P.  Stack", "43373", "Democratic", "NJ", "33"], ["Nellie  Pou", "15181", "Democratic", "NJ", "35"], ["Loretta  L.  Weinberg", "4204", "Democratic", "NJ", "37"], ["Joseph  A.  Lagana", "145269", "Democratic", "NJ", "38"]], "Did Not Vote": [["Nia  H.  Gill", "4433", "Democratic", "NJ", "34"]], "NA": []}, "synopsis": "Vote to pass a bill that requires the recycling of food waste at supermarkets, hospitals, and prisons.", "link": "https://justfacts.votesmart.org/bill/27907/72126/requires-recycling-of-food-waste", "name": "A 2371 - Requires Recycling of Food Waste - New Jersey Key Vote", "pg": "Highlights: Defines “alternative authorized food waste recycling method as (Sec. 1): Recycling food waste at the site at which it is generated as authorized by the Department of Environmental Protection; Treating food waste at the site at which it is generated pursuant to a permit issued by the department; Sending food waste for offsite use for agricultural purposes, including as animal feed; Sending food waste offsite for treatment with sewage sludge in an anaerobic digester for renewable natural gas or biogas recovery as authorized by the department; or Any other method of recycling or reuse of food waste, as authorized by the department. Defines “large food waste generator” as any commercial food wholesaler, distributor, industrial food processor, supermarket, resort, conference center, banquet hall, restaurant, educational or religious institution, military installation, prison, hospital, medical facility, or casino that produces at least 52 tons per year of food waste (Sec. 1). Requires each large food waste generator located within 25 road miles of an authorized food waste recycling facility to source separate its food waste from other solid waste, and send the source separated food waste to an authorized food waste recycling facility that has available capacity and will accept it (Sec. 2). Authorizes a large food waste generator not located within 25 road miles of an authorized food waste recycling facility, or if the authorized food waste recycling facility will not accept the generator’s food waste, to send the food waste for final disposal at a solid waste facility (Sec. 2). Authorizes a large food waste generator to petition the Department of Environmental Protection for a waiver of the requirements of the cost of transporting the food waste plus the fee charged by an authorized food waste recycling facility located within 25 road miles of the large food waste generator if it is at least 10 percent more than the cost of transporting the food waste for disposal plus the disposal fee charged for solid waste disposal in the State (Sec. 2). Specifies that any person in violation of this act will be subject to a civil penalty of $250 for the first offense, $500 for the second offense, and $1,000 for the third and each subsequent offense (Sec. 2). Specifies that any municipality following these food waste guidelines will be entitled to an economic benefit of $0.50 per ton of all food waste accepted for processing at the authorized food waste recycling facility (Sec. 3). Establishes in the Department of Environmental Protection a Food Waste Recycling Market Development Council (Sec. 4). Requires every state department or agency that engages in landscaping or construction activities on state land, or for state projects or facilities, to use, where technically feasible, compost, mulch, or other soil amendments produced from solid waste, food waste, sludge, or other organic materials (Sec. 5). Requires an authorized food waste recycling facility, where feasible, to employ minority and women applicants that reside near the facility (Sec. 6). Amends the definition of “class I renewable energy” to include methane gas from a biomass facility and from a composting or anaerobic or aerobic digestion facility that converts food waste or other organic waste to energy (Sec. 7)."}