{"votes": {"No": [["Mike  Testa", "186423", "Republican", "NJ", "1"], ["Christopher  J.  Connors", "4186", "Republican", "NJ", "9"], ["Samuel  D. 'Sam'  Thompson", "24777", "Republican", "NJ", "12"], ["Declan  Joseph  O'Scanlon\n                  Jr.", "58171", "Republican", "NJ", "13"], ["Thomas  H. 'Tom'  Kean\n                  Jr.", "43250", "Republican", "NJ", "21"], ["Michael  J.  Doherty", "22500", "Republican", "NJ", "23"], ["Steven  V. 'Steve'  Oroho", "69682", "Republican", "NJ", "24"], ["Anthony  M.  Bucco\n                  Jr.", "122157", "Republican", "NJ", "25"], ["Joseph 'Joe'  Pennacchio", "55025", "Republican", "NJ", "26"], ["Gerald 'Gerry'  Cardinale", "4165", "Republican", "NJ", "39"]], "Yes": [["Chris  A.  Brown", "129795", "Republican", "NJ", "2"], ["Stephen  M. 'Steve'  Sweeney", "55120", "Democratic", "NJ", "3"], ["Fred  H.  Madden\n                  Jr.", "43313", "Democratic", "NJ", "4"], ["Nilsa  I.  Cruz-Perez", "4472", "Democratic", "NJ", "5"], ["James 'Jim'  Beach", "110944", "Democratic", "NJ", "6"], ["Troy  Singleton", "129802", "Democratic", "NJ", "7"], ["Dawn  Marie  Addiego", "69709", "Democratic", "NJ", "8"], ["Vin  Gopal", "129810", "Democratic", "NJ", "11"], ["Linda  R.  Greenstein", "22544", "Democratic", "NJ", "14"], ["Shirley  K.  Turner", "4452", "Democratic", "NJ", "15"], ["Christopher 'Kip'  Bateman", "4194", "Republican", "NJ", "16"], ["Robert  G. 'Bob'  Smith", "4201", "Democratic", "NJ", "17"], ["Patrick  J.  Diegnan\n                  Jr.", "55104", "Democratic", "NJ", "18"], ["Joseph  P. 'Joe'  Cryan", "55122", "Democratic", "NJ", "20"], ["Nicholas  P.  Scutari", "43083", "Democratic", "NJ", "22"], ["Richard  J.  Codey", "4172", "Democratic", "NJ", "27"], ["Ronald  L.  Rice", "4174", "Democratic", "NJ", "28"], ["M.  Teresa  Ruiz", "69688", "Democratic", "NJ", "29"], ["Robert  W.  Singer", "4471", "Republican", "NJ", "30"], ["Sandra  Bolden  Cunningham", "69701", "Democratic", "NJ", "31"], ["Nicholas  J. 'Nick'  Sacco", "4467", "Democratic", "NJ", "32"], ["Brian  P.  Stack", "43373", "Democratic", "NJ", "33"], ["Nia  H.  Gill", "4433", "Democratic", "NJ", "34"], ["Nellie  Pou", "15181", "Democratic", "NJ", "35"], ["Paul  A.  Sarlo", "55139", "Democratic", "NJ", "36"], ["Loretta  L.  Weinberg", "4204", "Democratic", "NJ", "37"], ["Joseph  A.  Lagana", "145269", "Democratic", "NJ", "38"], ["Kristin  M.  Corrado", "176310", "Republican", "NJ", "40"]], "Did Not Vote": [["James  W. 'Jim'  Holzapfel", "4437", "Republican", "NJ", "10"], ["Joseph  F.  Vitale", "24731", "Democratic", "NJ", "19"]], "NA": []}, "synopsis": "Vote to pass a bill that establishes the Office of Clean Energy Equity within the Board of Public Utilities, effective immediately.", "link": "https://justfacts.votesmart.org/bill/29112/75826/establishes-the-office-of-clean-energy-equity", "name": "S 2484 - Establishes the Office of Clean Energy Equity - New Jersey Key Vote", "pg": "Highlights: Establishes an Office of Clean Energy Equity within the Board of Public Utilities (BPU) (Sec 1). Authorizes the BPU, in conjunction with the Office of Clean Energy Equity, to (Sec 1): Establish onsite solar or community solar programs; Require the establishment of a minimum of 1,600-megawatt-hours of energy storage in overburdened communities; Integrate workforce development training into all clean energy and energy storage programs established by the BPU; Provide outreach and recruitment campaign grants to community-based organizations to increase resident participation in energy programs; Develop accessible materials concerning this act’s provisions; and Appoint a community liaison and establish an advisory board responsible for conducting reviews and evaluations of all energy programs. Specifies that overburdened community means any census block group in which at least (Sec 1): 35 percent of the households qualify as low-income households; 40 percent of the residents identify as minority or as members of a State-recognized tribal community; or 40 percent of the households have limited English proficiency. Requires the Office and the Department of Labor and Workforce Development to establish a program to provide grants to community-based, diversity-focused nonprofit organizations, community colleges, and vocational-technical schools to develop solar energy or clean energy paid workforce training positions that provide training to at least 2,500 individuals from overburdened communities by 2025 (Sec 2). Requires the Department of Labor and Workforce Development, in coordination with community-based organizations, to develop programs that provide entrepreneurial training, mentoring, apprenticeships, investment capital loans, or other training, capacity building, technical, and financial support to residents of overburdened communities to help launch new clean energy enterprises or establish careers in the clean energy workforce (Sec 2). Authorizes the Office and the Department of Community Affairs to require all new construction located in an overburdened community to be solar-ready (Sec 3). Requires the BPU to adopt rules and regulations establishing a “Community Solar Energy Pilot Program” to permit customers of an electric public utility to participate in a solar energy project within 210 days of enactment (Sec 5). Specifies that the solar energy program is remotely located from a customer’s property, but within their electric public utility service territory, to allow for a credit to the customer’s utility bill equal to the electricity generated that is attributed to the customer’s participation in the project (Sec 5). Requires the BPU to adopt rules and regulations to convert the solar energy pilot program into a permanent energy program no later than 36 months after the adoption of the original rules (Sec 5). Requires the BPU to direct no less than 10 percent of the annual total clean energy budget, or at least $50 million annually, whichever is greater, to the Office of Clean Energy Equity to implement provisions (Sec 1). Specifies that any funding will be supplemental to, and not replace, any funds allocated to energy efficiency services for low-income households required by the PBU, and permits the BPU to allocate any additional resources as deemed appropriate (Sec 1). Authorizes the Office of Clean Energy Equity to contract with a third party administrator to implement any solar energy and energy storage provisions (Sec 1). Requires the BPU to provide public notice of the proposed budget for the Office of Clean Energy Equity for the forthcoming fiscal year no later than January 15 of each year, and give the opportunity for interested stakeholders to provide comments (Sec 1). Requires the BPU to prepare and submit a written report to the governor and legislature of the annual activities of the Office no later than September 1 (Sec 1)."}