{"votes": {"No": [["Mike  Testa", "186423", "Republican", "NJ", "1"], ["Christopher  J.  Connors", "4186", "Republican", "NJ", "9"], ["James  W. 'Jim'  Holzapfel", "4437", "Republican", "NJ", "10"], ["Samuel  D. 'Sam'  Thompson", "24777", "Republican", "NJ", "12"], ["Declan  Joseph  O'Scanlon\n                  Jr.", "58171", "Republican", "NJ", "13"], ["Michael  J.  Doherty", "22500", "Republican", "NJ", "23"], ["Steven  V. 'Steve'  Oroho", "69682", "Republican", "NJ", "24"], ["Anthony  M.  Bucco\n                  Jr.", "122157", "Republican", "NJ", "25"], ["Joseph 'Joe'  Pennacchio", "55025", "Republican", "NJ", "26"], ["Gerald 'Gerry'  Cardinale", "4165", "Republican", "NJ", "39"], ["Kristin  M.  Corrado", "176310", "Republican", "NJ", "40"]], "Yes": [["Chris  A.  Brown", "129795", "Republican", "NJ", "2"], ["Stephen  M. 'Steve'  Sweeney", "55120", "Democratic", "NJ", "3"], ["Fred  H.  Madden\n                  Jr.", "43313", "Democratic", "NJ", "4"], ["Nilsa  I.  Cruz-Perez", "4472", "Democratic", "NJ", "5"], ["James 'Jim'  Beach", "110944", "Democratic", "NJ", "6"], ["Troy  Singleton", "129802", "Democratic", "NJ", "7"], ["Dawn  Marie  Addiego", "69709", "Democratic", "NJ", "8"], ["Vin  Gopal", "129810", "Democratic", "NJ", "11"], ["Linda  R.  Greenstein", "22544", "Democratic", "NJ", "14"], ["Shirley  K.  Turner", "4452", "Democratic", "NJ", "15"], ["Christopher 'Kip'  Bateman", "4194", "Republican", "NJ", "16"], ["Robert  G. 'Bob'  Smith", "4201", "Democratic", "NJ", "17"], ["Patrick  J.  Diegnan\n                  Jr.", "55104", "Democratic", "NJ", "18"], ["Joseph  F.  Vitale", "24731", "Democratic", "NJ", "19"], ["Joseph  P. 'Joe'  Cryan", "55122", "Democratic", "NJ", "20"], ["Thomas  H. 'Tom'  Kean\n                  Jr.", "43250", "Republican", "NJ", "21"], ["Nicholas  P.  Scutari", "43083", "Democratic", "NJ", "22"], ["Richard  J.  Codey", "4172", "Democratic", "NJ", "27"], ["Ronald  L.  Rice", "4174", "Democratic", "NJ", "28"], ["M.  Teresa  Ruiz", "69688", "Democratic", "NJ", "29"], ["Robert  W.  Singer", "4471", "Republican", "NJ", "30"], ["Sandra  Bolden  Cunningham", "69701", "Democratic", "NJ", "31"], ["Nicholas  J. 'Nick'  Sacco", "4467", "Democratic", "NJ", "32"], ["Brian  P.  Stack", "43373", "Democratic", "NJ", "33"], ["Nellie  Pou", "15181", "Democratic", "NJ", "35"], ["Paul  A.  Sarlo", "55139", "Democratic", "NJ", "36"], ["Loretta  L.  Weinberg", "4204", "Democratic", "NJ", "37"], ["Joseph  A.  Lagana", "145269", "Democratic", "NJ", "38"]], "Did Not Vote": [["Nia  H.  Gill", "4433", "Democratic", "NJ", "34"]], "NA": []}, "synopsis": "Vote to pass a bill that requires municipal master plans to factor in climate change when designing cities.", "link": "https://justfacts.votesmart.org/bill/30019/77297/requires-municipal-master-plans-to-factor-in-climate-change", "name": "S 2607 - Requires Municipal Master Plans to Factor in Climate Change - New Jersey Key Vote", "pg": "Highlights: Requires land use elements of master plans include a climate change-related hazard vulnerability assessment which considers the following (Sec. 1.h): Environmental effects and extreme weather-related events associated with climate change, including, but not limited to,temperature, drought, and sea-level rise; Measures to mitigate reasonably anticipated natural hazards, including, but not limited to, coastal storms, shoreline erosion, flooding, storm surge, and wind; Critical facilities, utilities, roadways, and other infrastructure that is necessary for evacuation purposes and for sustaining quality of life during a natural disaster; The potential impact of natural hazards on relevant components and elements of the master plan; Strategies and design standards that may be implemented to reduce or avoid risks associated with natural hazards; A specific policy statement on the consistency, coordination, and integration of the climate-change related hazard vulnerability assessment with any existing or proposed natural hazard mitigation plan, floodplain management plan, comprehensive emergency management plan, emergency response plan, post-disaster recovery plan, or capital improvement plan; and The most recent natural hazard projections and best available science provided by the New Jersey Department of Environmental Protection. Requires the master plan involve a conservation plan element providing for the preservation, conservation, and utilization of natural resources, including, to the extent appropriate, energy, open space, water supply, forests, soil, marshes, wetlands, harbors, rivers and other waters, fisheries, endangered or threatened species wildlife and other resources (Sec. 1-8). Requires an economic plan element considering all aspects of economic development and sustained economic vitality, including (Sec. 1-9): A comparison of the types of employment expected to be provided by the economic development to be promoted with the characteristics of the labor pool resident in the municipality and nearby areas; and An analysis of the stability and diversity of the economic development to be promoted; Requires a farmland preservation plan element, which includes an inventory of farm properties and a map illustrating significant areas of agricultural land, a statement showing that municipal ordinances support and promote agriculture as a business, and a plan for preserving as much farmland as possible (Sec. 1-13). Authorizes the Department of Environmental Protection to provide technical assistance to a municipality preparing a climate change related hazard vulnerability assessment (Sec. 2)."}