{"votes": {"No": [["Mike  Testa", "186423", "Republican", "NJ", "1"], ["Christopher  J.  Connors", "4186", "Republican", "NJ", "9"], ["James  W. 'Jim'  Holzapfel", "4437", "Republican", "NJ", "10"], ["Samuel  D. 'Sam'  Thompson", "24777", "Republican", "NJ", "12"], ["Declan  Joseph  O'Scanlon\n                  Jr.", "58171", "Republican", "NJ", "13"], ["Thomas  H. 'Tom'  Kean\n                  Jr.", "43250", "Republican", "NJ", "21"], ["Michael  J.  Doherty", "22500", "Republican", "NJ", "23"], ["Steven  V. 'Steve'  Oroho", "69682", "Republican", "NJ", "24"], ["Anthony  M.  Bucco\n                  Jr.", "122157", "Republican", "NJ", "25"], ["Joseph 'Joe'  Pennacchio", "55025", "Republican", "NJ", "26"], ["Robert  W.  Singer", "4471", "Republican", "NJ", "30"], ["Paul  A.  Sarlo", "55139", "Democratic", "NJ", "36"], ["Holly  T.  Schepisi", "134860", "Republican", "NJ", "39"], ["Kristin  M.  Corrado", "176310", "Republican", "NJ", "40"]], "Yes": [["Chris  A.  Brown", "129795", "Republican", "NJ", "2"], ["Stephen  M. 'Steve'  Sweeney", "55120", "Democratic", "NJ", "3"], ["James 'Jim'  Beach", "110944", "Democratic", "NJ", "6"], ["Dawn  Marie  Addiego", "69709", "Democratic", "NJ", "8"], ["Vin  Gopal", "129810", "Democratic", "NJ", "11"], ["Linda  R.  Greenstein", "22544", "Democratic", "NJ", "14"], ["Christopher 'Kip'  Bateman", "4194", "Republican", "NJ", "16"], ["Robert  G. 'Bob'  Smith", "4201", "Democratic", "NJ", "17"], ["Patrick  J.  Diegnan\n                  Jr.", "55104", "Democratic", "NJ", "18"], ["Joseph  F.  Vitale", "24731", "Democratic", "NJ", "19"], ["Joseph  P. 'Joe'  Cryan", "55122", "Democratic", "NJ", "20"], ["Nicholas  P.  Scutari", "43083", "Democratic", "NJ", "22"], ["Richard  J.  Codey", "4172", "Democratic", "NJ", "27"], ["Ronald  L.  Rice", "4174", "Democratic", "NJ", "28"], ["M.  Teresa  Ruiz", "69688", "Democratic", "NJ", "29"], ["Sandra  Bolden  Cunningham", "69701", "Democratic", "NJ", "31"], ["Nicholas  J. 'Nick'  Sacco", "4467", "Democratic", "NJ", "32"], ["Brian  P.  Stack", "43373", "Democratic", "NJ", "33"], ["Nia  H.  Gill", "4433", "Democratic", "NJ", "34"], ["Nellie  Pou", "15181", "Democratic", "NJ", "35"], ["Loretta  L.  Weinberg", "4204", "Democratic", "NJ", "37"], ["Joseph  A.  Lagana", "145269", "Democratic", "NJ", "38"]], "Did Not Vote": [["Fred  H.  Madden\n                  Jr.", "43313", "Democratic", "NJ", "4"], ["Nilsa  I.  Cruz-Perez", "4472", "Democratic", "NJ", "5"], ["Troy  Singleton", "129802", "Democratic", "NJ", "7"], ["Shirley  K.  Turner", "4452", "Democratic", "NJ", "15"]], "NA": []}, "synopsis": "Vote to pass a bill that requires plastic containers and packaging include a minimum amount of recycled materials.", "link": "https://justfacts.votesmart.org/bill/31619/82278/requires-plastic-containers-and-packaging-to-include-recycled-materials", "name": "S 2515 - Requires Plastic Containers and Packaging to Include Recycled Materials - New Jersey Key Vote", "pg": "Highlights: Defines “department” as the Department of Environmental Protection (Sec. 1). Requires each rigid plastic container sold, offered for sale, or used in association with the sale or offer for sale of a product in the State by a manufacturer to (Sec. 2.a): Contain at least 35 percent recycled content; or Be made of a plastic that is being recycled in the State at a rate of 35 percent. Exempts a rigid plastic container from the requirements above if it (Sec. 2.c): Is a plastic beverage container, to which the requirements of section 3 of this act apply; Contains drugs, medical devices, medical food, or infant formula; Contains toxic or hazardous products regulated by the Federal Insecticide, Fungicide, and Rodenticide Act; Is associated with a product produced in or brought into the State that is destined for shipment to other destinations outside the State and that remains with the product upon shipment; Is necessary to provide tamper-resistant seals for public health purposes; Is a source reduced package; or Is a refillable container or a reusable container. Prohibits the department from enforcing the provisions of this law during the first full calendar year after the department determines, for the first time, that the recycling rate for rigid plastic containers is less than 35 percent (Sec. 2.f). Requires each plastic beverage container sold, offered for sale, or filled with a beverage sold or offered for sale in the State by a manufacturer shall contain at least 10 percent recycled content from January 1, 2022, through December 31, 2025 (Sec. 3.a). Requires each glass container sold, offered for sale, or filled with a food or beverage sold or offered for sale in the State by a manufacturer to contain at least 35 percent recycled content; except that, if a manufacturer demonstrates to the satisfaction of the department that its use of recycled content is made up of at least 50 percent mixed-color cullet, then the manufacturer will use at least 25 percent recycled content in the manufacturing of its glass containers Sec. 4.a). Requires each paper carryout bag sold or offered for sale in the State by a manufacturer to (Sec. 5): Contain at least 40 percent recycled content; except that a paper carryout bag that holds 8 pounds or less to contain at least 20 percent recycled content; and Have printed on the bag the name of the manufacturer, the country where the bag was manufactured, and the percentage of recycled content in the bag. Authorizes a manufacturer to apply to the department for a waiver from, or reduction in, the recycled content requirements. The department may approve, in writing, a waiver or other relief pursuant to this section if the manufacturer demonstrates, and the department finds, that it is not technologically feasible for the manufacturer to achieve the recycled content requirements, or the manufacturer cannot achieve the recycled content requirements due to a lack of available recycled material or other market conditions (Sec. 8). Establishes any person who violates the provisions of this act, or any rule or regulation adopted pursuant thereto, shall be subject to a civil administrative penalty of not more than $10,000. If the violation is of a continuing nature, each day during which the violation continues will constitute an additional, separate, and distinct offense (Sec. 11.a)."}