{"votes": {"No": [["Lester  G.  Jackson\n                  III", "17540", "Democratic", "GA", "2"], ["Curt  B.  Thompson\n                  II", "11761", "Democratic", "GA", "5"], ["Emanuel  Davie  Jones", "31536", "Democratic", "GA", "10"], ["Freddie  Powell  Sims", "31367", "Democratic", "GA", "12"], ["John  Dickey 'Dick'  Crosby", "110527", "Republican", "GA", "13"], ["Ed  Harbison", "7804", "Democratic", "GA", "15"], ["David  E.  Lucas\n                  Sr.", "7925", "Democratic", "GA", "26"], ["Steve  Thompson", "8204", "Democratic", "GA", "33"], ["Valencia  M.  Seay", "32093", "Democratic", "GA", "34"], ["Donzella  J.  James", "7809", "Democratic", "GA", "35"], ["Nancy  Grogan 'Nan'  Orrock", "7940", "Democratic", "GA", "36"], ["Horacena  Tate", "17558", "Democratic", "GA", "38"], ["Vincent  D.  Fort", "12211", "Democratic", "GA", "39"], ["Fran  Millar", "17494", "Republican", "GA", "40"], ["Steve  Henson", "7805", "Democratic", "GA", "41"], ["Ronald  B.  Ramsey\n                  Sr.", "66999", "Democratic", "GA", "43"], ["Gail  Davenport", "66317", "Democratic", "GA", "44"], ["Gloria  S.  Butler", "17612", "Democratic", "GA", "55"]], "Yes": [["Earl  L. 'Buddy'  Carter", "32085", "Republican", "GA", "1"], ["William  T.  Ligon\n                  Jr.", "122305", "Republican", "GA", "3"], ["Jack  Hill", "7806", "Republican", "GA", "4"], ["Hunter  B.  Hill", "105118", "Republican", "GA", "6"], ["Tyler  Harper", "140252", "Republican", "GA", "7"], ["Tim  Golden", "7887", "Republican", "GA", "8"], ["Don  Balfour", "7782", "Republican", "GA", "9"], ["Kenneth  K. 'Dean'  Burke", "17696", "Republican", "GA", "11"], ["Bruce  Thompson", "145367", "Republican", "GA", "14"], ["Ronnie  Chance", "31979", "Republican", "GA", "16"], ["Rick  Jeffares", "115262", "Republican", "GA", "17"], ["Cecil  Staton", "31913", "Republican", "GA", "18"], ["Tommie  Williams", "17516", "Republican", "GA", "19"], ["Thorborn 'Ross'  Tolleson\n                  Jr.", "31740", "Republican", "GA", "20"], ["Brandon  Beach", "122717", "Republican", "GA", "21"], ["Jesse  Stone", "122651", "Republican", "GA", "23"], ["William  S. 'Bill'  Jackson", "11787", "Republican", "GA", "24"], ["Burt  Jones", "140261", "Republican", "GA", "25"], ["Jack  Murphy", "31337", "Republican", "GA", "27"], ["Mike  Crane", "31998", "Republican", "GA", "28"], ["Joshua 'Josh'  McKoon", "122186", "Republican", "GA", "29"], ["Michael 'Mike'  Dugan", "143535", "Republican", "GA", "30"], ["William  D. 'Bill'  Heath\n                  Jr.", "31932", "Republican", "GA", "31"], ["Judson  Hill", "32115", "Republican", "GA", "32"], ["Lindsey  Tippins", "122669", "Republican", "GA", "37"], ["Jason  J.  Carter", "122512", "Democratic", "GA", "42"], ["Renee  S.  Unterman", "17700", "Republican", "GA", "45"], ["Bill  Cowsert", "31562", "Republican", "GA", "46"], ["Frank  Ginn", "122693", "Republican", "GA", "47"], ["David  Shafer", "31920", "Republican", "GA", "48"], ["Cecil  Terrell 'Butch'  Miller", "122513", "Republican", "GA", "49"], ["John  K.  Wilkinson", "135384", "Republican", "GA", "50"], ["Steve  Gooch", "82557", "Republican", "GA", "51"], ["Chuck  Hufstetler", "140281", "Republican", "GA", "52"], ["Jeff  E.  Mullis", "17715", "Republican", "GA", "53"], ["Charles  Jones 'Charlie'  Bethel", "112648", "Republican", "GA", "54"], ["John  Albers", "122715", "Republican", "GA", "56"]], "Did Not Vote": [["Hardie  Davis\n                  Jr.", "66319", "Democratic", "GA", "22"]], "NA": []}, "synopsis": "Vote to concur with House amendments and adopt additional amendments to a bill that amends firearm laws.", "link": "https://justfacts.votesmart.org/bill/17646/47197/amends-firearm-laws", "name": "HB 60 - Amends Firearm Laws - Georgia Key Vote", "pg": "Highlights: Authorizes an official of an elementary, secondary, university, or other post-secondary school to permit in writing certain licensed individuals to carry a “weapon” within a school safety zone, at a school function, or on a transportation service furnished by the school (Sec. 1.6). Defines “weapon” as including, but not limited to, a pistol or revolver (Sec. 1.9). Requires any individual selected to possess or carry weapons within a school safety zone, at a school function or on a transportation service furnished by a school to be a licensed carry holder and pass a criminal history background check annually conducted by the local board of education to determine whether the individual remains qualified to be a licensed holder (Sec. 1.9). Prohibits any local board of education or school administration from being required to implement a program that allows for an individual to carry a weapon in a school safety zone, a school function, or on a transportation service provided by the school (Sec. 1.9). Authorizes each individual local board of education or school administrator to allow certain personnel to possess a weapon if the following are provided (Sec. 1.9): Training prior to authorizing an individual to carry a weapon; The approved list of the types of weapons and ammunition and the quantity of weapons and ammunition to be possessed or carried; The exclusion from approval for any individual who had an employment or other history indicating any type of mental or emotional instability; and A mandatory method of securing weapons which must include at minimum that the weapon must be carried on the individual and not in a purse, briefcase, bag, or other similar accessory. Authorizes a licensed individual to carry a weapon in a government building when the building is open for business and when access into such building is not restricted or screened by security personnel (Sec. 1.5). Authorizes a licensed individual to carry a weapon in a place of worship if the governing body or authority of the place permits the carrying of weapons by licensed holders (Sec. 1.5). Specifies that a license holder who violates the provisions of this bill in a place of worship will not be arrested but fined up to $100 (Sec. 1.5). Authorizes a licensed individual to carry a weapon in the following public access areas of an airport (Sec. 1.9): The airport drive; The general parking area; The walkway; or The shops and areas around the terminal that are outside the screening checkpoint. Specifies that an individual who immediately exits after being notified that he or she is carrying a weapon in a restricted airport area is not guilty of violating any prohibition on carrying the weapon in the restricted area (Sec. 1.9). Specifies that any ordinance or regulation approved by any county or municipality that is in conflict with the weapons in airports provision of this bill will be considered void (Sec. 1.9). Authorizes the use of silencers or suppressors for hunting in the following locations (Sec. 1.2A): The private property of the individual using a silencer or a suppressor; The private property of an individual that has provided verifiable permission for an individual to use a silencer or suppressor; or The specifically designated areas of public lands. Specifies that the hunting privileges of an individual in violation of the provisions of this bill regarding hunting will be suspended for 3 years (Sec. 1.2A). Repeals the prohibition on the carrying of a weapon in a bar or a place that serves alcoholic beverages (Sec. 1.5). Prohibits the issuing of a weapons carrying license to any individual under the age of 21 unless the individual is over the age of 18 and is a current or honorably discharged member of the United States military (Sec. 1.7). Prohibits the creation of a multijurisdictional data base of information regarding individuals issued weapons carry licenses (Sec. 1.7). Authorizes a private property owner or an individual in control of a private property to prohibit, exclude, or “eject” any individual who is in possession of a weapon or long gun on the owner’s private property (Sec. 1.4). Classifies a violation of the provisions of this bill as a misdemeanor (Secs. 1.2, 1.6, 1.7, 1.9, 1.10)."}