{"status": "OK", "bill": {"bill_id": 120863, "change_hash": "fffcdfc155db4a42de018fca3472dfdc", "session_id": 50, "session": {"session_id": 50, "state_id": 8, "year_start": 2009, "year_end": 2010, "prefile": 0, "sine_die": 1, "prior": 1, "special": 0, "session_tag": "Regular Session", "session_title": "2009-2010 Regular Session", "session_name": "145th General Assembly"}, "url": "https://legiscan.com/DE/bill/HB19/2009", "state_link": "http://legis.delaware.gov/LIS/lis145.nsf/2bede841c6272c888025698400433a04/f97681d196d4872385257571004e64f1?OpenDocument", "completed": 1, "status": 4, "status_date": "2009-04-10", "progress": [{"date": "2009-03-10", "event": 1}, {"date": "2009-03-10", "event": 9}, {"date": "2009-03-18", "event": 2}, {"date": "2009-03-24", "event": 9}, {"date": "2009-04-08", "event": 3}, {"date": "2009-04-10", "event": 4}], "state": "DE", "state_id": 8, "bill_number": "HB19", "bill_type": "B", "bill_type_id": "1", "body": "H", "body_id": 25, "current_body": "H", "current_body_id": 25, "title": "An Act To Amend Title 8 Of The Delaware Code Relating To The General Corporation Law.", "description": "Section 1. New Section 112 clarifies that the bylaws may require that if the corporation solicits proxies with respect to an election of directors, the corporation may be required to include in its proxy materials one or more nominees submitted by stockholders in addition to individuals nominated by the board of directors. Section 112 also identifies a non-exclusive list of conditions that the bylaws may impose on such a right of access to the corporation’s proxy materials. In particular, and in the interest of avoiding election contests instituted by stockholders having little or no economic interest in the corporation, Section 112 authorizes the bylaws to prescribe a minimum level of stock ownership as a prerequisite to requiring inclusion of nominees in the corporation’s proxy materials. In establishing such a minimum level of stock ownership, the bylaws may define beneficial ownership to take account of ownership of options or other rights in respect of or relating to stock (including rights that derive their value from the market price of the stock). Section 112 also permits the bylaws to limit a right of access according to whether or not a majority of board seats is to be contested, or whether nominations are related to an acquisition of a significant percentage of the corporation’s stock. The bylaws may also prescribe any other lawful condition to the exercise of a right of access to the corporation’s proxy materials. Section 2. New Section 113 provides that a bylaw may require the corporation to reimburse proxy solicitation expenses incurred by a stockholder. Section 113 also identifies a non-exclusive list of conditions that the bylaws may impose on such a right to reimbursement. Section 3. The amendment to Section 145(f) adopts a default rule different than the approach articulated in Schoon v. Troy Corp., 948 A.2d 1157, 1165-1166 (Del. Ch. 2008). Under amended Section 145(f), a right to indemnification or advancement of expenses under a provision of a certificate of incorporation or bylaw cannot be eliminated or impaired by an amendment of the provision after the occurrence of the act or omission to which indemnification or advancement of expenses relates, unless the provision contains, at the time of the act or omission, an explicit authorization of such elimination or limitation. Section 4. This section amends Section 211(c) to reflect the changes in Section 213(a) providing for separate record dates for determining stockholders entitled to notice of and to vote at a meeting. Section 5. This amendment to Section 213(a) permits a board of directors to separate the record date for determining the stockholders entitled to vote at a meeting from the record date for determining those stockholders entitled to notice of the meeting. Under amended Section 213(a), the board of directors may chose a date later than the notice record date, on or before the meeting date, for determining those stockholders entitled to vote. This amendment is not intended to affect application of the doctrine expressed in Schnell v. Chris-Craft Indus., Inc., 285 A.2d 437 (Del. 1971). Section 6. This section amends Section 219(a) to clarify that, where the record date for determining stockholders entitled to vote is set less then ten days before the date of the meeting as provided for under Section 213(a), the corporation’s obligation to provide a list of stockholders prior to the meeting is limited to preparing a list of those holders as of the tenth day before the meeting date. The amendment does not affect the list that must be provided at the meeting. Sections 7 through 9. These amendments to Section 222 reflect the changes in Section 213(a) permitting separate record dates for determining stockholders entitled to notice of and to vote at a meeting. The amended subsection (a) provides that where the board of directors fixes separate record dates, written notice under that subsection shall include the record date for determining stockholders entitled to vote. In addition, subsection (b) is amended to make clear that the timing requirements for providing written notice remain unchanged in that instance and that the corporation need only provide written notice to those stockholders entitled to vote as of the notice record date. Finally, the new sentence added to subsection (c) provides that where the board of directors sets a new record date for determining stockholders entitled to vote at an adjourned meeting, the board will be required to set a new notice record date in accordance with Section 213(a) and provide written notice to stockholders entitled to vote as of that date. Section 10. This section, which adds a new subsection (c) to Section 225, changes existing law by granting to the Court of Chancery the power to remove directors under specified limited circumstances. An application for judicial removal of a director must be brought directly by or derivatively in the right of the corporation. Such an application must be preceded by either a felony conviction or a judgment of the sort specified in the new subsection. Removal of a director is permitted only when the Court determines that the director did not act in good faith and that judicial removal is necessary to avoid irreparable harm to the corporation. Section 11. This section is a technical amendment to Section 228(e) to make it consistent with the revisions to Section 213(a). Sections 12 and 13. These sections are technical amendments to Section 262 to make it consistent with the revisions to Section 213(a). Section 14. This section amends Section 275(a) to make it consistent with the revisions to Sections 213(a) and 222 by requiring notice only be mailed to those stockholders entitled to vote as of the notice record date. Section 15. Section 15 provides for an effective date of August 1, 2009.", "pending_committee_id": 0, "committee": [], "referrals": [{"date": "2009-03-10", "committee_id": 1658, "chamber": "H", "chamber_id": 25, "name": "Judiciary"}, {"date": "2009-03-24", "committee_id": 1684, "chamber": "S", "chamber_id": 26, "name": "Judiciary"}], "history": [{"date": "2009-03-10", "action": "Introduced and Assigned to Judiciary Committee in House", "chamber": "", "chamber_id": 0, "importance": 1}, {"date": "2009-03-17", "action": "Reported Out of Committee (JUDICIARY) in House with 6 Favorable, 1 On Its Merits", "chamber": "", "chamber_id": 0, "importance": 0}, {"date": "2009-03-18", "action": "Passed by House of Representatives. Votes: Passed 38 YES 0 NO 0 NOT VOTING 3 ABSENT 0 VACANT", "chamber": "", "chamber_id": 0, "importance": 1}, {"date": "2009-03-24", "action": "Assigned to Judiciary Committee in Senate", "chamber": "", "chamber_id": 0, "importance": 1}, {"date": "2009-04-01", "action": "Reported Out of Committee (JUDICIARY) in Senate with 5 On Its Merits", "chamber": "", "chamber_id": 0, "importance": 0}, {"date": "2009-04-08", "action": "Passed by Senate. Votes: Passed 21 YES 0 NO 0 NOT VOTING 0 ABSENT 0 VACANT", "chamber": "", "chamber_id": 0, "importance": 1}, {"date": "2009-04-10", "action": "Signed by Governor", "chamber": "", "chamber_id": 0, "importance": 1}], "sponsors": [{"people_id": 4414, "person_hash": "hina1z9v", "party_id": "1", "state_id": 8, "party": "D", "role_id": 1, "role": "Rep", "name": "James Johnson", "first_name": "James", "middle_name": "", "last_name": "Johnson", "suffix": "", "nickname": "", "district": "HD-016", "ftm_eid": 12998441, "votesmart_id": 30677, "opensecrets_id": "", "knowwho_pid": 227087, "ballotpedia": "James_Johnson_(Delaware)", "sponsor_type_id": 0, "sponsor_order": 0, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 4437, "person_hash": "nxj8gb7h", "party_id": "1", "state_id": 8, "party": "D", "role_id": 2, "role": "Sen", "name": "Anthony DeLuca", "first_name": "Anthony", "middle_name": "J.", "last_name": "DeLuca", "suffix": "", "nickname": "", "district": "SD-011", "ftm_eid": 6415686, "votesmart_id": 17259, "opensecrets_id": "", "knowwho_pid": 193421, "ballotpedia": "Anthony_DeLuca,_Delaware_Senator", "sponsor_type_id": 0, "sponsor_order": 0, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 4439, "person_hash": "mljs26bo", "party_id": "2", "state_id": 8, "party": "R", "role_id": 1, "role": "Rep", "name": "Thomas Kovach", "first_name": "Thomas", "middle_name": "H.", "last_name": "Kovach", "suffix": "", "nickname": "", "district": "HD-006", "ftm_eid": 6696649, "votesmart_id": 110895, "opensecrets_id": "", "knowwho_pid": 299459, "ballotpedia": "Tom_Kovach_(Delaware)", "sponsor_type_id": 0, "sponsor_order": 0, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}, {"people_id": 4465, "person_hash": "saeqrrb2", "party_id": "0", "state_id": 8, "party": "", "role_id": 1, "role": "Rep", "name": "George", "first_name": "", "middle_name": "", "last_name": "George", "suffix": "", "nickname": "", "district": "", "ftm_eid": 0, "votesmart_id": 0, "opensecrets_id": "", "knowwho_pid": 0, "ballotpedia": "", "sponsor_type_id": 0, "sponsor_order": 0, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}], "sasts": [], "subjects": [], "texts": [{"doc_id": 369812, "date": "2011-11-09", "type": "Draft", "type_id": 9, "mime": "text/html", "mime_id": 1, "url": "https://legiscan.com/DE/text/HB19/id/369812", "state_link": "http://legis.delaware.gov/LIS/lis146.nsf/vwLegislation/HB+19/$file/legis.html?open", "text_size": 149033, "text_hash": "71f80511d6d46c5c84401ae7e358a146"}], "votes": [{"roll_call_id": 107106, "date": "2009-03-18", "desc": "House Third Reading", "yea": 38, "nay": 0, "nv": 0, "absent": 3, "total": 41, "passed": 1, "chamber": "H", "chamber_id": 25, "url": "https://legiscan.com/DE/rollcall/HB19/id/107106", "state_link": "http://legis.delaware.gov/LIS/lis145.nsf/7712cf7cc0e9227a852568470077336f/01e6ef0b2aa5fd488525757d006c46d6?OpenDocument"}, {"roll_call_id": 107107, "date": "2009-04-08", "desc": "Senate Third Reading", "yea": 21, "nay": 0, "nv": 0, "absent": 0, "total": 21, "passed": 1, "chamber": "S", "chamber_id": 26, "url": "https://legiscan.com/DE/rollcall/HB19/id/107107", "state_link": "http://legis.delaware.gov/LIS/lis145.nsf/7712cf7cc0e9227a852568470077336f/d9f5157b826dc3758525759200740889?OpenDocument"}], "amendments": [], "supplements": [], "calendar": []}}