{"status": "OK", "bill": {"bill_id": 1568190, "change_hash": "e8f92a1c8db7a836d09a2fa1b7b9296f", "session_id": 1918, "session": {"session_id": 1918, "state_id": 46, "year_start": 2022, "year_end": 2022, "prefile": 0, "sine_die": 1, "prior": 0, "special": 0, "session_tag": "Regular Session", "session_title": "2022 Regular Session", "session_name": "2022 Regular Session"}, "url": "https://legiscan.com/VA/bill/SB735/2022", "state_link": "https://lis.virginia.gov/cgi-bin/legp604.exe?221+sum+SB735", "completed": 0, "status": 1, "status_date": "2022-01-21", "progress": [{"date": "2022-01-21", "event": 1}, {"date": "2022-01-21", "event": 9}], "state": "VA", "state_id": 46, "bill_number": "SB735", "bill_type": "B", "bill_type_id": "1", "body": "S", "body_id": 8, "current_body": "S", "current_body_id": 8, "title": "Diversity, Opportunity, & Inclusion, Dir. of; renames Director of Diversity, Equity, & Inclusion.", "description": "Renaming Director of Diversity, Equity, and Inclusion as Director of Diversity, Opportunity, and Inclusion. Renames the Director of Diversity, Equity, and Inclusion to the Director of Diversity, Opportunity, and Inclusion. The Director shall i) develop a sustainable framework to promote inclusive practices across state government; (ii) implement a measurable, strategic plan to increase opportunities for all Virginians; (iii) facilitate methods to turn feedback and suggestions from state employees, external stakeholders, and community leaders into actionable opportunities; (iv) promote ideas, policies, and practices in coordination with the Secretary of Commerce and Trade to expand entrepreneurship and economic opportunities for disadvantaged Virginians, including Virginians living with disabilities; (v) facilitate bringing Virginians of different faiths together in service to their communities and the Commonwealth; (vi) promote free speech and civil discourse in civic life, including viewpoint diversity in higher education in coordination with the Secretary of Education; (vii) promote ideas, policies, and practices to eliminate disparities in prenatal care and to be an ambassador for unborn children; (viii) coordinate with the Secretary of Education to ensure the history of the United States is taught in Virginia honestly, objectively, and completely and to respond to the rights of parents in educational and curricular decision making; and (ix) perform any other responsibilities as assigned by the Governor. The bill makes similar renaming changes for the Office of Diversity, Equity, and Inclusion and the Diversity, Equity, and Inclusion Officer. Renaming Director of Diversity, Equity, and Inclusion as Director of Diversity, Opportunity, and Inclusion. Renames the Director of Diversity, Equity, and Inclusion to the Director of Diversity, Opportunity, and Inclusion. The Director shall i) develop a sustainable framework to promote inclusive practices across state government; (ii) implement a measurable, strategic plan to increase opportunities for all Virginians; (iii) facilitate methods to turn feedback and suggestions from state employees, external stakeholders, and community leaders into actionable opportunities; (iv) promote ideas, policies, and practices in coordination with the Secretary of Commerce and Trade to expand entrepreneurship and economic opportunities for disadvantaged Virginians, including Virginians living with disabilities; (v) facilitate bringing Virginians of different faiths together in service to their communities and the Commonwealth; (vi) promote free speech and civil discourse in civic life, including viewpoint diversity in higher education in coordination with the Secretary of Education; (vii) promote ideas, policies, and practices to eliminate disparities in prenatal care and to be an ambassador for unborn children; (viii) coordinate with the Secretary of Education to ensure the history of the United States is taught in Virginia honestly, objectively, and completely and to respond to the rights of parents in educational and curricular decision making; and (ix) perform any other responsibilities as assigned by the Governor. The bill makes similar renaming changes for the Office of Diversity, Equity, and Inclusion and the Diversity, Equity, and Inclusion Officer.", "pending_committee_id": 0, "committee": [], "referrals": [{"date": "2022-01-21", "committee_id": 165, "chamber": "S", "chamber_id": 8, "name": "General Laws and Technology"}], "history": [{"date": "2022-01-21", "action": "Presented and ordered printed 22103625D", "chamber": "S", "chamber_id": 8, "importance": 0}, {"date": "2022-01-21", "action": "Referred to Committee on General Laws and Technology", "chamber": "S", "chamber_id": 8, "importance": 1}, {"date": "2022-01-26", "action": "Passed by indefinitely in General Laws and Technology (8-Y 7-N)", "chamber": "S", "chamber_id": 8, "importance": 0}], "sponsors": [{"people_id": 789, "person_hash": "9ju7o265", "party_id": "2", "state_id": 46, "party": "R", "role_id": 2, "role": "Sen", "name": "Frank Ruff", "first_name": "Frank", "middle_name": "M.", "last_name": "Ruff", "suffix": "Jr.", "nickname": "", "district": "SD-015", "ftm_eid": 6571545, "votesmart_id": 5188, "opensecrets_id": "", "knowwho_pid": 199483, "ballotpedia": "Frank_Ruff", "sponsor_type_id": 1, "sponsor_order": 1, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}], "sasts": [], "subjects": [{"subject_id": 174, "subject_name": "Administration of Government"}, {"subject_id": 213, "subject_name": "Education"}], "texts": [{"doc_id": 2487567, "date": "2022-01-21", "type": "Introduced", "type_id": 1, "mime": "text/html", "mime_id": 1, "url": "https://legiscan.com/VA/text/SB735/id/2487567", "state_link": "https://lis.virginia.gov/cgi-bin/legp604.exe?221+ful+SB735+hil", "text_size": 72721, "text_hash": "8eef59430ea332f60488711d77b72ded"}], "votes": [{"roll_call_id": 1129158, "date": "2022-01-26", "desc": "Senate: Passed by indefinitely in General Laws and Technology (8-Y 7-N)", "yea": 8, "nay": 7, "nv": 0, "absent": 0, "total": 15, "passed": 1, "chamber": "S", "chamber_id": 8, "url": "https://legiscan.com/VA/rollcall/SB735/id/1129158", "state_link": "https://lis.virginia.gov/cgi-bin/legp604.exe?221+vot+S12V0042+SB0735"}], "amendments": [], "supplements": [{"supplement_id": 228598, "date": "2022-01-26", "type": "Fiscal Note/Analysis", "type_id": 3, "title": "Fiscal Note/Analysis", "description": "Senate: Presented and ordered printed 22103625D", "mime": "application/pdf", "mime_id": 2, "url": "https://legiscan.com/VA/supplement/SB735/id/228598", "state_link": "https://lis.virginia.gov/cgi-bin/legp604.exe?221+oth+SB735F122+PDF", "supplement_size": 73132, "supplement_hash": "9b31f79b7d9e2ff0b48ddf7a11c21413"}], "calendar": [{"type_id": 1, "type": "Hearing", "date": "2022-01-26", "time": "00:00", "location": "", "description": "Senate Committee on General Laws and Technology Hearing"}]}}