{"status": "OK", "bill": {"bill_id": 788016, "change_hash": "58bf8cb48e5e8d74db77a1978999b196", "session_id": 1156, "session": {"session_id": 1156, "state_id": 52, "year_start": 2015, "year_end": 2016, "prefile": 0, "sine_die": 1, "prior": 1, "special": 0, "session_tag": "Regular Session", "session_title": "2015-2016 Regular Session", "session_name": "114th Congress"}, "url": "https://legiscan.com/US/bill/SB1837/2015", "state_link": "https://www.congress.gov/bill/114th-congress/senate-bill/1837/all-info", "completed": 0, "status": 1, "status_date": "2015-07-22", "progress": [{"date": "2015-07-22", "event": 1}, {"date": "2015-07-22", "event": 9}], "state": "US", "state_id": 52, "bill_number": "SB1837", "bill_type": "B", "bill_type_id": "1", "body": "S", "body_id": 115, "current_body": "S", "current_body_id": 115, "title": "Drought Recovery and Resilience Act of 2015", "description": "Drought Recovery and Resilience Act of 2015 TITLE I--EMERGENCY DROUGHT RESPONSE APPROPRIATIONS FROM RECLAMATION FUND This bill provides emergency supplemental appropriations for FY2015 from the Reclamation Fund to the Department of the Interior, the Environmental Protection Agency (EPA), the Department of Agriculture (USDA), the Department of Justice (DOJ), and the Army Corps of Engineers for water projects, programs, grants, or loans in states impacted by drought. Interior is provided additional amounts for the Bureau of Reclamation (Reclamation), including amounts for water reclamation and reuse projects, the WaterSMART program under the Reclamation States Emergency Drought Relief Act of 1991, and water acquisition, water conveyance, and facilities construction under the Refuge Water Supply Program. The EPA is provided additional amounts for cleanup of polluted groundwater supplies, capitalization grants for state water pollution control revolving funds and for drinking water treatment revolving loan funds, and loans under the Water Infrastructure Finance and Innovation Act of 2014. USDA is provided additional amounts for: (1) the Rural Utilities Service for direct and guaranteed loans and grants for rural water, wastewater, and waste disposal programs; and (2) emergency grants, upon declaration of a natural disaster, to assist low-income migrant and seasonal farmworkers to address impacts of drought. Additional amounts are also provided to: DOJ for the Drug Enforcement Administration to assist state or local law enforcement agencies in the suppression of cannabis operations; the Army Corps to carry out the Water Resources and Development Act of 2007; and projects under the Land and Water Conservation Fund Act of 1965 in drought-affected states that reduce fire risk, improve water quality or downstream water quantity, or expand ground water recharge capacity. TITLE II--NEW WATER INFRASTRUCTURE PROGRAM AUTHORIZATIONS National Water Recycling and Reclamation Act of 2015 The EPA must establish a National Water Recycling and Reclamation Program to provide private or governmental entities with grants for up to 80% of the costs for water recycling and reclamation projects for which eligible costs are anticipated to exceed $1 million. Selection criteria for such grants include the extent to which projects address water demand and supply, environmental protection, and federal return on investment through renewable water supplies. Reclamation Infrastructure Finance and Innovation Act or RIFIA Interior may provide financial assistance, such as secured loans or loan guarantees, to private entities, state or local governments, irrigation districts, water users' associations, or other entities that contract with the United States under federal reclamation law to carry out water projects within the 17 western states served by Reclamation, other states where Reclamation is authorized to provide project assistance, Alaska, and Hawaii. Projects eligible for assistance include: reclamation and reuse of municipal, industrial, domestic, and agricultural wastewater and naturally impaired ground; water infrastructure projects that would contribute to a safe, adequate water supply for domestic, agricultural, environmental, or municipal and industrial use; new water conduits, pipelines, canals, pumping or power facilities; energy efficiency projects; accelerated repair and replacement of aging water distribution facilities; brackish or sea water desalination; or acquisition of real property or an interest therein for water storage, reclaimed or recycled water, or wastewater that is integral to an authorized project. Priority must be given to projects that promote wastewater recycling, agricultural or urban water conservation and efficiency, stormwater capture, or other innovations that reduce reliance on surface and groundwater supplies. To be eligible for assistance, eligible project costs of a project and other projects in a watershed must be reasonably anticipated to be at least $10 million. The interest of a secured loan may not be more than the yield on Treasury securities of a similar maturity. Interior may sell or reoffer into the capital markets a secured loan after the substantial completion of the project. The final maturity date of a secured loan may not be later than 35 years after the expected date of substantial completion of the underlying project. Interior may also enter into cost-shared financial assistance agreements with nonfederal entities in the 17 Reclamation-served western states or Hawaii to carry out the planning, design, and construction of any permanent water storage and conveyance facility used solely to regulate and maximize the water supply arising from a project that is eligible for assistance, including recycled water projects not congressionally authorized, to: (1) recycle wastewater or ground water, or (2) use integrated and coordinated water management on a watershed or regional scale. The federal share of the cost of such a project shall be: (1) nonreimbursable, and (2) the lesser of 50% of the total cost or $15 million (adjusted for inflation). Reclamation Title Transfer Act of 2015 Reclamation may establish a program that: (1) identifies and analyzes the potential for public benefits from the transfer of eligible facilities out of federal ownership, and (2) facilitates the transfer of such facilities to qualifying entities to promote more efficient management of water and water-related facilities. \"Eligible facilities\" is defined as reclamation projects or facilities (including dams and appurtenant works, infrastructure, recreational facilities, buildings, distribution and drainage works, and associated land or interests in land or water) for which the United States holds title and that meet the criteria for potential transfer. A \"qualifying entity\" is a state, local government, Indian tribe, municipal or quasi-municipal corporation, or other entity (such as a water district) that has the capacity to continue to manage the conveyed property for the same purposes that the property has been managed under the reclamation laws. Reclamation may convey an eligible facility to a qualifying entity if Congress is notified before the conveyance and does not disapprove. A right of first refusal is granted to a qualifying entity that is operating an eligible facility at the time conveyance is being considered. The bill terminates Reclamation's authority to carry out such conveyances 15 years after this Act's enactment. Innovative Stormwater Infrastructure Act of 2015 The EPA must provide grants to eligible higher education institutions and research institutions to establish and maintain between three and five centers of excellence for innovative stormwater control infrastructure. One of the centers must be the national electronic clearinghouse center and must operate a website and a public database on the infrastructure. The EPA must provide grants for innovative stormwater control infrastructure projects and must give priority to applications from: (1) a community that has combined storm and sanitary sewers in its collection system or is low-income or disadvantaged, or (2) an eligible entity that will use at least 10% of the grant for a low-income or disadvantaged community. The EPA must ensure that: (1) EPA offices promote the use of the infrastructure in, and coordinate its integration into, permitting programs, planning efforts, research, technical assistance, and funding guidance; and (2) the EPA's Office of Water supports establishing innovative financing mechanisms in the implementation of the infrastructure. The EPA must: (1) direct EPA regional offices to promote and integrate the use of the infrastructure, and (2) promote sharing information about the infrastructure approaches. The EPA must establish an innovative stormwater control infrastructure portfolio standard consisting of voluntary, measurable goals to increase the percentage of annual water managed by entities that use the infrastructure. TITLE III--IMPROVED INFRASTRUCTURE AND WATER MANAGEMENT Restoring America's Watersheds Act of 2015 The Forest Service must establish a Water Source Protection Program within the region of the National Forest System west of the 100th Meridian. USDA is authorized to enter into water source investment partnerships with specified end water users to protect and restore the condition of National Forest watersheds that provide water to nonfederal partners. The Forest Service must establish a Watershed Condition Framework within such region to: (1) identify for restoration up to five priority watersheds in each National Forest and up to two priority watersheds in each national grassland, and (2) develop and implement a watershed restoration action plan for each priority watershed. The Forest Service must also establish a Forest Service Legacy Roads and Trails Remediation Program within such region to: carry out critical maintenance and urgent repairs and improvements on National Forest System roads, trails, and bridges; restore fish and other aquatic organism passage by removing or replacing unnatural barriers to the passage of fish and other aquatic organisms; and decommission unneeded roads and trails. The Collaborative Forest Landscape Restoration Fund is reauthorized through FY2024. Five Demonstrations of Advancing Yields by Fixing Operations of Reservoirs to Encompass Climatic and Atmospheric Science Trends Act The Department of the Army must establish up to five pilot projects to implement forecast-based reservoir operations in states with drought emergencies during water year 2015. Interior must establish a wind and solar energy leasing pilot program to conduct lease sales of certain sites located on Reclamation land for purposes of carrying out wind and solar energy projects. The bill sets forth procedures for qualified developers to bid on sites that Interior offers for lease. Interior, within five years after enactment of this Act, must determine whether to expand the pilot program to apply to all authorized Reclamation lands. The general term for issued leases is: (1) an initial term of 25 years, and (2) any additional period after the initial 25-year term during which electricity is being produced annually in commercial quantities from the lease. However, a lease term may not be more than 5 years for the placement and operation of a meteorological or data collection facility or for the development or demonstration of a new wind or solar energy technology. Interior must establish and require payment of a royalty as a condition of issued leases. The royalty must be a percentage of the gross proceeds from the sale of electricity produced on land that is the subject of the lease. Lease royalties and authorized bonuses collected by Interior must be distributed in a manner such that: 25% is paid to the states and 25% is paid to the counties within the boundaries of which the royalties or bonuses are derived; 25% is deposited into a Fish and Wildlife Restoration Fund for Interior to use or make payments to states, federal agencies, or others for protecting fish and wildlife in regions impacted by the development of hydropower by federal agencies and the development of wind or solar energy on Reclamation land; 15% is paid to state Reclamation offices during the first 15 years after enactment of this Act for purposes of reducing the number of renewable energy permits that have not been processed before the enactment of this Act; and the remainder is deposited into the general fund of the Treasury for purposes of reducing the annual federal budget deficit. The Safe Drinking Water Act is amended to require a state to operate an EPA-prescribed injection control program for underground wells if the EPA finds that the state improperly issued permits under the state's underground injection control program. DOJ must maintain a registry of incidents of cultivation of marijuana on government property or while intentionally trespassing on another's property. DOJ is authorized to use amounts from the Department of Justice Assets Forfeiture Fund to pay for costs incurred by state, local, or tribal governments in connection with the remediation of an area formerly used for the production or cultivation of marijuana in which such a government assisted in a federal prosecution related to marijuana. The bill requires court sentences for certain marijuana offenses to include an order requiring the defendant to reimburse federal, state, or local governments for costs incurred for cleanup associated with the cultivation of marijuana by the defendant or on premises or in property that the defendant owns, resides in, or does business in. The Omnibus Public Land Management Act of 2009 is amended to: (1) include \"planning for or addressing the impact of drought\" among the activities for which Reclamation may make grants and enter cooperative agreements for water management improvement, (2) include Hawaii among the states in which eligible grant and agreement applicants may be located, (3) reauthorize such grants and agreements for FY2015-FY2023, and (4) reauthorize the authority of the U.S. Geological Survey (USGS) to provide grants to state water resource agencies under the national water availability and use assessment program for FY2014-FY2023. The Internal Revenue Code is amended to establish a refundable tax credit for the purchase and installation of a qualified water-harvesting system. The Reclamation Safety of Dams Act of 1978 is amended to authorize Interior, subject to feasibility studies and other specified conditions, to develop additional project benefits (such as additional conservation storage capacity) through the construction of new or supplementary works on a project in conjunction with its authority to modify Reclamation dams and related facilities to preserve their structural safety. Interior may expend available appropriated funds for construction of a project that meets certain environmental standards, but the bill prohibits the federal cost-share from exceeding 25% of the project costs. The USGS must establish and maintain an open water data system to advance the availability, timely distribution, and widespread use of water data and information for water management, education, research, assessment, and monitoring purposes. TITLE IV--PLANNING FOR THE FUTURE Water Innovation and Prize Competition Act of 2015 The Department of Energy must establish a program to award prizes for development of water desalination technologies. The Natural Resources Conservation Service must collaborate with Reclamation to provide assistance, upon request, to water or power delivery authorities for purposes of increasing water use efficiency and providing on-farm assistance to address water quantity and water quality conservation practices. The U.S. Fish and Wildlife Service must prepare a California salmon drought plan. The President must update the National Response Plan and the National Disaster Recovery Framework to include a plan for catastrophic drought.", "pending_committee_id": 2326, "committee": {"committee_id": 2326, "chamber": "S", "chamber_id": 115, "name": "Finance"}, "referrals": [{"date": "2015-07-22", "committee_id": 2326, "chamber": "S", "chamber_id": 115, "name": "Finance"}], "history": [{"date": "2015-07-22", "action": "Read twice and referred to the Committee on Finance.", "chamber": "S", "chamber_id": 115, "importance": 1}], "sponsors": [{"people_id": 9401, "person_hash": "528jrj6c", "party_id": "1", "state_id": 52, "party": "D", "role_id": 2, "role": "Sen", "name": "Barbara Boxer", "first_name": "Barbara", "middle_name": "", "last_name": "Boxer", "suffix": "", "nickname": "", "district": "SD-CA", "ftm_eid": 2545581, "votesmart_id": 53274, "opensecrets_id": "N00006692", "knowwho_pid": 165202, "ballotpedia": "Barbara_Boxer", "sponsor_type_id": 1, "sponsor_order": 1, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}], "sasts": [{"type_id": 8, "type": "Related", "sast_bill_number": "HB2983", "sast_bill_id": 787086}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB1775", "sast_bill_id": 769361}, {"type_id": 8, "type": "Related", "sast_bill_number": "HB2749", "sast_bill_id": 785340}, {"type_id": 8, "type": "Related", "sast_bill_number": "SB896", "sast_bill_id": 769417}, {"type_id": 8, "type": "Related", "sast_bill_number": "SB1657", "sast_bill_id": 786484}, {"type_id": 8, "type": "Related", "sast_bill_number": "SB1780", "sast_bill_id": 787755}, {"type_id": 8, "type": "Related", "sast_bill_number": "SB1837", "sast_bill_id": 788016}], "subjects": [{"subject_id": 13400, "subject_name": "Advanced technology and technological innovations"}, {"subject_id": 13331, "subject_name": "Aquatic ecology"}, {"subject_id": 13541, "subject_name": "Dams and canals"}, {"subject_id": 13439, "subject_name": "Disaster relief and insurance"}, {"subject_id": 13171, "subject_name": "Education programs funding"}, {"subject_id": 13174, "subject_name": "Elementary and secondary education"}, {"subject_id": 13543, "subject_name": "Endangered and threatened species"}, {"subject_id": 13182, "subject_name": "Environmental Protection Agency (EPA)"}, {"subject_id": 13333, "subject_name": "Environmental assessment, monitoring, research"}, {"subject_id": 13528, "subject_name": "Environmental technology"}, {"subject_id": 13184, "subject_name": "Executive agency funding and structure"}, {"subject_id": 13188, "subject_name": "Fires"}, {"subject_id": 13415, "subject_name": "Fishes"}, {"subject_id": 13189, "subject_name": "Floods and storm protection"}, {"subject_id": 22687, "subject_name": "Forests, forestry, trees"}, {"subject_id": 13196, "subject_name": "Government buildings, facilities, and property"}, {"subject_id": 13200, "subject_name": "Government information and archives"}, {"subject_id": 22688, "subject_name": "Government studies and investigations"}, {"subject_id": 13203, "subject_name": "Government trust funds"}, {"subject_id": 13310, "subject_name": "Hawaii"}, {"subject_id": 13215, "subject_name": "Higher education"}, {"subject_id": 13771, "subject_name": "Hydrology and hydrography"}, {"subject_id": 13229, "subject_name": "Infrastructure development"}, {"subject_id": 13420, "subject_name": "Lakes and rivers"}, {"subject_id": 13380, "subject_name": "Land transfers"}, {"subject_id": 13425, "subject_name": "Land use and conservation"}, {"subject_id": 13442, "subject_name": "Natural disasters"}, {"subject_id": 13257, "subject_name": "Parks, recreation areas, trails"}, {"subject_id": 13671, "subject_name": "Public-private cooperation"}, {"subject_id": 13267, "subject_name": "Research administration and funding"}, {"subject_id": 13271, "subject_name": "Roads and highways"}, {"subject_id": 13287, "subject_name": "Teaching, teachers, curricula"}, {"subject_id": 13298, "subject_name": "Water quality"}, {"subject_id": 13299, "subject_name": "Water resources funding"}, {"subject_id": 13394, "subject_name": "Water use and supply"}, {"subject_id": 13300, "subject_name": "Watersheds"}, {"subject_id": 13427, "subject_name": "Wetlands"}, {"subject_id": 13337, "subject_name": "Wildlife conservation and habitat protection"}, {"subject_id": 13134, "subject_name": "Appropriations"}, {"subject_id": 13391, "subject_name": "California"}, {"subject_id": 13146, "subject_name": "Congressional oversight"}, {"subject_id": 13344, "subject_name": "Criminal procedure and sentencing"}, {"subject_id": 13345, "subject_name": "Drug trafficking and controlled substances"}, {"subject_id": 13173, "subject_name": "Electric power generation and transmission"}, {"subject_id": 13202, "subject_name": "Government lending and loan guarantees"}, {"subject_id": 13224, "subject_name": "Income tax credits"}, {"subject_id": 13236, "subject_name": "Law enforcement administration and funding"}, {"subject_id": 13899, "subject_name": "Migrant, seasonal, agricultural labor"}, {"subject_id": 13272, "subject_name": "Rural conditions and development"}, {"subject_id": 13281, "subject_name": "Solid waste and recycling"}, {"subject_id": 13390, "subject_name": "Water resources development"}], "texts": [{"doc_id": 1256778, "date": "2015-07-28", "type": "Introduced", "type_id": 1, "mime": "application/pdf", "mime_id": 2, "url": "https://legiscan.com/US/text/SB1837/id/1256778", "state_link": "https://www.congress.gov/114/bills/s1837/BILLS-114s1837is.pdf", "text_size": 487295, "text_hash": "b8d5980666d3ca0cfc352a66991d9b97"}], "votes": [], "amendments": [], "supplements": [], "calendar": []}}