{"votes": {"No": [["Brandon  Creighton", "50127", "Republican", "TX", "4"], ["Sylvia  R.  Garcia", "49734", "Democratic", "TX", "6"], ["Jane Gray  Nelson", "5451", "Republican", "TX", "12"], ["Borris  L.  Miles", "59415", "Democratic", "TX", "13"], ["Kirk  Watson", "57991", "Democratic", "TX", "14"], ["John  Whitmire", "5464", "Democratic", "TX", "15"], ["Joan  Huffman", "110896", "Republican", "TX", "17"], ["Carlos  I. 'Charlie'  Uresti", "15218", "Democratic", "TX", "19"], ["Juan 'Chuy'  Hinojosa", "10049", "Democratic", "TX", "20"], ["Judith  Zaffirini", "5465", "Democratic", "TX", "21"], ["Royce  West", "5463", "Democratic", "TX", "23"], ["José  Menéndez", "49908", "Democratic", "TX", "26"], ["Eduardo 'Eddie'  Lucio\n                  Jr.", "5445", "Democratic", "TX", "27"], ["Jose  R.  Rodriguez", "117009", "Democratic", "TX", "29"]], "Yes": [["Bryan  Hughes", "50173", "Republican", "TX", "1"], ["Bob  Hall", "147733", "Republican", "TX", "2"], ["Robert  Nichols", "59338", "Republican", "TX", "3"], ["Charles  J.  Schwertner", "116941", "Republican", "TX", "5"], ["Paul  Bettencourt", "147736", "Republican", "TX", "7"], ["Nicholas 'Van'  Taylor", "147737", "Republican", "TX", "8"], ["Kelly  Hancock", "59194", "Republican", "TX", "9"], ["Konni  Burton", "147741", "Republican", "TX", "10"], ["Larry  Taylor", "25471", "Republican", "TX", "11"], ["Don  Huffines", "147751", "Republican", "TX", "16"], ["Lois  W.  Kolkhorst", "49608", "Republican", "TX", "18"], ["Brian  Birdwell", "127373", "Republican", "TX", "22"], ["Dawn  Buckingham", "166502", "Republican", "TX", "24"], ["Donna  Sue  Campbell", "116916", "Republican", "TX", "25"], ["Charles  Lee  Perry", "116957", "Republican", "TX", "28"], ["Craig  Estes", "49388", "Republican", "TX", "30"], ["Kel  Seliger", "49550", "Republican", "TX", "31"]], "Did Not Vote": [], "NA": []}, "synopsis": "Vote to pass a bill that specifies tree removal regulations that municipalities may impose, effective December 1, 2017.", "link": "https://justfacts.votesmart.org/bill/23519/60936/specifies-tree-removal-regulations-municipalities-may-impose", "name": "HB 7 - Specifies Tree Removal Regulations Municipalities May Impose - Texas Key Vote", "pg": "Highlights: Prohibits municipal governments from regulating, in extraterritorial jurisdiction, the ability of property owners to remove a tree or vegetation from the owner’s property, except as necessary to mitigate tree-borne diseases, requiring the owner to file a notice before removing the tree or vegetation, or imposing a tree mitigation fee (Sec. 1). Defines “tree mitigation fee” as a fee imposed by a municipality regarding the removal of a tree from private property (Sec. 2). Requires municipalities that impose tree mitigation fees for tree removal on an individual’s property to allow that individual to apply for a credit for tree planting to offset the amount of the fee (Sec. 2). Requires trees planted for credit to be planted on property for which the tree mitigation fee was assessed or was mutually agreed upon by the municipality and the individual, and to be at least two inches in diameter at the point on the trunk 4.5 feet upon the ground (Sec. 2). Requires the amount of a credit provided to an individual to be applied in the same manner as the tree mitigation fee assessed against the person and be the following (Sec. 2): Equal to the amount of the tree mitigation fee if the property is an existing one or two-family dwelling that is the individual’s residence; At least half of the amount of the tree mitigation fee if the property is a residential structure that is not occupied by the person and is being constructed or renovated for sale as a residential structure not for use as the individual’s residence; or At least 40 percent of the amount of the tree mitigation fee if the property is not a residential structure or the individual is constructing or intends to construct a structure that is not residential. Prohibits the amount of a tree mitigation fee from exceeding $400 (Sec. 2). Prohibits tree mitigation fees for the removal of trees that are diseased, dead, or pose an immediate threat to persons or property (Sec. 2). Prohibits municipalities from prohibiting the removal of trees that are less than 24 inches in diameter at the point on the trunk 4.5 feet above the ground, are diseased or dead, or pose an immediate threat to persons or property (Sec. 2)."}