{"votes": {"No": [["Richard  C. 'Dick'  Cathcart", "15242", "Republican", "DE", "9"], ["Deborah  D.  Hudson", "5750", "Republican", "DE", "12"], ["William  A.  Oberle\n                  Jr.", "5770", "Republican", "DE", "24"], ["William  R. 'Bobby'  Outten", "30660", "Republican", "DE", "30"], ["Donald  A.  Blakey", "66233", "Republican", "DE", "34"], ["David  L. 'Dave'  Wilson", "109426", "Republican", "DE", "35"], ["V. George  Carey", "5751", "Republican", "DE", "36"], ["Ruth  Briggs King", "117701", "Republican", "DE", "37"], ["Gerald  W.  Hocker", "53669", "Republican", "DE", "38"], ["Daniel  B. 'Danny'  Short", "30692", "Republican", "DE", "39"], ["Clifford  G. 'Biff'  Lee", "5765", "Republican", "DE", "40"], ["John  C.  Atkins", "30668", "Democratic", "DE", "41"]], "Yes": [["Dennis  P.  Williams", "5761", "Democratic", "DE", "1"], ["Hazel  D.  Plant", "53668", "Democratic", "DE", "2"], ["Helene  M.  Keeley", "12879", "Democratic", "DE", "3"], ["Gerald  L.  Brady", "69012", "Democratic", "DE", "4"], ["Melanie  George  Smith", "30649", "Democratic", "DE", "5"], ["Thomas  H.  Kovach", "110895", "Republican", "DE", "6"], ["Bryon  H.  Short", "71370", "Democratic", "DE", "7"], ["S.  Quinton 'Quinn'  Johnson\n                  IV", "109367", "Democratic", "DE", "8"], ["Dennis  E.  Williams", "737", "Democratic", "DE", "10"], ["John  L. 'Larry'  Mitchell\n                  Jr.", "66234", "Democratic", "DE", "13"], ["Peter  C. 'Pete'  Schwartzkopf", "30709", "Democratic", "DE", "14"], ["Valerie  J.  Longhurst", "30666", "Democratic", "DE", "15"], ["James 'J.J.'  Johnson", "30677", "Democratic", "DE", "16"], ["Michael  P.  Mulrooney", "17244", "Democratic", "DE", "17"], ["Michael  A. 'Mike'  Barbieri", "69019", "Democratic", "DE", "18"], ["Robert  F.  Gilligan", "5762", "Democratic", "DE", "19"], ["Michael  J. 'Mike'  Ramone", "17267", "Republican", "DE", "21"], ["Teresa  L. 'Terry'  Schooley", "30731", "Democratic", "DE", "23"], ["John  A.  Kowalko\n                  Jr.", "30724", "Democratic", "DE", "25"], ["John  J.  Viola", "17252", "Democratic", "DE", "26"], ["Earl  G.  Jaques\n                  Jr.", "69024", "Democratic", "DE", "27"], ["William  J.  Carson\n                  Jr.", "102387", "Democratic", "DE", "28"], ["Pamela  J. 'Pam'  Thornburg", "12855", "Republican", "DE", "29"], ["Darryl  M.  Scott", "109399", "Democratic", "DE", "31"], ["E.  Bradford  Bennett", "109420", "Democratic", "DE", "32"], ["Robert  E. 'Bob'  Walls", "66231", "Democratic", "DE", "33"]], "Did Not Vote": [["Gregory  F.  Lavelle", "53654", "Republican", "DE", "11"], ["Nick  T.  Manolakos", "69021", "Republican", "DE", "20"], ["Joseph  E. 'Joe'  Miro", "17262", "Republican", "DE", "22"]], "NA": []}, "synopsis": "Vote to pass a bill that establishes Universal Recycling in Delaware.", "link": "https://justfacts.votesmart.org/bill/11379/30409/universal-recycling-and-beverage-containers", "name": "SB 234 - Universal Recycling and Beverage Containers - Delaware Key Vote", "pg": "Highlights: -Defines 'Multi-family' as 3 or more attached structures, generally intended for occupancy by individuals or families and where centralized community trash disposal and collection services are typically provided (Sec 1). -Defines 'Single Stream' as a system in which all fibers and containers are combined for collection into one container instead of being sorted into separate commodities and multiple containers (Sec 1). -Defines 'Single-family' as either a detached structure, such as a house, surrounded by open space or attached structures, such as town or row homes, generally intended for occupancy by a family and where individual trash collection services are typically provided for each structure (Sec 1). -Ceases curbside recycling services, including yard waste collection effective no later than September 15, 2011 (Sec 1). -Requires that all persons providing solid waste collection services in the State of Delaware provide (Sec 1): -Single stream curbside recycling collection services to all of their Delaware single-family residential customers at a frequency of not less than once every other week; -Source separated recycling collection services to dealers who provide on-premise sales; -All single-family residential and on-premise sales customers with a single charge for the collection of waste and recyclables on their \"waste services\" bill that is inclusive of the combined waste and recycling collection service costs; and -Notification to all customers that the single stream recycling service will be provided and instructions on participation prior to September 15, 2011. -Requires all persons providing solid waste collection services in the State of Delaware to provide (Sec 1): -Single stream recycling collection services to all of their Delaware multi-family residential customers; -Notification to the multi-family complex management that the single stream recycling service, including instructions on participation, will be provided; -A frequency of recyclables collection that shall preclude the recycling containers from overflowing and otherwise causing a nuisance; -Written justification to the Department for not providing multi-family recycling collection services. -Establishes the Delaware Recycling Fund, with the following revenue being deposited into it (Sec 1): -The Recycling Fee on the sale of beverage containers; and -The repayment of low interest loans. -Specifies that the Secretary shall use the Fund for the exclusive purpose of funding specific activities designed to enhance the state's recycling rate (Sec 1). -Establishes a competitive Recycling Grants and Low Interest Loan Program to assist persons engaged in the business of collecting, transporting, processing, or marketing recyclable materials (Sec 1). -Prohibits the sale of beverages that are in a metal container designed and constructed so that part of the container is detachable when opening the container, in containers connected to each other with plastic rings or similar devices which are not classified by the Department as biodegradable, photodegradable or recyclable or in a beverage container which is not recyclable or refillable (Sec 1). -Establishes the Recycling Public Advisory Council made of 14 members appointed by, and reporting to, the governor to advise the Department and the Authority on the following (Sec 1): -All aspects of recycling; -On the Recycling Grants and Low Interest Loan Program; -Track recycling rates; and -Institute Educational Programs. -Requires that the Department track the state's accomplishments, create public awareness through educational programs, provide local organizations with assistance in order to increase recycling, and act as the administrative support for the Council (Sec. 1). -Establishes that whoever violates this law be fined not less than $100 nor more than $500 for each day of violation and for each subsequent conviction for the same offense within a 10 year period, be fined not less than $500 nor more than $1,500 for each day of violation (Sec 1). -Authorizes the Department and the Authority to work with a private sector company if it offers a more efficient and less expensive recycling program (Sec. 4)."}