{"votes": {"No": [["Richard  W. 'Dick'  Sears\n                  Jr.", "5255", "Democratic", "VT", "Bennington"], ["Matthew  A. 'Matt'  Choate", "51070", "Democratic", "VT", "Caledonia"], ["Robert  A.  Starr", "5377", "Democratic", "VT", "Essex-Orleans"], ["Vincent 'Vince'  Illuzzi", "5265", "Republican", "VT", "Essex-Orleans"], ["Randolph  D. 'Randy'  Brock", "51163", "Republican", "VT", "Franklin"], ["Sara  Branon  Kittell", "5266", "Democratic", "VT", "Franklin"], ["Kevin  J.  Mullin", "25963", "Republican", "VT", "Rutland"], ["Margaret  K. 'Peg'  Flory", "13361", "Republican", "VT", "Rutland"], ["Phillip  B. 'Phil'  Scott", "55934", "Republican", "VT", "Washington"]], "Yes": [["Claire  D.  Ayer", "50993", "Democratic", "VT", "Addison"], ["Robert  M. 'Bob'  Hartwell", "51197", "Democratic", "VT", "Bennington"], ["Jane  M.  Kitchel", "51050", "Democratic", "VT", "Caledonia"], ["Timothy  R. 'Tim'  Ashe", "80645", "Democratic, Progressive", "VT", "Chittenden"], ["Diane  B.  Snelling", "51034", "Republican", "VT", "Chittenden"], ["Douglas  A. 'Doug'  Racine", "1708", "Democratic", "VT", "Chittenden"], ["Hinda  Miller", "51048", "Democratic", "VT", "Chittenden"], ["Virginia  V. 'Ginny'  Lyons", "26024", "Democratic", "VT", "Chittenden"], ["Edward  S. 'Ed'  Flanagan", "56011", "Democratic", "VT", "Chittenden"], ["Richard  T. 'Dick'  Mazza", "5275", "Democratic", "VT", "Grand Isle"], ["Susan  J.  Bartlett", "5268", "Democratic", "VT", "Lamoille"], ["Mark  A.  MacDonald", "13236", "Democratic", "VT", "Orange"], ["William 'Bill'  Carris", "65181", "Democratic", "VT", "Rutland"], ["William  T. 'Bill'  Doyle", "5287", "Republican", "VT", "Washington"], ["Ann  E.  Cummings", "13256", "Democratic", "VT", "Washington"], ["Jeanette  K.  White", "51112", "Democratic", "VT", "Windham"], ["Peter  Elliott  Shumlin", "5276", "Democratic", "VT", "Windham"], ["John  F.  Campbell", "55921", "Democratic", "VT", "Windsor"], ["Alice  W.  Nitka", "25991", "Democratic", "VT", "Windsor"], ["Richard  J. 'Dick'  McCormack", "5278", "Democratic", "VT", "Windsor"]], "Did Not Vote": [["Harold  W.  Giard", "51228", "Democratic", "VT", "Addison"]], "NA": []}, "synopsis": "Vote to concur with House amendments and pass a bill that amends existing law relating to property taxes in various ways.", "link": "https://justfacts.votesmart.org/bill/11498/32173/property-tax-and-land-use-law-amendments", "name": "H 485 - Land Conservation Program (\"Current Use\") Amendments - Vermont Key Vote", "pg": "Highlights: -Imposes a one-time assessment of $128 on owners of land enrolled in the Use Value Appraisal Program, to be collected as part of property tax bills prepared for the 2010 tax year (Sec. 1). -Modifies the Land Use Change Tax in the following manner (Sec. 2): -Existing law: -The rate is 20 percent of the full fair market value of the changed land determined without regard to use value appraisal; or -The rate is 10 percent if the owner demonstrates that the parcel has been enrolled continuously more than 10 years, and if changed land is a portion of a parcel, the fair market value of the changed land shall be prorated on the basis of acreage, divided by the common level of appraisal; -New law: -The rate shall be 10 percent of the full fair market value of the changed land determined without regard to the use value appraisal. -Changes the way in which the fair market value of land is determined with regards to the Land Use Change Tax in the following manner (Sec. 2): -Existing law: -The determination as of the date the land is no longer eligible for a use value appraisal, or as of the time of the withdrawal of the land from use value appraisal, shall be made by the Director of the Division of Property Valuation and Review; -New law: -The determination shall be made by the local assessing officials in accordance with the land schedule and the appraisal model used to list property of a similar size to the withdrawn parcel in their municipality divided by the municipality's most recent common level of appraisal as determined by the Director, provided that if the land use change tax becomes payable as a result of a transfer of title pursuant to a \"bona fide arm's length transaction,\" the purchase price shall be deemed the fair market value of the property for the purpose of calculating the Land Use Change Tax. -Allows the Director to initiate a determination of fair market value on his or her own initiative following written notice to the owner and a period of no less than 30 days for the owner to respond (Sec. 2). -Changes the way in which the Land Use Change Tax shall be paid in the following manner (Sec. 2): -Existing law: -The tax shall be paid to the Commissioner of the Department of Taxes for deposit into the General Fund; -New law: -The tax shall be paid to the municipality in which the land is located and the local assessing officials shall send one-half of the tax collected to the Commissioner. -Repeals the provision of existing law that allows the tax for property transfers of properties that are enrolled in the Agricultural and Managed Forest Land Use Value Program or are otherwise working farms to be imposed at the amount of 5/10 of 1 percent on the entire value of the property (Sec. 4). -Appropriates $300,000 from the general fund to the Use Value Appraisal Program Special Fund for the purpose of administering the program electronically for fiscal year 2011 (Sec. 5). -Allows an owner of property enrolled in Use Value Appraisal as of the passage of this bill who chooses to discontinue enrollment of the entire parcel to be relieved of the first $100,000 of Land Use Change Tax, provided that he or she pay the full property tax, based on the property's full fair market value, for the 2010 assessment, and no state reimbursement shall be paid for the land (Sec. 8a). -Specifies that the previous highlight shall not apply for any parcel that has been developed prior to the effective date of this bill (Sec. 8b). -The text of this bill was replaced by a substitute amendment sponsored by the Senate Committee on Finance."}