{"votes": {"No": [["Joseph  Charles 'Joe'  Benning", "123546", "Republican", "VT", "Caledonia"], ["Corey  J.  Parent", "154164", "Republican", "VT", "Franklin"], ["Randolph  D. 'Randy'  Brock", "51163", "Republican", "VT", "Franklin"], ["James  L. 'Jim'  McNeil", "102016", "Republican", "VT", "Rutland"], ["Brian  Collamore", "154049", "Republican", "VT", "Rutland"]], "Yes": [["Ruth  Hardy", "183686", "Democratic", "VT", "Addison"], ["Christopher  A.  Bray", "66587", "Democratic", "VT", "Addison"], ["Richard  W. 'Dick'  Sears\n                  Jr.", "5255", "Democratic", "VT", "Bennington"], ["Brian  A.  Campion", "123607", "Democratic", "VT", "Bennington"], ["Jane  M.  Kitchel", "51050", "Democratic", "VT", "Caledonia"], ["Debbie  Ingram", "141331", "Democratic", "VT", "Chittenden"], ["Michael  Sirotkin", "154034", "Democratic", "VT", "Chittenden"], ["Christopher  A. 'Chris'  Pearson", "58523", "Democratic", "VT", "Chittenden"], ["Virginia  V. 'Ginny'  Lyons", "26024", "Democratic", "VT", "Chittenden"], ["Philip  E. 'Phil'  Baruth", "123550", "Democratic", "VT", "Chittenden"], ["Timothy  R. 'Tim'  Ashe", "80645", "Democratic, Progressive", "VT", "Chittenden"], ["John  S.  Rodgers", "110226", "Democratic", "VT", "Essex-Orleans"], ["Robert  A.  Starr", "5377", "Democratic", "VT", "Essex-Orleans"], ["Richard  T. 'Dick'  Mazza", "5275", "Democratic", "VT", "Grand Isle"], ["Richard  A.  Westman", "5356", "Republican", "VT", "Lamoille"], ["Mark  A.  MacDonald", "13236", "Democratic", "VT", "Orange"], ["Cheryl  Mazzariello  Hooker", "13244", "Democratic", "VT", "Rutland"], ["Anthony  Pollina", "51062", "Democratic, Progressive", "VT", "Washington"], ["Ann  E.  Cummings", "13256", "Democratic", "VT", "Washington"], ["Andrew  Perchlik", "183725", "Democratic", "VT", "Washington"], ["Rebecca  A. 'Becca'  Balint", "154056", "Democratic", "VT", "Windham"], ["Jeanette  K.  White", "51112", "Democratic", "VT", "Windham"], ["Alice  W.  Nitka", "25991", "Democratic", "VT", "Windsor"], ["Richard  J. 'Dick'  McCormack", "5278", "Democratic", "VT", "Windsor"], ["Alison  Hudnut  Clarkson", "51164", "Democratic", "VT", "Windsor"]], "Did Not Vote": [], "NA": []}, "synopsis": "Vote to pass a bill that establishes regulations for toxic substances and hazardous materials.", "link": "https://justfacts.votesmart.org/bill/29786/76812/establishes-regulations-for-toxic-substances-and-hazardous-materials", "name": "S 55 - Establishes Regulations for Toxic Substances and Hazardous Materials - Vermont Key Vote", "pg": "Highlights: Establishes a citizen advisory panel to provide input and expertise to the Committee. The citizen advisory panel shall consist of persons available to the Committee on an as-needed basis (Sec. 1-1). Requires the Interagency Committee on Chemical Management shall report to the Governor and make recommendations regarding the actions of the Committee and specifies that the report will include: (Sec. 1.e) A summary of chemical use in the State based on reported chemical inventories; A summary of identified risks to human health and the environment from reported chemical inventories; A summary of any change under federal statute or rule affecting the regulation of chemicals in the State; and Recommended legislative or regulatory action to reduce risks to human health and the environment from regulated and unregulated chemicals of emerging concern. Authorizes the Commissioner of Health to add chemicals to the list of chemicals of high concern to children, provided it meets the following criteria (Sec. 5.b): Harms the normal development of a fetus or child or causes other developmental toxicity; Causes cancer, genetic damage, or reproductive harm; Disrupts the endocrine system; or Damages the nervous system, immune system, or organs or causes other systemic toxicity. Authorizes the Commissioner of Health to adopt a rule to regulating the sale or distribution of a children’s product containing a chemical of high concern to children upon a determination that (Sec. 5-1): Children may be exposed to a chemical of high concern to children in the children’s product; and There is a probability possibility that, due to the degree of exposure or frequency of exposure of a child to a chemical of high concern to children in a children’s product, exposure could cause or contribute to one or more of the adverse health impacts. Authorizes the Chemicals of High Concern to Children Working Group to submit to the House Committees on Natural Resources, Fish, and Wildlife and Human Services and the Senate Committees on Natural Resources and Energy and Health and Welfare the recommendations or information from a consultation provided to the Commissioner of Health (Sec. 5-5)."}