{"votes": {"No": [["Timothy  W. 'Tim'  Carpenter", "3477", "Democratic", "WI", "3"], ["Lena  C.  Taylor", "51747", "Democratic", "WI", "4"], ["G. Spencer  Coggs", "3478", "Democratic", "WI", "6"], ["Christopher  J. 'Chris'  Larson", "109307", "Democratic", "WI", "7"], ["Jim  Holperin", "108855", "Democratic", "WI", "12"], ["Mark  F.  Miller", "26258", "Democratic", "WI", "16"], ["Jessica  King", "79778", "Democratic", "WI", "18"], ["Robert  W. 'Bob'  Wirch", "3557", "Democratic", "WI", "22"], ["Julie  M.  Lassa", "26310", "Democratic", "WI", "24"], ["Robert  Jauch", "3453", "Democratic", "WI", "25"], ["Fred  A.  Risser", "3460", "Democratic", "WI", "26"], ["Jon  B.  Erpenbach", "26379", "Democratic", "WI", "27"], ["Dave  Hansen", "56438", "Democratic", "WI", "30"], ["Kathleen  Vinehout", "67069", "Democratic", "WI", "31"], ["Jennifer  Shilling", "56385", "Democratic", "WI", "32"]], "Yes": [["Frank  G.  Lasee", "3517", "Republican", "WI", "1"], ["Robert  L.  Cowles", "3440", "Republican", "WI", "2"], ["Leah  Vukmir", "52001", "Republican", "WI", "5"], ["Alberta  Darling", "3441", "Republican", "WI", "8"], ["Joseph  K. 'Joe'  Leibham", "26308", "Republican", "WI", "9"], ["Sheila  E.  Harsdorf", "3498", "Republican", "WI", "10"], ["Neal  J.  Kedzie", "13857", "Republican", "WI", "11"], ["Scott  L.  Fitzgerald", "3446", "Republican", "WI", "13"], ["Luther  S.  Olsen", "3524", "Republican", "WI", "14"], ["Dale  W.  Schultz", "3463", "Republican", "WI", "17"], ["Michael  G.  Ellis", "3444", "Republican", "WI", "19"], ["Glenn  Grothman", "3493", "Republican", "WI", "20"], ["Van  H.  Wanggaard", "68677", "Republican", "WI", "21"], ["Terry  Moulton", "51967", "Republican", "WI", "23"], ["Mary  A.  Lazich", "3518", "Republican", "WI", "28"], ["Pamela  Gail 'Pam'  Galloway", "126969", "Republican", "WI", "29"], ["Rich  Zipperer", "67075", "Republican", "WI", "33"]], "Did Not Vote": [["Timothy  F. 'Tim'  Cullen", "126963", "Democratic", "WI", "15"]], "NA": []}, "synopsis": "Vote to pass a bill that amends wetland development regulations.", "link": "https://justfacts.votesmart.org/bill/14651/38251/amends-wetland-development-regulations", "name": "SB 368 - Amends Wetland Development Regulations - Wisconsin Key Vote", "pg": "Highlights: Requires a wetland general permit or individual permit issued by the Department of Natural Resources prior to the discharge of dredged material or fill material into a wetland, whereas existing law required a water quality certification (Sec. 67). Establishes that a wetland general permit applies only to a single project and is valid for 5 years (Secs. 76 & 82). Requires anyone seeking to obtain a wetland general permit to complete the following (Secs. 82 & 115): Submit an application demonstrating that the impact to the wetland cannot be avoided and will be minimized to the greatest extent “practicable;” Consent to the DNR's entering and inspecting the site; and Pay an application fee of $500. Authorizes the DNR to issue a wetland general permit if the discharge of material into a wetland is necessary for the following (Sec. 73): The treatment or disposal of hazardous waste or toxic pollutants as long as the discharge does not contain hazardous waste or toxic pollutants and does not affect more than 2 acres of wetland; For temporary access and dewatering and does not affect more than 2 acres of wetland; For routine utility construction and maintenance projects and activities; Part of a development for industrial, commercial, residential, agricultural, municipal, or recreational purposes and does not affect more than 10,000 square feet of wetland; or For a transportation project implemented by a local government. Requires anyone seeking to obtain a wetland individual permit to fulfill the following requirements (Secs. 84-85, 87 & 115): Implement “mitigation” by: Purchasing credits from a “mitigation bank” in Wisconsin; Participating in a subprogram in which payments are made to the DNR or another entity for the purpose of restoring, enhancing, creating, or preserving wetlands or other water resource features; or Completing “mitigation” within the same watershed or within one-half mile of the site of the discharge; Submit an application including an analysis of “practicable” alternatives; and Pay an application fee of $800. Defines “wetlands” as an area where water is at, near, or above the land surface long enough to be capable of supporting aquatic vegetation and which has soils that indicate wet conditions (Sec. 17). Defines “practicable” as the availability for an action to be implemented after considering the following factors (Sec. 63): Cost; Site availability; Available technology and logistics; and Proximity to the proposed project site. Defines “mitigation” as the restoration, enhancement, creation, or preservation of wetlands to compensate for adverse impacts to other wetlands (Sec. 61). Defines “mitigation bank” as a system of accounting for wetland loss that includes sites where wetlands are improved to provide transferable credits to be applied to offset adverse impact to other wetlands (Sec. 123). Authorizes the DNR to require anyone applying for a wetland general permit to apply for and obtain an individual permit if the DNR determines that additional restrictions are required to prevent any “significant adverse impacts” to wetlands (Sec. 83). Requires the DNR to consider mitigation when determining whether to issue a wetland individual permit (Sec. 85). Limits the DNR's authority to review practicable alternatives to those located at and adjacent to the site of discharge (Sec. 85). Establishes penalties for any violation of this act that include, but are not limited to, the following (Sec. 118): For a violation of a wetland general permit: A fine between $10 and $500 for the first offense; and A fine between $50 and $500 for each subsequent offense; and For a violation of a wetland individual permit: A fine between $100 and $10,000 for the first offense; and A fine between $500 and $10,000 for each subsequent offense."}