{"votes": {"No": [["Edna  R.  Brown", "45433", "Democratic", "OH", "11"], ["Charleta  B.  Tavares", "8398", "Democratic", "OH", "15"], ["Shirley  A.  Smith", "23315", "Democratic", "OH", "21"], ["Michael  J.  Skindell", "45287", "Democratic", "OH", "23"], ["Nina  Turner", "75105", "Democratic", "OH", "25"], ["Thomas  C. 'Tom'  Sawyer", "27019", "Democratic", "OH", "28"], ["Capri  S.  Cafaro", "45584", "Democratic", "OH", "32"], ["Joseph  L. 'Joe'  Schiavoni", "110964", "Democratic", "OH", "33"]], "Yes": [["Clifford  K. 'Cliff'  Hite", "60099", "Republican", "OH", "1"], ["Mark  D.  Wagoner\n                  Jr.", "45678", "Republican", "OH", "2"], ["Kevin  R.  Bacon", "60025", "Republican", "OH", "3"], ["William  P. 'Bill'  Coley\n                  II", "45450", "Republican", "OH", "4"], ["Bill  Beagle", "120455", "Republican", "OH", "5"], ["Peggy  Lehner", "76903", "Republican", "OH", "6"], ["Shannon  Jones", "60091", "Republican", "OH", "7"], ["William  J. 'Bill'  Seitz", "45594", "Republican", "OH", "8"], ["Eric  H.  Kearney", "59344", "Democratic", "OH", "9"], ["Christopher  R. 'Chris'  Widener", "45836", "Republican", "OH", "10"], ["Keith  L.  Faber", "45424", "Republican", "OH", "12"], ["Gayle  L.  Manning", "120459", "Republican", "OH", "13"], ["Thomas  E. 'Tom'  Niehaus", "45729", "Republican", "OH", "14"], ["James  Michael 'Jim'  Hughes", "45662", "Republican", "OH", "16"], ["David  T.  Daniels", "45210", "Republican", "OH", "17"], ["Timothy  J.  Grendell", "45672", "Republican", "OH", "18"], ["Kris  Jordan", "95730", "Republican", "OH", "19"], ["Jimmy  Stewart", "45221", "Republican", "OH", "20"], ["Larry  J.  Obhof\n                  Jr.", "128729", "Republican", "OH", "22"], ["Thomas  F. 'Tom'  Patton", "45206", "Republican", "OH", "24"], ["Karen  L.  Gillmor", "4155", "Republican", "OH", "26"], ["Frank  LaRose", "120464", "Republican", "OH", "27"], ["Scott  Oelslager", "8024", "Republican", "OH", "29"], ["Jason  H.  Wilson", "69482", "Democratic", "OH", "30"], ["Timothy  O. 'Tim'  Schaffer", "45832", "Republican", "OH", "31"]], "Did Not Vote": [], "NA": []}, "synopsis": "Vote to pass a bill that requires certain facilities that withdraw or consume water from Lake Erie to obtain permits from the Division of Soil and Water Resources.", "link": "https://justfacts.votesmart.org/bill/13601/35970/withdrawal-permit-for-water-usage-at-lake-erie", "name": "HB 231 - Withdrawal Permit for Water Usage at Lake Erie - Ohio Key Vote", "pg": "Highlights: Requires the chief of the Division of Soil and Water Resources to establish a program for the issuance of permits for the withdrawal and consumptive use of water from the Lake Erie watershed (Sec. 1). Requires the owner of a facility to obtain a withdrawal and consumptive use permit if the facility meets any of the following criteria (Sec. 1): The facility has a new or increased capacity for withdrawals or consumptive uses from Lake Erie, or a river or stream under influence of Lake Erie of at least 5 million gallons per day averaged over a 90-day period; The facility has a new or increased capacity for withdrawals or consumptive uses from any river or stream, other than a river or stream under the influence of Lake Erie or from ground water in the Lake Erie watershed of at least 2 million gallons per day averaged over a 90-day period; or The facility has a new or increased capacity for withdrawals or consumptive uses from any river or stream that is \"high quality water\" and has a drainage area of less than 100 square miles of at least 300,000 gallons per day averaged over a 90-day period. Defines \"high quality water\" as a river or stream that has been designated by the Environmental Protection Agency as an exceptional warm water habitat, cold water habitat, outstanding state water, or superior high-quality water, excluding outstanding state waters that are designated as such due to exceptional recreational value (Sec. 1). Specifies that permits are not required for the portion of the withdrawal and consumptive use capacity of the facility below the threshold amount (Sec. 1). Requires the chief of the Division of Soil and Water Resources to apply criteria established by the Great Lakes--St. Lawrence River Basin Water Resources Compact in making the decision to issue or deny a permit (Sec. 1). Exempts a facility from being required to obtain a permit if the facility meets criteria including, but not limited to, the following (Sec. 1): The facility has not increased withdrawal and consumptive use capacity above the baseline report and beyond the established thresholds; The facility is required to increase its withdrawal and consumptive use capacity as a result of legal requirements or emergency conditions; The facility is increasing its withdrawal and consumptive use capacity for testing purposes, if the testing period will not last longer than 24 months; or The facility purchases all of its water from a public water system."}