{"votes": {"No": [["Eric  H.  Kearney", "59344", "Democratic", "OH", "9"], ["Edna  R.  Brown", "45433", "Democratic", "OH", "11"], ["Gayle  L.  Manning", "120459", "Republican", "OH", "13"], ["Charleta  B.  Tavares", "8398", "Democratic", "OH", "15"], ["John  Eklund", "135317", "Republican", "OH", "18"], ["Shirley  A.  Smith", "23315", "Democratic", "OH", "21"], ["Michael  J.  Skindell", "45287", "Democratic", "OH", "23"], ["Nina  Turner", "75105", "Democratic", "OH", "25"], ["Frank  LaRose", "120464", "Republican", "OH", "27"], ["Thomas  C. 'Tom'  Sawyer", "27019", "Democratic", "OH", "28"], ["Lou  Gentile", "120621", "Democratic", "OH", "30"], ["Joseph  L. 'Joe'  Schiavoni", "110964", "Democratic", "OH", "33"]], "Yes": [["Clifford  K. 'Cliff'  Hite", "60099", "Republican", "OH", "1"], ["Mark  D.  Wagoner\n                  Jr.", "45678", "Republican", "OH", "2"], ["Kevin  R.  Bacon", "60025", "Republican", "OH", "3"], ["William  P. 'Bill'  Coley\n                  II", "45450", "Republican", "OH", "4"], ["Bill  Beagle", "120455", "Republican", "OH", "5"], ["Peggy  Lehner", "76903", "Republican", "OH", "6"], ["Shannon  Jones", "60091", "Republican", "OH", "7"], ["William  J. 'Bill'  Seitz", "45594", "Republican", "OH", "8"], ["Christopher  R. 'Chris'  Widener", "45836", "Republican", "OH", "10"], ["Keith  L.  Faber", "45424", "Republican", "OH", "12"], ["Thomas  E. 'Tom'  Niehaus", "45729", "Republican", "OH", "14"], ["James  Michael 'Jim'  Hughes", "45662", "Republican", "OH", "16"], ["Bob  Peterson", "95755", "Republican", "OH", "17"], ["Kris  Jordan", "95730", "Republican", "OH", "19"], ["Troy  Balderson", "102781", "Republican", "OH", "20"], ["Larry  J.  Obhof\n                  Jr.", "128729", "Republican", "OH", "22"], ["David  E. 'Dave'  Burke", "102761", "Republican", "OH", "26"], ["Scott  Oelslager", "8024", "Republican", "OH", "29"], ["Timothy  O. 'Tim'  Schaffer", "45832", "Republican", "OH", "31"], ["Capri  S.  Cafaro", "45584", "Democratic", "OH", "32"]], "Did Not Vote": [["Thomas  F. 'Tom'  Patton", "45206", "Republican", "OH", "24"]], "NA": []}, "synopsis": "Vote to pass a bill that limits and regulates the withdrawal of water from the Great Lakes.", "link": "https://justfacts.votesmart.org/bill/15310/40291/limits-water-withdrawal-from-the-great-lakes", "name": "HB 473 - Limits Water Withdrawal from the Great Lakes - Ohio Key Vote", "pg": "Highlights: Prohibits any facility from diverting more than 100,000 gallons of water per day out of the Ohio River watershed unless they have a permit from the Director of Natural Resources (Sec. 1). Prohibits any facility from withdrawing an amount of water that results in new or increased consumptive use of more than an average of 2 million gallons of water per day in 30 days unless they have a permit from the Director of Natural Resources (Sec. 1). Prohibits the Director of Natural Resources from approving a permit for reasons including, but not limited to, the following (Sec. 1): If, during the duration of the project, some of the water is needed for use within the Ohio River watershed; The proposed diversion would endanger public health or welfare; The applicant has not demonstrated an effort to develop and conserve water resources in the importing basin; or If the proposed diversion will have an adverse impact on the economic or ecological aspects of water levels. Authorizes the Director of Natural Resources to suspend a permit if the quantity of water being diverted violates the provisions of the permit or if the director determines that the continued diversion of water will endanger public health or welfare (Sec. 1). Prohibits any facility from diverting or increasing diversion of water out of the Lake Erie watershed to another watershed unless they have a permit from the Chief of the Division of Soil and Water Resources (Sec. 1). Requires a facility to obtain a permit from the Chief of the Division of Soil and Water Resources for the withdrawal or consumptive uses of the following amounts of water from the Lake Erie watershed (Sec. 1): 2.5 million gallons or more per day over 90 days from Lake Erie; 1 million gallons or more per day over 90 days from any river, stream or ground water in the Lake Erie watershed; 100,000 gallons or more per day over 90 days from a “high quality” river or stream in the Lake Erie watershed whose watershed area is greater than 100 square miles; 100,000 gallons or more per day over 45 days from a “high quality” river or stream in the Lake Erie watershed whose watershed area is between 50 and 100 square miles; or 100,000 gallons or more per day from a “high quality” river or stream in the Lake Erie watershed whose watershed area is less than 50 square miles. Defines “high quality water” as a river or stream segment with an exceptionally warm water habitat, cold water habitat, outstanding state water, or superior high-quality water, as specified by the environmental protection agency (Sec. 1). Requires the Chief of the Division of Soil and Water Resources to establish a process for the issuance and denial of permits (Sec. 1). Requires the Chief of the Division of Soil and Water Resources to consider the following when determining the terms of a permit (Sec. 1): The long-term mean annual inflow and outflow of the Lake Erie source watershed; and The withdrawal and the portion of the withdrawal that is not returned to the Lake Erie source watershed. Requires a facility to certify, once every 5 years, to the Chief of the Division of Soil and Water Resources that the facility is still in compliance with its permit (Sec. 1). Authorizes the Chief of the Division of Soil and Water Resources to investigate any alleged permit compliance failures (Sec. 1). Authorizes the Chief of the Division of Soil and Water Resources to suspend or revoke a permit if the facility is in violation of any term or condition of the permit (Sec. 1). Establishes a $1000 application fee for a permit (Sec. 1). Specifies that any facility that is required to obtain a permit from Chief of the Division of Soil and Water Resources does not need to obtain a permit from the Director of Natural Resources (Sec. 1)."}