{"votes": {"No": [["Robert 'Rob'  McColley", "150620", "Republican", "OH", "1"], ["Tina  Maharath", "178998", "Democratic", "OH", "3"], ["William  P. 'Bill'  Coley\n                  II", "45450", "Republican", "OH", "4"], ["Stephen  A. 'Steve'  Huffman", "150587", "Republican", "OH", "5"], ["Cecil  Thomas", "75054", "Democratic", "OH", "9"], ["Joseph  W. 'Joe'  Uecker", "45859", "Republican", "OH", "14"], ["Hearcel  F.  Craig", "75244", "Democratic", "OH", "15"], ["Stephanie  L.  Kunze", "135766", "Republican", "OH", "16"], ["Nickie  J.  Antonio", "76941", "Democratic", "OH", "23"], ["Vernon  L.  Sykes", "8396", "Democratic", "OH", "28"], ["Sean  J.  O'Brien", "120575", "Democratic", "OH", "32"], ["Michael  A.  Rulli", "179016", "Republican", "OH", "33"]], "Yes": [["Theresa  A.  Gavarone", "160587", "Republican", "OH", "2"], ["Peggy  Lehner", "76903", "Republican", "OH", "6"], ["Steve  Wilson", "176515", "Republican", "OH", "7"], ["Louis  F. 'Lou'  Terhar", "134763", "Republican", "OH", "8"], ["Robert  D. 'Bob'  Hackett", "94656", "Republican", "OH", "10"], ["Teresa  M.  Fedor", "45710", "Democratic", "OH", "11"], ["Matt  Huffman", "58540", "Republican", "OH", "12"], ["Bob  Peterson", "95755", "Republican", "OH", "17"], ["John  Eklund", "135317", "Republican", "OH", "18"], ["Andrew  O.  Brenner", "120481", "Republican", "OH", "19"], ["Timothy  O. 'Tim'  Schaffer", "45832", "Republican", "OH", "20"], ["Sandra  Williams", "60019", "Democratic", "OH", "21"], ["Larry  J.  Obhof\n                  Jr.", "128729", "Republican", "OH", "22"], ["Matthew  J.  Dolan", "45154", "Republican", "OH", "24"], ["Kenny  Yuko", "45847", "Democratic", "OH", "25"], ["David  E. 'Dave'  Burke", "102761", "Republican", "OH", "26"], ["Kirk  J.  Schuring", "8388", "Republican", "OH", "29"], ["Frank  Hoagland", "166895", "Republican", "OH", "30"], ["Jay  Hottinger", "8153", "Republican", "OH", "31"]], "Did Not Vote": [], "NA": []}, "synopsis": "Vote to pass with amendment a bill that amends clean energy standards.", "link": "https://justfacts.votesmart.org/bill/26445/68697/amends-clean-energy-standards", "name": "HB 6 - Amends Clean Energy Standards - Ohio Key Vote", "pg": "Highlights: Defines a “clean air resource” as an electric generating facility in Ohio that (Sec. 1): Is interconnected with the transmission grid that is subject to the operational control of PJM Interconnection, L.L.C., or its successor organization; Uses or will use solar energy as the primary energy source; and Has obtained a certificate for the construction of a major utility facility from the Power Siting Board prior to June 1st, 2019. Specifies that beginning for all bills rendered on or after January 1st, 2021, by an electric distribution utility in Ohio, such electric distribution utility will collect from all of its retail electric customers in Ohio, each month, a charge or charges total that are sufficient to produce the following revenue requirements (Sec. 1): $150 million annually for total disbursements required under section 3706.55 of the Revised Code from the nuclear generation fund; and $20 million annually for total disbursements required under section 3706.55 of the Revised Code from the renewable generation fund. Authorizes the public utilities commission to decide upon the method through which the revenue is allocated or assigned to each electric distribution utility for billing and collection (Sec. 1). Authorizes any person owning or controlling a qualifying nuclear resource or qualifying renewable resource to submit a written application to the Ohio air quality development authority to receive payments for nuclear resource credits or renewable energy credits, as applicable, no later than February 1, 2020 (Sec. 1). Authorizes the authority to issue one nuclear resource credit to a qualifying nuclear resource for each megawatt hour of electricity that is reported to and approved by the authority (Sec. 1). Authorizes the authority to issue one renewable energy credit to a qualifying renewable resource for each megawatt hour of electricity that is reported to and approved by the authority (Sec. 1). Establishes the price for each renewable energy credit to be $9 dollars (Sec. 1). Requires the Ohio air quality development authority, from April 2021 to January 2028 and between three month increments, to direct the treasurer of the state to remit money from the funds created under section 3706.49 of the Revised Code (Sec. 1). Prohibits the taxable property of electric companies that are or are part of a qualifying nuclear resource receiving payments for nuclear resource credits for any part of a tax year from being assessed for that year at less than the taxable value of the property as of the effective date of HB 6 of the 133rd general assembly (Sec. 1). Defines “credit price adjustment” as a reduction to the price for each nuclear resource credit equal to the market price index minus the strike price (Sec. 1). Defines “strike price” as $46 dollars per megawatt hour (Sec. 1). Defines “market price index” as the sum expressed in dollars per megawatt hour of both of the following for the upcoming twelve-month period beginning the first day of June and ending the thirty-first of May (Sec. 1): Projected energy prices, determined using futures contracts for the PJM AEP-Dayton hub; and Projected capacity prices, determined using PJM’s rest-of-RTO market clearing price. Requires the commission to submit a report summarizing the findings of each annual review to the president and minority leader of the senate, the speaker and minority leader of the house of representatives, and the Ohio air quality development authority, and to make the report publicly available (Sec. 1)."}